[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy tacklings are loosed . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words have been taken as applicable either to Assyria, as one of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ships of Tarshish” that had been wrecked, or to Zion, as a vessel that had been driven by the wind and tossed, but had escaped shipwreck. On the whole, the first view seems most in harmony with the context. The terms have been taken by some critics for the cords, poles, and canvas of a tent, but the rendering of the Authorised version seems preferable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The lame take the prey.—The wrecked Assyrian ship is represented as being plundered by those whom it came to plunder. “The lame” were commonly excluded, as incapable of active service, from sharing in the spoils. Here they also were to have their portion.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The lame take the prey.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The wrecked Assyrian ship is represented as being plundered by those whom it came to plunder. “The lame” were commonly excluded, as incapable of active service, from sharing in the spoils. Here they also were to have their portion.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 33:23-24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:23-24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy tacklings are loosed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This apostrophe of the prophet is directed to the hostile nation. Having designed their army under the notion of a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gallant ship, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) he here represents their undone condition by the metaphor of a ship, tossed in a tempestuous sea, having her cables broke, and all her tacklings loose, so that she could have no benefit of her masts and sails; and therefore is quickly swallowed up. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They could not strengthen their mast ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, the Assyrians could not, of whom he still speaks, as in the first clause he spake to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The lame take the prey ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— They who came to spoil and prey upon my people, shall become a prey to them, and shall be forced to flee away so suddenly that they shall leave so many spoils behind them, that, when strong and active men have carried away all that they desired, there shall be enough left for the lame, who come last to the spoil. Thus God would bring good out of evil; and not only deliver Jerusalem, but enrich it, and abundantly recompense the losses it had sustained. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the inhabitant shall not say, I am sick ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As the lame shall take the prey, so shall the sick, notwithstanding their weakness, make a shift to get to the abandoned camp, and seize something for themselves. In this sense the clause is understood by Bishop Lowth, and many other interpreters. Or, the sense may be, There shall be such a universal transport of joy upon this occasion, that even the sick shall, for the present, forget their sickness, and the sorrows of it, and join with the public in its rejoicings; the deliverance of their city shall be their cure: or, they shall have no cause to complain of any sickness or calamity; they shall be fully delivered from all their enemies and troubles; and shall enjoy perfect tranquillity and prosperity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The people that dwell therein shall be forgiven their iniquity ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This may be added, either, 1st, As the reason of the foregoing privilege; their sins, the main causes of their distresses, shall be pardoned; and therefore their sufferings, the effects of sin, shall cease: or, 2d, As an additional favour. They shall not only receive from me a glorious temporal deliverance, but, which is infinitely better, the pardon of all their sins, and all those spiritual and everlasting blessings which attend upon that mercy. Observe here, reader, sin is the sickness of the soul: when God pardons sin, he heals the disease; and when the diseases of sin are healed by pardoning mercy, the sting of bodily sickness is taken out, and the cause of it removed: so that either the inhabitant shall not be sick, or, at least, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall not say, I am sick ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— If iniquity be taken away, we have little reason to complain of outward affliction: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Son, be of good cheer, thy sins are forgiven thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33:15-24 The true believer watches against all occasions of sin. The Divine power will keep him safe, and his faith in that power will keep him easy. He shall want nothing needful for him. Every blessing of salvation is freely bestowed on all that ask with humble, believing prayer; and the believer is safe in time and for ever. Those that walk uprightly shall not only have bread given, and their water sure, but they shall, by faith, see the King of kings in his beauty, the beauty of holiness. The remembrance of the terror they were in, shall add to the pleasure of their deliverance. It is desirable to be quiet in our own houses, but much more so to be quiet in God's house; and in every age Christ will have a seed to serve him. Jerusalem had no large river running by it, but the presence and power of God make up all wants. We have all in God, all we need, or can desire. By faith we take Christ for our Prince and Saviour; he reigns over his redeemed people. All that refuse to have Him to reign over them, make shipwreck of their souls. Sickness is taken away in mercy, when the fruit of it is the taking away of sin. If iniquity be taken away, we have little reason to complain of outward affliction. This last verse leads our thoughts, not only to the most glorious state of the gospel church on earth, but to heaven, where no sickness or trouble can enter. He that blotteth out our transgressions, will heal our souls.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy tacklings - This is evidently an address to Sennacherib. The mention of the war-galley and the ship seems to have suggested the application of the figure to the enemies of the Jews, and particularly to Sennacherib. The prophet, therefore, compares the Assyrian to a ship that was rendered unserviceable; whose sails were unfastened, and whose mast could not be made firm, and which was therefore at the mercy of winds and waves. The Hebrew which is rendered here 'thy tacklings are loosed,' means 'thy cords are let go;' that is, the cords or ropes that fastened the sails, the masts, and the rudder, were loosened. In such a condition the ship would, of course, go to ruin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They could not well strengthen their mast - They could not fix it firm or secure. It is evident that if the mast cannot be made firm, it is impossible to navigate a ship. It is to be observed here, however, that the word which our translators have rendered 'well' (כן  kên), not only signifies 'well' as an adverb, but is also used as a noun, and means a stand or station Genesis 40:13; Genesis 41:13; Daniel 11:20-21; and also a base or pedestal (Exodus 30:18, Exodus 30:28; Exodus 31:9; Exodus 35:16; Exodus 38:8; Leviticus 8:11; 1 Kings 7:31. It may be used here to denote the socket or base of the ship's mast; or the cross beam which the mast passed through, and which held it firm. This was called by the Greeks ἱστοπέδη  histopedē (Odyssey xii. 51), or μεσόδμη, ἱστοδόκη  mesodmē, histodokē. The translation, therefore, 'They could not make fast the base of their mast,' would better express the sense of the Hebrew. The Septuagint renders it: 'Thy mast gave way.'",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They could not well strengthen their mast - They could not fix it firm or secure. It is evident that if the mast cannot be made firm, it is impossible to navigate a ship. It is to be observed here, however, that the word which our translators have rendered 'well' (כן  kên), not only signifies 'well' as an adverb, but is also used as a noun, and means a stand or station ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 40:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:20-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and also a base or pedestal (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 38:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It may be used here to denote the socket or base of the ship's mast; or the cross beam which the mast passed through, and which held it firm. This was called by the Greeks ἱστοπέδη  histopedē (Odyssey xii. 51), or μεσόδμη, ἱστοδόκη  mesodmē, histodokē. The translation, therefore, 'They could not make fast the base of their mast,' would better express the sense of the Hebrew. The Septuagint renders it: 'Thy mast gave way.'",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They could not spread the sail - Of course, as the ropes were all loosened, and the mast could not be made firm, it Would be in vain to attempt to spread a sail. The sense is, that the plan of the Assyrian would be disconcerted, his scheme discomfited, and his enterprise would come to naught. He and his army would be like a vessel at sea without sails.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Then is the prey of a great spoil divided - The word 'divided' here means shall be distributed or apportioned, as plunder was usually among victors. The sense is, that much booty would be taken from the army of the Assyrian and distributed among the Jews (see the note at Isaiah 33:4). It is certain that Hezekiah had given to Sennacherib three hundred talents of silver, and thirty talents of gold, and had stripped the temple, and given the gold that was on the temple to him 2 Kings 18:14-16, and tiffs treasure was doubtless in the camp of the Assyrians. And it is certain that after this invasion of Sennacherib, the treasures of Hezekiah were replenished, and his wealth so much abounded, that he made an improper and ostentatious display of it to the ambassadors that came from Babylon 2 Kings 20:13-15; and there is every presumption, therefore, that a great amount of spoil was collected from the camp of the Assyrian.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then is the prey of a great spoil divided - The word 'divided' here means shall be distributed or apportioned, as plunder was usually among victors. The sense is, that much booty would be taken from the army of the Assyrian and distributed among the Jews (see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is certain that Hezekiah had given to Sennacherib three hundred talents of silver, and thirty talents of gold, and had stripped the temple, and given the gold that was on the temple to him ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:14-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and tiffs treasure was doubtless in the camp of the Assyrians. And it is certain that after this invasion of Sennacherib, the treasures of Hezekiah were replenished, and his wealth so much abounded, that he made an improper and ostentatious display of it to the ambassadors that came from Babylon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 20:13-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and there is every presumption, therefore, that a great amount of spoil was collected from the camp of the Assyrian.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The lame take the prey - It shall be so abundant, and shall be so entirely abandoned by the Assyrians, that even the feeble and the defenseless shall go forth to the camp and take the spoil that is left. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The lame take the prey - It shall be so abundant, and shall be so entirely abandoned by the Assyrians, that even the feeble and the defenseless shall go forth to the camp and take the spoil that is left. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. tacklings—Continuing the allegory in Isa 33:21, he compares the enemies' host to a war galley which is deprived of the tacklings or cords by which the mast is sustained and the sail is spread; and which therefore is sure to be wrecked on \"the broad river\" (Isa 33:21), and become the prey of Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they—the tacklings, \"hold not firm the base of the mast.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then—when the Assyrian host shall have been discomfited. Hezekiah had given Sennacherib three hundred talents of silver, and thirty of gold (2Ki 18:14-16), and had stripped the temple of its gold to give it to him; this treasure was probably part of the prey found in the foe's camp. After the invasion, Hezekiah had so much wealth that he made an improper display of it (2Ki 20:13-15); this wealth, probably, was in part got from the Assyrian.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the lame—Even the most feeble shall spoil the Assyrian camp (compare Isa 35:6; 2Sa 5:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy tacklings are loosed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he directeth his speech to the Assyrians; and having tacitly designed their army under the notion of a gallant ship, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 33:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", he here represents their broken and undone condition by the metaphor of a ship tossed in a tempestuous sea, having her cables broken, and all her tacklings loose, and out of order, so as she could have no benefit of her masts and sails; and therefore is quickly broken or swallowed up by the sea. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Assyrians, of whom he still speaks, as in the first clause he spake to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then is the prey of a great spoil divided; the lame take the prey; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they who came to spoil and prey upon my people shall become a prey to them, and shall be forced to flee away so suddenly, that they shall leave so many spoils behind them, that when strong and active men have carried away all that they desired, there shall be enough left for the lame, who come last to the spoil. The general sense of the place is, that God’s people shall be victorious over all their enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy tacklings are loosed,.... Or \"are left\" (h); forsaken by the mariners, as being of no use and service: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they could not well strengthen their mast; with ropes to make it stand upright: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they could not spread the sail; upon the mast, without which they could not proceed. This is spoken to and of the enemies of the church; most interpreters understand it of the Assyrians, who are compared to a ship in great distress at sea, when its tacklings are shattered, the mast is split, and the sails cannot be spread. The metaphor is taken and carried on from Isaiah 33:21, where mention is made of a galley with oars, and a gallant ship. Tyrannical governments are thought by some to be compared to ships; a king to the mast; princes to ropes, cords, and tackling; and their army in battle array to sails spread; but here all is in confusion, distress, and unavoidable ruin: this may very well be applied to the antichristian states, when the vials of God's wrath shall be poured out upon them; especially when the second vial shall be poured out upon the sea, and all shipping will suffer, as under the second trumpet the third part of ships were destroyed, there being a correspondence between the trumpets and the seals, Revelation 8:8, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they could not spread the sail; upon the mast, without which they could not proceed. This is spoken to and of the enemies of the church; most interpreters understand it of the Assyrians, who are compared to a ship in great distress at sea, when its tacklings are shattered, the mast is split, and the sails cannot be spread. The metaphor is taken and carried on from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where mention is made of a galley with oars, and a gallant ship. Tyrannical governments are thought by some to be compared to ships; a king to the mast; princes to ropes, cords, and tackling; and their army in battle array to sails spread; but here all is in confusion, distress, and unavoidable ruin: this may very well be applied to the antichristian states, when the vials of God's wrath shall be poured out upon them; especially when the second vial shall be poured out upon the sea, and all shipping will suffer, as under the second trumpet the third part of ships were destroyed, there being a correspondence between the trumpets and the seals, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "then is the prey of a great spoil divided: as the spoil of the Assyrian camp was by the Israelites, so will the spoil of the Papists by the Protestants; particularly when the kings of the earth shall be filled with an aversion to the whore of Rome, and shall destroy her, and make her bare and desolate of all her riches, and shall \"eat her flesh\", or seize upon her substance, which will become the prey of a great spoil unto them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the lame take the prey; which denotes both how easily it shall be taken, and what a plenty there shall be, that even such, and who come late, shall have a share in it. The Targum of the whole is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"at that time (when vengeance shall be taken on Gog) the people shall be broken with their own strength, and they shall be like to a ship whose ropes are broken; and there is no strength in their mast, which is cut down, that it is not possible to spread a sail on it; then shall the house of Israel divide the substance of the people, the multitude of a prey and spoil; and although the blind and the lame are left among them, they also shall divide the multitude of the prey and spoil.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) So the word is interpreted by Kimchi and Ben Melech. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) So the word is interpreted by Kimchi and Ben Melech. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thy {a} tacklings are loosed; they could not well strengthen their mast, they could not spread the sail: then is the {b} prey of a great spoil divided; the lame take the prey.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " tacklings are loosed; they could not well strengthen their mast, they could not spread the sail: then is the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prey of a great spoil divided; the lame take the prey.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) He derides the Assyrians and enemies of the Church, declaring their destruction as they who perish by shipwreck.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) He comforts the Church, and shows that they will be enriched with all benefits both of body and soul.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The abrupt transition from the glorious future to the present or the past, in the first part of the verse, is somewhat surprising at this point. It is not Assyria but Zion which is compared to an unseaworthy ship, a comparison natural enough in itself, as when we speak of the “ship of state.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy tacklings are loosed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thy ropes hung slack",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they could not well strengthen, &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "they could not hold fast the foot of their mast, they did not spread out the sail",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, “the ensign”).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The subject here is the ropes; they could not serve the two purposes for which they were intended, supporting the mast and extending the sail. The word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "well",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must from its position be a substantive; it denotes the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μεσόδμη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the cross-beam into which the mast was let, or else the hole in the keel which received its foot (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἱστοπέδη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The rendering “sail” is doubtful. The word means elsewhere “ensign,” and one is tempted to translate it “flag.” But it is said that ships had no flags in ancient times (Cornill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the prey of a great spoil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, “prey of spoil in abundance.” The expression “prey of spoil” is perhaps to be explained like the Latin ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "praeda exuviarum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The figure of the ship is entirely dropped. On the word for “prey” see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thy tacklings are loosed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The comparing of God to a river has led to the representation of Judah's enemies as warships (ver. 21). This causes Judah herself to be viewed as a ship - a badly appointed ship, which has to contend with one whose equipment is perfect. The prophet's thoughts have traveled back to the existing state of things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They could not well strengthen their mast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "they cannot hold firm the lower part of their mast",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The mast had its lower extremity inserted into a hole in a cross-beam, and required to be kept in place by the ropes. If they were loose, it might slip out of the hole and fall overboard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They could not spread the sail",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "they cannot spread the ensign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ensign would seem to have been attached to the top of the mast. If the mast fell, it would no longer be spread out, so as to be seen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then is the prey of a great spoil divided",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word \"then\" is emphatic. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the disabled ship seems incapable of coping with its enemy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Then",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (after Assyria's overthrow) Judah will obtain an immense spoil (see ver. 4). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Even the lame shall have their portion.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah 33:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Compare Grashof, Ueber das Schiff bei Homer und Hesiod, Gymnasial-programm 1834, p. 23ff.). The μεσόδμη ( equals  μεσοδόμη) is the cross plank which connects the two sides of the ship. A piece is cut out of this on the side towards the rudder, in which the mast is supported, being also let into a hole in the boards of the keel (ἱστοπέδη) and there held fast. The mast is also prevented from falling backwards by ropes or stays carried forward to the bows (πρότονοι). On landing, the mast is laid back into a hollow place in the bottom of the ship (ἱστοδόκη). If the stays are not drawn tight, the mast may easily fall backwards, and so slip not only out of the μεσόδμη but out of the ἱστοπέδη also. This is the meaning of the words בּל־יהזּקוּ כן־תּרנם. It would be better to understand kēn as referring to the ἱστοπέδη than to the μεσόδμη. The latter has no \"hole,\" but only a notch, i.e., a semicircular piece cut out, and serves as a support to the mast; the former, on the contrary, has the mast inserted into it, and serves as a kēn, i.e., a basis, theca, loculamentum. Vitringa observes (though without knowing the difference between μεσόδμη and ἱστοπέδη): \"Oportet accedere funes, qui thecam firment, h. e. qui malum sustinentes thecae succurrant, qui quod theca sola per se praestare nequit absque funibus cum ea veluti concurrentes efficiant.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isaiah 33:23Now indeed it was apparently very different from this. It was not Assyria, but Jerusalem, that was like a ship about to be wrecked; but when that which had just been predicted should be fulfilled, Jerusalem, at present so powerless and sinful, would be entirely changed. \"Thy ropes hang loose; they do not hold fast the support of thy mast; they do not hold the flag extended: then is booty of plunder divided in abundance; even lame men share the prey. And not an inhabitant will say, I am weak: the people settled there have their sins forgiven.\" Nearly every commentator (even Luzzatto) has taken Isaiah 33:23 as addressed to Assyria, which, like a proud vessel of war, would cross the encircling river by which Jerusalem was surrounded. But Drechsler has very properly given up this view. The address itself, with the suffix ayikh (see at Isaiah 1:26), points to Jerusalem; and the reference to this gives the most appropriate sense, whilst the contrast between the now and then closes the prophecy in the most glorious manner. Jerusalem is now a badly appointed ship, dashed about by the storm, the sport of the waves. Its rigging hangs loose (Jerome, laxati sunt); it does not hold the kēn tornâm fast, i.e., the support of their mast, or cross beam with a hole in it, into which the mast is slipped (the mesodme of Homer, Od. xv 289), which is sure to go to ruin along with the falling mast, if the ropes do not assist its bearing power (malum sustinentes thecae succurrant, as Vitruvius says). And so the ropes of the ship Jerusalem do not keep the nēs spread out, i.e., the ἐπίσημον of the ship, whether we understand by it a flag or a sail, with a device worked upon it (see Winer, R.W. s. v. Schiffe). And this is the case with Jerusalem now; but then ('âz) it will be entirely different. Asshur is wrecked, and Jerusalem enriches itself, without employing any weapons, from the wealth of the Assyrian camp. It was with a prediction of this spoiling of Asshur that the prophet commenced in Isaiah 33:1; so that the address finishes as it began. But the closing words of the prophet are, that the people of Jerusalem are now strong in God, and are עון נשׂא (as in Psalm 32:1), lifted up, taken away from their guilt. A people humbled by punishment, penitent, and therefore pardoned, would then dwell in Jerusalem. The strength of Israel, and all its salvation, rest upon the forgiveness of its sins. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Now indeed it was apparently very different from this. It was not Assyria, but Jerusalem, that was like a ship about to be wrecked; but when that which had just been predicted should be fulfilled, Jerusalem, at present so powerless and sinful, would be entirely changed. \"Thy ropes hang loose; they do not hold fast the support of thy mast; they do not hold the flag extended: then is booty of plunder divided in abundance; even lame men share the prey. And not an inhabitant will say, I am weak: the people settled there have their sins forgiven.\" Nearly every commentator (even Luzzatto) has taken ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as addressed to Assyria, which, like a proud vessel of war, would cross the encircling river by which Jerusalem was surrounded. But Drechsler has very properly given up this view. The address itself, with the suffix ayikh (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), points to Jerusalem; and the reference to this gives the most appropriate sense, whilst the contrast between the now and then closes the prophecy in the most glorious manner. Jerusalem is now a badly appointed ship, dashed about by the storm, the sport of the waves. Its rigging hangs loose (Jerome, laxati sunt); it does not hold the kēn tornâm fast, i.e., the support of their mast, or cross beam with a hole in it, into which the mast is slipped (the mesodme of Homer, Od. xv 289), which is sure to go to ruin along with the falling mast, if the ropes do not assist its bearing power (malum sustinentes thecae succurrant, as Vitruvius says). And so the ropes of the ship Jerusalem do not keep the nēs spread out, i.e., the ἐπίσημον of the ship, whether we understand by it a flag or a sail, with a device worked upon it (see Winer, R.W. s. v. Schiffe). And this is the case with Jerusalem now; but then ('âz) it will be entirely different. Asshur is wrecked, and Jerusalem enriches itself, without employing any weapons, from the wealth of the Assyrian camp. It was with a prediction of this spoiling of Asshur that the prophet commenced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; so that the address finishes as it began. But the closing words of the prophet are, that the people of Jerusalem are now strong in God, and are עון נשׂא (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 32:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), lifted up, taken away from their guilt. A people humbled by punishment, penitent, and therefore pardoned, would then dwell in Jerusalem. The strength of Israel, and all its salvation, rest upon the forgiveness of its sins. ",
            "children": []
          }
        ]
      }
    ]
  }
]