[{"header":"Jacob Shows His Bravery"},{"num":33,"verse":"Jacob looked up and saw Esau coming. With him were 400 men. So Jacob divided his children among Leah, Rachel and the two slave girls. "},{"num":2,"verse":"Jacob put the slave girls with their children first. Then he put Leah and her children behind them. And he put Rachel and Joseph last. "},{"num":3,"verse":"Jacob himself went out in front of them. He bowed down flat on the ground seven times as he was walking toward his brother."},{"num":4,"verse":"But Esau ran to meet Jacob. Esau put his arms around him and hugged him. Then Esau kissed him, and they both cried. "},{"num":5,"verse":"Esau looked up and saw the women and children. He asked, “Who are these people with you?”"},{"num":6,"verse":"Then the two slave girls and their children came up to Esau. They bowed down flat on the earth before him. "},{"num":7,"verse":"Then Leah and her children came up to Esau. They also bowed down flat on the earth. Last of all, Joseph and Rachel came up to Esau. And they, too, bowed down flat before him."},{"num":8,"verse":"Esau said, “I saw many herds as I was coming here. Why did you bring them?”"},{"num":9,"verse":"But Esau said, “I already have enough, my brother. Keep what you have.”"},{"num":10,"verse":"Jacob said, “No! Please! If I have pleased you, then please accept the gift I give you. I am very happy to see your face again. It is like seeing the face of God because you have accepted me. "},{"num":11,"verse":"So I beg you to accept the gift I give you. God has been very good to me. And I have more than I need.” And because Jacob begged, Esau accepted the gift."},{"num":12,"verse":"Then Esau said, “Let us get going. I will travel with you.”"},{"num":13,"verse":"But Jacob said to him, “My master, you know that the children are weak. And I must be careful with my flocks and their young ones. If I force them to go too far in one day, all the animals will die. "},{"num":14,"verse":"So, my master, you go on ahead of me, your servant. I will follow you slowly. I will let the animals and the children set the speed at which we travel. I will meet you, my master, in Edom.”"},{"num":15,"verse":"So Esau said, “Then let me leave some of my men with you.”"},{"num":16,"verse":"So that day Esau started back to Edom. "},{"num":17,"verse":"But Jacob went to Succoth. There he built a house for himself. And he made shelters for his animals. That is why the place was named Succoth."},{"num":18,"verse":"Jacob left Northwest Mesopotamia. And he arrived safely at the city of Shechem in the land of Canaan. He camped east of the city. "},{"num":19,"verse":"He bought a part of the field where he had camped. He bought it from the sons of Hamor father of Shechem for 100 pieces of silver. "},{"num":20,"verse":"He built an altar there and named it after God, the God of Israel."}]