[{"num":33,"verse":"And Ya’akov lifted up his eyes, and looked, and, hinei, Esav came, and with him arba me’ot ish (four hundred men). And he divided the yeladim unto Leah, and unto Rachel, and unto the two shefachot."},{"num":2,"verse":"And he put the shefachot and their yeladim rishonah, and Leah and her yeladim acharonim, and Rachel and Yosef acharonim."},{"num":3,"verse":"And he passed over before them, and bowed himself to the ground sheva pe’amim, until he came near to achiv (his brother)."},{"num":4,"verse":"And Esav ran to meet him, and embraced him, and fell on his tzavar (neck), and kissed him; and they wept."},{"num":5,"verse":"And he lifted up his eyes, and saw the nashim and the yeladim; and said, Who are those with thee? And he said, The yeladim which Elohim hath graciously given thy eved."},{"num":6,"verse":"Then the shefachot came near, they and their yeladim, and they bowed themselves."},{"num":7,"verse":"And Leah also with her yeladim came near, and bowed themselves; and after came Yosef near and Rachel, and they bowed themselves."},{"num":8,"verse":"And he said, What meanest thou by all this machaneh which I met? And he said, These are to find chen (grace) in the eyes of adoni."},{"num":9,"verse":"And Esav said, I have enough, achi (my brother); keep that thou hast unto thyself."},{"num":10,"verse":"And Ya’akov said, No, now, if I have found chen (grace) in thy sight, then receive my minchah at my yad inasmuch as I have seen thy face, as though I had seen the p’nei Elohim (the face of G-d) vatirtzeini (and thou wast pleased to accept me, thou wast appeased by me)."},{"num":11,"verse":"Accept, now, my brocha that is brought to thee; because Elohim hath dealt graciously with me, and because yesh li khol (there is to me all, my needs are met). And he urged him, and he accepted."},{"num":12,"verse":"And he said, Nise’ah (let us take our journey), and let us go, I will go next to thee."},{"num":13,"verse":"And he said unto him, Adoni knoweth that the yeladim are tender and the nursing tzon and bakar are upon me; and if men should overdrive them yom echad, all the tzon will die."},{"num":14,"verse":"Let now adoni, pass over before his eved; and I will lead on slowly, according to the pace of the drove that goeth before me and the pace the yeladim are able to endure, until I come unto adoni at Seir."},{"num":15,"verse":"And Esav said, Let me now leave with thee some of HaAm that are with me. And he said, What needeth it? Let me find chen in the sight of adoni."},{"num":16,"verse":"So Esav returned that day on his derech unto Seir."},{"num":17,"verse":"And Ya’akov journeyed to Sukkot, and built him a bais, and made sukkot for his mikneh; therefore the shem of the makom is called Sukkot."},{"num":18,"verse":"And Ya’akov came shalem to Ir Shechem, which is in eretz Kena’an, when he came from Padan Aram; and encamped before the Ir."},{"num":19,"verse":"And he bought a chelkat hasadeh (piece of land), where he had pitched there his ohel, from the yad Bnei Chamor Avi Shechem, for a hundred pieces of kesitah (money)."},{"num":20,"verse":"And he erected there a Mizbe’ach, and called it El Elohei Yisroel."}]