[{"num":1,"verse":"Theophilus, I first wrote to you about all that Jesus did and taught from the very first "},{"num":2,"verse":"until he was taken up to heaven. But before he was taken up, he gave orders to the apostles he had chosen with the help of the Holy Spirit."},{"num":3,"verse":"For forty days after Jesus had suffered and died, he proved in many ways that he had been raised from death. He appeared to his apostles and spoke to them about God’s kingdom. "},{"num":4,"verse":"While he was still with them, he said:"},{"header":"Jesus Is Taken to Heaven"},{"num":6,"verse":"While the apostles were still with Jesus, they asked him, “Lord, are you now going to give Israel its own king again?”"},{"num":7,"verse":"Jesus said to them, “You don’t need to know the time of those events that only the Father controls. "},{"num":8,"verse":"But the Holy Spirit will come upon you and give you power. Then you will tell everyone about me in Jerusalem, in all Judea, in Samaria, and everywhere in the world.” "},{"num":9,"verse":"After Jesus had said this and while they were watching, he was taken up into a cloud. They could not see him, "},{"num":10,"verse":"but as he went up, they kept looking up into the sky."},{"num":11,"verse":"They said, “Why are you men from Galilee standing here and looking up into the sky? Jesus has been taken to heaven. But he will come back in the same way that you have seen him go.”"},{"header":"Someone To Take the Place of Judas"},{"num":12,"verse":"The Mount of Olives was about half a mile from Jerusalem. The apostles who had gone there were Peter, John, James, Andrew, Philip, Thomas, Bartholomew, Matthew, James the son of Alphaeus, Simon, known as the Eager One, and Judas the son of James."},{"num":14,"verse":"The apostles often met together and prayed with a single purpose in mind. The women and Mary the mother of Jesus would meet with them, and so would his brothers. "},{"num":15,"verse":"One day there were about one hundred twenty of the Lord’s followers meeting together, and Peter stood up to speak to them. "},{"num":16,"verse":"He said:"},{"num":23,"verse":"Two men were suggested: One of them was Joseph Barsabbas, known as Justus, and the other was Matthias. "},{"num":24,"verse":"Then they all prayed, “Lord, you know what everyone is like! Show us the one you have chosen "},{"num":25,"verse":"to be an apostle and to serve in place of Judas, who got what he deserved.” "},{"num":26,"verse":"They drew names, and Matthias was chosen to join the group of the eleven apostles."}]