[{"header":"The Angel of the Lord at Bokim"},{"num":2,"verse":"The angel of the Lord went up from Gilgal to Bokim. He spoke to the people of Israel there and said: “I brought you up from Egypt. I led you to the land I promised to give to your ancestors. I said, ‘I will never break my agreement with you. "},{"num":2,"verse":"But in return, you must not make an agreement with the people who live in this land. You must destroy their altars.’ But you did not obey me. How could you do this? "},{"num":3,"verse":"Now I will tell you this: ‘I will not force out the people in this land. They will become your enemies. Their gods will become a trap for you.’”"},{"num":4,"verse":"After the angel gave Israel this message from the Lord, they cried loudly. "},{"num":5,"verse":"So they named the place Bokim. There they offered sacrifices to the Lord."},{"header":"Joshua Dies"},{"num":6,"verse":"Then Joshua told the people they could go home. So each one went to take his own share of the land. "},{"num":7,"verse":"The people of Israel served the Lord as long as Joshua was alive. They continued serving the Lord during the lifetimes of the elders who lived on after Joshua. These men had seen all the great things the Lord had done for Israel. "},{"num":8,"verse":"Joshua son of Nun was the servant of the Lord. Joshua died at the age of 110. "},{"num":9,"verse":"So the Israelites buried him in the land he had been given. That land was at Timnath Heres. It was in the mountains of Ephraim, north of Mount Gaash."},{"header":"The People Disobey"},{"num":10,"verse":"After those people had died, their children grew up. They did not know the Lord or what he had done for Israel. "},{"num":11,"verse":"So they did evil and worshiped the Baal idols. They did what the Lord said was wrong. "},{"num":12,"verse":"The Lord had brought the people of Israel out of Egypt. And the ancestors of these people had worshiped the Lord. But the Israelites quit following the Lord. They began to worship the gods of the people who lived around them. That made the Lord angry. "},{"num":13,"verse":"The Israelites quit following the Lord and worshiped Baal and Ashtoreth. "},{"num":14,"verse":"The Lord was angry with the people of Israel. So he let robbers attack them and take their possessions. He let their enemies who lived around them defeat them. They could not protect themselves from their enemies. "},{"num":15,"verse":"When the Israelites went out to fight, they always lost. They lost because the Lord was not on their side. The Lord had sworn to them this would happen. So the Israelites suffered very much."},{"header":"God Chooses Judges"},{"num":16,"verse":"Then the Lord chose leaders called judges. These leaders saved the people of Israel from the robbers. "},{"num":17,"verse":"But the Israelites did not listen to their judges. They were not faithful to God. They followed other gods instead. In the past the people of Israel obeyed the Lord’s commands. But now the Israelites stopped obeying the Lord. "},{"num":18,"verse":"Many times the enemies of Israel hurt the Israelites. So the Israelites would cry for help. And each time the Lord felt sorry for them. Each time he sent a judge to save them from their enemies. The Lord was with those judges. "},{"num":19,"verse":"But when each judge died, the Israelites again sinned and worshiped the false gods. They became worse than their ancestors. The Israelites were very stubborn; they refused to change their evil ways."},{"num":20,"verse":"So the Lord became angry with the Israelites. He said, “These people have broken the agreement I made with their ancestors. They have not listened to me. "},{"num":21,"verse":"So I will no longer defeat the nations who were left when Joshua died. "},{"num":22,"verse":"I will use those nations to test Israel. I will see if Israel keeps the Lord’s commands as their ancestors did.” "},{"num":23,"verse":"In the past the Lord had permitted those nations to stay in the land. He did not quickly force them out. He did not help Joshua’s army defeat them."}]