[[],[{"type":"header","content":"The Lord’s Messenger Comes to Bokim"},{"type":"prose","content":"The angel of the  went up from Gilgal to Bokim and said to the Israelites, “I brought you out of Egypt into this land that I swore to give your ancestors, and I said I would never break my covenant with you."}],[{"type":"prose","content":"For your part, you were not to make any covenants with the people living in this land; instead, you were to destroy their altars. But you disobeyed my command. Why did you do this?"}],[{"type":"prose","content":"So now I declare that I will no longer drive out the people living in your land. They will be thorns in your sides, and their gods will be a constant temptation to you.”"}],[{"type":"prose","content":"When the angel of the  finished speaking to all the Israelites, the people wept loudly."}],[{"type":"prose","content":"So they called the place Bokim (which means “weeping”), and they offered sacrifices there to the ."},{"type":"header","content":"The Death of Joshua"}],[{"type":"prose","content":"After Joshua sent the people away, each of the tribes left to take possession of the land allotted to them."}],[{"type":"prose","content":"And the Israelites served the  throughout the lifetime of Joshua and the leaders who outlived him—those who had seen all the great things the  had done for Israel."}],[{"type":"prose","content":"Joshua son of Nun, the servant of the , died at the age of 110."}],[{"type":"prose","content":"They buried him in the land he had been allocated, at Timnath-serah in the hill country of Ephraim, north of Mount Gaash."},{"type":"header","content":"Israel Disobeys the Lord"}],[{"type":"prose","content":"After that generation died, another generation grew up who did not acknowledge the  or remember the mighty things he had done for Israel."}],[{"type":"prose","content":"The Israelites did evil in the ’s sight and served the images of Baal."}],[{"type":"prose","content":"They abandoned the , the God of their ancestors, who had brought them out of Egypt. They went after other gods, worshiping the gods of the people around them. And they angered the ."}],[{"type":"prose","content":"They abandoned the  to serve Baal and the images of Ashtoreth."}],[{"type":"prose","content":"This made the  burn with anger against Israel, so he handed them over to raiders who stole their possessions. He turned them over to their enemies all around, and they were no longer able to resist them."}],[{"type":"prose","content":"Every time Israel went out to battle, the  fought against them, causing them to be defeated, just as he had warned. And the people were in great distress."},{"type":"header","content":"The Lord Rescues His People"}],[{"type":"prose","content":"Then the  raised up judges to rescue the Israelites from their attackers."}],[{"type":"prose","content":"Yet Israel did not listen to the judges but prostituted themselves by worshiping other gods. How quickly they turned away from the path of their ancestors, who had walked in obedience to the ’s commands."}],[{"type":"prose","content":"Whenever the  raised up a judge over Israel, he was with that judge and rescued the people from their enemies throughout the judge’s lifetime. For the  took pity on his people, who were burdened by oppression and suffering."}],[{"type":"prose","content":"But when the judge died, the people returned to their corrupt ways, behaving worse than those who had lived before them. They went after other gods, serving and worshiping them. And they refused to give up their evil practices and stubborn ways."}],[{"type":"prose","content":"So the  burned with anger against Israel. He said, “Because these people have violated my covenant, which I made with their ancestors, and have ignored my commands,"}],[{"type":"prose","content":"I will no longer drive out the nations that Joshua left unconquered when he died."}],[{"type":"prose","content":"I did this to test Israel—to see whether or not they would follow the ways of the  as their ancestors did.”"}],[{"type":"prose","content":"That is why the  left those nations in place. He did not quickly drive them out or allow Joshua to conquer them all."}]]