[{"header":"Jonah’s Displeasure Rebuked"},{"num":4,"verse":"But it greatly displeased Jonah and he became angry. "},{"num":2,"verse":"He prayed to the Lord and said, “O Lord, is this not what I said when I was still in my country? That is why I ran to Tarshish, because I knew that You are a gracious and compassionate God, slow to anger and great in lovingkindness, and [when sinners turn to You] You revoke the [sentence of] disaster [against them]. "},{"num":3,"verse":"Therefore now, O Lord, just take my life from me, for it is better for me to die than to live.” "},{"num":4,"verse":"Then the Lord said, “Do you have a good reason to be angry?”"},{"num":5,"verse":"Then Jonah went out of the city and sat east of it. There he made himself a shelter and sat under its shade so that he could see what would happen in the city. "},{"num":6,"verse":"So the Lord God prepared a plant and it grew up over Jonah, to be a shade over his head to spare him from discomfort. And Jonah was extremely happy about [the protection of] the plant. "},{"num":7,"verse":"But God prepared a worm when morning dawned the next day, and it attacked the plant and it withered. "},{"num":8,"verse":"When the sun came up God prepared a scorching east wind, and the sun beat down on Jonah’s head so that he fainted and he wished to die, and said, “It is better for me to die than to live.”"},{"num":9,"verse":"Then God said to Jonah, “Do you have a good reason to be angry about [the loss of] the plant?” And he said, “I have a [very] good reason to be angry, angry enough to die!” "},{"num":10,"verse":"Then the Lord said, “You had compassion on the plant for which you did not work and which you did not cause to grow, which came up overnight and perished overnight. "},{"num":11,"verse":"Should I not have compassion on Nineveh, the great city in which there are more than 120,000 [innocent] persons, who do not know the difference between their right and left hand [and are not yet accountable for sin], as well as many [blameless] animals?”"}]