[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My covenant.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There had been no covenant with Adam or with the Sethites, but in the higher state of things which began with Noah, man was to hold a more exactly defined relation to God; and though they had begun to attach the notion of Deity to the name Jehovah in the days of Enos (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), yet it was not till the time of Moses that it became the distinct title of God in covenant with man. Of this relation a necessary result was revelation, as in no other way could there be a communication between the two contracting parties. Hence the Bible is called “The Old and New Covenant,” or “The Old and New Testament,” the Greek term being of wider meaning than either word with us, and signifying either an agreement between the living or the document by which a testator disposes of his property after his death (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The title of covenant is more applicable to the Scriptures of the prior dispensation, which contain a series of such relations, all preparing for the last and best and most perfect, which was a Testament ratified in the blood of Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:12-21 God told Noah his purpose to destroy the wicked world by water. The secret of the Lord is with them that fear him, Ps 25:14. It is with all believers, enabling them to understand and apply the declarations and warnings of the written word. God chose to do it by a flood of waters, which should drown the world. As he chooses the rod with which he corrects his children, so he chooses the sword with which he cuts off his enemies. God established his covenant with Noah. This is the first place in the Bible where the word 'covenant' is found; it seems to mean, 1. The covenant of providence; that the course of nature shall be continued to the end of time. 2. The covenant of grace; that God would be a God to Noah, and that out of his seed God would take to himself a people. God directed Noah to make an ark. This ark was like the hulk of a ship, fitted to float upon the waters. It was very large, half the size of St. Paul's cathedral, and would hold more than eighteen of the largest ships now used. God could have secured Noah without putting him to any care, or pains, or trouble; but employed him in making that which was to be the means to preserve him, for the trial of his faith and obedience. Both the providence of God, and the grace of God, own and crown the obedient and diligent. God gave Noah particular orders how to make the ark, which could not therefore but be well fitted for the purpose. God promised Noah that he and his family should be kept alive in the ark. What we do in obedience to God, we and our families are likely to have the benefit of. The piety of parents gets their children good in this life, and furthers them in the way to eternal life, if they improve it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The covenant with Noah. Here is the first appearance of a covenant between God and man on the face of Scripture. A covenant is a solemn compact, tacit or express, between two parties, in which each is bound to perform his part. Hence, a covenant implies the moral faculty; and wherever the moral faculty exists, there must needs be a covenant. Consequently, between God and man there was of necessity a covenant from the very beginning, though the name do not appear. At first it was a covenant of works, in regard to man; but now that works have failed, it can only be a covenant of grace to the penitent sinner. \"My covenant.\" The word \"my\" points to its original establishment with Adam. My primeval covenant, which I am resolved not to abandon. \"Will I establish.\" Though Adam has failed, yet will I find means of maintaining my covenant of life with the seed of the woman. \"With thee.\" Though all flesh be to perish through breach of my covenant, yet will I uphold it with thee. \"Go into the ark.\" This is the means of safety. Some may say in their hearts, this is a clumsy way to save Noah. But if he is to be saved, there must be some way. And it is not a sign of wisdom to prescribe the way to the All-wise. Rather let us reflect that the erection of this ark was a daily warning to a wicked race, a deepening lesson of reliance on God to Noah and his household, and a most salutary occupation for the progenitors of the future race of mankind. \"And thy sons, etc.\" Noah's household share in the covenant.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. But with thee will I establish my covenant—a special promise of deliverance, called a covenant, to convince him of the confidence to be reposed in it. The substance and terms of this covenant are related at Ge 6:19-21.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. My promise to preserve thee and thine, both till the flood and in it, notwithstanding all the scoffs and threats of the wicked world against thee all the time of thy preaching and building of the ark. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "covenant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being here understood, not of a mutual compact or agreement, but of a single and gracious promise, as it is also used ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 18:19, Numbers 25:12",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 25:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in other places. Which promise, though only here mentioned, was doubtless made before, as may easily be gathered, both from these words and some foregoing passages, and from the need which Noah had of such a support and encouragement during all the time of his ministry. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. My covenant concerning the sending of the promised Seed, and the redemption of mankind by the Messias, who shall come out of thy loins, and therefore thou shalt be preserved. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But with thee will I establish my covenant,.... Made with Noah at this time, though not expressed, that on his making an ark, as God directed him, and going into it at his command, he would preserve him while building it from the rage of wicked men, and save him in it and his family, when the flood should come; and that they should come safe out of it, and repeople the world, which should be no more destroyed by one; for this covenant respects that later mentioned, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so Aben Ezra; or the promise of the Messiah, which should spring from him, for the fulfilment of which Noah and his family were spared; and this in every article God would confirm, of which he might be assured from his power, veracity, and faithfulness, and other perfections of his: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and thou shalt come into the ark; when the covenant would begin more clearly to be established, and more plainly to be fulfilling; Noah on the one hand being obedient to the divine will, having built an ark, and entering into it; and on the other, God giving him leave, and an order to enter into it, and shutting him up in it to preserve him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou and thy sons, and thy wife, and thy sons' wives with thee; that is, Noah and his wife, and his sons and their wives, in all eight persons; and eight only, as the Apostle Peter observes, 1 Peter 3:20 by this it appears that Noah's three sons were married before the flood, but as yet had no children. Jarchi concludes, from the mode of expression used, that the men and women were to be separate; that they entered the ark in this manner, and continued so, the use of the marriage bed being forbidden them while in the ark. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou and thy sons, and thy wife, and thy sons' wives with thee; that is, Noah and his wife, and his sons and their wives, in all eight persons; and eight only, as the Apostle Peter observes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by this it appears that Noah's three sons were married before the flood, but as yet had no children. Jarchi concludes, from the mode of expression used, that the men and women were to be separate; that they entered the ark in this manner, and continued so, the use of the marriage bed being forbidden them while in the ark. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But with thee will I {m} establish my covenant; and thou shalt come into the ark, thou, and thy sons, and thy wife, and thy sons' wives with thee.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But with thee will I ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " establish my covenant; and thou shalt come into the ark, thou, and thy sons, and thy wife, and thy sons' wives with thee.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) So that in this great undertaking and mocking of the whole world, you may be confirmed so your faith does not fail.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will establish my covenant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] We have here the first mention of a covenant relation between God and man. In the writing of P great stress is laid upon the covenant with Noah, here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:8-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and with the patriarchs, e.g. in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:2-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word “covenant” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b’rîth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "foedus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") plays an important part in O.T. theology. Its place here in relation to the manifestation of sin on the one side, and of Divine salvation on the other, is typical of its permanent significance in the history of the Chosen People. It is this relationship of covenant (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which is renewed by our Lord and ratified at the institution of the Lord’s Supper, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A covenant means an agreement, or compact between two parties, for the observance of which promises and pledges are given. Cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou, and thy sons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] This is the redundant style of P, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But with thee will I establish my covenant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בְּרית",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διαθήκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", LXX.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "foe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "due",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vulgate; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "testamentum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", N.T.), from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בָּרַא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to cut or carve; hence a covenant, from the custom of passing between the divided pieces of the victims slain on the occasion of making such solemn compacts (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Gesenius); from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בָּרַה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to eat, hence an eating together, a banquet (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Lee). On the Bible idea of covenant see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". My covenant   =   the already well-known covenant which I have made with man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And thou shalt come into the ark, thou, and thy sons, and thy wife, and thy son's wives with thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "This",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was the substance of the covenant agreement so far as Noah was concerned. The next three verses describe the arrangements about the animals. Genesis 6:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Noah was to build this ark, because God was about to bring a flood upon the earth, and would save him, with his family, and one pair of every kind of animal. מבּוּל, (the flood), is an archaic word, coined expressly for the waters of Noah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is used nowhere else except ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". הארץ על מים is in apposition to mabbul: \"I bring the flood, waters upon the earth, to destroy all flesh, wherein is a living breath\" (i.e., man and beast). With Noah, God made a covenant. On בּרית see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As not only the human race, but the animal world also was to be preserved through Noah, he was to take with him into the ark his wife, his sons and their wives, and of every living thing, of all flesh, two of every sort, a male and a female, to keep them alive; also all kinds of food for himself and family, and for the sustenance of the beasts.",
        "children": []
      }
    ]
  }
]