[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sons of God. . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The literal translation of this verse is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the sons of the Elohim saw the daughters of the adam that they were good ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(beautiful); ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and they took to them wives whomsoever they chose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Of the sons of the Elohim there are three principal interpretations: the first, that of the Targums and the chief Jewish expositors, that they were the nobles, and men of high rank; the second, that they were angels. St. Jude, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jude 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and St. Peter, 2 Ep., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Peter 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", seem to favour this interpretation, possibly as being the translation of the LXX. according to several MSS. But even if this be their meaning, which is very uncertain, they use it only as an illustration; and a higher authority says that the angels neither marry nor are given in marriage. The third, and most generally accepted interpretation in modern times, is that the sons of the Elohim were the Sethites, and that when they married for mere lust of beauty, universal corruption soon ensued. But no modern commentator has shown how such marriages could produce “mighty men . . . men of renown;” or how strong warriors could be the result of the intermarriage of pious men with women of an inferior race, such as the Cainites are assumed to have been.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Jewish interpreters, who well understood the uses of their own language, are right in the main point that the phrase “sons of the Elohim” conveys no idea of moral goodness or piety. Elohim constantly means mighty ones (Exodus 15:11, marg.). (Comp. Exodus 12:12, marg., Exodus 21:6; Exodus 22:8-9, where it is translated judges; Exodus 22:28, 1Samuel 2:25, where also it is translated judge.) In Job 1:6 the “sons of Elohim” are the nobles, the idea being that of a king who at his durbar gathers his princes round him; and, not unnecessarily to multiply examples, the “sons of the Elim,” the other form of the plural, is rightly translated mighty ones in Psalm 29:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Jewish interpreters, who well understood the uses of their own language, are right in the main point that the phrase “sons of the Elohim” conveys no idea of moral goodness or piety. Elohim constantly means ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "mighty ones ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", marg.). (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", marg., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 21:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 22:8-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is translated ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "judges; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 22:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 2:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where also it is translated ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "judge.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the “sons of Elohim” are the nobles, the idea being that of a king who at his durbar gathers his princes round him; and, not unnecessarily to multiply examples, the “sons of the Elim,” the other form of the plural, is rightly translated ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "mighty ones ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 29:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Who, then, are these “mighty ones?” Before answering this question, let me call attention to the plain teaching of the narrative as to what is meant by the “daughters of men.” It says: “When the adam began to multiply, and daughters were born unto them, the sons of the Elohim saw the daughters of the adam . . . and took them wives,” &c. But according to every right rule of interpretation, the “daughters of the adam” in Genesis 6:1 must be the same as the “daughters of the adam” in Genesis 6:2, whom the sons of the Elohim married. Now, it seems undeniable that the adam here spoken of were the Sethites. The phrase occurs in the history of Noah, just after giving his descent from Adam; Cain is absolutely passed over, even in the account of the birth of Seth, who is described as Adam’s firstborn, such as legally he was. The corruption described is that of the Sethites; for the Cainites have already been depicted as violent and lustful, and their history has been brought to an end. Moreover, in Genesis 6:3, “the adam with whom God will not always strive” is certainly the family of Seth, who, though the chosen people and possessors of the birthright, are nevertheless described as falling into evil ways; and their utter corruption finally is the result of the depravation of their women by a race superior to themselves in muscular vigour and warlike prowess.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who, then, are these “mighty ones?” Before answering this question, let me call attention to the plain teaching of the narrative as to what is meant by the “daughters of men.” It says: “When the adam began to multiply, and daughters were born unto them, the sons of the Elohim saw the daughters of the adam . . . and took them wives,” &c. But according to every right rule of interpretation, the “daughters of the adam” in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " must be the same as the “daughters of the adam” in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", whom the sons of the Elohim married. Now, it seems undeniable that the adam here spoken of were the Sethites. The phrase occurs in the history of Noah, just after giving his descent from Adam; Cain is absolutely passed over, even in the account of the birth of Seth, who is described as Adam’s firstborn, such as legally he was. The corruption described is that of the Sethites; for the Cainites have already been depicted as violent and lustful, and their history has been brought to an end. Moreover, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “the adam with whom God will not always strive” is certainly the family of Seth, who, though the chosen people and possessors of the birthright, are nevertheless described as falling into evil ways; and their utter corruption finally is the result of the depravation of their women by a race superior to themselves in muscular vigour and warlike prowess.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Where, then, shall we find these men? Certainly among the descendants of Cain. In Genesis 4:17-24, we find Cain described as the founder of civil institutions and social life: the name he gives to his son testifies to his determination that his race shall be trained men. They advance rapidly in the arts, become rich, refined, luxurious, but also martial and arrogant. The picture terminates in a boastful hero parading himself before his admiring wives, displaying to them his weapons, and vaunting himself in a poem of no mean merit as ten times superior to their forefather Cain. His namesake in the race of Seth also indites a poem; but it is a groan over their hard toil, and the difficulty with which, by incessant labour, they earned their daily bread. To the simple “daughters of the adam,” these men, enriched by the possession of implements of metal, playing sweet music on harp and pipe, and rendered invincible by the deadly weapons they had forged, must have seemed indeed as very “sons of the Elohim.” The Sethites could not have taken the Cainite women according to their fancy in the way described, protected as they were by armed men; but the whole phrase, “whomsoever they would,” reeks of that arrogancy and wantonness of which the polygamist Lamech had set so notable an example. And so, not by the women corrupting nobler natures, but by these strong men acting according to their lust, the race with the birthright sank to the Cainite level, and God had no longer a people on earth worthy of His choice.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Where, then, shall we find these men? Certainly among the descendants of Cain. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:17-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we find Cain described as the founder of civil institutions and social life: the name he gives to his son testifies to his determination that his race shall be trained men. They advance rapidly in the arts, become rich, refined, luxurious, but also martial and arrogant. The picture terminates in a boastful hero parading himself before his admiring wives, displaying to them his weapons, and vaunting himself in a poem of no mean merit as ten times superior to their forefather Cain. His namesake in the race of Seth also indites a poem; but it is a groan over their hard toil, and the difficulty with which, by incessant labour, they earned their daily bread. To the simple “daughters of the adam,” these men, enriched by the possession of implements of metal, playing sweet music on harp and pipe, and rendered invincible by the deadly weapons they had forged, must have seemed indeed as very “sons of the Elohim.” The Sethites could not have taken the Cainite women according to their fancy in the way described, protected as they were by armed men; but the whole phrase, “whomsoever they would,” reeks of that arrogancy and wantonness of which the polygamist Lamech had set so notable an example. And so, not by the women corrupting nobler natures, but by these strong men acting according to their lust, the race with the birthright sank to the Cainite level, and God had no longer a people on earth worthy of His choice.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 6:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The sons of God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Those who were called by the name of the Lord, and called upon that name; married ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the daughters of men ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Those that were profane, and strangers to God. The posterity of Seth did not keep to themselves as they ought, but intermingled with the race of Cain: they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "took them wives of all which they chosen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They chose only by the eye. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They saw that they were fair — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which was all they looked at.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-7 The most remarkable thing concerning the old world, is the destroying of it by the deluge, or flood. We are told of the abounding iniquity of that wicked world: God's just wrath, and his holy resolution to punish it. In all ages there has been a peculiar curse of God upon marriages between professors of true religion and its avowed enemies. The evil example of the ungodly party corrupts or greatly hurts the other. Family religion is put an end to, and the children are trained up according to the worldly maxims of that parent who is without the fear of God. If we profess to be the sons and daughters of the Lord Almighty, we must not marry without his consent. He will never give his blessing, if we prefer beauty, wit, wealth, or worldly honours, to faith and holiness. The Spirit of God strove with men, by sending Enoch, Noah, and perhaps others, to preach to them; by waiting to be gracious, notwithstanding their rebellions; and by exciting alarm and convictions in their consciences. But the Lord declared that his Spirit should not thus strive with men always; he would leave them to be hardened in sin, and ripened for destruction. This he determined on, because man was flesh: not only frail and feeble, but carnal and depraved; having misused the noble powers of his soul to gratify his corrupt inclinations. God sees all the wickedness that is among the children of men; it cannot be hid from him now; and if it be not repented of, it shall be made known by him shortly. The wickedness of a people is great indeed, when noted sinners are men renowned among them. Very much sin was committed in all places, by all sorts of people. Any one might see that the wickedness of man was great: but God saw that every imagination, or purpose, of the thoughts of man's heart, was only evil continually. This was the bitter root, the corrupt spring. The heart was deceitful and desperately wicked; the principles were corrupt; the habits and dispositions evil. Their designs and devices were wicked. They did evil deliberately, contriving how to do mischief. There was no good among them. God saw man's wickedness as one injured and wronged by it. He saw it as a tender father sees the folly and stubbornness of a rebellious and disobedient child, which grieves him, and makes him wish he had been childless. The words here used are remarkable; they are used after the manner of men, and do not mean that God can change, or be unhappy. Does God thus hate our sin? And shall not we be grieved to the heart for it? Oh that we may look on Him whom we have grieved, and mourn! God repented that he had made man; but we never find him repent that he redeemed man. God resolves to destroy man: the original word is very striking, 'I will wipe off man from the earth,' as dirt or filth is wiped off from a place which should be clean, and is thrown to the dunghill, the proper place for it. God speaks of man as his own creature, when he resolves upon his punishment. Those forfeit their lives who do not answer the end of their living. God speaks of resolution concerning men, after his Spirit had been long striving with them in vain. None are punished by the justice of God, but those who hate to be reformed by the grace of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There are two stages of evil set forth in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - the one contained in the present four verses, and the other in the following. The former refers to the apostasy of the descendants of Sheth, and the cause and consequences of it. When man began to multiply, the separate families of Cain and Sheth would come into contact. The daughters of the stirring Cainites, distinguished by the graces of nature, the embellishments of art, and the charms of music and song, even though destitute of the loftier qualities of likemindedness with God, would attract attention and prompt to unholy alliances. The phrase \"sons of God,\" means an order of intelligent beings who \"retain the purity of moral character\" originally communicated, or subsequently restored, by their Creator. They are called the sons of God, because they have his spirit or disposition. The sons of God mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are an order of rational beings existing before the creation of man, and joining in the symphony of the universe, when the earth and all things were called into being. Then all were holy, for all are styled the sons of God. Such, however, are not meant in the present passage. For they were not created as a race, have no distinction of sex, and therefore no sexual desire; they \"neither marry nor are given in marriage\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is contrary to the law of nature for different species even on earth to cohabit in a carnal way; much more for those in the body, and those who have not a body of flesh. Moreover, we are here in the region of humanity, and not in the sphere of superhuman spirits; and the historian has not given the slightest intimation of the existence of spiritual beings different from man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The sons of God, therefore, are those who are on the Lord's side, who approach him with duly significant offerings, who call upon him by his proper name, and who walk with God in their daily conversation. The figurative use of the word \"son\" to denote a variety of relations incidental, and moral as well as natural, was not unfamiliar to the early speaker. Thus, Noah is called \"the son of five hundred years\" Genesis 5:32. Abraham calls Eliezer בן־בותי  ben-bēytı̂y, \"son of my house\" Genesis 15:3. The dying Rachel names her son Ben-oni, \"son of my sorrow,\" while his father called him Benjamin, \"son of thy right hand\" Genesis 35:18. An obvious parallel to the moral application is presented in the phrases \"the seed of the woman\" and \"the seed of the serpent.\" The word \"generations\" תולדות  tôledot, Genesis 5:1) exhibits a similar freedom and elasticity of meaning, being applied to the whole doings of a rational being, and even to the physical changes of the material world Genesis 2:4. The occasion for the present designation is furnished in the remark of Eve on the birth of Sheth. God hath given me another seed instead of Habel. Her son Sheth she therefore regarded as the son of God. Accordingly, about the birth of his son Enosh, was begun the custom calling upon the name of the Lord, no doubt in the family circle of Adam, with whom Sheth continued to dwell. And Enok, the seventh from Adam in the same line, exhibited the first striking example of a true believer walking with God in all the intercourse of life. These descendants of Sheth, among whom were also Lamek who spoke of the Lord, and Noah who walked with God, are therefore by a natural transition called the sons of God, the godlike in a moral sense, being born of the Spirit, and walking not after the flesh, but after the Spirit Psalm 82:6; Hosea 2:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The sons of God, therefore, are those who are on the Lord's side, who approach him with duly significant offerings, who call upon him by his proper name, and who walk with God in their daily conversation. The figurative use of the word \"son\" to denote a variety of relations incidental, and moral as well as natural, was not unfamiliar to the early speaker. Thus, Noah is called \"the son of five hundred years\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Abraham calls Eliezer בן־בותי  ben-bēytı̂y, \"son of my house\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The dying Rachel names her son Ben-oni, \"son of my sorrow,\" while his father called him Benjamin, \"son of thy right hand\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". An obvious parallel to the moral application is presented in the phrases \"the seed of the woman\" and \"the seed of the serpent.\" The word \"generations\" תולדות  tôledot, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") exhibits a similar freedom and elasticity of meaning, being applied to the whole doings of a rational being, and even to the physical changes of the material world ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The occasion for the present designation is furnished in the remark of Eve on the birth of Sheth. God hath given me another seed instead of Habel. Her son Sheth she therefore regarded as the son of God. Accordingly, about the birth of his son Enosh, was begun the custom calling upon the name of the Lord, no doubt in the family circle of Adam, with whom Sheth continued to dwell. And Enok, the seventh from Adam in the same line, exhibited the first striking example of a true believer walking with God in all the intercourse of life. These descendants of Sheth, among whom were also Lamek who spoke of the Lord, and Noah who walked with God, are therefore by a natural transition called the sons of God, the godlike in a moral sense, being born of the Spirit, and walking not after the flesh, but after the Spirit ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 82:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Some take \"the daughters of man\" to be the daughters of the Cainites only. But it is sufficient to understand by this phrase, the daughters of man in general, without any distinction of a moral or spiritual kind, and therefore including both Cainite and Shethite females. \"And they took them wives of all whom they chose.\" The evil here described is that of promiscuous intermarriage, without regard to spiritual character. The godly took them wives of all; that is, of the ungodly as well as the godly families, without any discrimination. \"Whom they chose,\" not for the godliness of their lives, but for the goodliness of their looks. Ungodly mothers will not train up children in the way they should go; and husbands who have taken the wrong step of marrying ungodly wives cannot prove to be very exemplary or authoritative fathers. Up to this time they may have been consistent as the sons of God in their outward conduct. But a laxity of choice proves a corresponding laxity of principle. The first inlet of sin prepares the way for the flood-gates of iniquity. It is easy to see that now the degeneracy of the whole race will go on at a rapid pace.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Some take \"the daughters of man\" to be the daughters of the Cainites only. But it is sufficient to understand by this phrase, the daughters of man in general, without any distinction of a moral or spiritual kind, and therefore including both Cainite and Shethite females. \"And they took them wives of all whom they chose.\" The evil here described is that of promiscuous intermarriage, without regard to spiritual character. The godly took them wives of all; that is, of the ungodly as well as the godly families, without any discrimination. \"Whom they chose,\" not for the godliness of their lives, but for the goodliness of their looks. Ungodly mothers will not train up children in the way they should go; and husbands who have taken the wrong step of marrying ungodly wives cannot prove to be very exemplary or authoritative fathers. Up to this time they may have been consistent as the sons of God in their outward conduct. But a laxity of choice proves a corresponding laxity of principle. The first inlet of sin prepares the way for the flood-gates of iniquity. It is easy to see that now the degeneracy of the whole race will go on at a rapid pace.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. the sons of God saw the daughters of men—By the former is meant the family of Seth, who were professedly religious; by the latter, the descendants of apostate Cain. Mixed marriages between parties of opposite principles and practice were necessarily sources of extensive corruption. The women, religious themselves, would as wives and mothers exert an influence fatal to the existence of religion in their household, and consequently the people of that later age sank to the lowest depravity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sons of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Persons of greatest eminency for place and power, for such are called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gods, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "children of the Most High, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 82:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 82:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; where also they are opposed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 6:7",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. to meaner men. And the most eminent things in their kinds are attributed to God, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cedars of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c. But it is not probable that the princes and nobles should generally take wives or women of the meaner rank, nor would the marriages of such persons be simply condemned, or at least it would not be mentioned as a crying sin, and a great cause of the deluge. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The children of Seth and Enos, the professors of the true religion. For, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Such, and only such, in the common use of Scripture, are called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "sons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "children of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 14:1, Deu 32:19, Isaiah 1:2, Isaiah 45:11, Hosea 11:1, Luke 17:27",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 32:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 17:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. This title manifestly relates to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 4:26",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same persons are said to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "called by the name of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. to be the sons and servants of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. They are opposed to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "daughters of men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being here taken in an ill sense, for such as had nothing in them but the nature of men, which is corrupt and abominable, and were not sons of God, but foreigners and strangers to him, and apostates from him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. These unequal matches with persons of a false religion are every where condemned in Scripture as sinful and pernicious, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 26:35 Exodus 34:16 1 Kings 11:2-3, Ezra 9:12, Nehemiah 13:23",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 11:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Ezra 9:12, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 13:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Malachi 2:11 1 Corinthians 7:39 2 Corinthians 6:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 7:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore are fitly spoken of here as one of the sins which brought the flood upon the ungodly world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saw, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. gazed upon and observed curiously and lustfully, as the sequel showeth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the daughters of men, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of that ungodly and accursed race of Cain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They were fair, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. beautiful, and set off their beauty with all the allurements of ornaments and carriage; herein using greater liberty than the sons and daughters of God did or durst take, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Peter 3:3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 3:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and therefore were more enticing and prevalent with fleshly-minded men. Either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. By force and violence, as the word sometimes signifies. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. By consent; for the sons of God were so few, in comparison of the wicked world, that they durst not take away their daughters by force; which also proves that they did not take them for harlots, but for wives. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They took them wives, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " possibly more than one for each of them, after the example of those wicked families into which they were matched; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of all which they chose, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. loved and liked, as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "choosing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Psalm 25:12, Psalm 119:173, Isaiah 1:29, Isaiah 42:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:173",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Matthew 12:28",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is noted as the first error, that they did promiscuously choose wives, without any regard to their sobriety and religion, minding only the pleasing of their own fancies and lusts, not the pleasing and serving of their Lord and Maker, nor the obtaining of a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "godly seed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was God’s end in the institution of marriage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Malachi 2:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 2:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore should have been theirs too. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That the sons of God saw the daughters of men, that they were fair,.... Or \"good\" (k), not in a moral but natural sense; goodly to look upon, of a beautiful aspect; and they looked upon, and only regarded their external beauty, and lusted after them: those \"sons of God\" were not angels either good or bad, as many have thought, since they are incorporeal beings, and cannot be affected with fleshly lusts, or marry and be given in marriage, or generate and be generated; nor the sons of judges, magistrates, and great personages, nor they themselves, as the Targums of Onkelos and Jonathan, and so Jarchi and Aben Ezra; but this could be no crime in them, to look upon and take in marriage such persons, though they were the daughters of the meaner sort; and supposing they acted a criminal part in looking at them, and lusting after them, and committing fornication with them, and even in marrying irreligious persons; yet this could only be a partial, not an universal corruption, as is after affirmed, though such examples must indeed have great influence upon the populace; but rather this is to be understood of the posterity of Seth, who from the times of Enos, when then began to be called by the name of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had the title of the sons of God, in distinction from the children of men; these claimed the privilege of divine adoption, and professed to be born of God, and partakers of his grace, and pretended to worship him according to his will, so far as revealed to them, and to fear and serve and glorify him. According to the Arabic writers (l), immediately after the death of Adam the family of Seth was separated from the family of Cain; Seth took his sons and their wives to a high mountain (Hermon), on the top of which Adam was buried, and Cain and all his sons lived in the valley beneath, where Abel was slain; and they on the mountain obtained a name for holiness and purity, and were so near the angels that they could hear their voices and join their hymns with them; and they, their wives and their children, went by the common name of the sons of God: and now these were adjured, by Seth and by succeeding patriarchs, by no means to go down from the mountain and join the Cainites; but notwithstanding in the times of Jared some did go down, it seems; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and after that others, and at this time it became general; and being taken with the beauty of the daughters of Cain and his posterity, they did as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they took them wives of all that they chose; not by force, as Aben Ezra and Ben Gersom interpret, for the Cainites being more numerous and powerful than they, it can hardly be thought that the one would attempt it, or the other suffer it; but they intermarried with them, which the Cainites might not be averse unto; they took to them wives as they fancied, which were pleasing to the flesh, without regard to their moral and civil character, and without the advice and consent of their parents, and without consulting God and his will in the matter; or they took women as they pleased, and were to their liking, and committed fornication, to which the Cainites were addicted; for they spent their time in singing and dancing, and in uncleanness, whereby the posterity of Seth or sons of God were allured to come down and join them, and commit fornication with them, as the Arabic writers (m) relate. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k)  Sept, \"bonae\" Cocceius. (l) Elmacinus, Patricides apud Hottinger. Smegma, l. 1. c. viii. p. 226, 227, 228. (m) Elmacinus, Patricides apud Hottinger. Smegma, l. 1. c. viii. p. 232, 235, 236, 242, 247. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k)  Sept, \"bonae\" Cocceius. (l) Elmacinus, Patricides apud Hottinger. Smegma, l. 1. c. viii. p. 226, 227, 228. (m) Elmacinus, Patricides apud Hottinger. Smegma, l. 1. c. viii. p. 232, 235, 236, 242, 247. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "That the {a} sons of God saw the daughters {b} of men that they were {c} fair; and they took them wives of all which they chose.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sons of God saw the daughters ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of men that they ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fair; and they took them wives of all which they chose.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) The children of the godly who began to degenerate.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Those that had wicked parents, as if from Cain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Having more respect for their beauty and worldly considerations than for their manners and godliness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that the sons of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] This is one of the most disputed passages in the book. But the difficulty, in a great measure, disappears, if it is frankly recognized, that the verse must be allowed to have its literal meaning. According to the legend which it preserves, intermarriages took place between Heavenly Beings and mortal women.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Commentators have often shrunk from the admission that this piece of mythology could have a place in the Hebrew Scriptures. Accordingly, very fanciful explanations have sometimes found favour; e.g. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “the sons of God” are the men of the upper classes, “the daughters of men” are “the women of the lower classes”; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “the sons of God” are “the sons of the god-fearing,” “the daughters of men” are “the daughters of the impious”; (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “the sons of God” are “the descendants of Seth,” “the daughters of men” are “the women of the Cainite race.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Such interpretations may be dismissed as arbitrary and non-natural: and they furnish no explanation of the inference in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 6:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that a race of giants or heroes was the progeny of these marriages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sons of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "B’nê Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “sons of Elohim,” i.e. beings partaking of the Divine nature. It has been pointed out above (see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that the Israelites believed the Almighty to be surrounded by a court of beings who were subordinate to Him in authority, office, and rank: their dwelling-place was in Heaven; their duty was to perform the tasks appointed them by the Almighty. They were “angels” or “messengers,” Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mal’âkhîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Gr. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄγγελοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sons of God are mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The expression must be judged in accordance with Hebrew, not English, idiom. “The sons of the prophets” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 20:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are persons who belong to the guild of the prophets, members, as we should say, of the prophet’s calling. No family relationship is implied. Similarly “the sons of God” are not “sons of gods,” in the sense of being their children, but “sons of Elohim” in the sense of belonging to the class of super-natural, or heavenly, beings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is no reference, on the one hand, to Oriental speculations respecting emanations from the Deity; nor to actual sonship, or generation. The description is quite general. Nowhere do we find in the O.T. mention of the “sons of Jehovah” instead of the “sons of Elohim.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of all that they chose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. whomsoever they chose. The sons of God are represented as being irresistible. The sons of men could offer no effective opposition. The marriages, contracted in this way, are evidently implied to be wrong, and the result of mere unbridled passion. The men were powerless to defend their women folk.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In the later days of Judaism, this passage became the source of the strange legends respecting “fallen angels,” of which we find traces in the N.T.: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “for if God spared not angels when they sinned, but cast them down to Hell”; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “angels which kept not their own principality, but left their proper habitation”; and in the Book of Enoch.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is no trace, however, in the Book of Genesis of any tradition respecting either the fall, or the rebellion, of members of the angel-host. Unquestionably English ideas are profoundly affected by the influence of Milton’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Paradise Lost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and by the vague impression that a great and noble religious poem must have been founded upon literal facts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " relates to the increase of men generally (האדם, without any restriction), i.e., of the whole human race; and whilst the moral corruption is represented as universal, the whole human race, with the exception of Noah, who found grace before God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is described as ripe for destruction (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:5-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To understand this section, and appreciate the causes of this complete degeneracy of the race, we must first obtain a correct interpretation of the expressions \"sons of God\" (האלהים בני) and \"daughters of men\" (האדם בנות). Three different views have been entertained from the very earliest times: the \"sons of God\" being regarded as (a) the sons of princes, (b) angels, (c) the Sethites or godly men; and the \"daughters of men,\" as the daughters (a) of people of the lower orders, (b) of mankind generally, (c) of the Cainites, or of the rest of mankind as contrasted with the godly or the children of God. Of these three views, the first, although it has become the traditional one in orthodox rabbinical Judaism, may be dismissed at once as not warranted by the usages of the language, and as altogether unscriptural. The second, on the contrary, may be defended on two plausible grounds: first, the fact that the \"sons of God,\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are unquestionably angels (also אלים בּני in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 89:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and secondly, the antithesis, \"sons of God\" and \"daughters of men.\" Apart from the context and tenor of the passage, these two points would lead us most naturally to regard the \"sons of God\" as angels, in distinction from men and the daughters of men. But this explanation, though the first to suggest itself, can only lay claim to be received as the correct one, provided the language itself admits of no other. Now that is not the case. For it is not to angels only that the term \"sons of Elohim,\" or \"sons of Elim,\" is applied; but in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in an address to Elohim, the godly are called \"the generation of Thy sons,\" i.e., sons of Elohim; in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Israelites are called His (God's) sons, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"sons of the living God;\" and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Israel is spoken of as the son, whom Elohim has made strong. These passages show that the expression \"sons of God\" cannot be elucidated by philological means, but must be interpreted by theology alone. Moreover, even when it is applied to the angels, it is questionable whether it is to be understood in a physical or ethical sense. The notion that \"it is employed in a physical sense as nomen naturae, instead of angels as nomen officii, and presupposes generation of a physical kind,\" we must reject as an unscriptural and gnostic error. According to the scriptural view, the heavenly spirits are creatures of God, and not begotten from the divine essence. Moreover, all the other terms applied to the angels are ethical in their character. But if the title \"sons of God\" cannot involve the notion of physical generation, it cannot be restricted to celestial spirits, but is applicable to all beings which bear the image of God, or by virtue of their likeness to God participate in the glory, power, and blessedness of the divine life, - to men therefore as well as angels, since God has caused man to \"want but little of Elohim,\" or to stand but a little behind Elohim (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that even magistrates are designated \"Elohim, and sons of the Most High\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 82:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). When Delitzsch objects to the application of the expression \"sons of Elohim\" to pious men, because, \"although the idea of a child of God may indeed have pointed, even in the O.T., beyond its theocratic limitation to Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") towards a wider ethical signification (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 14:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), yet this extension and expansion were not so completed, that in historical prose the terms 'sons of God' (for which 'sons of Jehovah' should have been used to prevent mistake), and 'sons (or daughters) of men,' could be used to distinguish the children of God and the children of the world,\" - this argument rests upon the erroneous supposition, that the expression \"sons of God\" was introduced by Jehovah for the first time when He selected Israel to be the covenant nation. So much is true, indeed, that before the adoption of Israel as the first-born son of Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it would have been out of place to speak of sons of Jehovah; but the notion is false, or at least incapable of proof, that there were not children of God in the olden time, long before Abraham's call, and that, if there were, they could not have been called \"sons of Elohim.\" The idea was not first introduced in connection with the theocracy, and extended thence to a more universal signification. It had its roots in the divine image, and therefore was general in its application from the very first; and it was not till God in the character of Jehovah chose Abraham and his seed to be the vehicles of salvation, and left the heathen nations to go their own way, that the expression received the specifically theocratic signification of \"son of Jehovah,\" to be again liberated and expanded into the more comprehensive idea of νἱοθεσία τοῦ Θεοῦ (i.e., Elohim, not τοῦ κυρίου  equals  Jehovah), at the coming of Christ, the Saviour of all nations. If in the olden time there were pious men who, like Enoch and Noah, walked with Elohim, or who, even if they did not stand in this close priestly relation to God, made the divine image a reality through their piety and fear of God, then there were sons (children) of God, for whom the only correct appellation was \"sons of Elohim,\" since sonship to Jehovah was introduced with the call of Israel, so that it could only have been proleptically that the children of God in the old world could be called \"sons of Jehovah.\" But if it be still argued, that in mere prose the term \"sons of God\" could not have been applied to children of God, or pious men, this would be equally applicable to \"sons of Jehovah.\" On the other hand, there is this objection to our applying it to angels, that the pious, who walked with God and called upon the name of the Lord, had been mentioned just before, whereas no allusion had been made to angels, not even to their creation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Again, the antithesis \"sons of God\" and \"daughters of men\" does not prove that the former were angels. It by no means follows, that because in Genesis 6:1 האדם denotes man as a genus, i.e., the whole human race, it must do the same in Genesis 6:2, where the expression \"daughters of men\" is determined by the antithesis \"sons of God.\" And with reasons existing for understanding by the sons of God and the daughters of men two species of the genus האדם, mentioned in Genesis 6:1, no valid objection can be offered to the restriction of האדם, through the antithesis Elohim, to all men with the exception of the sons of God; since this mode of expression is by no means unusual in Hebrew. \"From the expression 'daughters of men,\" as Dettinger observes, \"it by no means follows that the sons of God were not men; any more than it follows from Jeremiah 32:20, where it is said that God had done miracles 'in Israel, and among men,' or from Isaiah 43:4, where God says He will give men for the Israelites, or from Judges 16:7, where Samson says, that if he is bound with seven green withs he shall be as weak as a man, for from Psalm 73:5, where it is said of the ungodly they are not in trouble as men, that the Israelites, or Samson, or the ungodly, were not men at all. In all these passages אדם (men) denotes the remainder of mankind in distinction from those who are especially named.\" Cases occur, too, even in simple prose, in which the same term is used, first in a general, and then directly afterwards in a more restricted sense. We need cite only one, which occurs in Judg. In Judges 19:30 reference is made to the coming of the children of Israel (i.e., of the twelve tribes) out of Egypt; and directly afterwards (Judges 20:1-2) it is related that \"all the children of Israel,\" \"all the tribes of Israel,\" assembled together (to make war, as we learn from Judges 20:3., upon Benjamin); and in the whole account of the war, Judges 20 and 21, the tribes of Israel are distinguished from the tribe of Benjamin: so that the expression \"tribes of Israel\" really means the rest of the tribes with the exception of Benjamin. And yet the Benjamites were Israelites. Why then should the fact that the sons of God are distinguished from the daughters of men prove that the former could not be men? There is not force enough in these two objections to compel us to adopt the conclusion that the sons of God were angels.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Again, the antithesis \"sons of God\" and \"daughters of men\" does not prove that the former were angels. It by no means follows, that because in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " האדם denotes man as a genus, i.e., the whole human race, it must do the same in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the expression \"daughters of men\" is determined by the antithesis \"sons of God.\" And with reasons existing for understanding by the sons of God and the daughters of men two species of the genus האדם, mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", no valid objection can be offered to the restriction of האדם, through the antithesis Elohim, to all men with the exception of the sons of God; since this mode of expression is by no means unusual in Hebrew. \"From the expression 'daughters of men,\" as Dettinger observes, \"it by no means follows that the sons of God were not men; any more than it follows from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is said that God had done miracles 'in Israel, and among men,' or from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where God says He will give men for the Israelites, or from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 16:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where Samson says, that if he is bound with seven green withs he shall be as weak as a man, for from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is said of the ungodly they are not in trouble as men, that the Israelites, or Samson, or the ungodly, were not men at all. In all these passages אדם (men) denotes the remainder of mankind in distinction from those who are especially named.\" Cases occur, too, even in simple prose, in which the same term is used, first in a general, and then directly afterwards in a more restricted sense. We need cite only one, which occurs in Judg. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 19:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " reference is made to the coming of the children of Israel (i.e., of the twelve tribes) out of Egypt; and directly afterwards (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 20:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") it is related that \"all the children of Israel,\" \"all the tribes of Israel,\" assembled together (to make war, as we learn from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., upon Benjamin); and in the whole account of the war, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 21, the tribes of Israel are distinguished from the tribe of Benjamin: so that the expression \"tribes of Israel\" really means the rest of the tribes with the exception of Benjamin. And yet the Benjamites were Israelites. Why then should the fact that the sons of God are distinguished from the daughters of men prove that the former could not be men? There is not force enough in these two objections to compel us to adopt the conclusion that the sons of God were angels.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The question whether the \"sons of Elohim\" were celestial or terrestrial sons of God (angels or pious men of the family of Seth) can only be determined from the context, and from the substance of the passage itself, that is to say, from what is related respecting the conduct of the sons of God and its results. That the connection does not favour the idea of their being angels, is acknowledged even by those who adopt this view. \"It cannot be denied,\" says Delitzsch, \"that the connection of Genesis 6:1-8 with Genesis 4 necessitates the assumption, that such intermarriages (of the Sethite and Cainite families) did take place about the time of the flood (cf. Matthew 24:38; Luke 17:27); and the prohibition of mixed marriages under the law (Exodus 34:16; cf. Genesis 27:46; Genesis 28:1.) also favours the same idea.\" But this \"assumption\" is placed beyond all doubt, by what is here related of the sons of God. In Genesis 6:2 it is stated that \"the sons of God saw the daughters of men, that they were fair; and they took them wives of all which they chose,\" i.e., of any with whose beauty they were charmed; and these wives bare children to them (Genesis 6:4). Now אשּׁה לקח (to take a wife) is a standing expression throughout the whole of the Old Testament for the marriage relation established by God at the creation, and is never applied to πορνεία, or the simple act of physical connection. This is quite sufficient of itself to exclude any reference to angels. For Christ Himself distinctly states that the angels cannot marry (Matthew 22:30; Mark 12:25; cf. Luke 20:34.). And when Kurtz endeavours to weaken the force of these words of Christ, by arguing that they do not prove that it is impossible for angels so to fall from their original holiness as to sink into an unnatural state; this phrase has no meaning, unless by conclusive analogies, or the clear testimony of Scripture,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The question whether the \"sons of Elohim\" were celestial or terrestrial sons of God (angels or pious men of the family of Seth) can only be determined from the context, and from the substance of the passage itself, that is to say, from what is related respecting the conduct of the sons of God and its results. That the connection does not favour the idea of their being angels, is acknowledged even by those who adopt this view. \"It cannot be denied,\" says Delitzsch, \"that the connection of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:1-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " necessitates the assumption, that such intermarriages (of the Sethite and Cainite families) did take place about the time of the flood (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 17:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the prohibition of mixed marriages under the law (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:46",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) also favours the same idea.\" But this \"assumption\" is placed beyond all doubt, by what is here related of the sons of God. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is stated that \"the sons of God saw the daughters of men, that they were fair; and they took them wives of all which they chose,\" i.e., of any with whose beauty they were charmed; and these wives bare children to them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Now אשּׁה לקח (to take a wife) is a standing expression throughout the whole of the Old Testament for the marriage relation established by God at the creation, and is never applied to πορνεία, or the simple act of physical connection. This is quite sufficient of itself to exclude any reference to angels. For Christ Himself distinctly states that the angels cannot marry (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 22:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 12:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 20:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). And when Kurtz endeavours to weaken the force of these words of Christ, by arguing that they do not prove that it is impossible for angels so to fall from their original holiness as to sink into an unnatural state; this phrase has no meaning, unless by conclusive analogies, or the clear testimony of Scripture,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: We cannot admit that there is any force in Hoffmann's argument in his Schriftbeweis 1, p. 426, that \"the begetting of children on the part of angels is not more irreconcilable with a nature that is not organized, like that of man, on the basis of sexual distinctions, than partaking of food is with a nature that is altogether spiritual; and yet food was eaten by the angels who visited Abraham.\" For, in the first place, the eating in this case was a miracle wrought through the condescending grace of the omnipotent God, and furnishes no standard for judging what angels can do by their own power in rebellion against God. And in the second place, there is a considerable difference between the act of eating on the part of the angels of God who appeared in human shape, and the taking of wives and begetting of children on the part of sinning angels. We are quite unable also to accept as historical testimony, the myths of the heathen respecting demigods, sons of gods, and the begetting of children on the part of their gods, or the fables of the book of Enoch (ch. 6ff.) about the 200 angels, with their leaders, who lusted after the beautiful and delicate daughters of men, and who came down from heaven and took to themselves wives, with whom they begat giants of 3000 (or according to one MS 300) cubits in height.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor do 2 Peter 2:4 and Jde 1:6 furnish any evidence of angel marriages. Peter is merely speaking of sinning angels in general (ἀγγέλων ἁμαρτησάντων) whom God did not spare, and not of any particular sin on the part of a small number of angels; and Jude describes these angels as τοὺς μὴ τηρήσαντας τὴν ἑαυτῶν ἀρχήν ἀλλὰ ἀπολιπόντας τὸ ἴδιον οἰκητήριον, those who kept not their princedom, their position as rulers, but left their own habitation. There is nothing here about marriages with the daughters of men or the begetting of children, even if we refer the word τούτοις in the clause τὸν ὅμοιον τούτοις τρόπον ἐκπορνεύσασαι in Jde 1:7 to the angels mentioned in Jde 1:6; for ἐκπορνεύειν, the commission of fornication, would be altogether different from marriage, that is to say, from a conjugal bond that was permanent even though unnatural. But it is neither certain nor probable that this is the connection of τούτοις. Huther, the latest commentator upon this Epistle, who gives the preference to this explanation of τούτοις, and therefore cannot be accused of being biassed by doctrinal prejudices, says distinctly in the 2nd Ed. of his commentary, \"τούτοις may be grammatically construed as referring to Sodom and Gomorrah, or per synesin to the inhabitants of these cities; but in that case the sin of Sodom and Gomorrah would only be mentioned indirectly.\" There is nothing in the rules of syntax, therefore, to prevent our connecting the word with Sodom and Gomorrah; and it is not a fact, that \"grammaticae et logicae praecepta compel us to refer this word to the angels,\" as G. v. Zeschwitz says. But the very same reason which Huther assigns for not connecting it with Sodom and Gomorrah, may be also assigned for not connecting it with the angels, namely, that in that case the sin of the angels would only be mentioned indirectly. We regard Philippi's explanation (in his Glaubenslehre iii. p. 303) as a possible one, viz., that the word τούτοις refers back to the ἄνθρωποι ἀσελγεῖς mentioned in Jde 1:4, and as by no means set aside by De Wette's objection, that the thought of Jde 1:8 would be anticipated in that case; for this objection is fully met by the circumstance, that not only does the word οὗτοι, which is repeated five times from Jde 1:8 onwards, refer back to these men, but even the word τούτοις in Jde 1:14 also. On the other hand, the reference of τούτοις to the angels is altogether precluded by the clause καὶ ἀπελθοῦσαι ὀπίσω σαρκὸς ἑτέρας, which follows the word ἐκπορνεύσασαι. For fornication on the part of the angels could only consist in their going after flesh, or, as Hoffmann expresses it, \"having to do with flesh, for which they were not created,\" but not in their going after other, or foreign flesh. There would be no sense in the word ἑτέρας unless those who were ἐκπορνεύσαντες were themselves possessed of σάρξ; so that this is the only alternative, either we must attribute to the angels a σάρξ or fleshly body, or the idea of referring τούτοις to the angels must be given up. When Kurtz replies to this by saying that \"to angels human bodies are quite as much a ἑτέρα σάρξ, i.e., a means of sensual gratification opposed to their nature and calling, as man can be to human man,\" he hides the difficulty, but does not remove it, by the ambiguous expression \"opposed to their nature and calling.\" The ἑτέρα σάρξ must necessarily presuppose an ἰδία σάρξ.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nor do ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and Jde 1:6 furnish any evidence of angel marriages. Peter is merely speaking of sinning angels in general (ἀγγέλων ἁμαρτησάντων) whom God did not spare, and not of any particular sin on the part of a small number of angels; and Jude describes these angels as τοὺς μὴ τηρήσαντας τὴν ἑαυτῶν ἀρχήν ἀλλὰ ἀπολιπόντας τὸ ἴδιον οἰκητήριον, those who kept not their princedom, their position as rulers, but left their own habitation. There is nothing here about marriages with the daughters of men or the begetting of children, even if we refer the word τούτοις in the clause τὸν ὅμοιον τούτοις τρόπον ἐκπορνεύσασαι in Jde 1:7 to the angels mentioned in Jde 1:6; for ἐκπορνεύειν, the commission of fornication, would be altogether different from marriage, that is to say, from a conjugal bond that was permanent even though unnatural. But it is neither certain nor probable that this is the connection of τούτοις. Huther, the latest commentator upon this Epistle, who gives the preference to this explanation of τούτοις, and therefore cannot be accused of being biassed by doctrinal prejudices, says distinctly in the 2nd Ed. of his commentary, \"τούτοις may be grammatically construed as referring to Sodom and Gomorrah, or per synesin to the inhabitants of these cities; but in that case the sin of Sodom and Gomorrah would only be mentioned indirectly.\" There is nothing in the rules of syntax, therefore, to prevent our connecting the word with Sodom and Gomorrah; and it is not a fact, that \"grammaticae et logicae praecepta compel us to refer this word to the angels,\" as G. v. Zeschwitz says. But the very same reason which Huther assigns for not connecting it with Sodom and Gomorrah, may be also assigned for not connecting it with the angels, namely, that in that case the sin of the angels would only be mentioned indirectly. We regard Philippi's explanation (in his Glaubenslehre iii. p. 303) as a possible one, viz., that the word τούτοις refers back to the ἄνθρωποι ἀσελγεῖς mentioned in Jde 1:4, and as by no means set aside by De Wette's objection, that the thought of Jde 1:8 would be anticipated in that case; for this objection is fully met by the circumstance, that not only does the word οὗτοι, which is repeated five times from Jde 1:8 onwards, refer back to these men, but even the word τούτοις in Jde 1:14 also. On the other hand, the reference of τούτοις to the angels is altogether precluded by the clause καὶ ἀπελθοῦσαι ὀπίσω σαρκὸς ἑτέρας, which follows the word ἐκπορνεύσασαι. For fornication on the part of the angels could only consist in their going after flesh, or, as Hoffmann expresses it, \"having to do with flesh, for which they were not created,\" but not in their going after other, or foreign flesh. There would be no sense in the word ἑτέρας unless those who were ἐκπορνεύσαντες were themselves possessed of σάρξ; so that this is the only alternative, either we must attribute to the angels a σάρξ or fleshly body, or the idea of referring τούτοις to the angels must be given up. When Kurtz replies to this by saying that \"to angels human bodies are quite as much a ἑτέρα σάρξ, i.e., a means of sensual gratification opposed to their nature and calling, as man can be to human man,\" he hides the difficulty, but does not remove it, by the ambiguous expression \"opposed to their nature and calling.\" The ἑτέρα σάρξ must necessarily presuppose an ἰδία σάρξ.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But it is thought by some, that even if τούτοις in Jde 1:7 do not refer to the angels in Jde 1:6, the words of Jude agree so thoroughly with the tradition of the book of Enoch respecting the fall of the angels, that we must admit the allusion to the Enoch legend, and so indirectly to Genesis 6, since Jude could not have expressed himself more clearly to persons who possessed the book of Enoch, or were acquainted with the tradition it contained. Now this conclusion would certainly be irresistible, if the only sin of the angels mentioned in the book of Enoch, as that for which they were kept in chains of darkness still the judgment-day, had been their intercourse with human wives. For the fact that Jude was acquainted with the legend of Enoch, and took for granted that the readers of his Epistle were so too, is evident from his introducing a prediction of Enoch in Jde 1:14, Jde 1:15, which is to be found in ch. i. 9 of Dillmann's edition of the book of Enoch. But it is admitted by all critical writers upon this book, that in the book of Enoch which has been edited by Dillmann, and is only to be found in an Ethiopic version, there are contradictory legends concerning the fall and judgment of the angels; that the book itself is composed of earlier and later materials; and that those very sections (ch. 6-16:106, etc.) in which the legend of the angel marriages is given without ambiguity, belong to the so-called book of Noah, i.e., to a later portion of the Enoch legend, which is opposed in many passages to the earlier legend. The fall of the angels is certainly often referred to in the earlier portions of the work; but among all the passages adduced by Dillmann in proof of this, there is only one (19:1) which mentions the angels who had taken wives. In the others, the only thing mentioned as the sin of the angels or of the hosts of Azazel, is the fact that they were subject to Satan, and seduced those who dwelt on the earth (54:3-6), or that they came down from heaven to earth, and revealed to the children of men what was hidden from them, and then led them astray to the commission of sin (64:2). There is nothing at all here about their taking wives. Moreover, in the earlier portions of the book, besides the fall of the angels, there is frequent reference made to a fall, i.e., an act of sin, on the part of the stars of heaven and the army of heaven, which transgressed the commandment of God before they rose, by not appearing at their appointed time (vid., 18:14-15; 21:3; 90:21, 24, etc.); and their punishment and place of punishment are described, in just the same manner as in the case of the wicked angels, as a prison, a lofty and horrible place in which the seven stars of heaven lie bound like great mountains and flaming with fire (21:2-3), as an abyss, narrow and deep, dreadful and dark, in which the star which fell first from heaven is lying, bound hand and foot (88:1, cf. 90:24). From these passages it is quite evident, that the legend concerning the fall of the angels and stars sprang out of Isaiah 24:21-22 (\"And it shall come to pass in that day, that the Lord shall visit the host of the height [המּרום צבא, the host of heaven, by which stars and angels are to be understood on high i.e., the spiritual powers of the heavens] and the kings of the earth upon the earth, and they shall be gathered together, bound in the dungeon, and shut up in prison, and after many days they shall be punished\"), along with Isaiah 14:12 (\"How art thou fallen from heaven, thou beautiful morning star!\"), and that the account of the sons of God in Genesis 6, as interpreted by those who refer it to the angels, was afterwards combined and amalgamated with it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But it is thought by some, that even if τούτοις in Jde 1:7 do not refer to the angels in Jde 1:6, the words of Jude agree so thoroughly with the tradition of the book of Enoch respecting the fall of the angels, that we must admit the allusion to the Enoch legend, and so indirectly to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", since Jude could not have expressed himself more clearly to persons who possessed the book of Enoch, or were acquainted with the tradition it contained. Now this conclusion would certainly be irresistible, if the only sin of the angels mentioned in the book of Enoch, as that for which they were kept in chains of darkness still the judgment-day, had been their intercourse with human wives. For the fact that Jude was acquainted with the legend of Enoch, and took for granted that the readers of his Epistle were so too, is evident from his introducing a prediction of Enoch in Jde 1:14, Jde 1:15, which is to be found in ch. i. 9 of Dillmann's edition of the book of Enoch. But it is admitted by all critical writers upon this book, that in the book of Enoch which has been edited by Dillmann, and is only to be found in an Ethiopic version, there are contradictory legends concerning the fall and judgment of the angels; that the book itself is composed of earlier and later materials; and that those very sections (ch. 6-16:106, etc.) in which the legend of the angel marriages is given without ambiguity, belong to the so-called book of Noah, i.e., to a later portion of the Enoch legend, which is opposed in many passages to the earlier legend. The fall of the angels is certainly often referred to in the earlier portions of the work; but among all the passages adduced by Dillmann in proof of this, there is only one (19:1) which mentions the angels who had taken wives. In the others, the only thing mentioned as the sin of the angels or of the hosts of Azazel, is the fact that they were subject to Satan, and seduced those who dwelt on the earth (54:3-6), or that they came down from heaven to earth, and revealed to the children of men what was hidden from them, and then led them astray to the commission of sin (64:2). There is nothing at all here about their taking wives. Moreover, in the earlier portions of the book, besides the fall of the angels, there is frequent reference made to a fall, i.e., an act of sin, on the part of the stars of heaven and the army of heaven, which transgressed the commandment of God before they rose, by not appearing at their appointed time (vid., 18:14-15; 21:3; 90:21, 24, etc.); and their punishment and place of punishment are described, in just the same manner as in the case of the wicked angels, as a prison, a lofty and horrible place in which the seven stars of heaven lie bound like great mountains and flaming with fire (21:2-3), as an abyss, narrow and deep, dreadful and dark, in which the star which fell first from heaven is lying, bound hand and foot (88:1, cf. 90:24). From these passages it is quite evident, that the legend concerning the fall of the angels and stars sprang out of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 24:21-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (\"And it shall come to pass in that day, that the Lord shall visit the host of the height [המּרום צבא, the host of heaven, by which stars and angels are to be understood on high i.e., the spiritual powers of the heavens] and the kings of the earth upon the earth, and they shall be gathered together, bound in the dungeon, and shut up in prison, and after many days they shall be punished\"), along with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 14:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (\"How art thou fallen from heaven, thou beautiful morning star!\"), and that the account of the sons of God in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as interpreted by those who refer it to the angels, was afterwards combined and amalgamated with it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Now if these different legends, describing the judgment upon the stars that fell from heaven, and the angels that followed Satan in seducing man, in just the same manner as the judgment upon the angels who begot giants from women, were in circulation at the time when the Epistle of Jude was written; we must not interpret the sin of the angels, referred to by Peter and Jude, in a one-sided manner, and arbitrarily connect it with only such passages of the book of Enoch as speak of angel marriages, to the entire disregard of all the other passages, which mention totally different sins as committed by the angels, that are punished with bands of darkness; but we must interpret it from what Jude himself has said concerning this sin, as Peter gives no further explanation of what he means by ἁμαρτῆσαι. Now the only sins that Jude mentions are μὴ τηρῆσαι τὴν ἑαυτῶν ἀρχήν and ἀπολιπεῖν τὸ ἴδιον οἰκητήριον. The two are closely connected. Through not keeping the ἀρχή (i.e., the position as rulers in heaven) which belonged to them, and was assigned them at their creation, the angels left \"their own habitation\" (ἴδιον οἰκητήριον); just as man, when he broke the commandment of God and failed to keep his position as ruler on earth, also lost \"his own habitation\" (ἴδιον οἰκητήριον), that is to say, not paradise alone, but the holy body of innocence also, so that he needed a covering for his nakedness, and will continue to need it, until we are \"clothed upon with our hose which is from heaven\" (οἰκητήριον ἡμῶν ἐξ οὐρανοῦ). In this description of the angels' sin, there is not the slightest allusion to their leaving heaven to woo the beautiful daughters of men. The words may be very well interpreted, as they were by the earlier Christian theologians, as relating to the fall of Satan and his angels, to whom all that is said concerning their punishment fully applies. If Jude had had the πορνεία of the angels, mentioned in the Enoch legends, in his mind, he would have stated this distinctly, just as he does in v. 9 in the case of the legend concerning Michael and the devil, and in v. 11 in that of Enoch's prophecy. There was all the more reason for his doing this, because not only to contradictory accounts of the sin of the angels occur in the Enoch legends, but a comparison of the parallels cited from the book of Enoch proves that he deviated from the Enoch legend in points of no little importance. Thus, for example, according to Enoch 54:3, \"iron chains of immense weight\" are prepared for the hosts of Azazel, to put them into the lowest hell, and cast them on that great day into the furnace with flaming fire. Now Jude and Peter say nothing about iron chains, and merely mention \"everlasting chains under darkness\" and \"chains of darkness.\" Again, according to Enoch 10:12, the angel sinners are \"bound fast under the earth for seventy generations, till the day of judgment and their completion, till the last judgment shall be held for all eternity.\" Peter and Jude make no allusion to this point of time, and the supporters of the angel marriages, therefore, have thought well to leave it out when quoting this parallel to Jde 1:6. Under these circumstances, the silence of the apostles as to either marriages or fornication on the part of the sinful angels, is a sure sign that they gave no credence to these fables of a Jewish gnosticizing tradition.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it can be proved that the angels either possess by nature a material corporeality adequate to the contraction of a human marriage, or that by rebellion against their Creator they can acquire it, or that there are some creatures in heaven and on earth which, through sinful degeneracy, or by sinking into an unnatural state, can become possessed of the power, which they have not by nature, of generating and propagating their species. As man could indeed destroy by sin the nature which he had received from his Creator, but could not by his own power restore it when destroyed, to say nothing of implanting an organ or a power that was wanting before; so we cannot believe that angels, through apostasy from God, could acquire sexual power of which they had previously been destitute.",
        "children": []
      }
    ]
  }
]