[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And shall go out to deceive the nations.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Perhaps better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall come out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the earth is the view-point. The nations deceived and led astray are designated as Gog and Magog. The names are derived from Ezekiel (Ezekiel 38, 39). In rabbinical books the names were used to describe the nations who would rise against the reign of the Messiah. The names are to be understood figuratively. No particular nation could be well spoken of as “the nations in the four corners of the earth.” The origin of the figure is not difficult. In Ezekiel, Gog is called the chief prince of Meshech and Tubal; or, adopting another rendering, the prince of Rosh, Meshech, and Tubal. Magog is mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as one of the sons of Japheth. The name is there associated with Gomer, Madai, and Meshech. Gomer is thought to correspond with the Cimmerians, Madai with the Medes, and Meshech with the Muscovites. Mr. Smith, in his history of Assurbanipal from cuneiform inscriptions, thinks that a certain chief of the Saka (Scythians), named Gaagi, is the same as Gog. The sons of this Gaagi are mentioned in connection with Birighudri, a chief of Madai (Medes). Josephus also identifies Magog with the Scythians. The remembrance of the Scythian invasion lingered long in the minds of Asiatic nations; and the names of those northern nations were adopted as representative of the great and undefined enemies who would in after ages assail the Messiah’s kingdom, or wage unprovoked war against the true Israel of God. Ezekiel’s language in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seems to imply as much. The Evangelist here accepts the names employed by the earlier prophet. Gog and Magog stand for the great hosts of the nations, and their leaders, who would break forth into uncalled-for hostility against the people of the Lord. It must be remembered that the imagery is derived from the history of Israel. Jerusalem, the beloved city of the true Israel of God, looks out upon her foes. They are Babylon, Egypt, or they may come from the far northern regions, the abode of Gog and Magog, whence the wild and relentless invaders had poured upon the land. Gog and Magog are thus used as typical names. Under the auspices of such, the great gathering of turbulent and reckless enemies of the faith would take place. The hosts of the foes of Jerusalem are described as innumerable as the sand of the sea. This great concourse of countless hosts is moved by hostility to the faith of Christ. The nations, thus multitudinous, have been restrained during the millennial reign. Evil and unbelief have been held in check, but they have not been extinguished. The millennial reign is clearly, therefore, not a period in which the rule of Christ is universally and sincerely accepted. There are powers at work which compete for human affections and interests; but the general acceptance of Christian principles keeps the evil forces in abeyance, and the gracious strength of God limits the power of the archenemy. But when the restraints are removed, the long-suppressed evil breaks forth, and the reluctantly submissive nations are gathered together to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the war",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—not to battle, as in our version, but to the war—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to the war which has been before spoken of in Revelation 16, 19. All the restraints which Christ and Christian teaching had supplied to the world are gradually removed. The Euphrates is dried, the Devil is loosed, the unclean spirits have gone forth, the last phase of the long war between good and evil, between Christ and Belial, has been entered.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:7-10 While this world lasts, Satan's power in it will not be wholly destroyed, though it may be limited and lessened. No sooner is Satan let loose, than he again begins deceiving the nations, and stirring them up to make war with the saints and servants of God. It would be well if the servants and ministers of Christ were as active and persevering in doing good, as his enemies in doing mischief. God will fight this last and decisive battle for his people, that the victory may be complete, and the glory be to himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And shall go out to deceive the nations - See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning here is, that he would again, for a time, act in his true character, and in some way delude the nations once more. In what way this would be done is not stated. It would be, however, clearly an appeal to the wicked passions of mankind, exciting a hope that they might yet overthrow the kingdom of God on the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which are in the four quarters of the earth - Literally, corners of the earth, as if the earth were one extended square plain. The earth is usually spoken of as divided into four parts or quarters - the eastern, the western, the northern, and the southern. It is implied here that the deception or apostasy referred to would not be confined to one spot or portion of the world, but would extend afar. The idea seems to be, that during that period, though there would be a \"general\" prevalence of the gospel, and a \"general\" diffusion of its blessings, yet that the earth would not be entirely under its influence, and especially that the native character of the human heart would not be changed. Man, under powerful temptations, would be liable to be deluded by the great master spirit that has so often corrupted the race. Once more he would be permitted to make the trial, and then his power would forever come to an end.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gog and Magog - The name \"Gog\" occurs as the name of a prince in Ezekiel 38:2-3, Ezekiel 38:16, Ezekiel 38:18; Ezekiel 39:1, Ezekiel 39:11. \"He is an invader of the land of Israel, the chief prince of Meshech and Tubal,\" Ezekiel 38:2. \"Magog\" is also mentioned in Ezekiel 38:2, \"the land of Magog\"; and in Ezekiel 39:6, \"I will send a fire on Magog.\" As the terms are used in the Old Testament, the representation would seem to be that \"Gog\" was the king of a people called \"Magog.\" The signification of the names is unknown, and consequently nothing can be determined about the meaning of this passage from that source. Nor is there much known about the \"people\" who are referred to by Ezekiel. His representation would seem to be, that a great and powerful people, dwelling in the extreme recesses of the north Ezekiel 38:15; Ezekiel 39:2, would invade the Holy Land after the return from the exile, Ezekiel 38:8-12. It is commonly supposed that they were Scythians, residing between the Caspian and Euxine Seas, or in the region of Mount Caucasus. Thus Josephus (Ant Ezekiel 1:6, Ezekiel 1:3) has dropped the Hebrew word Magog, and rendered it by Σκύθαι  Skuthai - \"Scythians\"; and so does Jerome. Suidas renders it Persai - Persians; but this does not materially vary the view, since the word \"Scythians,\" among the ancient writers, is a collective word, to denote all the northeastern, unknown, barbarous tribes.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Gog and Magog - The name \"Gog\" occurs as the name of a prince in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"He is an invader of the land of Israel, the chief prince of Meshech and Tubal,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Magog\" is also mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"the land of Magog\"; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"I will send a fire on Magog.\" As the terms are used in the Old Testament, the representation would seem to be that \"Gog\" was the king of a people called \"Magog.\" The signification of the names is unknown, and consequently nothing can be determined about the meaning of this passage from that source. Nor is there much known about the \"people\" who are referred to by Ezekiel. His representation would seem to be, that a great and powerful people, dwelling in the extreme recesses of the north ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 39:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", would invade the Holy Land after the return from the exile, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:8-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is commonly supposed that they were Scythians, residing between the Caspian and Euxine Seas, or in the region of Mount Caucasus. Thus Josephus (Ant ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") has dropped the Hebrew word Magog, and rendered it by Σκύθαι  Skuthai - \"Scythians\"; and so does Jerome. Suidas renders it Persai - Persians; but this does not materially vary the view, since the word \"Scythians,\" among the ancient writers, is a collective word, to denote all the northeastern, unknown, barbarous tribes.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Among the Hebrews, the name \"Magog\" also would seem to denote all the unknown barbarous tribes about the Caucasian mountains. The fact that the names Gog and Magog are, in Ezekiel, associated with Meshech and Tubal, seems to determine the locality of these people, for those two countries lie between the Euxine and Caspian Seas, or at the southeast extremity of the Euxine Sea (Rosenmuller, Bib. Geog. vol. 1, p. 240). The people of that region were, it seems, a terror to Middle Asia, in the same manner as the Scythians were to the Greeks and Romans. Intercourse with such distant and savage nations was scarcely possible in ancient times; and hence, from their numbers and strength, they were regarded with great terror, just as the Scythians were regarded by the ancient Greeks and Romans, and as the Tartars were in the middle ages. In this manner they became an appropriate symbol of rude and savage people; of enemies fierce and warlike; of foes to be dreaded; and as such they were referred to by both Ezekiel and John. It has been made a question whether Ezekiel and John do not refer to the same period, but it is not necessary to consider that question here.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All that is needful to be understood is, that John means to say that at the time referred to there would be formidable enemies of the church who might be compared with the dreaded dwellers in the land of Magog; or, that after this long period of millennial tranquility and peace, there would be a state of things which might be properly compared with the invasion of the Holy Land by the dreaded barbarians of Magog or Scythia. It is not necessary to suppose that any particular \"country\" is referred to, or that there would be any one portion of the earth which the gospel would not reach, and which would be still barbarous, pagan, and savage; all that is necessary to be supposed is, that though religion would generally prevail, human nature would remain essentially corrupt and unchanged; and that, therefore, from causes which are not stated, there might yet be a fearful apostasy, and a somewhat general prevalence of iniquity. This would be nothing more than has occurred after the most favored times in the church, and nothing more than human nature would exhibit at any time, if all restraints were withdrawn, and people were suffered to act out their native feelings. \"Why\" this will be permitted; what causes will bring it about; what subordinate agencies will be employed, is not said, and conjecture would be vain. The reader who wishes more information in regard to Gog and Magog may consult Prof. Stuart on this book, vol. 2, pp. 364-368, and the authorities there referred to. Compare especially Rosenmuller on Ezekiel 38:2. See also Sale's \"Koran,\" Pre. Dis. section 4, and the \"Koran\" itself, Sura 18:94 and 21:95.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All that is needful to be understood is, that John means to say that at the time referred to there would be formidable enemies of the church who might be compared with the dreaded dwellers in the land of Magog; or, that after this long period of millennial tranquility and peace, there would be a state of things which might be properly compared with the invasion of the Holy Land by the dreaded barbarians of Magog or Scythia. It is not necessary to suppose that any particular \"country\" is referred to, or that there would be any one portion of the earth which the gospel would not reach, and which would be still barbarous, pagan, and savage; all that is necessary to be supposed is, that though religion would generally prevail, human nature would remain essentially corrupt and unchanged; and that, therefore, from causes which are not stated, there might yet be a fearful apostasy, and a somewhat general prevalence of iniquity. This would be nothing more than has occurred after the most favored times in the church, and nothing more than human nature would exhibit at any time, if all restraints were withdrawn, and people were suffered to act out their native feelings. \"Why\" this will be permitted; what causes will bring it about; what subordinate agencies will be employed, is not said, and conjecture would be vain. The reader who wishes more information in regard to Gog and Magog may consult Prof. Stuart on this book, vol. 2, pp. 364-368, and the authorities there referred to. Compare especially Rosenmuller on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See also Sale's \"Koran,\" Pre. Dis. section 4, and the \"Koran\" itself, Sura 18:94 and 21:95.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To gather them together to battle - As if to assemble them for war; that is, a state of things would exist in regard to the kingdom of God and the prevalence of the true religion as if distant and barbarous nations should be aroused to make war on the church of God. The meaning is, that there would be an awakened hostility against the kingdom of Christ in the earth. See the notes on Revelation 16:14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To gather them together to battle - As if to assemble them for war; that is, a state of things would exist in regard to the kingdom of God and the prevalence of the true religion as if distant and barbarous nations should be aroused to make war on the church of God. The meaning is, that there would be an awakened hostility against the kingdom of Christ in the earth. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The number of whom is as the sand of the sea - A common comparison in the Scriptures to denote a great multitude, Genesis 22:17; Genesis 32:12; Genesis 41:49; 1 Samuel 13:5; 1 Kings 4:20, et al.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The number of whom is as the sand of the sea - A common comparison in the Scriptures to denote a great multitude, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 32:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 4:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", et al.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Section c. - Condition of things in the period referred to in Revelation 20:7-8;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Section c. - Condition of things in the period referred to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ";",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) This will occur \"at the close\" of the millennial period - the period of the thousand years. It is not said, indeed, that it would be \"immediately\" after that; but the statement is explicit that it will be \"after\" that, or \"when the thousand years are expired.\" There may be an interval before it shall be accomplished of an indefinite time; the alienation and corruption may be gradual; a considerable period may elapse before the apostasy shall assume an organized form, or, in the language of John, before the hosts shall \"be gathered to battle,\" but it is to be the \"next\" marked and prominent event in the history of the world, and is to precede the final consummation of all things.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) this will be a \"brief period.\" Compared with the long period of prosperity that preceded it, and \"perhaps\" compared with the long period that shall follow it before the final judgment, it will be short. Thus, in Revelation 20:3, it is said that Satan \"must be loosed a little season.\" See the notes on that verse. There is no way of determining the time with exactness; but we are assured that it will not be long.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) this will be a \"brief period.\" Compared with the long period of prosperity that preceded it, and \"perhaps\" compared with the long period that shall follow it before the final judgment, it will be short. Thus, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is said that Satan \"must be loosed a little season.\" See the notes on that verse. There is no way of determining the time with exactness; but we are assured that it will not be long.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) what will be the exact state of things then can be only a matter of conjecture. We may say, however, that it will not be:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) necessarily \"war.\" The language is figurative and symbolical, and it is not necessary to suppose that an actual and bloody warfare will be literally waged against the church. Nor,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) will there be a literal invasion of the land of Palestine as the residence of the saints and the capital of the Redeemer's visible empire, for there is not a hint of this - not a word to justify such an interpretation. Nor,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) is it necessary to suppose that there will be literally such nations as will be then called \"Gog and Magog,\" for this language is figurative, and designed to characterize the foes of the church - as being in some respects formidable and terrible as were those ancient nations.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. Gog and Magog—(Eze 38:1-39:29; see on [2742]Eze 38:2). Magog is a general name for northern nations of Japheth's posterity, whose ideal head is Gog (Ge 10:2). A has but one Greek article to \"Gog and Magog,\" whereby the two, namely, the prince and the people, are marked as having the closest connection. B reads the second article before Magog wrongly. Hiller [Onomasticon] explains both words as signifying \"lofty,\" \"elevated.\" For \"quarters\" the Greek is \"corners.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to battle—Greek, \"to the war,\" in A and B. But Andreas omits \"the.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And shall go out to deceive the nations which are in the four quarters of the earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, the devil, being got from under the restraint of Divine Providence, shall fall upon his old work, going about to deceive men over all the world, either tempting them to idolatry, or heresy, or lewdness of life, or (which seemeth most probable) stirring them up to one attempt more to ruin the church. These people are called ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Gog and Magog, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " about the meaning of which there are various opinions. We read of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Magog, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 10:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; he was one of the sons of Japheth; see also ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Chronicles 1:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 1:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; he inhabited that country called Syria, and from thence, his posterity being multiplied, (as some think), transplanted some colonies into America. We read of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " no where in Scripture but in Ezekiel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 38:1-39:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:1-39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ":29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where both ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are mentioned as the great enemies of God’s ancient Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 38:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is named as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the chief prince of Meshech and Tubal.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There are disputes who are meant by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in those two chapters. The Jewish rabbies apply the terms to some nations whom the Messiah (expected by them) shall encounter and overcome; but if we consider that prophecy as made in Babylon, and to comfort the people in that captivity, we can hardly think the enemies there intended were to appear at such a distance of time as more than two thousand years, for so many, and more, are elapsed already since Ezekiel’s prophecy. The best interpreters therefore rather think, that Antiochus, and the race of Seleucus, (a king of Syria, who in those quarters of the world succeeded Alexander, of whom we read in the book of Maccabees), is there intended, whose ruin is there foretold, as being a great enemy to the Jews after their return from Babylon; yet some think, that in both these chapters Ezekiel prophesied of the same ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here intended, which should be the last enemies of the church. The papists, who (according to their interest) contend for antichrist as yet to come, make Gog and Magog here to signify some king or kings that shall join with antichrist when he appeareth. Others think that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in this place, signifies more generally, a colluvies, or mixed company of all wicked men, a very great multitude, who shall come from all parts, only typified by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Ezekiel, as being like them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. For number; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. In their design to ruin the church, upon its restoration to a more quiet, peaceable state; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. And who shall be ruined like them, by the more than ordinary providence of God; for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned in Ezekiel, are described in three texts of that prophecy as coming from the north, but these are described as coming from the four quarters of the world: this seemeth a much more probable opinion than theirs, who will have them some particular nations, whether Americans, Turks, or Indians. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The number of whom is as the sand of the sea:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these enemies shall make a vast number, therefore compared to the sand of the sea; and in this they hold a proportion also with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned in Ezekiel, who were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a great company, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ezekiel 38:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "many people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ezekiel 38:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "covering the land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Ezekiel 38:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And shall go out,.... Of his prison, the bottomless pit, and shall walk to and fro in the earth, and go about like a deceitful serpent, and roaring lion, as before: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to deceive the nations: as he had done before the thousand years began, and from which he was restrained during that time; he had before deceived the Pagan, Papal, and Mahometan nations, and now he will go forth to deceive those at this time ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which are in the four quarters of the earth; all the world over: the names of which nations are, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gog and Magog: not the same which are mentioned in Ezekiel 38:1 though there is an allusion to them, and from thence the names are taken, and some of the figures borrowed, and design the enemies of God's people, who will be in the world at this time; so the Jews (b) speak of a Gog and Magog, that will come up against Jerusalem in the days of the Messiah, whom they still expect, by whom they shall be destroyed: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Gog and Magog: not the same which are mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though there is an allusion to them, and from thence the names are taken, and some of the figures borrowed, and design the enemies of God's people, who will be in the world at this time; so the Jews (b) speak of a Gog and Magog, that will come up against Jerusalem in the days of the Messiah, whom they still expect, by whom they shall be destroyed: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "to gather them together to battle; not one against another, as some think, as the pope against the Turk, and the Turk against the pope, nor are they designed at all; nor \"to kill them\", as the Ethiopic version renders it; but against the saints and people of God, in the beloved city and camp; herein will lie his deception of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the number of whom is as the sand of the sea; that is, innumerable, in allusion to Gog and Magog in Ezekiel 38:9 but the great question is, who are meant by these?--Not the Papists, the nations made drunk with the wine of Rome's fornication, the Gentiles, by whom the holy city is trodden under foot, and who will be angry when the time of avenging the saints is come, Revelation 11:2 for these will be all destroyed, even all the remains of them, at the battle of Armageddon; nor is antichrist himself intended, who will be destroyed in the spiritual reign of Christ, with the breath of his mouth; and at the above decisive battle the beast and the false prophet will be taken alive, and cast into the lake of fire: nor are the Turks designed, the people of Magog being Scythians originally, as Josephus says (c), from whence the Turks sprung; or Tartarinns, for Paulus Venetus (d) says the countries of Gog and Magog are in Tartary, called Jug and Munjug; hence some think these are the same with the four angels bound at the river Euphrates, and loosed, whose armies are represented as exceeding numerous, Revelation 9:14 but though the Turkish dominions are very large, yet they do not extend to the four quarters of the world; and when the Turks were let loose, and came even into Europe, it was not against the true Christians, the camp of the saints, the beloved city, as here, but against the antichristian party; the Papists have suffered most by the incursions of the Turks, though it has not brought them to repentance; besides, the loosing of the four angels, or the Turkish nations, and their chiefs, is long before these thousand years begin; that is past already, under the sixth trumpet, whereas the seventh trumpet will be blown, and all the seven vials poured out, and the world cleared of all Christ's enemies, and after that a thousand years must run out, before this Gog and Magog army will appear: nor are the Americans the nations, here spoken of; for they are but in one quarter of the world; nor is there any reason to believe there will be there more enemies of Christ's people than in any other part, since in the spiritual reign of Christ the earth shall be full of his knowledge, and his spiritual kingdom will be to the ends of the earth: and as for that notion that those inhabiting the other hemisphere will be saved from the general conflagration, there is no reason to believe it, since the earth, and whatsoever is therein, shall be burnt up, 2 Peter 3:10. Some think that the wicked living in the distant parts of the world, in the corners of the earth, are meant, who, upon Christ's coming, will flee thither, and remain in continual dread and terror to the end of the thousand years, when Satan will gather them together, and spirit them up against the saints; but this cannot be, because they will all be destroyed at the universal conflagration of the world; nor will there be any in the new earth but righteous persons: but these will be all the wicked dead, the rest of the dead, who lived not again until the thousand years are ended, when will be the second resurrection, the resurrection of all the wicked that have been from the beginning of the world; and these, with the posse of devils under Satan, will make up the Gog and Magog army: all the characters agree with them; these may be called nations, or Gentiles, being aliens from the true Israel of God, the dogs that will be without the holy city; these may be said to be in \"the four quarters\" of the world, since where they die and are buried, there they will rise and stand upon their feet, an exceeding great army; and as they will die enemies to Christ and his people, they will rise such; as they will go down to hell with their \"weapons of war\", as is said of Meshech and Tubal, the people of Gog, Ezekiel 32:27 they will rise with the same; the grave, the dust of the earth, will make no change in their vile bodies, nor the flames of hell any alteration in the disposition of their minds; yea, as is said in the above place, they will \"lay their swords under their heads\", and so be in a readiness, when they rise, to make use of them against the saints, and to avenge themselves; for their envy, malice, and revenge, will be heightened and increased by their confinement and punishment in hell: nor need this be wondered at, since the devils, notwithstanding they have been so long expelled the realms of light, and have been in chains of darkness, and in expectation of everlasting torment, retain the same enmity as ever; and though the deception will be very great, to attack saints in an immortal state, who are like the angels that die not, nor will these die any more, and especially since Christ, the King of kings and Lord of lords, who rules the nations with a rod of iron, will be at the head of them; yet it need not seem strange, when they will rise as weak and feeble, and as little able to resist temptation, and as much exposed to seduction, as they were before; Satan will have as much power over them as ever; and what with their own numbers, and the posse of devils at the head of them, and especially considering the desperateness of their state, and that this is their last struggle and effort for liberty, they will animate themselves and one another to this strange undertaking. These now may be called Gog and Magog, as the one signifies \"covered\", the other open, or \"uncovered\": these being all the enemies of Christ and his people, both secret and open: and this sense well accounts for their number, being as the sand of the sea; and which the Arabic version seems to confirm, \"and Jagog and Magog shall rise with him\". The Jews have a notion that this deception of Satan will be at the day of judgment, which agrees with this account; for immediately upon this will follow the judgment of the wicked: they say (e), ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the number of whom is as the sand of the sea; that is, innumerable, in allusion to Gog and Magog in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but the great question is, who are meant by these?--Not the Papists, the nations made drunk with the wine of Rome's fornication, the Gentiles, by whom the holy city is trodden under foot, and who will be angry when the time of avenging the saints is come, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for these will be all destroyed, even all the remains of them, at the battle of Armageddon; nor is antichrist himself intended, who will be destroyed in the spiritual reign of Christ, with the breath of his mouth; and at the above decisive battle the beast and the false prophet will be taken alive, and cast into the lake of fire: nor are the Turks designed, the people of Magog being Scythians originally, as Josephus says (c), from whence the Turks sprung; or Tartarinns, for Paulus Venetus (d) says the countries of Gog and Magog are in Tartary, called Jug and Munjug; hence some think these are the same with the four angels bound at the river Euphrates, and loosed, whose armies are represented as exceeding numerous, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but though the Turkish dominions are very large, yet they do not extend to the four quarters of the world; and when the Turks were let loose, and came even into Europe, it was not against the true Christians, the camp of the saints, the beloved city, as here, but against the antichristian party; the Papists have suffered most by the incursions of the Turks, though it has not brought them to repentance; besides, the loosing of the four angels, or the Turkish nations, and their chiefs, is long before these thousand years begin; that is past already, under the sixth trumpet, whereas the seventh trumpet will be blown, and all the seven vials poured out, and the world cleared of all Christ's enemies, and after that a thousand years must run out, before this Gog and Magog army will appear: nor are the Americans the nations, here spoken of; for they are but in one quarter of the world; nor is there any reason to believe there will be there more enemies of Christ's people than in any other part, since in the spiritual reign of Christ the earth shall be full of his knowledge, and his spiritual kingdom will be to the ends of the earth: and as for that notion that those inhabiting the other hemisphere will be saved from the general conflagration, there is no reason to believe it, since the earth, and whatsoever is therein, shall be burnt up, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some think that the wicked living in the distant parts of the world, in the corners of the earth, are meant, who, upon Christ's coming, will flee thither, and remain in continual dread and terror to the end of the thousand years, when Satan will gather them together, and spirit them up against the saints; but this cannot be, because they will all be destroyed at the universal conflagration of the world; nor will there be any in the new earth but righteous persons: but these will be all the wicked dead, the rest of the dead, who lived not again until the thousand years are ended, when will be the second resurrection, the resurrection of all the wicked that have been from the beginning of the world; and these, with the posse of devils under Satan, will make up the Gog and Magog army: all the characters agree with them; these may be called nations, or Gentiles, being aliens from the true Israel of God, the dogs that will be without the holy city; these may be said to be in \"the four quarters\" of the world, since where they die and are buried, there they will rise and stand upon their feet, an exceeding great army; and as they will die enemies to Christ and his people, they will rise such; as they will go down to hell with their \"weapons of war\", as is said of Meshech and Tubal, the people of Gog, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 32:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they will rise with the same; the grave, the dust of the earth, will make no change in their vile bodies, nor the flames of hell any alteration in the disposition of their minds; yea, as is said in the above place, they will \"lay their swords under their heads\", and so be in a readiness, when they rise, to make use of them against the saints, and to avenge themselves; for their envy, malice, and revenge, will be heightened and increased by their confinement and punishment in hell: nor need this be wondered at, since the devils, notwithstanding they have been so long expelled the realms of light, and have been in chains of darkness, and in expectation of everlasting torment, retain the same enmity as ever; and though the deception will be very great, to attack saints in an immortal state, who are like the angels that die not, nor will these die any more, and especially since Christ, the King of kings and Lord of lords, who rules the nations with a rod of iron, will be at the head of them; yet it need not seem strange, when they will rise as weak and feeble, and as little able to resist temptation, and as much exposed to seduction, as they were before; Satan will have as much power over them as ever; and what with their own numbers, and the posse of devils at the head of them, and especially considering the desperateness of their state, and that this is their last struggle and effort for liberty, they will animate themselves and one another to this strange undertaking. These now may be called Gog and Magog, as the one signifies \"covered\", the other open, or \"uncovered\": these being all the enemies of Christ and his people, both secret and open: and this sense well accounts for their number, being as the sand of the sea; and which the Arabic version seems to confirm, \"and Jagog and Magog shall rise with him\". The Jews have a notion that this deception of Satan will be at the day of judgment, which agrees with this account; for immediately upon this will follow the judgment of the wicked: they say (e), ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"in the day that judgment shall be found in the world, and the holy blessed God shall sit upon the throne of Judgment, Satan  , \"shall deceive above and below\" (angels and men), and he shall be found to destroy the world, and to take away souls.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Targum in Cant. viii. 4. & Targum Hieros. in Numb. xi. 26. (c) Antiqu. l. 1. c. 6. sect. 1.((d) In Schindler. Lex. Pentaglott. col. 288. (e) Zohar. in Gen. fol. 73. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) Targum in Cant. viii. 4. & Targum Hieros. in Numb. xi. 26. (c) Antiqu. l. 1. c. 6. sect. 1.((d) In Schindler. Lex. Pentaglott. col. 288. (e) Zohar. in Gen. fol. 73. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{16} And shall go out to deceive the nations which are in the four quarters of the earth, Gog and Magog, to gather them together to battle: the number of whom is as the sand of the sea.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{16}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And shall go out to deceive the nations which are in the four quarters of the earth, Gog and Magog, to gather them together to battle: the number of whom ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the sand of the sea.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(16) The work or act of Satan (which is the first part, as I distinguished in the verse before) to deceive the whole world, even to the uttermost nations of it: to arm them against the people of God, in this verse and to besiege and oppress the Church, with his whole strength, in the verse following.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Satan’s return to encounter irretrievable defeat upon the scene of his former successes (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπʼ ἐσχάτου ἐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is an obscure and curious feature, borrowed in part from earlier beliefs in Judaism (Gog and the Parthians both from the dreaded N. E., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but directly or indirectly from a legend common to Persian and Hellenic eschatology: in the former the evil spirit has a preliminary and a final defeat, while in the latter the Titans emerge from Tartarus only to be conclusively worsted (Rohde, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psyche",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 410 f.). No explanation is given of how Satan gets free. In the Iranian eschatology (Brandt, 590 f.) the serpent breaks loose at the call of Angra Mainyô (God’s opponent), seduces a part of mankind and persecutes the rest, till he is overcome by the messiah, who then proceeds to raise the dead. But as John identifies the serpent with Satan, such a theory was plainly out of the question. At any rate, Satan wins adherents for this fresh attempt from those barbarian hordes who survived the downfall of the Roman empire (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:17-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). They are called “Gog and Magog,” after the traditional opponents who were to be defeated by the redeemed Israel of the latter days, according to the faith of Judaism (Ezekiel 38-39.). Jerusalem, the navel and centre of the earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as messiah’s residence, is besieged; but, like Gog of old, the invaders are consumed by the divine fire, whilst Satan is consigned for ever to the lake of fire, where he lies writhing among his worshippers, as a punishment for seducing men. This is at once a reminiscence of the Iranian eschatology (Hübschmann, 231), where the serpent is flung into molten metal as his final doom, in order to rid earth of his presence, and also a reflection of Enoch liv. (lxvii. 7) where the four angels grip the hosts of Azazel on the last day and “cast them into a burning furnace, that the Lord of Spirits may take vengeance on them for leading astray those who dwell on earth”.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the nations which are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] It almost seems as though the kingdom of Christ and of His Saints had not been world-wide, but had been, like the Roman empire of St John’s day, or the Christendom of our own, a wide but limited region of light in the midst of a barbarous world. It is not therefore certain that the coming of the kingdom must be postponed till Christianity has gained its victory over the compact mass of nations which, from China to Guinea, still hold out against it: and we ought to remember the possibility, that they may prove as dangerous to the fabric of modern civilisation as the barbarians of Scythia, Germany, and Arabia proved to the ancient. But it is possible that this prediction refers, not to an incursion from outlying heathens, but to an apostasy of outlying Christians. If so, this may be illustrated by the way that the remoter provinces of Christendom fell into heresy in the fifth and following centuries, and were, in great measure as a consequence, absorbed in Islam afterwards. We may also think of the many wild and unchristian sects rising in our own time in America and in Russia—the countries of Christendom remotest from its centres of intellectual life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "quarters",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "corners",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See Ezekiel 38, 39—a prophecy which ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for aught we know, have had some nearly contemporary fulfilment, but which the Jewish traditions interpret of a war in the days of the Messiah, nearly as here. Magog is given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the name of a son of Japhet, the eponymus, there is no doubt, of one of the nations lying near the Black Sea, and called by Europeans Scythian in the wide sense. Gog appears in Ezek. l.c. to be not a national name, but the name, whether personal or dynastic, of the king of Magog and the neighbouring or kindred tribes of Rosh, Meshech, and Tubal. The resemblance of two of these names to the modern ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Russia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Muscovy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is merely accidental: but it would be rash to deny the possibility, that the geographical or ethnological suggestion is to be taken literally, and that St John does foretell an invasion, something like that of the Huns, or Tartars, and falling on Christendom from the same quarter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to gather them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Nearly a repetition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 17:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Yet it can hardly describe the same event: it seems plain that, whatever be the meaning of the first resurrection and the thousand years’ reign, they intervene between that war and this. Moreover, the former war was on the part of the rulers of the civilised world, this on the part of the outer barbarians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὸν Γὼγ καὶ Μαγὼγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the son of Japhet, was the father of the northern nations towards the east. The prince of those nations is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Ezekiel ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in this passage. A prince and a people most hostile, perhaps less good than others, though themselves less wicked then than after the new ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πλάνη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The article ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[220] of itself shows the intimate connection between the prince and the people, as does the Paronomasia, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Both words signify ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lofty, Elevated",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as Hiller teaches in his Onomasticon. Therefore ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used as a proper name: but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the chief syllable, being left to it by Aphæresis, seems by Antonomasia to hold the place of a proper name, until that fierce leader of so many nations under Satan appears at length in his own name. Jerome on Ezekiel 38 would not have refused to take ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ros",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a proper name, if the name of such a nation (the Russians) had been known to him. Comp. Hist. Univ. vol. i. p. 257.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συναγαγεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to gather together",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is not said to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "deceive and gather together",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to deceive for the purpose of gathering together",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gathering together",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the end of the deceiving.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") In other places the Apocalypse regards the leader in preference to the forces, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but respecting the Gog prince it recounts nothing apart from Magog, which constitutes his forces, partly because enough had been said respecting him by Ezekiel, and partly because Gog makes an unsuccessful attempt, and in his overthrow is mingled with the crowd itself, as the kings are, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[220] Beng. and Lachm. rightly omit the second ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Μαγὼγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with A. The one article to both Gog and Magog marks their connection. Tisch., with B and Rec. Text, reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν Μαγώγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—E.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And shall go out to deceive the nations which are in the four quarters of the earth, Gog and Magog;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "four corners.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The signification of \"Gog and Magog\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide infra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") shows in what sense \"the nations\" is used. It is in the limited sense of the ungodly of the world, not in the wider sense in which the expression is used (without any qualifying clause) in ver. 3. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is mentioned among the sons of Japheth who were the ancestors of the northern nations (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Ezekiel 39:2). Hence the name ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Magog",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used to denote the northern tribes, whose invasion of Palestine and adjoining parts took place about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 630-600",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it seems that Gog was originally a leader among these tribes; and from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it seems that Ezekiel took these names to be symbolical of all the foes of the people of God. Jewish tradition makes use of these names to indicate those nations who were expected to war against Jerusalem in the last days, and to be overthrown by the Messiah. Hence the employment of the terms here by St. John as denoting the ungodly people of the world, amongst whom Satan still exercises his power, though that power is limited to these, and he is completely bound as regards true believers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To gather them together to battle: the number of whom is as the sand of the sea;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to the war",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the article points definitely to the war of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 19:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Revelation 16:14. It is a prolonged ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "war",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "battle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because lasting throughout life. The vastness of the hosts of Gog and Magog is alluded to in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:9, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is in conformity with our Lord's teaching: \"Many are called, but few are chosen\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. also Revelation 7:14). Revelation 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Gog and Magog",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See Ezekiel 38, 39. Compare Genesis 10:2. where Magog appears as a son of Japhet. Magog is a general name for the northern nations, and, according to Ezekiel, Gog is their prince. Josephus says that the descendants of Magog were the Scythians. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 39. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". where Magog appears as a son of Japhet. Magog is a general name for the northern nations, and, according to Ezekiel, Gog is their prince. Josephus says that the descendants of Magog were the Scythians. ",
            "children": []
          }
        ]
      }
    ]
  }
]