[{"num":12,"verse":"If I must glory (it is not expedient indeed), but I will come to visions and revelations of the Lord."},{"num":2,"verse":"I know a man in Christ above fourteen years ago (whether in the body, I know not, or out of the body, I know not; God knoweth), such a one caught up to the third heaven."},{"num":3,"verse":"And I know such a man (whether in the body, or out of the body, I know not: God knoweth),"},{"num":4,"verse":"That he was caught up into paradise, and heard secret words, which it is not granted to man to utter."},{"num":5,"verse":"For such an one I will glory; but for myself I will glory nothing, but in my infirmities."},{"num":6,"verse":"For though I should have a mind to glory, I shall not be foolish; for I will say the truth. But I forbear, lest any man should think of me above that which he seeth in me, or any thing he heareth from me."},{"num":7,"verse":"And lest the greatness of the revelations should exalt me, there was given me a sting of my flesh, an angel of Satan, to buffet me."},{"num":8,"verse":"For which thing thrice I besought the Lord, that it might depart from me."},{"num":9,"verse":"And he said to me: My grace is sufficient for thee; for power is made perfect in infirmity. Gladly therefore will I glory in my infirmities, that the power of Christ may dwell in me."},{"num":10,"verse":"For which cause I please myself in my infirmities, in reproaches, in necessities, in persecutions, in distresses, for Christ. For when I am weak, then am I powerful."},{"num":11,"verse":"I am become foolish: you have compelled me. For I ought to have been commended by you: for I have no way come short of them that are above measure apostles, although I be nothing."},{"num":12,"verse":"Yet the signs of my apostleship have been wrought on you, in all patience, in signs, and wonders, and mighty deeds."},{"num":13,"verse":"For what is there that you have had less than the other churches, but that I myself was not burthensome to you? Pardon me this injury."},{"num":14,"verse":"Behold now the third time I am ready to come to you; and I will not be burthensome unto you. For I seek not the things that are yours, but you. For neither ought the children to lay up for the parents, but the parents for the children."},{"num":15,"verse":"But I most gladly will spend and be spent myself for your souls; although loving you more, I be loved less."},{"num":16,"verse":"But be it so: I did not burthen you: but being crafty, I caught you by guile."},{"num":17,"verse":"Did I overreach you by any of them whom I sent to you?"},{"num":18,"verse":"I desired Titus, and I sent with him a brother. Did Titus overreach you? Did we not walk with the same spirit? did we not in the same steps?"},{"num":19,"verse":"Of old, think you that we excuse ourselves to you? We speak before God in Christ; but all things, my dearly beloved, for your edification."},{"num":20,"verse":"For I fear lest perhaps when I come I shall not find you such as I would, and that I shall be found by you such as you would not. Lest perhaps contentions, envyings, animosities, dissensions, detractions, whisperings, swellings, seditions, be among you."},{"num":21,"verse":"Lest again, when I come, God humble me among you: and I mourn many of them that sinned before, and have not done penance for the uncleanness, and fornication, and lasciviousness, that they have committed."}]