[{"num":12,"verse":"This boasting is all so foolish, but let me go on. Let me tell about the visions I’ve had, and revelations from the Lord."},{"num":2,"verse":"Fourteen years ago I was taken up to heaven* for a visit. Don’t ask me whether my body was there or just my spirit, for I don’t know; only God can answer that. But anyway, there I was in paradise, "},{"num":4,"verse":"and heard things so astounding that they are beyond a man’s power to describe or put in words (and anyway I am not allowed to tell them to others). "},{"num":5,"verse":"That experience is something worth bragging about, but I am not going to do it. I am going to boast only about how weak I am and how great God is to use such weakness for his glory. "},{"num":6,"verse":"I have plenty to boast about and would be no fool in doing it, but I don’t want anyone to think more highly of me than he should from what he can actually see in my life and my message."},{"num":7,"verse":"I will say this: because these experiences I had were so tremendous, God was afraid I might be puffed up by them; so I was given a physical condition which has been a thorn in my flesh, a messenger from Satan to hurt and bother me and prick my pride. "},{"num":8,"verse":"Three different times I begged God to make me well again."},{"num":9,"verse":"Each time he said, “No. But I am with you; that is all you need. My power shows up best in weak people.” Now I am glad to boast about how weak I am; I am glad to be a living demonstration of Christ’s power, instead of showing off my own power and abilities. "},{"num":10,"verse":"Since I know it is all for Christ’s good, I am quite happy about “the thorn,” and about insults and hardships, persecutions and difficulties; for when I am weak, then I am strong—the less I have, the more I depend on him."},{"num":11,"verse":"You have made me act like a fool—boasting like this—for you people ought to be writing about me and not making me write about myself. There isn’t a single thing these other marvelous fellows have that I don’t have too, even though I am really worth nothing at all. "},{"num":12,"verse":"When I was there I certainly gave you every proof that I was truly an apostle, sent to you by God himself, for I patiently did many wonders and signs and mighty works among you. "},{"num":13,"verse":"The only thing I didn’t do for you, which I do everywhere else in all other churches, was to become a burden to you—I didn’t ask you to give me food to eat and a place to stay. Please forgive me for this wrong!"},{"num":14,"verse":"Now I am coming to you again, the third time; and it is still not going to cost you anything, for I don’t want your money. I want you! And anyway, you are my children, and little children don’t pay for their father’s and mother’s food—it’s the other way around; parents supply food for their children. "},{"num":15,"verse":"I am glad to give you myself and all I have for your spiritual good, even though it seems that the more I love you, the less you love me."},{"num":16,"verse":"Some of you are saying, “It’s true that his visits didn’t seem to cost us anything, but he is a sneaky fellow, that Paul, and he fooled us. As sure as anything he must have made money from us some way.”"},{"num":17,"verse":"But how? Did any of the men I sent to you take advantage of you? "},{"num":18,"verse":"When I urged Titus to visit you and sent our other brother with him, did they make any profit? No, of course not. For we have the same Holy Spirit and walk in each other’s steps, doing things the same way."},{"num":19,"verse":"I suppose you think I am saying all this to get back into your good graces. That isn’t it at all. I tell you, with God listening as I say it, that I have said this to help you, dear friends—to build you up spiritually—and not to help myself. "},{"num":20,"verse":"For I am afraid that when I come to visit you I won’t like what I find, and then you won’t like the way I will have to act. I am afraid that I will find you quarreling, and envying each other, and being angry with each other, and acting big, and saying wicked things about each other, and whispering behind each other’s backs, filled with conceit and disunity. "},{"num":21,"verse":"Yes, I am afraid that when I come God will humble me before you and I will be sad and mourn because many of you have sinned before and don’t even care about the wicked, impure things you have done: your lust and immorality, and the taking of other men’s wives."}]