[[],[{"type":"header","content":"Conquest of Egypt Predicted"},{"type":"prose","content":"The word that came to Jeremiah concerning all the Jews who were living in the land of Egypt—at Migdol, at Tahpanhes, at Memphis, and in the land of Pathros, saying, "}],[{"type":"prose","content":"“Thus says the  of hosts, the God of Israel, ‘You have seen all the disaster that I have brought on Jerusalem and on all the cities of Judah; and see, this day they are desolated and no one lives in them "}],[{"type":"prose","content":"because of the wickedness which they committed, provoking Me to anger by continuing to burn sacrifices  incense to serve other gods that they had not known,  they, nor you, nor your fathers. "}],[{"type":"prose","content":"Yet I sent to you all My servants the prophets, again and again, saying, “Oh, do not do this shamefully vile thing which I hate.” "}],[{"type":"prose","content":"But they did not listen or turn [obediently] from their wickedness, and stop burning sacrifices  incense to other gods. "}],[{"type":"prose","content":"Therefore My wrath and My anger were poured out and burned in the cities of Judah and in the streets of Jerusalem; so they have become a ruin and a desolation, as it is this day. "}],[{"type":"prose","content":"Therefore now thus says the  God of hosts, the God of Israel, “Why did you commit this great evil against yourselves [bringing disaster] that will cut off from you man and woman, child and infant, out of Judah, leaving yourselves without a remnant? "}],[{"type":"prose","content":"Why do you [deliberately] provoke Me to anger with the works (idols) of your hands, burning sacrifices  incense to [make-believe] gods in the land of Egypt, where you [of your own accord] have come to live [as temporary residents], that you might be cut off and become a curse and a disgrace [an object of taunts] among all the nations of the earth? "}],[{"type":"prose","content":"Have you forgotten the wickedness of your fathers, the wickedness of the kings of Judah, the wickedness of their wives [who served their foreign gods], your own wickedness, and the wickedness of your wives [who imitated the sin of the queens], which they committed in the land of Judah and in the streets of Jerusalem? "}],[{"type":"prose","content":"They have not become apologetic [for their guilt and sin] even to this day; they have not feared [Me with reverence] nor walked in My law or My statutes, which I have set before you and before your fathers.”’"}],[{"type":"prose","content":"“Therefore thus says the  of hosts, the God of Israel, ‘Behold, I am going to set My face against you for woe—even to cut off (destroy) all Judah [from the land]. "}],[{"type":"prose","content":"And I will take the remnant of Judah who have decided to go into the land of Egypt to live there [instead of surrendering to the Chaldeans as directed], and they will all fall and die in the land of Egypt; they will fall by the sword or perish by famine. From the least to the greatest, they will die by the sword or by famine; and they will become detestable, an object of horror, a curse, and a disgrace. "}],[{"type":"prose","content":"For I will punish all the inhabitants of the land of Egypt, as I have punished Jerusalem, with the sword, with famine, and with virulent disease; "}],[{"type":"prose","content":"so none of the survivors from the remnant of Judah who have entered the land of Egypt to live there will survive, even though they lift up their souls in longing to return to the land of Judah, [the place] to which they long to return to live; none will return except a few refugees.’”"}],[{"type":"prose","content":"Then all the men who knew that their wives were burning sacrifices to other gods, and all the women who were standing by, a large group, including all the people who were living in Pathros in the land of Egypt, answered Jeremiah, saying, "}],[{"type":"prose","content":"“As for the word (message) that you have spoken to us in the name of the , we are not going to listen to you. "}],[{"type":"prose","content":"But rather we will certainly perform every word of the vows we have made: to burn sacrifices to the queen of heaven (Ishtar) and to pour out drink offerings to her, just as we ourselves and our forefathers, our kings and our princes did in the cities of Judah and in the streets of Jerusalem; for [then] we had plenty of food and were prosperous and saw no misfortune. "}],[{"type":"prose","content":"But since we stopped burning sacrifices to the queen of heaven and pouring out drink offerings to her, we have lacked everything and have been consumed by the sword and by famine.” "}],[{"type":"prose","content":", “When we were burning sacrifices to the queen of heaven and were pouring out drink offerings to her, was it without [the knowledge and approval of] our husbands that we made cakes [in the shape of a star] to represent her and pour out drink offerings to her?”"},{"type":"header","content":"Tragedy for the Jews"}],[{"type":"prose","content":"Then Jeremiah said to all the people, to the men and to the women and to all the people who had given him that answer, "}],[{"type":"prose","content":"“The smoking sacrifices (incense) that you burned in the cities of Judah and in the streets of Jerusalem—you and your forefathers, your kings and your princes, and the people of the land—did not the  remember [in detail your idolatry] and did it not all come into His mind? "}],[{"type":"prose","content":"The  could no longer endure it, because of the evil of your acts and the repulsive acts which you have committed; because of them your land has become a ruin, an object of horror and a curse, without inhabitant, as it is this day. "}],[{"type":"prose","content":"Because you have burned sacrifices [to idols] and because you have sinned against the  and have not obeyed the voice of the  or walked in His law and in His statutes and in His testimonies, therefore this tragedy has fallen on you, as it has this day.”"}],[{"type":"prose","content":"Then Jeremiah said to all the people, including all the women, “Hear the word of the , all [you of] Judah who are in the land of Egypt, "}],[{"type":"prose","content":"thus says the  of hosts, the God of Israel, as follows: ‘You and your wives have both declared with your mouth and fulfilled it with your hand, saying, “We will certainly perform our vows that we have vowed, to burn sacrifices to the queen of heaven (Ishtar) and to pour out drink offerings to her.” Surely then confirm your vows and go ahead and perform your vows! [If you intend to defy all My warnings, proceed!]’ "}],[{"type":"prose","content":"Therefore hear the word of the , all [you people of] Judah who are living in the land of Egypt, ‘Behold, I have sworn [an oath] by My great Name,’ says the , ‘that My Name shall never again be invoked by the mouth of any man of Judah in all the land of Egypt, saying, “As the Lord  lives.” "}],[{"type":"prose","content":"Behold, I am watching over them for harm and not for good; and all the men of Judah who are in the land of Egypt shall be consumed by the sword and by famine until they are all destroyed. "}],[{"type":"prose","content":"Yet a small number [of My choosing] who escape the sword will return from the land of Egypt to the land of Judah; and all the remnant of Judah who have gone to the land of Egypt to reside there will know whose words will stand, Mine or theirs. "}],[{"type":"prose","content":"And this will be the sign to you,’ says the , ‘that I am going to punish you in this place, so that you may know that My words will surely stand against you for harm.’ "}],[{"type":"prose","content":"Thus says the , ‘Behold, I will give Pharaoh Hophra king of Egypt into the hand of his enemies and into the hand of those who seek his life, just as I gave Zedekiah king of Judah into the hand of Nebuchadnezzar king of Babylon, who was his enemy and was seeking his life.’”"}]]