[{"header":"Jeremiah Warns the Refugees in Egypt"},{"num":44,"verse":"This is the message that came to Jeremiah for all the Judeans who were living in the land of Egypt, who were living in Migdol, Tahpanhes, Memphis, and in the land of Pathros, saying, "},{"num":2,"verse":"“This is what the Lord of the Heavenly Armies, the God of Israel, says: ‘You have seen the disaster that I brought on Jerusalem and all the cities of Judah. Look, they’re in ruins today, with no one living in them, "},{"num":3,"verse":"because of the wickedness that they did, provoking me to anger by continuing to offer sacrifices and worship other gods that neither they nor you nor your ancestors had known. "},{"num":4,"verse":"Yet I sent all my servants the prophets to you again and again, saying, “Don’t do this repulsive thing that I hate.” "},{"num":5,"verse":"‘But they didn’t listen or pay attention by turning from their wickedness and not offering sacrifices to other gods. "},{"num":6,"verse":"My wrath and my anger were poured out, and they burned in the cities of Judah and the streets of Jerusalem so that they have become a ruin and a desolate place, as is the case today.’"},{"num":7,"verse":"“Now, this is what the Lord of the Heavenly Armies, the God of Israel, says: ‘Why are you doing great harm to yourselves so as to cut off from Judah man and woman, child and infant from you, leaving yourselves without a remnant? "},{"num":8,"verse":"And why have you provoked me to anger by the works of your hands, by offering sacrifices to other gods in the land of Egypt where you have come to settle so that you cut yourselves off and become an object of ridicule and scorn among all the nations of the earth? "},{"num":9,"verse":"Have you forgotten the evil deeds of your ancestors, the evil deeds of the kings of Judah, the evil deeds of their wives, your evil deeds, and the evil deeds of your wives, that they did in the land of Judah and the streets of Jerusalem? "},{"num":10,"verse":"To this day they haven’t humbled themselves, they haven’t shown reverence for the Lord, and they haven’t lived according to my Law and my statutes that I set before them and before their ancestors.’"},{"num":11,"verse":"“Therefore, this is what the Lord of the Heavenly Armies, the God of Israel, says: ‘Look, I’ve determined to bring disaster on you and to cut off all Judah. "},{"num":12,"verse":"I’ll take the remnant of Judah that determined to go to the land of Egypt to settle there, and all of them will come to an end in the land of Egypt. They’ll fall by the sword, and they’ll come to an end by famine. They’ll become a curse, an object of horror, ridicule, and scorn. "},{"num":13,"verse":"I’ll punish those who live in the land of Egypt just as I punished Jerusalem—with the sword, with famine, and with plague. "},{"num":14,"verse":"Of the remnant of Judah that came into the land of Egypt to settle there, no one will escape or survive to return to the land of Judah where they long to return and live. Indeed, they won’t return, except for some refugees.’”"},{"header":"The Refugees Refuse to Repent"},{"num":15,"verse":"Then all the men who knew that their wives were offering sacrifices to other gods and all the women who were standing by—a large group, including all the people who were living in the land of Egypt in Pathros—answered Jeremiah: "},{"num":16,"verse":"“As for the message that you reported to us in the name of the Lord, we won’t listen to you! "},{"num":17,"verse":"Rather, we will keep doing everything that we said we would by offering sacrifices to the Queen of Heaven and by pouring out liquid offerings to her just as we, our ancestors, our kings, and our leaders did in the cities of Judah and the streets of Jerusalem. Then we had plenty of bread, things went well for us, and we didn’t experience disaster. "},{"num":18,"verse":"From the time we stopped offering sacrifices to the Queen of Heaven and pouring out liquid offerings to her, we have lacked everything, and we have been consumed by the sword and famine. "},{"num":19,"verse":"Indeed, we are going to continue offering sacrifices to the Queen of Heaven and pouring out liquid offerings to her. And do you think we have made cakes to represent her or poured out liquid offerings for her without our husbands’ approval?”"},{"header":"Final Judgment Proclaimed"},{"num":20,"verse":"Then Jeremiah spoke a message to all the people, to the young men, to the women, and to all the people who were answering him: "},{"num":21,"verse":"“As for the sacrifices that you, your ancestors, your kings, your officials, and the people of the land offered in the cities of Judah and the streets of Jerusalem, the Lord remembered them, did he not? And they came to his attention, did they not? "},{"num":22,"verse":"The Lord could no longer bear it because of your evil deeds and the repulsive things that you did. So your land has become a ruin and an object of horror and ridicule without an inhabitant, as is the case today. "},{"num":23,"verse":"Because you offered sacrifices and sinned against the Lord, you didn’t obey the Lord and didn’t live according to his Law, his statutes, or his testimonies; therefore, this disaster has happened to you, as is the case today.”"},{"num":24,"verse":"Then Jeremiah told all the people and all the women, “All you people of Judah who are in the land of Egypt, listen to this message from the Lord! "},{"num":25,"verse":"This is what the Lord of the Heavenly Armies, the God of Israel, says: ‘You and your wives have spoken with your mouths and acted with your hands: “We will certainly carry through on the vows that we vowed to offer sacrifices to the Queen of Heaven and pour out liquid offerings to her!” Go ahead, carry through on your vows, and diligently do what you vowed!’ "},{"num":26,"verse":"But listen to this message from the Lord, all you people of Judah who are living in the land of Egypt. ‘Look, I’ve sworn by my great name’, says the Lord, ‘my name will no longer be invoked by the mouth of any person in the entire land of Egypt, as he says, “As surely as the Lord God lives…”"},{"num":27,"verse":"“‘Look, I’m watching over them to bring disaster rather than good. Every person of Judah in the land of Egypt will be brought to an end by the sword and by famine until they’re completely gone. "},{"num":28,"verse":"The ones who escape the sword will return from the land of Egypt to the land of Judah, few in number. Then all the remnant of Judah who have come into the land of Egypt to settle will know whose message will stand, mine or theirs. "},{"num":29,"verse":"This will be a sign to you,’ declares the Lord, ‘that I’ll punish you in this place so that you may know that my words concerning disaster against you will surely stand.’"},{"num":30,"verse":"This is what the Lord says: “Look, I’m going to give Pharaoh Hophra, king of Egypt, into the hands of his enemies and into the hands of those seeking his life, just as I gave Zedekiah king of Judah into the hands of Nebuchadnezzar king of Babylon, his enemy who was seeking his life.”"}]