[{"num":15,"verse":"¶ But it came to pass within some days in the time of wheat harvest that Samson visited his wife with a kid, and he said, I will go in to my wife into the chamber. But her father would not allow him to go in."},{"num":2,"verse":"And her father said, I was persuaded that thou didst utterly hate her; therefore, I gave her to thy companion. Is not her younger sister fairer than she? Take her, I pray thee, instead of her."},{"num":3,"verse":"And Samson replied unto them, Now I shall be blameless before the Philistines if I do them injury."},{"num":4,"verse":"And Samson went and caught three hundred foxes, and took torches, and turning them tail to tail, he put a torch between every two tails."},{"num":5,"verse":"Then, setting the torches on fire, he let them go into the standing grain of the Philistines and burnt up both the shocks and also the standing grain with the vineyards and oliveyards."},{"num":6,"verse":"Then the Philistines said, Who has done this? And they answered, Samson, the son-in-law of the Timnite, because he had taken his wife and given her to his companion. And the Philistines came up and burnt her and her father with fire."},{"num":7,"verse":"And Samson said unto them, Though ye have done this, yet I will be avenged of you, and after that I will cease."},{"num":8,"verse":"And he smote them hip and thigh with a great slaughter, and he went down and dwelt in the cleft of the rock Etam."},{"num":9,"verse":"¶ Then the Philistines went up and pitched camp in Judah and spread themselves in Lehi."},{"num":10,"verse":"And the men of Judah said, Why have ye come up against us? And they answered, We have come up to bind Samson, to do to him as he has done to us."},{"num":11,"verse":"Then three thousand men of Judah went to the cleft of the rock Etam and said to Samson, Knowest thou not that the Philistines are rulers over us? What is this that thou hast done unto us? And he said unto them, As they did unto me, so have I done unto them."},{"num":12,"verse":"And they said unto him, We have come to bind thee that we may deliver thee into the hand of the Philistines. And Samson said unto them, Swear unto me that ye will not fall upon me yourselves."},{"num":13,"verse":"And they answered him, saying, No, we will bind thee fast and deliver thee into their hands; but surely we will not kill thee. And they bound him with two new cords and brought him up from the rock."},{"num":14,"verse":"And when he came unto Lehi, {Heb. jaw} the Philistines received him with shouts; and the Spirit of the LORD came mightily upon him, and the cords that were upon his arms became as flax that was burnt with fire, and his bands loosed from off his hands."},{"num":15,"verse":"And he found a new jawbone of an ass and put forth his hand and took it and slew a thousand men with it."},{"num":16,"verse":"Then Samson said, With the jawbone of an ass, one heap, two heaps; with the jaw of an ass I have slain a thousand men."},{"num":17,"verse":"And when he had finished speaking, he cast away the jawbone out of his hand and called that place Ramathlehi. {Heb. the lifting up of the jaw}"},{"num":18,"verse":"¶ And he was sore athirst and called on the LORD and said, Thou hast given this great salvation by the hand of thy slave; and now shall I die for thirst and fall into the hand of the uncircumcised?"},{"num":19,"verse":"Then God broke a tooth that was in the jaw, and water came out there; and he drank, and recovered his spirit, and he lived. Therefore he called the name thereof Enhakkore, {Heb. the fountain of he who called} which is in Lehi unto this day."},{"num":20,"verse":"And he judged Israel in the days of the Philistines twenty years."}]