[{"num":29,"verse":"(ii) Continuing his journey, Ya‘akov came to the land of the people of the east. "},{"num":2,"verse":"As he looked, he saw a well in a field; and there were three flocks of sheep lying there next to it; because they watered the sheep from that well. The stone on the well’s mouth was large, "},{"num":3,"verse":"and only when all the flocks had gathered there would they roll the stone away from the opening of the well and water the sheep. Then they would put the stone back in its place on the well’s opening."},{"num":4,"verse":"Ya‘akov said to them, “My brothers, where are you from?” They answered, “We’re from Haran.” "},{"num":5,"verse":"He asked them, “Do you know Lavan the [grand]son of Nachor?” They said, “We do.” "},{"num":6,"verse":"He asked them, “Are things going well with him?” “Yes,” they answered, “and here comes his daughter Rachel with the sheep.” "},{"num":7,"verse":"He said, “Look, there’s still plenty of daylight left; and it isn’t time to bring the animals home; so water the sheep; then go, and put them out to pasture.” "},{"num":8,"verse":"They answered, “We can’t, not until all the flocks have been gathered together, and they roll the stone away from the opening of the well. That’s when we water the sheep.”"},{"num":9,"verse":"While he was still speaking with them, Rachel came with her father’s sheep, because she took care of them. "},{"num":10,"verse":"When Ya‘akov saw Rachel the daughter of Lavan his mother’s brother, and the sheep of Lavan his mother’s brother, Ya‘akov went up and rolled the stone away from the opening of the well and watered the flock of Lavan his mother’s brother. "},{"num":11,"verse":"Ya‘akov kissed Rachel and wept aloud. "},{"num":12,"verse":"Ya‘akov told Rachel that he was her father’s relative, and that he was Rivkah’s son; and she ran and told her father. "},{"num":13,"verse":"When Lavan heard the news of Ya‘akov his sister’s son, he ran to meet him, hugged him and kissed him, and brought him to his house. Ya‘akov told Lavan all that had happened. "},{"num":14,"verse":"Lavan said to him, “You are indeed my own flesh and blood.”"},{"num":15,"verse":"Lavan said to him, “Why should you work for me for nothing, just because you are my relative? Tell me how much I should pay you.” "},{"num":16,"verse":"Now Lavan had two daughters; the name of the older was Le’ah, and the name of the younger was Rachel. "},{"num":17,"verse":"Le’ah’s eyes were weak; but Rachel was good-looking, with beautiful features."},{"num":18,"verse":"(iii) Ya‘akov had fallen in love with Rachel and said, “I will work for you seven years in exchange for Rachel your younger daughter.” "},{"num":19,"verse":"Lavan answered, “Better that I give her to you than to someone else; stay with me.” "},{"num":20,"verse":"So Ya‘akov worked seven years for Rachel, and it seemed only a few days to him, because he was so much in love with her."},{"num":21,"verse":"Ya‘akov said to Lavan, “Give me my wife, since my time is finished, so that I can start living with her.” "},{"num":22,"verse":"Lavan gathered all the men of the place and gave a banquet. "},{"num":23,"verse":"In the evening he took Le’ah his daughter and brought her to Ya‘akov, and he went in and slept with her. "},{"num":24,"verse":"Lavan also gave his slave-girl Zilpah to his daughter Le’ah as her slave-girl."},{"num":25,"verse":"In the morning Ya‘akov saw that he was with Le’ah, and he said to Lavan, “What kind of thing is this that you’ve done to me? Didn’t I work for you for Rachel? Why have you deceived me?” "},{"num":26,"verse":"Lavan answered, “In our place that isn’t how it’s done, to give the younger daughter before the firstborn. "},{"num":27,"verse":"Finish the marriage week of this one, and we’ll give you the other one also in exchange for the work you will do for me during yet another seven years.” "},{"num":28,"verse":"Ya‘akov agreed to this, so he finished her week, and Lavan gave him his daughter Rachel as his wife. "},{"num":29,"verse":"Lavan also gave to his daughter Rachel his slave-girl Bilhah as her slave-girl. "},{"num":30,"verse":"So not only did Ya‘akov go in and sleep with Rachel, but he also loved Rachel more than Le’ah. Then he served Lavan another seven years."},{"num":31,"verse":"Adonai saw that Le’ah was unloved, so he made her fertile, while Rachel remained childless. "},{"num":32,"verse":"Le’ah conceived and gave birth to a son, whom she named Re’uven [see, a son!], for she said, “It is because Adonai has seen how humiliated I have been, but now my husband will love me.” "},{"num":33,"verse":"She conceived again, gave birth to a son and said, “It is because Adonai has heard that I am unloved; therefore he has given me this son also.” So she named him Shim‘on [hearing]. "},{"num":34,"verse":"Once more she conceived and had a son; and she said, “Now this time my husband will be joined to me, because I have borne him three sons.” Therefore she named him Levi [joining]. "},{"num":35,"verse":"She conceived yet again, had a son and said, “This time I will praise Adonai”; therefore she named him Y’hudah [praise]. Then she stopped having children."}]