[{"header":"Jacob and Laban"},{"num":29,"verse":"Then Jacob continued on his journey and came to the land of the people of the east."},{"num":2,"verse":"He looked around and noticed a well in the field, and he saw three flocks of sheep lying there beside it. (That well was used to water the flocks. There was a large stone over the mouth of the well. "},{"num":3,"verse":"All the flocks would gather there. Then the shepherds would roll the stone away from the mouth of the well and water the sheep. Then they would put the stone back in its place over the mouth of the well.)"},{"num":4,"verse":"Jacob said to the men waiting there, “My brothers, where are you from?”"},{"num":5,"verse":"He said to them, “Do you know Laban, the grandson of Nahor?”"},{"num":6,"verse":"He said to them, “Is he doing well?”"},{"num":7,"verse":"He said, “Look, it is still the middle of the day. It is not time to gather the livestock together. Water the sheep and go pasture them.”"},{"num":8,"verse":"They said, “We cannot, until all the flocks are gathered together, and they roll the stone from the mouth of the well. Then we water the sheep.”"},{"num":9,"verse":"While he was still speaking with them, Rachel arrived with her father’s sheep because she took care of them. "},{"num":10,"verse":"When Jacob saw Rachel the daughter of Laban, his mother’s brother, and the sheep of Laban, his mother’s brother, Jacob went up, rolled the stone away from the mouth of the well, and watered the flock of Laban, his mother’s brother. "},{"num":11,"verse":"Jacob kissed Rachel and wept loudly. "},{"num":12,"verse":"Jacob told Rachel that he was her father’s relative and that he was Rebekah’s son. She ran and told her father."},{"num":13,"verse":"When Laban heard the news about Jacob, his sister’s son, he ran to meet Jacob. He embraced him and kissed him and brought him to his house. Jacob repeated all these things to Laban. "},{"num":14,"verse":"Laban said to him, “Certainly you are my own flesh and blood.”"},{"num":15,"verse":"Then Laban said to Jacob, “Because you are my relative, is that any reason you should serve me for nothing? Tell me, what shall your wages be?”"},{"num":16,"verse":"Laban had two daughters. The name of the older one was Leah, and the name of the younger was Rachel. "},{"num":17,"verse":"Leah had attractive eyes, but Rachel had a beautiful face and figure. "},{"num":18,"verse":"Jacob loved Rachel. He said, “I will serve you seven years for Rachel, your younger daughter.”"},{"num":19,"verse":"Laban said, “It is better for me to give her to you than to give her to another man. Stay with me.”"},{"num":20,"verse":"Jacob served seven years for Rachel. They seemed to him like a few days, because of the love he had for her."},{"num":21,"verse":"Jacob said to Laban, “Give me my wife, for my time of service is finished, so that I may go to her.”"},{"num":22,"verse":"Laban gathered together all the local people and made a feast. "},{"num":23,"verse":"When evening had arrived, he took Leah his daughter and brought her to Jacob, and Jacob went to her. "},{"num":24,"verse":"(Laban gave his maid Zilpah to his daughter Leah as her maid.) "},{"num":25,"verse":"When morning came, Jacob realized it was Leah. So Jacob said to Laban, “What is this you have done to me? Didn’t I serve you for Rachel? Why have you deceived me?”"},{"num":26,"verse":"Laban said, “That is not the way we do it here. We do not give the younger before the firstborn. "},{"num":27,"verse":"Fulfill the marriage week for this one, and we will give you the other one too—for seven more years of service.”"},{"num":28,"verse":"So that is what Jacob did. When he fulfilled the marriage week, Laban gave him Rachel his daughter as his wife. "},{"num":29,"verse":"(Laban gave his maid Bilhah to his daughter Rachel to be her maid.) "},{"num":30,"verse":"Jacob also went to Rachel, and he loved Rachel more than Leah. He served Laban seven more years."},{"header":"Jacob’s Family"},{"num":31,"verse":"The Lord saw that Leah was not loved, and he allowed her to conceive, but Rachel had no children. "},{"num":32,"verse":"Leah became pregnant and gave birth to a son, and she named him Reuben, because she had said, “The Lord has looked at my misery. So now my husband will love me.”"},{"num":33,"verse":"She conceived again and gave birth to a son and said, “Because the Lord has heard that I am hated, he has given me this son also.” So she named him Simeon."},{"num":34,"verse":"She conceived again and gave birth to a son. She said, “Now this time my husband will be attached to me, because I have given birth to three sons for him.” That is why he was named Levi."},{"num":35,"verse":"She conceived again and gave birth to a son. She said, “This time I will praise the Lord.” So she named him Judah. Then she stopped having children."}]