[{"num":5,"verse":"Every high priest is chosen from among the people. He is appointed to act for the people. He acts for them in whatever has to do with God. He offers gifts and sacrifices for their sins. "},{"num":2,"verse":"Some people have gone astray without knowing it. He is able to deal gently with them. He can do that because he himself is weak. "},{"num":3,"verse":"That’s why he has to offer sacrifices for his own sins. He must also do it for the sins of the people. "},{"num":4,"verse":"And no one can take this honor for himself. Instead, he receives it when he is appointed by God. That is just how it was for Aaron."},{"num":5,"verse":"It was the same for Christ. He did not take for himself the glory of becoming a high priest. But God said to him,"},{"num":6,"verse":"In another place God said,"},{"num":7,"verse":"Jesus prayed while he lived on earth. He made his appeal with sincere cries and tears. He prayed to the God who could save him from death. God answered Jesus because he truly honored God. "},{"num":8,"verse":"Jesus was God’s Son. But by suffering he learned what it means to obey. "},{"num":9,"verse":"In this way he was made perfect. Eternal salvation comes from him. He saves all those who obey him. "},{"num":10,"verse":"God appointed him to be the high priest, just like Melchizedek."},{"header":"A Warning Against Falling Away"},{"num":11,"verse":"We have a lot to say about this. But it is hard to make it clear to you. That’s because you are no longer trying to understand. "},{"num":12,"verse":"By this time you should be teachers. But in fact, you need someone to teach you all over again. You need even the simple truths of God’s word. You need milk, not solid food. "},{"num":13,"verse":"Anyone who lives on milk is still a baby. That person does not want to learn about living a godly life. "},{"num":14,"verse":"Solid food is for those who are grown up. They have trained themselves to tell the difference between good and evil. That shows they have grown up."}]