[{"num":5,"verse":"For every Kohen Gadol taken from among Bnei Adam is ordained for men for the avodas kodesh of Hashem, that he may offer both minchot (gifts) and zevakhim (sacrifices) for chatta’im (sins)."},{"num":2,"verse":"The Kohen Gadol is able to deal gently with the Am Ha’Aretz and Wayward, als (since) he himself is subject to helpless human frailty;"},{"num":3,"verse":"and therefore he is obligated to offer zevakhim not only for the averos of the Am Berit but also for his own averos."},{"num":4,"verse":"And one does not presume to take the kavod of the office of Kohen Gadol upon oneself, but one must have the bechirah (choice, election) of Hashem, just as Aharon did."},{"num":5,"verse":"So also Rebbe, Melech HaMoshiach did not seize kavod for himself to become a Kohen Gadol, but the One having said to him, \"BENI ATAH, ANI HAYOM YELIDTICHA,\" (\"My Son you are; Today I have become your Father.\" TEHILLIM 2:7)"},{"num":6,"verse":"Says also in another passage, \"ATAH KOHEN L’OLAM AL DIVRATI MALKITZEDEK (\"You are a kohen forever according to the order of Malki Tzedek\"‖Ps 110:4)."},{"num":7,"verse":"Rebbi, Melech HaMoshiach, in the days of his earthly life, offered with a raised voice and tears both tefillos and techinnah (prayers of supplication) to the One who was able to deliver him from mavet, and Hashem heard him because of his chasidus."},{"num":8,"verse":"Although he was HaBen, Rebbi, Melech HaMoshiach learned mishma’at from his yissurim."},{"num":9,"verse":"And having been made shalem (complete), to all those with mishma’at toward Rebbe, Melech HaMoshiach, he became the source of Yeshu’at Eloheinu Olamim,"},{"num":10,"verse":"Having been designated by Hashem as Kohen Gadol AL DIVRATI MALKITZEDEK [TEHILLIM 110:4]."},{"num":11,"verse":"We have much to say about this for which it is difficult to make a midrash, als (since) you have become spiritually hard-of-hearing."},{"num":12,"verse":"For indeed by this time you ought to be [rabbininic] morim saying shiurim, but instead you have need again to be taught the orthodox Jewish basic ikarim (principles, essentials) of the Divrei Hashem, and you have become one having need of cholov and not solid okhel."},{"num":13,"verse":"For everyone partaking of cholov is unacquainted with HaDivrei Tzedek, for he is an olel (infant)."},{"num":14,"verse":"But solid okhel is for the mevugarim (mature ones, adults), the ones whose keilim (faculties) have been trained by practice for distinguishing both HaTov and HaRah. [T.N. In the next chp a warning is given to the Messianic Jew who re-submits Yehoshua to re-trial and reassigns the original verdict of deceiver: no re-rebirth, no rerepentance for such shmad]"}]