[{"num":1,"verse":"The Jewish high priest is merely a man like anyone else, but he is chosen to speak for all other men in their dealings with God. He presents their gifts to God and offers to him the blood of animals that are sacrificed to cover the sins of the people and his own sins too. And because he is a man, he can deal gently with other men, though they are foolish and ignorant, for he, too, is surrounded with the same temptations and understands their problems very well."},{"num":4,"verse":"Another thing to remember is that no one can be a high priest just because he wants to be. He has to be called by God for this work in the same way God chose Aaron."},{"num":5,"verse":"That is why Christ did not elect himself to the honor of being High Priest; no, he was chosen by God. God said to him, “My Son, today I have honored you.” "},{"num":6,"verse":"And another time God said to him, “You have been chosen to be a priest forever, with the same rank as Melchizedek.”"},{"num":7,"verse":"Yet while Christ was here on earth he pleaded with God, praying with tears and agony of soul to the only one who would save him from premature death. And God heard his prayers because of his strong desire to obey God at all times."},{"num":8,"verse":"And even though Jesus was God’s Son, he had to learn from experience what it was like to obey when obeying meant suffering. "},{"num":9,"verse":"It was after he had proved himself perfect in this experience that Jesus became the Giver of eternal salvation to all those who obey him. "},{"num":10,"verse":"For remember that God has chosen him to be a High Priest with the same rank as Melchizedek."},{"num":11,"verse":"There is much more I would like to say along these lines, but you don’t seem to listen, so it’s hard to make you understand."},{"num":12,"verse":"You have been Christians a long time now, and you ought to be teaching others, but instead you have dropped back to the place where you need someone to teach you all over again the very first principles in God’s Word. You are like babies who can drink only milk, not old enough for solid food. And when a person is still living on milk it shows he isn’t very far along in the Christian life, and doesn’t know much about the difference between right and wrong. He is still a baby Christian! "},{"num":14,"verse":"You will never be able to eat solid spiritual food and understand the deeper things of God’s Word until you become better Christians and learn right from wrong by practicing doing right."}]