[{"header":"The Preaching of John the Baptist(A)"},{"num":3,"verse":"It was the fifteenth year of the rule of Emperor Tiberius; Pontius Pilate was governor of Judea, Herod was ruler of Galilee, and his brother Philip was ruler of the territory of Iturea and Trachonitis; Lysanias was ruler of Abilene, "},{"num":2,"verse":"and Annas and Caiaphas were High Priests. At that time the word of God came to John son of Zechariah in the desert. "},{"num":3,"verse":"So John went throughout the whole territory of the Jordan River, preaching, “Turn away from your sins and be baptized, and God will forgive your sins.” "},{"num":4,"verse":"As it is written in the book of the prophet Isaiah:"},{"num":7,"verse":"Crowds of people came out to John to be baptized by him. “You snakes!” he said to them. “Who told you that you could escape from the punishment God is about to send? "},{"num":8,"verse":"Do those things that will show that you have turned from your sins. And don't start saying among yourselves that Abraham is your ancestor. I tell you that God can take these rocks and make descendants for Abraham! "},{"num":9,"verse":"The ax is ready to cut down the trees at the roots; every tree that does not bear good fruit will be cut down and thrown in the fire.”"},{"num":10,"verse":"The people asked him, “What are we to do, then?”"},{"num":11,"verse":"He answered, “Whoever has two shirts must give one to the man who has none, and whoever has food must share it.”"},{"num":12,"verse":"Some tax collectors came to be baptized, and they asked him, “Teacher, what are we to do?”"},{"num":13,"verse":"“Don't collect more than is legal,” he told them."},{"num":14,"verse":"Some soldiers also asked him, “What about us? What are we to do?”"},{"num":15,"verse":"People's hopes began to rise, and they began to wonder whether John perhaps might be the Messiah. "},{"num":16,"verse":"So John said to all of them, “I baptize you with water, but someone is coming who is much greater than I am. I am not good enough even to untie his sandals. He will baptize you with the Holy Spirit and fire. "},{"num":17,"verse":"He has his winnowing shovel with him, to thresh out all the grain and gather the wheat into his barn; but he will burn the chaff in a fire that never goes out.”"},{"num":18,"verse":"In many different ways John preached the Good News to the people and urged them to change their ways. "},{"num":19,"verse":"But John reprimanded Governor Herod, because he had married Herodias, his brother's wife, and had done many other evil things. "},{"num":20,"verse":"Then Herod did an even worse thing by putting John in prison."},{"header":"The Baptism of Jesus(H)"},{"num":21,"verse":"After all the people had been baptized, Jesus also was baptized. While he was praying, heaven was opened, "},{"num":22,"verse":"and the Holy Spirit came down upon him in bodily form like a dove. And a voice came from heaven, “You are my own dear Son. I am pleased with you.”"},{"header":"The Ancestors of Jesus(J)"},{"num":23,"verse":"When Jesus began his work, he was about thirty years old. He was the son, so people thought, of Joseph, who was the son of Heli, "},{"num":24,"verse":"the son of Matthat, the son of Levi, the son of Melchi, the son of Jannai, the son of Joseph, "},{"num":25,"verse":"the son of Mattathias, the son of Amos, the son of Nahum, the son of Esli, the son of Naggai, "},{"num":26,"verse":"the son of Maath, the son of Mattathias, the son of Semein, the son of Josech, the son of Joda, "},{"num":27,"verse":"the son of Joanan, the son of Rhesa, the son of Zerubbabel, the son of Shealtiel, the son of Neri, "},{"num":28,"verse":"the son of Melchi, the son of Addi, the son of Cosam, the son of Elmadam, the son of Er, "},{"num":29,"verse":"the son of Joshua, the son of Eliezer, the son of Jorim, the son of Matthat, the son of Levi, "},{"num":30,"verse":"the son of Simeon, the son of Judah, the son of Joseph, the son of Jonam, the son of Eliakim, "},{"num":31,"verse":"the son of Melea, the son of Menna, the son of Mattatha, the son of Nathan, the son of David, "},{"num":32,"verse":"the son of Jesse, the son of Obed, the son of Boaz, the son of Salmon, the son of Nahshon, "},{"num":33,"verse":"the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah, "},{"num":34,"verse":"the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor, "},{"num":35,"verse":"the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, "},{"num":36,"verse":"the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech, "},{"num":37,"verse":"the son of Methuselah, the son of Enoch, the son of Jared, the son of Mahalaleel, the son of Kenan, "},{"num":38,"verse":"the son of Enosh, the son of Seth, the son of Adam, the son of God."}]