[{"num":3,"verse":"3 John exhorteth to repentance. 15 His testimony of Christ. 20 Herod putteth him in prison. 21 Christ is baptized. 23 His pedigree."},{"num":1,"verse":"Now in the fifteenth year of the reign of Tiberius Caesar, Pontius Pilate being governor of Judea, and Herod being Tetrarch of Galilee, and his brother Philip Tetrarch of Iturea, and of the country of Trachonitis, and Lysanias the Tetrarch of Abilene,"},{"num":2,"verse":"(When Annas and Caiaphas were the high Priests) the word of God came unto John, the son of Zacharias in the wilderness."},{"num":3,"verse":"And he came into all the coasts about Jordan, preaching the baptism of repentance for the remission of sins,"},{"num":4,"verse":"As it is written in the book of the sayings of Isaiah the Prophet, which saith, The voice of him that crieth in the wilderness is, Prepare ye the way of the Lord: make his paths straight."},{"num":5,"verse":"Every valley shall be filled, and every mountain and hill shall be brought low, and crooked things shall be made straight, and the rough ways shall be made smooth."},{"num":6,"verse":"And all flesh shall see the salvation of God."},{"num":7,"verse":"Then said he to the people that were come out to be baptized of him, O generations of vipers, who hath forewarned you to flee from the wrath to come?"},{"num":8,"verse":"Bring forth therefore fruits worthy amendment of life, and begin not to say with yourselves, We have Abraham to our Father: for I say unto you, that God is able of these stones to raise up children unto Abraham."},{"num":9,"verse":"Now also is the axe laid unto the root of the trees: therefore every tree which bringeth not forth good fruit, shall be hewn down, and cast into the fire."},{"num":10,"verse":"¶ Then the people asked him, saying, What shall we do then?"},{"num":11,"verse":"And he answered, and said unto them, He that hath two coats, let him part with him that hath none: and he that hath meat, let him do likewise."},{"num":12,"verse":"Then came there Publicans also to be baptized, and said unto him, Master, what shall we do?"},{"num":13,"verse":"And he said unto them, Require no more than that which is appointed unto you."},{"num":14,"verse":"The soldiers likewise demanded of him, saying, And what shall we do? And he said unto them, Do violence to no man, neither accuse any falsely, and be content with your wages."},{"num":15,"verse":"As the people waited, and all men mused in their hearts of John, if he were not that Christ."},{"num":16,"verse":"John answered, and said to them all, Indeed I baptize you with water, but one stronger than I, cometh, whose shoe’s latchet I am not worthy to unloose: he will baptize you with the holy Ghost, and with fire."},{"num":17,"verse":"Whose fan is in his hand, and he will make clean his floor, and will gather the wheat into his garner, but the chaff will he burn up with fire that never shall be quenched."},{"num":18,"verse":"Thus then exhorting with many other things, he preached unto the people."},{"num":19,"verse":"But when Herod the Tetrarch was rebuked of him, for Herodias his brother Philip’s wife, and for all the evils which Herod had done,"},{"num":20,"verse":"He added yet this above all, that he shut up John in prison."},{"num":21,"verse":"Now it came to pass, as all the people were baptized, and that Jesus was baptized and did pray, that the heaven was opened:"},{"num":22,"verse":"And the holy Ghost came down in a bodily shape like a dove upon him, and there was a voice from heaven, saying, Thou art my beloved Son: in thee I am well pleased."},{"num":23,"verse":"¶ And Jesus himself began to be about thirty years of age, being as men supposed the son of Joseph, which was the son of Heli,"},{"num":24,"verse":"The son of Matthat, the son of Levi, the son of Melchi, the son of Janna, the son of Joseph,"},{"num":25,"verse":"The son of Mattathiah, the son of Amos, the son of Nahum, the son of Esli, the son of Naggai,"},{"num":26,"verse":"The son of Maath, the son of Mattathiah, the son of Semei, the son of Joseph, the son of Judah,"},{"num":27,"verse":"The son of Joannas, the son of Rhesa, the son of Zerubbabel, the son of Shealtiel, the son of Neri,"},{"num":28,"verse":"The son of Melchi, the son of Addi, the son of Cosam, the son of Elmodam, the son of Er,"},{"num":29,"verse":"¶ The son of Jose, the son of Eliezer, the son of Jorim, the son of Matthat, the son of Levi,"},{"num":30,"verse":"The son of Simeon, the son of Judah, the son of Joseph, the son of Jonan, the son of Eliakim,"},{"num":31,"verse":"The son of Melea, the son of Menan, the son of Mattathah, the son of Nathan, the son of David,"},{"num":32,"verse":"The son of Jesse, the son of Obed, the son of Boaz, the son of Salmon, the son of Nahshon,"},{"num":33,"verse":"The son of Amminadab, the son of Ram, the son of Hezron, the son of Perez, the son of Judah,"},{"num":34,"verse":"The son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor,"},{"num":35,"verse":"The son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah,"},{"num":36,"verse":"The son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech,"},{"num":37,"verse":"The son of Methuselah, the son of Enoch, the son of Jared, the son of Mahalalel, the son of Cainan,"},{"num":38,"verse":"The son of Enosh, the son of Seth, the son of Adam, the son of God."}]