[{"header":"Chapter 3"},{"num":1,"verse":"The Preaching of John the Baptist. In the fifteenth year of the reign of Tiberius Caesar, when Pontius Pilate was governor of Judea, and Herod was tetrarch of Galilee, and his brother Philip tetrarch of the region of Ituraea and Trachonitis, and Lysanias was tetrarch of Abilene, "},{"num":2,"verse":"during the high priesthood of Annas and Caiaphas, the word of God came to John the son of Zechariah in the desert. "},{"num":3,"verse":"He went throughout [the] whole region of the Jordan, proclaiming a baptism of repentance for the forgiveness of sins, "},{"num":4,"verse":"as it is written in the book of the words of the prophet Isaiah:"},{"num":7,"verse":"He said to the crowds who came out to be baptized by him, “You brood of vipers! Who warned you to flee from the coming wrath? "},{"num":8,"verse":"Produce good fruits as evidence of your repentance; and do not begin to say to yourselves, ‘We have Abraham as our father,’ for I tell you, God can raise up children to Abraham from these stones. "},{"num":9,"verse":"Even now the ax lies at the root of the trees. Therefore every tree that does not produce good fruit will be cut down and thrown into the fire.”"},{"num":10,"verse":"And the crowds asked him, “What then should we do?” "},{"num":11,"verse":"He said to them in reply, “Whoever has two tunics should share with the person who has none. And whoever has food should do likewise.” "},{"num":12,"verse":"Even tax collectors came to be baptized and they said to him, “Teacher, what should we do?” "},{"num":13,"verse":"He answered them, “Stop collecting more than what is prescribed.” "},{"num":14,"verse":"Soldiers also asked him, “And what is it that we should do?” He told them, “Do not practice extortion, do not falsely accuse anyone, and be satisfied with your wages.”"},{"num":15,"verse":"Now the people were filled with expectation, and all were asking in their hearts whether John might be the Messiah. "},{"num":16,"verse":"John answered them all, saying, “I am baptizing you with water, but one mightier than I is coming. I am not worthy to loosen the thongs of his sandals. He will baptize you with the holy Spirit and fire. "},{"num":17,"verse":"His winnowing fan is in his hand to clear his threshing floor and to gather the wheat into his barn, but the chaff he will burn with unquenchable fire.” "},{"num":18,"verse":"Exhorting them in many other ways, he preached good news to the people. "},{"num":19,"verse":"Now Herod the tetrarch, who had been censured by him because of Herodias, his brother’s wife, and because of all the evil deeds Herod had committed, "},{"num":20,"verse":"added still another to these by [also] putting John in prison."},{"num":21,"verse":"After all the people had been baptized and Jesus also had been baptized and was praying, heaven was opened "},{"num":22,"verse":"and the holy Spirit descended upon him in bodily form like a dove. And a voice came from heaven, “You are my beloved Son; with you I am well pleased.”"},{"num":23,"verse":"When Jesus began his ministry he was about thirty years of age. He was the son, as was thought, of Joseph, the son of Heli, "},{"num":24,"verse":"the son of Matthat, the son of Levi, the son of Melchi, the son of Jannai, the son of Joseph, "},{"num":25,"verse":"the son of Mattathias, the son of Amos, the son of Nahum, the son of Esli, the son of Naggai, "},{"num":26,"verse":"the son of Maath, the son of Mattathias, the son of Semein, the son of Josech, the son of Joda, "},{"num":27,"verse":"the son of Joanan, the son of Rhesa, the son of Zerubbabel, the son of Shealtiel, the son of Neri, "},{"num":28,"verse":"the son of Melchi, the son of Addi, the son of Cosam, the son of Elmadam, the son of Er, "},{"num":29,"verse":"the son of Joshua, the son of Eliezer, the son of Jorim, the son of Matthat, the son of Levi, "},{"num":30,"verse":"the son of Simeon, the son of Judah, the son of Joseph, the son of Jonam, the son of Eliakim, "},{"num":31,"verse":"the son of Melea, the son of Menna, the son of Mattatha, the son of Nathan, the son of David, "},{"num":32,"verse":"the son of Jesse, the son of Obed, the son of Boaz, the son of Sala, the son of Nahshon, "},{"num":33,"verse":"the son of Amminadab, the son of Admin, the son of Arni, the son of Hezron, the son of Perez, the son of Judah, "},{"num":34,"verse":"the son of Jacob, the son of Isaac, the son of Abraham, the son of Terah, the son of Nahor, "},{"num":35,"verse":"the son of Serug, the son of Reu, the son of Peleg, the son of Eber, the son of Shelah, "},{"num":36,"verse":"the son of Cainan, the son of Arphaxad, the son of Shem, the son of Noah, the son of Lamech, "},{"num":37,"verse":"the son of Methuselah, the son of Enoch, the son of Jared, the son of Mahalaleel, the son of Cainan, "},{"num":38,"verse":"the son of Enos, the son of Seth, the son of Adam, the son of God."}]