[[],[{"type":"header","content":"John the Baptist Prepares the Way(A)"},{"type":"prose","content":"Now in the fifteenth year of the reign of Tiberius Caesar, Pontius Pilate being governor of Judea, Herod being tetrarch of Galilee, his brother Philip tetrarch of Iturea and the region of Trachonitis, and Lysanias tetrarch of Abilene, "}],[{"type":"prose","content":"while Annas and Caiaphas were high priests, the word of God came to John the son of Zacharias in the wilderness. "}],[{"type":"prose","content":"And he went into all the region around the Jordan, preaching a baptism of repentance for the remission of sins, "}],[{"type":"prose","content":"as it is written in the book of the words of Isaiah the prophet, saying:"},{"type":"header","content":"John Preaches to the People(I)"}],[{"type":"prose","content":"Then he said to the multitudes that came out to be baptized by him, “Brood of vipers! Who warned you to flee from the wrath to come? "}],[{"type":"prose","content":"Therefore bear fruits worthy of repentance, and do not begin to say to yourselves, ‘We have Abraham as  father.’ For I say to you that God is able to raise up children to Abraham from these stones. "}],[{"type":"prose","content":"And even now the ax is laid to the root of the trees. Therefore every tree which does not bear good fruit is cut down and thrown into the fire.”"}],[{"type":"prose","content":"So the people asked him, saying, “What shall we do then?”"}],[{"type":"prose","content":"He answered and said to them, “He who has two tunics, let him give to him who has none; and he who has food, let him do likewise.”"}],[{"type":"prose","content":"Then tax collectors also came to be baptized, and said to him, “Teacher, what shall we do?”"}],[{"type":"prose","content":"And he said to them, “Collect no more than what is appointed for you.”"}],[{"type":"prose","content":"Likewise the soldiers asked him, saying, “And what shall we do?”So he said to them, “Do not intimidate anyone or accuse falsely, and be content with your wages.”"}],[{"type":"prose","content":"Now as the people were in expectation, and all reasoned in their hearts about John, whether he was the Christ  not, "}],[{"type":"prose","content":"John answered, saying to all, “I indeed baptize you with water; but One mightier than I is coming, whose sandal strap I am not worthy to loose. He will baptize you with the Holy Spirit and fire. "}],[{"type":"prose","content":"His winnowing fan  in His hand, and He will thoroughly clean out His threshing floor, and gather the wheat into His barn; but the chaff He will burn with unquenchable fire.”"}],[{"type":"prose","content":"And with many other exhortations he preached to the people. "}],[{"type":"prose","content":"But Herod the tetrarch, being rebuked by him concerning Herodias, his brother Philip’s wife, and for all the evils which Herod had done, "}],[{"type":"prose","content":"also added this, above all, that he shut John up in prison."},{"type":"header","content":"John Baptizes Jesus(W)"}],[{"type":"prose","content":"When all the people were baptized, it came to pass that Jesus also was baptized; and while He prayed, the heaven was opened. "}],[{"type":"prose","content":"And the Holy Spirit descended in bodily form like a dove upon Him, and a voice came from heaven which said, “You are My beloved Son; in You I am well pleased.”"},{"type":"header","content":"The Genealogy of Jesus Christ(Z)"}],[{"type":"prose","content":"Now Jesus Himself began  about thirty years of age, being (as was supposed)  son of Joseph,  of Heli, "}],[{"type":"prose","content":" of Matthat,  of Levi,  of Melchi,  of Janna,  of Joseph, "}],[{"type":"prose","content":" of Mattathiah,  of Amos,  of Nahum,  of Esli,  of Naggai, "}],[{"type":"prose","content":" of Maath,  of Mattathiah,  of Semei,  of Joseph,  of Judah, "}],[{"type":"prose","content":" of Joannas,  of Rhesa,  of Zerubbabel,  of Shealtiel,  of Neri, "}],[{"type":"prose","content":" of Melchi,  of Addi,  of Cosam,  of Elmodam,  of Er, "}],[{"type":"prose","content":" of Jose,  of Eliezer,  of Jorim,  of Matthat,  of Levi, "}],[{"type":"prose","content":" of Simeon,  of Judah,  of Joseph,  of Jonan,  of Eliakim, "}],[{"type":"prose","content":" of Melea,  of Menan,  of Mattathah,  of Nathan,  of David, "}],[{"type":"prose","content":" of Jesse,  of Obed,  of Boaz,  of Salmon,  of Nahshon, "}],[{"type":"prose","content":" of Amminadab,  of Ram,  of Hezron,  of Perez,  of Judah, "}],[{"type":"prose","content":" of Jacob,  of Isaac,  of Abraham,  of Terah,  of Nahor, "}],[{"type":"prose","content":" of Serug,  of Reu,  of Peleg,  of Eber,  of Shelah, "}],[{"type":"prose","content":" of Cainan,  of Arphaxad,  of Shem,  of Noah,  of Lamech, "}],[{"type":"prose","content":" of Methuselah,  of Enoch,  of Jared,  of Mahalalel,  of Cainan, "}],[{"type":"prose","content":" of Enosh,  of Seth,  of Adam,  of God."}]]