[[],[{"type":"header","content":"John the Baptist Prepares the Way"},{"type":"prose","content":"It was now the fifteenth year of the reign of Tiberius, the Roman emperor. Pontius Pilate was governor over Judea; Herod Antipas was ruler over Galilee; his brother Philip was ruler over Iturea and Traconitis; Lysanias was ruler over Abilene."}],[{"type":"prose","content":"Annas and Caiaphas were the high priests. At this time a message from God came to John son of Zechariah, who was living in the wilderness."}],[{"type":"prose","content":"Then John went from place to place on both sides of the Jordan River, preaching that people should be baptized to show that they had repented of their sins and turned to God to be forgiven."}],[{"type":"prose","content":"Isaiah had spoken of John when he said,"}],[{"type":"prose","content":"When the crowds came to John for baptism, he said, “You brood of snakes! Who warned you to flee the coming wrath?"}],[{"type":"prose","content":"Prove by the way you live that you have repented of your sins and turned to God. Don’t just say to each other, ‘We’re safe, for we are descendants of Abraham.’ That means nothing, for I tell you, God can create children of Abraham from these very stones."}],[{"type":"prose","content":"Even now the ax of God’s judgment is poised, ready to sever the roots of the trees. Yes, every tree that does not produce good fruit will be chopped down and thrown into the fire.”"}],[{"type":"prose","content":"The crowds asked, “What should we do?”"}],[{"type":"prose","content":"John replied, “If you have two shirts, give one to the poor. If you have food, share it with those who are hungry.”"}],[{"type":"prose","content":"Even corrupt tax collectors came to be baptized and asked, “Teacher, what should we do?”"}],[{"type":"prose","content":"He replied, “Collect no more taxes than the government requires.”"}],[{"type":"prose","content":"“What should we do?” asked some soldiers.John replied, “Don’t extort money or make false accusations. And be content with your pay.”"}],[{"type":"prose","content":"Everyone was expecting the Messiah to come soon, and they were eager to know whether John might be the Messiah."}],[{"type":"prose","content":"John answered their questions by saying, “I baptize you with water; but someone is coming soon who is greater than I am—so much greater that I’m not even worthy to be his slave and untie the straps of his sandals. He will baptize you with the Holy Spirit and with fire."}],[{"type":"prose","content":"He is ready to separate the chaff from the wheat with his winnowing fork. Then he will clean up the threshing area, gathering the wheat into his barn but burning the chaff with never-ending fire.”"}],[{"type":"prose","content":"John used many such warnings as he announced the Good News to the people."}],[{"type":"prose","content":"John also publicly criticized Herod Antipas, the ruler of Galilee, for marrying Herodias, his brother’s wife, and for many other wrongs he had done."}],[{"type":"prose","content":"So Herod put John in prison, adding this sin to his many others."},{"type":"header","content":"The Baptism of Jesus"}],[{"type":"prose","content":"One day when the crowds were being baptized, Jesus himself was baptized. As he was praying, the heavens opened,"}],[{"type":"prose","content":"and the Holy Spirit, in bodily form, descended on him like a dove. And a voice from heaven said, “You are my dearly loved Son, and you bring me great joy.”"},{"type":"header","content":"The Ancestors of Jesus"}],[{"type":"prose","content":"Jesus was about thirty years old when he began his public ministry."}]]