[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the rain cometh down . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The verse includes well-nigh every element of the parables of agriculture. The “rain” and the “dew” are the gracious influences that prepare the heart; the “seed” is the Divine word, the “sower” is the Servant of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the Son of Man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the “bread” the fruits of holiness that in their turn sustain the life of others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE CALL TO THE THIRSTYIsaiah 55:1 - Isaiah 55:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE CALL TO THE THIRSTY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The call to partake of the blessings of the Messianic salvation worthily follows the great prophecy of the suffering Servant. No doubt the immediate application of this chapter is to the exiled nation, who in it are summoned from their vain attempts to find satisfaction in the material prosperity realised in exile, and to make the only true blessedness their own by obedience to God’s voice. But if ever the prophet spoke to the world he does so here. It is no unwarranted spiritualising of his invitation which hears in it the voice which invites all mankind to share the blessings of the gospel feast.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The glorious words need little exposition. What we have to do is to see that they do not fall on our ears in vain. They may be roughly divided into two sections-the invitation to the feast, with the promises to the obedient Israel {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, and the summons to the necessary preparation for the feast, namely, repentance, with the reason for its necessity, and the encouragements to it in the might of God’s faithful promises {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Whose voice sounds so beseechingly and welcoming in this great call, which rings out to all thirsty souls?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If we note the ‘Me’ and ‘I’ which follow, we shall hear God Himself thus taking the office of summoner to His own feast. By whatever media the gospel call reaches us, it is in reality God’s own voice to our hearts, and that makes the responsibility of hearing more tremendous, and the folly of refusing more inexcusable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Who are invited? There are but two conditions expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and these are fulfilled in every soul. All are summoned who are thirsty and penniless. If we have in our souls desires that all the broken cisterns of earth can never slake-and we all have these-and if we have nothing by which we can procure what will still the gnawing hunger and burning thirst of our souls-and none of us has-then we are included in the call. Universal as are the craving for blessedness and the powerlessness to satisfy it, are the adaptation and destination of the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What is offered? Water, wine, milk-all the beverages of a simple civilisation, differing in their operation, but all precious to a thirsty palate. Water revives, wine gladdens and inspirits, milk nourishes. All that any man needs or desires is to be found in Christ. We shall not understand the nature of the feast unless we remember that He Himself is the ‘gift of God.’ What these three draughts mean is best perceived when we listen to Him saying, in a plain quotation of this call, ‘If any man thirst, let him come unto Me and drink.’ Nothing short of Himself can satisfy the thirst of one soul, much less of all the thirsty. Like the flow from the magic fountain of the legend, Jesus becomes to each what each most desires.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How does He become ours? The paradox of buying with what is not money is meant, by its very appearance of contradiction, to put in strongest fashion that the possession of Him depends on nothing in us but the sense of need and the willingness to accept. We buy Christ when we part with self, which is all that we have, in order to win Him. We must be full of conscious emptiness and desire, if we are to be filled with His fulness. Jesus interpreted the meaning of ‘come to the waters’ when He said, ‘He that cometh to Me shall never hunger, and he that believeth on Me shall never thirst.’ Faith is coming, faith is drinking, faith is buying.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The universal call, with is clear setting forth of blessing and conditions of possessing, is followed by a pleading remonstrance as to the folly of lavishing effort and money on what is not bread. It is strange that men will cheerfully take more pains to continue thirsty than to accept the satisfaction which God provides. They toil and continue unsatisfied. Experience does not teach them, and all the while the one real good is waiting to be theirs for nothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘‘Tis heaven alone that is given away;‘Tis only God may be had for the asking.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘‘Tis heaven alone that is given away;",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "‘Tis only God may be had for the asking.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christ goes a-begging, and we spend our strength in vain toil to acquire what we turn away from when it is offered us in Him. When the great Father offers bread for nothing, we will not have it, but we are ready to give any price for a stone. It is not the wickedness, but the folly, of unbelief, which is the marvel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The contrast between the heavy price at which men buy hunger, and the easy rate at which they may have full satisfaction, is further set forth by the call to ‘incline the ear,’ which is all that is needed in order that life and nourishment which delights the soul may be ours. ‘Hearken, and eat’ is equivalent to ‘Hearken, and ye shall eat.’ The real ‘good’ for man is only to be found in listening to and obeying the divine voice, whether it sound in invitation, promise, or command. The true life of the soul lies in that listening receptiveness which takes for one’s own God’s great gift of Christ, and yields glad obedience to His every word.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The exiled Israel was promised an ‘everlasting covenant’ as the result of their acceptance of the invitation; and we know whose blood it is that has sealed the new covenant, which abides as long as Christ’s fulness and men’s need shall last. That covenant, of which we seldom hear in Isaiah, but which fills a prominent place in Jeremiah and Ezekiel, is further explained as being ‘the sure mercies of David.’ This phrase and its context are difficult, but the general meaning is clear. The great promises of God’s unfailing mercy, made to the historical founder of the royal house, shall be transferred and continued, with inviolable faithfulness, to those who drink of the gift of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This parallel between the great King and the whole mass of the true Israel is further set forth in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Each begins with ‘Behold,’ and the similar form indicates similarity in contents. The son of Jesse was in some degree God’s witness to the heathen nations, as is expressed in several psalms; and, what he was imperfectly, the ransomed Israel would be to the world. The office of the Christian Church is to draw nations that it knew not, to follow in the blessed path, in which it has found satisfaction and the dawnings of a more than natural glory transfiguring it. They who have themselves drunk of the unfailing fountain in Christ are thereby fitted and called to cry to others, ‘Come ye to the waters.’ Experience of Christ’s preciousness, and of the rest of soul which comes from partaking of His salvation, impels and obliges to call others to share the bliss.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The second part of the chapter begins with an urgent call to repentance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", based upon the difference between God’s ways and man’s, and on the certainty that the divine promises will be fulfilled. The summons in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is first couched in most general terms, which are then more closely defined. To ‘seek the Lord’ is to direct conduct and heart to obtain possession of God as one’s own. Of that seeking, the chief element is calling upon Him; since such is His desire to be found of us that it only needs our asking in order to receive. As surely as the mother hears her child’s cry, so surely does He catch the faintest voice addressed to Him. But, men being what they are, a change of ways and of their root in thoughts is indispensable. Seeking which is not accompanied by forsaking self and an evil past is no genuine seeking, and will end in no finding. But this forsaking is only one side of true repentance; the other is return to God, as is expressed in the New Testament word for it, which implies a change of mind, purpose, and conduct. The faces which were turned earthward and averted from God are to be turned God-ward and diverted from earth. Whosoever thus seeks may be confident of finding and of abundant pardon. The belief in God’s loving forgivingness is the strongest motive to repentance, and the most melting argument to listen to the call to seek Him. But there is another motive of a more awful kind; namely, the consideration that the period of mercy is limited, and that a time may come, and that soon, when God no longer ‘may be found’ nor ‘is near.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The need for such a radical change in conduct and mind is further enforced, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by the emphatic statement of present discord between the exiled Israel and God. Mark that the deepest seat of the discord is first dealt with, and then the manifestation of it in active life. Mark also that the order of comparison is inverted in the two successive clauses in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God’s thoughts have not entered into Israel’s mind and become theirs. The ‘thinkings’ not being regulated according to God’s truth, nor the desires and sentiments brought into accord with His will and mind, a contrariety of ‘ways’ must follow, and the paths which men choose for themselves cannot run parallel with God’s, nor be pleasing to Him. Therefore the stringent urgency of the call to forsake ‘the crooked, wandering ways in which we live,’ and to come back to the path of righteousness which is traced by God for our feet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But divergence which necessitates repentance is not the only relation between our ways and God’s. There is elevation, transcendency, like that of the eternal heavens, high, boundless, the home of light, the storehouse of beneficent influences which fertilise. If we think of the dreary, flat plains where the exiles were, and the magnificent sweep of the sky over them, we shall feel the beauty of the figure. If ‘My thoughts are not your thoughts’ was all that was to be said, repentance would be of little use, and there would be little to encourage to it; but if God’s thoughts of love and ways of blessing arch themselves above our low lives as the sky bends, pitying and bestowing, above squalor, barrenness, and darkness, then penitence is not in vain, and the low earth may be visited with gifts from the highest heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The certainty that such gifts will be bestowed is the last thought of this magnificent summons. The prophet dilates on that assurance to the end of the chapter. He seems to catch fire, as it were, from the introduction of that grand figure of the lofty heavens domed above the flat earth. In effect, what he says is: They are high and inaccessible, but think what pours down from them, and how all fertility depends on their gifts of rain and snow, and how the moisture which they drop is turned into ‘seed to the sower, and bread to the eater.’ Thinking of that continuous benefaction and miracle, we should see in it a symbol of the better gifts from the higher heavens. So does God’s word come down from His throne. So does it turn barrenness into nodding harvest. So does it quicken undreamed of powers of fruitfulness in human nature and among the forces of the world. So does it supply nourishment for hungry souls, and germs which shall bear fruit in coming years. No complicated machinery nor the most careful culture can work what the gentle dropping rain effects. There is mightier force in it than in many thunder-clouds. The gospel does with ease and in silence what nothing else can do. It makes barren souls fruitful in all good works, and in all happiness worthy of men. Therefore the summons to drink of the springing fountain and to turn from evil ways and thoughts is recommended by the assurance that God’s word is faithful, and all His promises firm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The final verses {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} give the glowing picture of the return from exile amid the jubilation of a transformed world, as the strongest motive to the obedient hearkening to God’s voice, to which the chapter has summoned, and as the great instance of God’s keeping His word.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The flight from Egypt was ‘in haste’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}; but this shall be a triumphal exodus, without conflict or alarms. All nature shall participate in the joy. Mountains and hills shall raise the shrill note of rejoicing, and the trees wave their branches, as if clapping hands in delight. This is more than mere poetic rhetoric. A redeemed humanity implies a glorified world. Nature has been involved in the consequences of sin, and will share in the results of redemption, and have some humble reflected light from ‘the liberty of the glory of the sons of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The fulfilment of this final promise is not yet. All earlier returns of the exiled Israel from the Babylon of their bondage to God and the city of God, such as the historical one which the prophet foretold, and the spiritual one which is repeated age by age in the history of the Christian Church and of single penitent souls, point on to that last triumphant day when ‘the ransomed of the Lord shall return,’ and the world be transfigured to match the glory that they inherit. That fair world without poison or offence, and the nations of the saved who inhabit its peaceful spaces, shall be, in the fullest stretch of the words, ‘to the Lord for a name, and for an everlasting sign that shall not be cut off.’ The redemption of man and his establishing amid the felicities of a state correspondent to His God-given glory shall be to all eternity and to all possible creations the highest evidence of what God is, and His token to all beings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 55:10-11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:10-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For as the rain cometh down — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To water and refresh the earth, and render it fruitful; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the snow from heaven ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which, in its season, contributes to the fertility of the earth, as well as the rain; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and returneth not thither ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Namely, without effect, or immediately: it is not drawn up again as soon as it comes down, but abides for a convenient time upon the earth, until it do that work for which it is sent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That it may give seed and bread, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — That it may bring forth store of bread-corn, both for men’s present supplies, and for seed for the next year. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So shall my word be ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— My promises concerning the pardon of the greatest sinners, and the redemption and salvation of mankind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It shall not return unto me void ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Without success. It is an allusion to an ambassador who returns without despatching the business for which he was sent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It shall accomplish that which I please ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— It shall have the desired effect; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and it shall prosper, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — It shall certainly be fulfilled in the manner before expressed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 55:12-13 ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "therefore: you shall go out with joy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Ye shall be released from your bondage, because God hath promised, and will effect it. He alludes to their going out of Egypt, or to their release from Babylon, which deliverances were emblematical of the redemption of mankind, by Christ, from the power of sin and Satan. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And be led forth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "led onward, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as Bishop Lowth renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "תובלון",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", be conducted by the gracious and powerful presence of God, as the Israelites were in the wilderness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "peace ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Safely and triumphantly, without fear of being retaken and brought back into slavery by your enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The mountains and the hills shall break forth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — There shall be a great and general rejoicing at your deliverance. For “these are highly poetical images, to express a happy state, attended with joy and exultation.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Instead of the thorn shall come up the fir-tree ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— “These likewise are general poetical images, expressing a great and happy change for the better: the wilderness turned into a paradise, Lebanon into Carmel; the desert of the Gentiles watered with the heavenly snow and rain, which fail not to have their due effect, and becoming fruitful in piety and righteousness: or, as the Chaldee gives the moral sense of the emblem, ‘instead of the wicked shall arise the just, and instead of sinners, such as fear to sin.’” — Bishop Lowth. In other words, The church shall be delivered from pernicious men and things, and replenished with sincere and serious believers, and with all sorts of divine graces and blessings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And it shall be to the Lord for a name ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This wonderful change shall bring much honour to that God by whom it is wrought. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For an everlasting sign ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— For a monument, or evident and glorious token of God’s infinite power, faithfulness, and love to his people, unto all succeeding generations; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that shall not be cut off ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Which shall never be abolished, but shall always live and flourish in the minds and mouths of men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "55:6-13 Here is a gracious offer of pardon, and peace, and of all happiness. It shall not be in vain to seek God, now his word is calling to us, and his Spirit is striving with us. But there is a day coming when he will not be found. There may come such a time in this life; it is certain that at death and judgment the door will be shut. There must be not only a change of the way, but a change of the mind. We must alter our judgments about persons and things. It is not enough to break off from evil practices, we must strive against evil thoughts. To repent is to return to our Lord, against whom we have rebelled. If we do so, God will multiply to pardon, as we have multiplied to offend. But let none trifle with this plenteous mercy, or use it as an occasion to sin. Men's thoughts concerning sin, Christ, and holiness, concerning this world and the other, vastly differ from God's; but in nothing more than in the matter of pardon. We forgive, and cannot forget; but when God forgives sin, he remembers it no more. The power of his word in the kingdoms of providence and grace, is as certain as in that of nature. Sacred truth produces a spiritual change in the mind of men, which neither rain nor snow can make on the earth. It shall not return to the Lord without producing important effects. If we take a special view of the church, we shall find what great things God has done, and will do for it. The Jews shall come to their own land; this shall represent the blessings promised. Gospel grace will make a great change in men. Delivered from the wrath to come, the converted sinner finds peace in his conscience; and love constrains him to devote himself to the service of his Redeemer. Instead of being profane, contentious, selfish, or sensual, behold him patient, humble, kind, and peaceable. The hope of helping in such a work should urge us to spread the gospel of salvation. And do thou help us, O Spirit of all truth, to have such views of the fulness, freeness, and greatness of the rich mercy in Christ, as may remove from us all narrow views of sovereign grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For as the rain cometh down - The meaning of this verse and the following is plain. This refers evidently, as the whole passage does, to the times which should succeed the coming of the Messiah. The hearts of people by nature are what the earth would be without the rains of heaven - barren and sterile. But God says that his truth shall certainly accomplish an effect similar to that produced by descending showers. The rain never descends in vain. It makes the earth fertile, beautiful, and lovely. So would it be with his truth in the moral world. The comparison of truth with descending rain or dews is exceedingly beautiful, and occurs not unfrequently in the Bible. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My doctrine shall drop as the rain,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My speech shall distil as the dew,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the small rain upon the tender herb,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as the showers upon the grass.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare 2 Samuel 23:4; Psalm 72:6; Isaiah 5:6; the note at Isaiah 44:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the snow - This is a part of the emblem or symbol designed to denote the fertilizing effect of the truth of God. The snow, as well as the rain, accomplishes important purposes in rendering the earth fertile. It constitutes a covering that contributes to the warmth and preservation of plants and vegetation in the colder latitudes, and on the hills and mountains is accumulated in the winter months to fill the streams, or produce the overflowing of the rivers in the spring and the summer. This expression should not, however, be pressed ad unguem in the interpretation, as if it contained any special spiritual signification. It is a part of the general description of that which descends from heaven to render the earth fertile.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From heaven - From the clouds.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And returneth not thither - That is, not in the form in which they descend on the earth. They return not there as rain and snow. The main idea is, they do not return without accomplishing the effect which God intends.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And bud - Put forth its increase; causes it to sprout up, or germinate. The word 'bud' is applied rather to the small protuberance on the ends of limbs and branches, which contains the germ of the future leaf or flower. This word צמח  tsâmach means rather \"to germinate,\" or to cause to vegetate in general. It is applied to the putting forth of vegetation. on the earth when the showers descend. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And bud - Put forth its increase; causes it to sprout up, or germinate. The word 'bud' is applied rather to the small protuberance on the ends of limbs and branches, which contains the germ of the future leaf or flower. This word צמח  tsâmach means rather \"to germinate,\" or to cause to vegetate in general. It is applied to the putting forth of vegetation. on the earth when the showers descend. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. The hearts of men, once barren of spirituality, shall be made, by the outpouring of the Spirit under Messiah, to bear fruits of righteousness (Isa 5:6; De 32:2; 2Sa 23:4; Ps 72:6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "snow—which covers plants from frost in winter; and, when melted in spring, waters the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "returneth not—void; as in Isa 55:11; it returns not in the same shape, or without \"accomplishing\" the desired end.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "bud—germinate.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the snow, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which in its season contributes to the fruitfulness of the earth as well as the rain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Returneth not thither, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, void, or without effect, as it is expressed in the next verse; or immediately; it is not drawn up again as soon as it is come down, but abides for a convenient time upon the earth, until it do that work for which it was sent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That it may give seed to the sower, and bread to the eater; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that it may bring forth store of bread corn, both for men’s present supplies, and for seed for the next year. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For as the rain cometh down, and the snow from heaven, and returneth not thither,.... Rain and snow come down from the clouds in the heavens, and do not return again until they have done what they are sent to do, or have produced the following effects; otherwise they may be exhaled into vapours, as they often are, and drawn up again by the sun: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but watereth the earth, and maketh it bring forth and bud; or, \"inebriateth the earth\" (n); soaks into it, and reaches the seed that is sown in it, and causes that to spring up, and rise into stalk and ear: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that it may give seed to the sower and bread to the eater; produce a sufficiency for food both for man and beast, and enough for seed to sow the ground with the following year. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(n)        , Sept.; \"sed inebriats\" Pagninus, Junius & Tremellius; \"quin imo inebriavit terram\", Montanus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n)        , Sept.; \"sed inebriats\" Pagninus, Junius & Tremellius; \"quin imo inebriavit terram\", Montanus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For as the rain cometh down, and the snow from heaven, and returneth not thither, but watereth the earth, and maketh it bring forth and bud, that it may give seed to the sower, and bread to the eater:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This purpose of salvation is embodied in the word which goes forth from Jehovah’s mouth. The “word” is conceived as endowed with a self-fulfilling energy (see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and its silent but irresistible efficacy is set forth by a beautiful comparison from nature. The same idea was expressed in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the rain cometh down &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The image is suggested by “the heavens” in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 55:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but watereth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "without having watered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seed to the sower and bread to the eater",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As the rain...  and the snow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rain and the snow are God's ministers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 148:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and go forth from him, just as his word does. They have an appointed work to do, and do not return to him, whose ministers they are, until they have done it. It is best to translate, with Delitzsch and Mr. Cheyne, \"As the rain cometh down, and the snow from heaven, and returneth not thither, except it hath watered the earth,\" etc. The writer is, apparently, aware, as the writer of Ecclesiastes is, that the water which falls from heaven in the shape of rain does return thither again in the shape of vapour (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 55:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This is set forth under a figure drawn from the rain and the snow. \"For as the rain cometh down, and the snow from heaven, and returneth not thither, till it has moistened the earth, and fertilized it, and made it green, and offered seed to the sower and bread to the eater; so will my word be which goeth forth out of my mouth: it will not return to me fruitless, till it has accomplished that which I willed, and prosperously carried out that for which I sent it.\" The rain and snow come down from the sky, and return not thither till they have .... The perfects after אם כּי are all to be understood as such (Ewald, 356, a). Rain and snow return as vapour to the sky, but not without having first of all accomplished the purpose of their descent. And so with the word of Jehovah, which goeth forth out of His mouth (יצא, not יצא, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because it is thought of as still going on in the preaching of the prophet): it will not return without having effected its object, i.e., without having accomplished what was Jehovah's counsel, or \"good pleasure\" - without having attained the end for which it was sent by Jehovah (constr. as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 11:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The word is represented in other places as the messenger of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 147:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The personification presupposes that it is not a mere sound or letter. As it goeth forth out of the mouth of God it acquires shape, and in this shape is hidden a divine life, because of its divine origin; and so it runs, with life from God, endowed with divine power, supplied with divine commissions, like a swift messenger through nature and the world of man, there to melt the ice, as it were, and here to heal and to save; and does not return from its course till it has given effect to the will of the sender. This return of the word to God also presupposes its divine nature. The will of God, which becomes concrete and audible in the word, is the utterance of His nature, and is resolved into that nature again as soon as it is fulfilled. The figures chosen are rich in analogies. As snow and rain are the mediating causes of growth, and therefore the enjoyment of what is reaped; so is the soil of the human heart softened, refreshed, and rendered productive or prolific by the word out of the mouth of Jehovah; and this word furnishes the prophet, who resembles the sower, with the seed which he scatters, and brings with it bread which feeds the souls: for every word that proceedeth out of the mouth of God is bread (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]