[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "While he may be found . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The appeal shows that the promised blessings are not unconditional. There may come a time (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") when “too late will be written on all efforts to gain the inheritance which has been forfeited by neglect (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 55:6-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:6-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seek ye the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Having discoursed of the office and work of Christ, and showed that he should call people and nations to himself and to God, the prophet now endeavours to persuade the people to hearken to his call, and to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seek the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, to labour to get the knowledge of God’s will, and to obtain his grace and favour, neither of which could be obtained save in and through Christ. And this exhortation is general, like that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", intended for all nations, both Jews and Gentiles, implying that both of them had lost the favour and knowledge of God, and were gone astray from him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "While he may be found ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In this day of grace, while he offers mercy and reconciliation, which he will not always do: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 1:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Call upon him while he is near ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Near to you by his gracious presence and his offers in his ordinances, and ready and desirous to receive you to mercy upon the following conditions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let the wicked ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Any wicked man, either Jew or Gentile; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forsake his way ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— His evil or wicked way; his sinful course or manner of life; called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his way, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as being natural, customary, and dear to him, and in opposition to God’s good way. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let him cease to do evil, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Observe well, reader, men’s seeking God in the use of outward means, and even the calling upon him in prayer, will do them no lasting good, unless this be attended with the reformation of their lives; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the unrighteous man his thoughts ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The sinful desires, intentions, and purposes of his mind. Thus he strikes at the root of all sinful actions, and shows that the heart must be changed as well as the outward conduct. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And let him return unto the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As he departed from God by sin, so let him return to him by sincere repentance and faith, productive of new obedience. By this he signifies, that a mere abstinence from wicked courses is not sufficient, without the exercise of the contrary graces and virtues. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And to our God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To the God of Israel, who is, and has shown himself to be, a most merciful and gracious God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for he will abundantly pardon ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He uses so many words and arguments to encourage and lead them to repentance, because the persons here principally addressed had been guilty of idolatry, apostacy, and many other acts of gross wickedness, which he knew, when they came to themselves, and to have a serious sense of their sins, and of the just and holy nature and law of God, would be an insupportable burden to their awakened consciences, and would make them ready to conclude that God would not pardon such horrible delinquencies; in consequence of which they would rather be driven from God, than induced to draw near to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "55:6-13 Here is a gracious offer of pardon, and peace, and of all happiness. It shall not be in vain to seek God, now his word is calling to us, and his Spirit is striving with us. But there is a day coming when he will not be found. There may come such a time in this life; it is certain that at death and judgment the door will be shut. There must be not only a change of the way, but a change of the mind. We must alter our judgments about persons and things. It is not enough to break off from evil practices, we must strive against evil thoughts. To repent is to return to our Lord, against whom we have rebelled. If we do so, God will multiply to pardon, as we have multiplied to offend. But let none trifle with this plenteous mercy, or use it as an occasion to sin. Men's thoughts concerning sin, Christ, and holiness, concerning this world and the other, vastly differ from God's; but in nothing more than in the matter of pardon. We forgive, and cannot forget; but when God forgives sin, he remembers it no more. The power of his word in the kingdoms of providence and grace, is as certain as in that of nature. Sacred truth produces a spiritual change in the mind of men, which neither rain nor snow can make on the earth. It shall not return to the Lord without producing important effects. If we take a special view of the church, we shall find what great things God has done, and will do for it. The Jews shall come to their own land; this shall represent the blessings promised. Gospel grace will make a great change in men. Delivered from the wrath to come, the converted sinner finds peace in his conscience; and love constrains him to devote himself to the service of his Redeemer. Instead of being profane, contentious, selfish, or sensual, behold him patient, humble, kind, and peaceable. The hope of helping in such a work should urge us to spread the gospel of salvation. And do thou help us, O Spirit of all truth, to have such views of the fulness, freeness, and greatness of the rich mercy in Christ, as may remove from us all narrow views of sovereign grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Seek ye the Lord - The commencement of religion in the heart is often represented as seeking for God. or inquiring for his ways ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is to be regarded as addressed not to the Jewish exiles only or uniquely, but to all in view of the coming and work of the Messiah. That work would be so full and ample that an invitation could be extended to all to seek after God, and to return to him. It is implied here:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That people are by nature ignorant of God - since they are directed to 'seek' for him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. That if people will obtain his favor it must be sought. No man becomes his friend without desiring it; no one who does not earnestly seek for it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. That the invitation to seek God should be made to all. In this passage it is unlimited (compare Isaiah 55:7). Where there are sinners, there the invitation is to be offered.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "3. That the invitation to seek God should be made to all. In this passage it is unlimited (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Where there are sinners, there the invitation is to be offered.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "4. That the knowledge of God is of inestimable value. He would not command people to seek that which was worthless; he would not urge it with so much earnestness as is here manifested if it were not of inexpressible importance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "While he may be found - It is implied here:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That God may now be found.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. That the time will come when it will be impossible to obtain his favor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The leading thought is, that under the Messiah the offer of salvation will be made to people fully and freely. But the period will come when it will be withdrawn. If God forsakes human beings; if he wholly withdraws his Spirit; if they have committed the sin which hath never forgiveness; or if they neglect or despise the provisions of mercy and die in their sins, it will be too late, and mercy cannot then be found. How unspeakably important, then, is it to seek for mercy at once - lest, slighted now, the offer should be withdrawn. or lest death should Overtake us, and we be removed to a world where mercy is unknown! How important is the present moment - for another moment may place us beyond the reach of pardon and of grace! How amazing the stupidity of men who suffer their present moments to pass away unimproved, and who, amidst the gaieties and the business of life, permit the day of salvation to pass by, and lose their souls! And how just is the condemnation of the sinner! If a man will not do so simple a thing as to ask for pardon, he ought to perish. The universe will approve the condemnation of such a man; and the voice of complaint can never be raised against that Holy Being who consigns such a sinner to hell.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Call ye upon him - That is, implore his mercy (see Romans 10:13; compare Joel 2:32). How easy are the terms of salvation! How just will be the condemnation of a sinner if he will not call upon God! Assuredly, if people will not breathe out one broken-hearted petition to the God of heaven that they may be saved, they have only to blame themselves if they are lost. The terms of salvation could be made no easier; and man can ask nothing more simple.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Call ye upon him - That is, implore his mercy (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 10:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). How easy are the terms of salvation! How just will be the condemnation of a sinner if he will not call upon God! Assuredly, if people will not breathe out one broken-hearted petition to the God of heaven that they may be saved, they have only to blame themselves if they are lost. The terms of salvation could be made no easier; and man can ask nothing more simple.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "While he is near - In an important sense God is equally near to us at all times. But this figurative language is taken from the mode of speaking among people, and it denotes that there are influences more favorable for seeking him at some periods than others. Thus God comes near to us in the preaching of his word, when it is borne with power to the conscience; in his providences, when he strikes down a friend and comes into the very circle where we move, or the very dwelling where we abide; when he lays his hand upon us in sickness, he is near us by day and by night; in a revival of religion, or when a pious friend pleads with us, God is near to us then, and is calling us to his favor. These are favorable times for salvation; times which, if they are suffered to pass by unimproved, return no more; periods which will all soon be gone, and when they are gone, the sinner irrecoverably dies. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "While he is near - In an important sense God is equally near to us at all times. But this figurative language is taken from the mode of speaking among people, and it denotes that there are influences more favorable for seeking him at some periods than others. Thus God comes near to us in the preaching of his word, when it is borne with power to the conscience; in his providences, when he strikes down a friend and comes into the very circle where we move, or the very dwelling where we abide; when he lays his hand upon us in sickness, he is near us by day and by night; in a revival of religion, or when a pious friend pleads with us, God is near to us then, and is calling us to his favor. These are favorable times for salvation; times which, if they are suffered to pass by unimproved, return no more; periods which will all soon be gone, and when they are gone, the sinner irrecoverably dies. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. The condition and limit in the obtaining of the spiritual benefits (Isa 55:1-3): (1) Seek the Lord. (2) Seek Him while He is to be found (Isa 65:1; Ps 32:6; Mt 25:1-13; Joh 7:34; 8:21; 2Co 6:2; Heb 2:3; 3:13, 15).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "call—casting yourselves wholly on His mercy (Ro 10:13). Stronger than \"seek\"; so \"near\" is more positive than \"while He may be found\" (Ro 10:8, 9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "near—propitious (Ps 34:18; 145:18).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Seek ye the Lord:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " having discoursed of the office and work of Christ, and showed that he should call people and nations to himself, and to God, he now endeavours to persuade the people to hearken to his call, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to seek the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. to labour to get the knowledge of God’s will, and to obtain his grace and favour; neither of which things were to be done but in and through Christ. And this invitation or exhortation is general, like that ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 55:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", reaching to all nations, both Jews and Gentiles, implying that both of them had lost him and his favour, and were gone astray from him. Seek him, ye Gentiles, whom he now inviteth so to do, and will assist in finding him. And seeing the Gentiles seek him earnestly, let their example provoke you Jews to imitate them therein, and take heed that you do not reject him, whom they will receive and own. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "While he may be found; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in this day of grace, whilst he offereth mercy and reconciliation to you; which he will not always do. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 1:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 19:44 2 Corinthians 6:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "While he is near",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; near to you by his gracious presence and offers in his ordinances, ready and desirous to receive you to mercy upon the following conditions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Seek ye the Lord while he may be found,.... The Lord is to be sought unto at all times, whenever the people of God meet together, especially on sabbath days, and while the external ministry of the word lasts, and life itself; so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"seek the fear of the Lord, while ye are alive.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Kimchi compares it with Ecclesiastes 9:10. The Jewish writers, as Aben Ezra and others, generally interpret it before the sealing of the decree, or before the decree is gone forth. It may be understood of place, as well as time, and be rendered, \"seek the Lord in the place where he may be found\" (l); God is to be found, as Aben Ezra observes, in all places, and at all times; under the Old Testament there was a particular place appointed for the worship of God, the tabernacle and temple, where he was to be sought unto, and might be found; under the New Testament, all places are alike, and wherever the church and people of God meet together, there he is to be sought, and there he may be found, even in his house and ordinances: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Kimchi compares it with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Jewish writers, as Aben Ezra and others, generally interpret it before the sealing of the decree, or before the decree is gone forth. It may be understood of place, as well as time, and be rendered, \"seek the Lord in the place where he may be found\" (l); God is to be found, as Aben Ezra observes, in all places, and at all times; under the Old Testament there was a particular place appointed for the worship of God, the tabernacle and temple, where he was to be sought unto, and might be found; under the New Testament, all places are alike, and wherever the church and people of God meet together, there he is to be sought, and there he may be found, even in his house and ordinances: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "call ye upon him while he is near; the same thing designed by different words: seeking and calling design not only prayer, but the whole of public worship, and the time and place when and where the Lord is to be found, and is near. Aben Ezra thinks it refers to the Shechinah in the sanctuary. Perhaps it may have some respect to the time of Christ's incarnation, and his being in the land of Judea; and to the destruction of the temple by the Romans, when the Lord could be no more sought unto, and found in that place; or when the Christians were obliged to move from Jerusalem, because of the siege of it; and when the Jews had no more an opportunity of hearing the Gospel there. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) So in the Jerusalem Talmud, as quoted by Abendana on the place, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"seek the Lord, where he is found, in the synagogues, and in the schools; call upon him, where he is near, in the synagogues, and in the schools.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And so another Jewish writer, mentioned by him, interprets the words, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"whilst the Shechinah is found in the sanctuary; before he hides his face, and causes his Shechinah to remove from you.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"whilst the Shechinah is found in the sanctuary; before he hides his face, and causes his Shechinah to remove from you.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Seek ye the LORD while he may be {i} found, call ye upon him while he is near:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Seek ye the LORD while he may be ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " found, call ye upon him while he is near:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) When he offers himself by the preaching of his word.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6, 7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The call to repentance, because of the nearness of the kingdom of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "while he may be found … while he is near",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] in the “acceptable time” the “day of salvation” (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Comp. further ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Seek ye the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Again the strain changes. The people are once more addressed, but in a tone of reproach. Israel must \"seek the Lord\" without delay, or the opportunity will be past; God will have withdrawn himself from them. He \"will not alway be chiding, neither keepeth he his anger for ever\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 55:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So gracious is the offer which Jehovah now makes to His people, so great are the promises that He makes to it, viz., the regal glory of David, and the government of the world by virtue of the religion of Jehovah. Hence the exhortation is addressed to it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Seek ye Jehovah while He may be found, call ye upon Him while He is near. Let the wicked forsake his way, and the unrighteous man his thoughts: and let him return to Jehovah, and He will have compassion upon him; and to our God, for He will abundantly pardon.\" They are to seek to press into the fellowship of Jehovah (dârash with the radical meaning terere, to acquire experimental knowledge or confidential acquaintance with anything) now that He is to be found (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", compare the parallelism of words and things in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and to call upon Him, viz., for a share in that superabundant grace, ow that He is near, i.e., now that He approaches Israel, and offers it. In the admonition to repentance introduced in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", both sides of the μετάνοια find expression, viz., turning away from sinful self-will, and turning to the God of salvation. The apodosis with its promises commences with וירחמהוּ - then will He have compassion upon such a man; and consequently לסלוח כּי־ירבּה (with כּי because the fragmentary sentence ואל־אלהינוּ did not admit of the continuation with ו) has not a general, but an individual meaning (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is to be translated as a future (for the expression, compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]