[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Falling.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stumbling. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the original of this passage.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "EXPERIENCE, RESOLVE, AND HOPEPsalm 116:8 - Psalm 116:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "EXPERIENCE, RESOLVE, AND HOPE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is a quotation from an earlier psalm, with variations which are interesting, whether we suppose that the Psalmist was quoting from memory and made them unconsciously, or whether, as is more probable, he did so, deliberately and for a purpose. The variations are these. The words in the original psalm {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} according to the Revised Version, read, ‘Thou hast delivered my soul from death; hast Thou not delivered my feet from falling?’ The writer of this psalm felt that that did not say all, so he put in another clause: ‘Thou hast delivered my soul from death, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine eyes from tears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and my feet from falling.’ It is not enough to keep a man alive and upright. God will wipe away his tears; and will often keep him from shedding them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then the original psalm goes on: ‘Thou hast delivered . . . my feet from falling, that I may walk before God,’ but the later Psalmist goes a step further than his original. The first singer had seen what it is always a blessing to see-what God meant by all the varieties of His providences, viz. that the recipient might walk as in His presence; but the later poet not only discerns, but accords with, God’s purpose, yields himself to the divine intention, and instead of simply saying ‘That was what God meant,’ he says, ‘That is what I am going to do-I will walk before the Lord.’ There is still another variation which, however, does not alter the sense. The original psalm says, ‘in the light of the living’; the other uses another word, a little more intelligible, perhaps, to an ordinary reader, and says, ‘in the land of the living.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, noting these significant variations, I would draw attention to this expression of the Psalmist’s acceptance of the divine purpose, and the vision that it gave him of his future. It is hard to say whether he means ‘I will walk’ or ‘I shall walk’; whether he is expressing a hope or giving utterance to a fixed resolve. I think there is an element of both in the words. At all events, I find in them three things: a sure anticipation, a firm resolve, and a far-reaching hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. A sure anticipation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. A sure anticipation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Thou hast’-’I will.’ The past is for this Psalmist a mirror in which he sees reflected the approaching form of the veiled future. God’s past is the guarantee of God’s future. Godless people, who get wearied of the monotony of life, begin to say before they have gone far in it, ‘Oh! there is nothing new. That which is to be hath already been. It is just one continual repetition of the same sort of thing.’ But that is only partially true. There is only one man in the world who can truly and certainly say, ‘To-morrow shall be as this day, and much more abundant’; and that is the man who says; ‘He delivered my soul from death, mine eyes from tears, and my feet from falling.’ For the continuance of things here is not guaranteed to us by the fact that they have lasted for so long. Why, nobody knows whether the sun will rise to-morrow or not-whether there will be a to-morrow or not. There will come one day when the sun sets for the last time. What people call the ‘uniformity of nature’ affords no ground on which to build certainty as to the future. We all do it, but we have no right to do it. But when we bring God into the future, that makes all the difference. His past is the guarantee and the revelation of His future, and every person that grasps Him in faith has the right to pray with assurance, ‘Thou hast been my Helper; leave me not, neither forsake me,’ and to declare triumphantly, ‘The Lord will perfect that which concerneth me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, brethren! all the past, as it is recorded for us in Scripture, lives and throbs with faithful promises for us to-day. Though the methods of the manifestation may alter, the essence of it remains the same. As one of the Apostles says, ‘Whatsoever things were written aforetime were written for our advantage, that we, through the encouragement ministered by the Scriptures, might have hope’; and looking forward into all the future, might discern its wastes unknown, all lighted up by the one glad certainty that He that is ‘the same yesterday and to-day and for ever’ will be there, and we shall be beside Him. What God has done, He will keep on doing. ‘The Lord hath delivered mine eyes from tears, and my feet from falling,’ and therefore ‘I shall walk before the Lord in the land of the living.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our experience yields fuel for our faith. We have been near death many a time; we have never fallen into it. Our eyes have been wet many a time; God has dried them. Our feet have been ready to fall many a time, and if at the moment when we were tottering on the edge of the precipice, we have cried to Him and said, ‘My feet have well-nigh slipped,’ a strong Hand has been held out to us. ‘The Lord upholdeth them that are in the act of falling,’ as the old psalm, rightly rendered, has it, and if we have pushed aside His hand, and gone down, then the next clause of the same verse applies, for He ‘raiseth up those that have fallen,’ and are lying prostrate.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As it has been, so it will be. ‘Thou hast been with me in six troubles,’ therefore ‘in the seventh Thou wilt not forsake me.’ We can wear out men; and we cannot argue that because a man has had long patience with some unworthy recipient of his goodness, his patience will never give out. But it is safe to argue thus about God. ‘I say not unto thee, until seven times, but until seventy times seven’-the two perfect numbers multiplied into each other, and the product again multiplied by one of them, to give the measureless measure of the exhaustless divine love, and the sure guarantee that to His servant ‘to-morrow shall be as this day, and much more abundant.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, again, if we put a little different meaning into the Psalmist’s words {and as I said, I think both meanings lie in them}, they suggest that he did not look forward into the future only with expectation, but that along with expectation there was resolve. So we have here",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. A firm resolve. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. A firm resolve.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘I will walk before the Lord.’ What does ‘walking before the Lord’ mean? There are two or three expressions very like each other, yet entirely different from each other, in the Old and in the New Testament, about this matter. We read of ‘walking with God,’ and of ‘walking before God,’ and of ‘walking after God.’ And whilst there is much that is common to all the expressions, they look at the same idea from different angles. ‘Walking with God,’ communion, fellowship, and companionship are implied there. ‘Walking after God,’ guidance, direction, and example, and our poor imitation and obedience, are most conspicuous there. And ‘walking before God’ means, I suppose, mainly, feeling always that we are in His presence, and have the light of His face, and the glance of His all-seeing eye, falling upon us. ‘If I take the wings of the morning, and fly into the uttermost parts of the sea, Thou art there.’ ‘Thou art acquainted with all my ways, search me, O God!’ That is walking before God. To put it into colder words, it means the habitual-I do not say unbroken, but habitual-effort to feel in our conscious hearts that we are in His sight; not only that we are with Him, but that we are ‘naked and open to the eyes of Him with whom we have to do.’ And that is to be the result, says our psalm, as it is the intention, of all that God has been doing with us in His merciful providence, in His quickening, sustaining, and comforting influences in the past. He sent all these varying conditions, kept the psalmist alive, kept him from weeping, or dried his tears, kept him from falling, with the intention that he should be continually blessed in the continuous sunshine of God’s presence, and should open out his heart in it and for it, like a flower when the sunbeams strike it. Oh! how different life would look if we habitually took hold of all its incidents by that handle, and thought about them, not as we are accustomed to do, according to whether they tended to make us glad or sorry, to disappoint or fulfil our hopes and purposes, but looked upon them all as stages in our education, and as intended, if I might so say, to force us, when the tempests blow, close up against God; and when the sunshine came, to woo us to His side. Would not all life change its aspect if we carried that thought right into it, and did not only keep it for Sundays, or for the crises of our lives, but looked at all the trifles as so many magnets brought into action by Him to attract us to Himself? Dear brother, it is not enough to recognise God’s purpose, we must fall in with it, accept the intention, and co-operate with God in fulfilling it. It is a matter of purity and of piety, to say, ‘Thou hast delivered my soul from death, that I may walk before Thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there has to be something more. There have to be a firm resolve, and effort without which the firmest resolve will all come to nothing, and be one more paving-stone for the road that is ‘paved with good intentions.’ That firm resolve finds utterance in the not vain vow, ‘I will’-in spite of all opposition and difficulties-’I will walk before the Lord,’ and keep ever bright in my mind the thought, ‘Thou God seest me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ay! and just in the measure in which we do so shall we have joy. In some of those inhuman prisons where they go in for solitary confinement, there is a little hole somewhere in the wall-the prisoner does not know where-at which at any moment in the four-and-twenty hours the eye of the gaoler may be, and they say that the thought of that unseen eye, glaring in upon the felons, drives some of them half mad. The thought that poor Hagar found to be her only comfort in the wilderness-and so christened the well after it-’Thou God seest me,’ must be the source of our purest joy; or it must be a ghastly dread. When He comes at last, some men will lift up their faces to the sunshine and have their faces irradiated by the light; and some will call on the rocks and the hills to cover them from His face, and prefer rather to be crushed than to be blasted by the brightness of His countenance. If we are right with God, then the gladdest of thoughts is, ‘Thou knowest me altogether, and Thou hast beset me behind and before.’ If we are right with God, ‘Thou hast laid Thine hand upon me’ will mean for us support and blessing. If we are wrong, it will mean a weight that crushes to the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And if we are right with Him, that same thought brings with it security and companionship. Ah! we do not need ever to say ‘I am alone’ if we are walking before God. It brings with it, of course, an armour against temptation. What mean, lustful, worldly seduction has any power when a man falls back on the thought, ‘God sees me, and God is with me’? Do you remember the very first instance in Scripture of the use of this phrase? The Lord said unto Abraham, ‘Walk before Me, and be thou perfect.’ That was not only a commandment, but it was a promise, and we might as truly, for the sense of the passage, read, ‘Walk before Me, and thou shalt be perfect.’ That thought of the present God draws the teeth of all raging lions, and takes the stings out of all serpents, and paralyses and reduces to absolute nothingness every temptation. Clasp God’s hand, and you will not fall.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. There is lastly here, a far-reaching hope. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. There is lastly here, a far-reaching hope.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I do not know whether the Psalmist had any notion of any land of the living except the land of Earth, where men pass their natural lives. I almost think that both he and his brother, whose words he was imitating, had some glimpse of a future life of closer union, when eyes should no more weep nor feet fall. At any rate, you and I cannot help reading that hope into his words. When we read, ‘I will walk before the Lord in the land of the living,’ we cannot but think of the true and perfect deliverance, when it shall be said, with a depth and a fulness of meaning with which it is never said here, ‘Thou hast delivered my soul from death,’ and the black dread that towered so high, and closed the vista of all human expectation of the future, is now away back in the past, hull-down on the horizon as they say about ships scarcely visible, and no more to be feared. We cannot but think of the perfect deliverance of ‘mine eyes from tears,’ when ‘God shall wipe away the tears from off all faces, and the rebuke of His people from off all the earth.’ We cannot but think of the perfect deliverance of ‘my feet from falling’ when the redeemed of the Lord shall stand firm, and walk at liberty on the golden pavements, and no more dread the stumbling-blocks of earth. We cannot but think of the perfect presence of God, the perfect consciousness that we are near Him, when He shall ‘present us faultless before the presence of His glory with exceeding joy.’ We cannot but think of the perfect activity of that future state when we ‘shall walk with Him in white,’ and ‘follow the Lamb whithersoever He goeth.’ And one guarantee for all that far-reaching hope is in the tiny experiences of the present; for He who hath delivered our souls from death, our eyes from tears, and our feet from falling, is not going to expose Himself to the scoff, ‘This “God” began to build, and was not able to finish.’ But He will complete that which He has begun, and will not stay His hand until all His children are perfectly redeemed and perfectly conscious of His perfect Presence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "116:1-9 We have many reasons for loving the Lord, but are most affected by his loving-kindness when relieved out of deep distress. When a poor sinner is awakened to a sense of his state, and fears that he must soon sink under the just wrath of God, then he finds trouble and sorrow. But let all such call upon the Lord to deliver their souls, and they will find him gracious and true to his promise. Neither ignorance nor guilt will hinder their salvation, when they put their trust in the Lord. Let us all speak of God as we have found him; and have we ever found him otherwise than just and good? It is of his mercies that we are not consumed. Let those who labour and are heavy laden come to him, that they may find rest to their souls; and if at all drawn from their rest, let them haste to return, remembering how bountifully the Lord has dealt with them. We should deem ourselves bound to walk as in his presence. It is a great mercy to be kept from being swallowed up with over-much sorrow. It is a great mercy for God to hold us by the right hand, so that we are not overcome and overthrown by a temptation. But when we enter the heavenly rest, deliverance from sin and sorrow will be complete; we shall behold the glory of the Lord, and walk in his presence with delight we cannot now conceive.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou hast delivered my soul from death - My life. Thou hast saved me from death. This is such language as would be used by one who had been dangerously ill, and who had been restored again to health.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mine eyes from tears - Tears which he had shed in his sickness, and in the apprehension of dying. It may refer to tears shed on other occasions, but it is most natural to refer it to this. Compare the notes at Psalm 6:6.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Mine eyes from tears - Tears which he had shed in his sickness, and in the apprehension of dying. It may refer to tears shed on other occasions, but it is most natural to refer it to this. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And my feet from falling - From stumbling. That is, he had not, as it were, fallen by the way, and been rendered unable to pursue the journey of life. All this seems to refer to one occasion - to a time of dangerous illness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And my feet from falling - From stumbling. That is, he had not, as it were, fallen by the way, and been rendered unable to pursue the journey of life. All this seems to refer to one occasion - to a time of dangerous illness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5-8. The relief which he asked is the result not of his merit, but of God's known pity and tenderness, which is acknowledged in assuring himself (his \"soul,\" Ps 11:1; 16:10) of rest and peace. All calamities [Ps 116:8] are represented by death, tears, and falling of the feet (Ps 56:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My soul; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " myself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From falling, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, into mischief, and the pit of destruction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou hast delivered my soul from death,.... From a corporeal death, when his life was in danger, surrounded by Saul's army, in the hand of the Philistines at Gath, and when his son rebelled against him; and from a spiritual death in regeneration, which is a passing from death to life; and from an eternal death, the just wages of sin: and not only so, but even ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "mine eyes from tears; they were sometimes full of, and shed in great plenty; he watered his couch with them; and especially when absent from the worship of the Lord, and without his presence, which his enemies sometimes reproached him with; and particularly when he fled before his rebellious son, and at the death of him; but God dried up all his tears; see Psalm 6:6. Many are the occasions of the saints weeping as they pass through the valley of \"Baca\", but God will wipe away all tears from their eyes. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "mine eyes from tears; they were sometimes full of, and shed in great plenty; he watered his couch with them; and especially when absent from the worship of the Lord, and without his presence, which his enemies sometimes reproached him with; and particularly when he fled before his rebellious son, and at the death of him; but God dried up all his tears; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Many are the occasions of the saints weeping as they pass through the valley of \"Baca\", but God will wipe away all tears from their eyes. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And my feet from falling through a \"push\" (l), by an enemy, so as to fall; the people of God are liable to falling, both into sin and into calamity; it is the Lord only that keeps them; and which they may expect from their interest in his love, covenant, and promises, and from their being in the hands of Christ; see Psalm 56:13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And my feet from falling through a \"push\" (l), by an enemy, so as to fall; the people of God are liable to falling, both into sin and into calamity; it is the Lord only that keeps them; and which they may expect from their interest in his love, covenant, and promises, and from their being in the hands of Christ; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) \"ab impulsu\", Montanus; \"ab impulsione\", Cocceius, Gejerus, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) \"ab impulsu\", Montanus; \"ab impulsione\", Cocceius, Gejerus, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For thou hast delivered my soul from death, mine eyes from tears, and my feet from falling.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Taken almost verbatim from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (hence the transition to the second person), with the change of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "light",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", suggested by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The free and joyous service of God in the land of life and light is the contrast to that paralysis of existence in Sheol which he had dreaded. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For thou hast delivered my soul from death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This verse is exegetical of the last clause of ver. 4. The expressions are taken from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and suit a personal better than a national deliverance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Mine eyes from tears.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hezekiah, when told that his death was approaching, had \"wept sore\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And my feet from falling",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and my foot from slipping",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " When man is greatly tried, there is always danger lest his foot should slip. Whether the trial befall an individual or a nation, there is the same temptation to rebel and murmur. Psalm 116:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With \"gracious\" and \"compassionate\" is here associated, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 112:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the term \"righteous,\" which comprehends within itself everything that Jahve asserts concerning Himself in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". from the words \"and abundant in goodness and truth\" onwards. His love is turned especially toward the simple (lxx τὰ νήπια, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), who stand in need of His protection and give themselves over to it. פּתאים, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is a mode of writing blended out of פּתאים and פּתיים. The poet also has experienced this love in a time of impotent need. דּלּותי is accented on the ultima here, and not as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 142:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the penult. The accentuation is regulated by some phonetic or rhythmical law that has not yet been made clear (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The national grammarians, so far as we are acquainted with them, furnish no explanation. De Balmis believes that these Milra forms דּלּותי, בּלּותי, and the like, must be regarded as infinitives, but at the same time confirms the difference of views existing on this point.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "יהושׁיע is a resolved Hiphil form, the use of which became common in the later period of the language, but is not alien to the earlier period, especially in poetry (Psalm 45:18, cf. Psalm 81:6; 1 Samuel 17:47; Isaiah 52:5). In Psalm 116:7 we hear the form of soliloquy which has become familiar to us from Psalm 42:1; Psalm 103. שׁוּבי is Milra here, as also in two other instances. The plural מנוּחים signifies full, complete rest, as it is found only in God; and the suffix in the address to the soul is ajchi for ajich, as in Psalm 103:3-5. The perfect גּמל states that which is a matter of actual experience, and is corroborated in Psalm 116:8 in retrospective perfects. In Psalm 116:8-9 we hear Psalm 56:14 again amplified; and if we add Psalm 27:13, then we see as it were to the bottom of the origin of the poet's thoughts. מן־דּמעה belongs still more decidedly than יהושׁיע to the resolved forms which multiply in the later period of the language. In Psalm 116:9 the poet declares the result of the divine deliverance. The Hithpa. אתהלּך denotes a free and contented going to and fro; and instead of \"the land of the living,\" Psalm 27:13, the expression here is \"the lands (ארצות), i.e., the broad land, of the living.\" There he walks forth, with nothing to hinder his feet or limit his view, in the presence of Jahve, i.e., having his Deliverer from death ever before his eyes. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "יהושׁיע is a resolved Hiphil form, the use of which became common in the later period of the language, but is not alien to the earlier period, especially in poetry (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:47",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we hear the form of soliloquy which has become familiar to us from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". שׁוּבי is Milra here, as also in two other instances. The plural מנוּחים signifies full, complete rest, as it is found only in God; and the suffix in the address to the soul is ajchi for ajich, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103:3-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The perfect גּמל states that which is a matter of actual experience, and is corroborated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in retrospective perfects. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:8-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we hear ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " again amplified; and if we add ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", then we see as it were to the bottom of the origin of the poet's thoughts. מן־דּמעה belongs still more decidedly than יהושׁיע to the resolved forms which multiply in the later period of the language. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 116:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the poet declares the result of the divine deliverance. The Hithpa. אתהלּך denotes a free and contented going to and fro; and instead of \"the land of the living,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the expression here is \"the lands (ארצות), i.e., the broad land, of the living.\" There he walks forth, with nothing to hinder his feet or limit his view, in the presence of Jahve, i.e., having his Deliverer from death ever before his eyes. ",
            "children": []
          }
        ]
      }
    ]
  }
]