[{"num":12,"verse":"1 Of the deliverance of the Church by Christ."},{"num":1,"verse":"And at that time shall Michael stand up, the great prince, which standeth for the children of thy people, and there shall be a time of trouble, such as never was since there began to be a nation unto that same time: and at that time thy people shall be delivered, everyone that shall be found written in the book."},{"num":2,"verse":"And many of them that sleep in the dust of the earth, shall awake, some to everlasting life, and some to shame and perpetual contempt."},{"num":3,"verse":"And they that be wise, shall shine, as the brightness of the firmament: and they that turn many to righteousness, shall shine as the stars, forever and ever."},{"num":4,"verse":"But thou, O Daniel, shut up the words, and seal the book till the end of the time: many shall run to and fro, and knowledge shall be increased."},{"num":5,"verse":"¶ Then I Daniel looked, and behold, there stood other two, the one on this side of the brink of the river, and the other on that side of the brink of the river."},{"num":6,"verse":"And one said unto the man clothed in linen, which was upon the waters of the river, When shall be the end of these wonders?"},{"num":7,"verse":"And I heard the man clothed in linen which was upon the waters of the river, when he held up his right hand, and his left hand unto heaven, and sware by him that liveth forever, that it shall tarry for a time two times and an half: and when he shall have accomplished to scatter the power of the holy people, all these things shall be finished."},{"num":8,"verse":"Then I heard it, but I understood it not: then said I, O my Lord, what shall be the end of these things?"},{"num":9,"verse":"And he said, Go thy way, Daniel: for the words are closed up, and sealed, till the end of the time."},{"num":10,"verse":"Many shall be purified, made white, and tried: but the wicked shall do wickedly, and none of the wicked shall have understanding: but the wise shall understand."},{"num":11,"verse":"And from the time that the daily sacrifice shall be taken away, and the abominable desolation set up, there shall be a thousand, two hundred and ninety days."},{"num":12,"verse":"Blessed is he that waiteth and cometh to the thousand, three hundred and five and thirty days."},{"num":13,"verse":"But go thou thy way till the end be: for thou shalt rest and stand up in thy lot, at the end of the days."}]