[{"num":12,"verse":"⌞The person who looked like a human continued,⌟ “At that time Michael, the great commander, will stand up on behalf of the descendants of your people. It will be a time of trouble unlike any that has existed from the time there have been nations until that time. But at that time your people, everyone written in the book, will be rescued. "},{"num":2,"verse":"Many sleeping in the ground will wake up. Some will wake up to live forever, but others will wake up to be ashamed and disgraced forever. "},{"num":3,"verse":"Those who are wise will shine like the brightness on the horizon. Those who lead many people to righteousness will shine like the stars forever and ever."},{"num":4,"verse":"“But you, Daniel, keep these words secret, and seal the book until the end times. Many will travel everywhere, and knowledge will grow.”"},{"header":"The Words Are Sealed Up"},{"num":5,"verse":"When I, Daniel, looked up, I saw two men standing there. One man stood on one side of the river, and the other one stood on the other side. "},{"num":6,"verse":"One of them asked the man dressed in linen clothes who was above the river, “How long will it be until these miracles are over?” "},{"num":7,"verse":"I heard the man dressed in linen clothes who was above the river. He raised his right hand and left hand to heaven and swore an oath by the one who lives forever. He said, “It will be for a time, times, and half of a time. When the power of the holy people has been completely shattered, then all these things will be finished.”"},{"num":8,"verse":"I heard him, but I did not understand. So I asked him, “Sir, how will these things end?”"},{"num":9,"verse":"He replied, “Go, Daniel. These words are to be kept secret and sealed until the end times. "},{"num":10,"verse":"Many will be purified, made white, and refined. But wicked people will do wicked things, and none of them will understand. Only wise people will understand. "},{"num":11,"verse":"From the time the daily burnt offering is taken away and the disgusting thing that causes destruction is set up, there will be 1,290 days. "},{"num":12,"verse":"Blessed are those who wait until they reach 1,335 days. "},{"num":13,"verse":"But go on until the end. You will rest, and you will rise for your inheritance at the end of time.”"}]