[{"num":12,"verse":"“At that time Michael, the mighty angelic prince who stands guard over your nation, will stand up and fight for you in heaven against satanic forces, and there will be a time of anguish for the Jews greater than any previous suffering in Jewish history. And yet every one of your people whose names are written in the Book will endure it."},{"num":2,"verse":"“And many of those whose bodies lie dead and buried will rise up, some to everlasting life and some to shame and everlasting contempt."},{"num":3,"verse":"“And those who are wise—the people of God—shall shine as brightly as the sun’s brilliance, and those who turn many to righteousness will glitter like stars forever."},{"num":4,"verse":"“But Daniel, keep this prophecy a secret; seal it up so that it will not be understood until the end times, when travel and education shall be vastly increased!”"},{"num":5,"verse":"Then I, Daniel, looked and saw two men on each bank of a river. "},{"num":6,"verse":"And one of them asked the man in linen robes who was standing now above the river, “How long will it be until all these terrors end?”"},{"num":7,"verse":"He replied, with both hands lifted to heaven, taking oath by him who lives forever and ever, that they will not end until three and a half years after the power of God’s people has been crushed."},{"num":8,"verse":"I heard what he said, but I didn’t understand what he meant. So I said, “Sir, how will all this finally end?”"},{"num":9,"verse":"But he said, “Go now, Daniel, for what I have said is not to be understood until the time of the end. "},{"num":10,"verse":"Many shall be purified by great trials and persecutions. But the wicked shall continue in their wickedness, and none of them will understand. Only those who are willing to learn will know what it means."},{"num":11,"verse":"“From the time the daily sacrifice is taken away and the Horrible Thing is set up to be worshiped, there will be 1,290 days. "},{"num":12,"verse":"And blessed are those who wait and remain until the 1,335th day!"},{"num":13,"verse":"“But go on now to the end of your life and your rest; for you will rise again and have your full share of those last days.”"}]