[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But all these.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Again, in striking contrast to the great varieties of gifts, the common source of them all is emphatically repeated. The Corinthians estimated these gifts variously, according to their variety in operation. The Apostle estimates their common value as proceeding from the One Spirit, distributed according to His will. Those who valued men more or less according to the kind of gift they possessed were really, if unconsciously, criticising the giver.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-11 Spiritual gifts were extraordinary powers bestowed in the first ages, to convince unbelievers, and to spread the gospel. Gifts and graces greatly differ. Both were freely given of God. But where grace is given, it is for the salvation of those who have it. Gifts are for the advantage and salvation of others; and there may be great gifts where there is no grace. The extraordinary gifts of the Holy Spirit were chiefly exercised in the public assemblies, where the Corinthians seem to have made displays of them, wanting in the spirit of piety, and of Christian love. While heathens, they had not been influenced by the Spirit of Christ. No man can call Christ Lord, with believing dependence upon him, unless that faith is wrought by the Holy Ghost. No man could believe with his heart, or prove by a miracle, that Jesus was Christ, unless by the Holy Ghost. There are various gifts, and various offices to perform, but all proceed from one God, one Lord, one Spirit; that is, from the Father, Son, and Holy Ghost, the origin of all spiritual blessings. No man has them merely for himself. The more he profits others, the more will they turn to his own account. The gifts mentioned appear to mean exact understanding, and uttering the doctrines of the Christian religion; the knowledge of mysteries, and skill to give advice and counsel. Also the gift of healing the sick, the working of miracles, and to explain Scripture by a peculiar gift of the Spirit, and ability to speak and interpret languages. If we have any knowledge of the truth, or any power to make it known, we must give all the glory of God. The greater the gifts are, the more the possessor is exposed to temptations, and the larger is the measure of grace needed to keep him humble and spiritual; and he will meet with more painful experiences and humbling dispensations. We have little cause to glory in any gifts bestowed on us, or to despise those who have them not.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But all these - All these various endowments.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Worketh - Produces. All these are to be traced to him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That one and the self-same Spirit - The Holy Spirit, Acts 2. They were all, though so different in themselves, to be traced to the Holy Spirit, just as all the natural endowments of people - their strength, memory, judgment, etc. - though so various in themselves are to be traced to the same God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That one and the self-same Spirit - The Holy Spirit, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They were all, though so different in themselves, to be traced to the Holy Spirit, just as all the natural endowments of people - their strength, memory, judgment, etc. - though so various in themselves are to be traced to the same God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Dividing to every man severally - Conferring on each one as he pleases. He confers on each one that which he sees to be best, and most wise, and proper.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As he will - As he chooses or as in his view seems best. Dr. Doddridge remarks, that this word does \"not so much express arbitrary pleasure, as a determination founded on \"wise\" counsel.\" It implies, however, that he does it as a sovereign; as he sees to be right and best. He distributes these favors as to him seems best adapted to promote the welfare of the whole church and to advance his cause. Some of the doctrines which are taught by this verse are the following:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) The Holy Spirit is a \"person.\" For, he acts as a person; distributes favors, confers endowments and special mercies \"as he will.\" This proves that he is, in some respects, distinguished from the Father and the Son. It would be absurd to say of an \"attribute\" of God, that it confers favors, and distributes the various endowments of speaking with tongues, and raising the dead. And if so, then the Holy Spirit is \"not\" an attribute of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) he is a sovereign. He gives to all as he pleases. In regard to spiritual endowments of the highest order, he deals with people as he does in the common endowments bestowed upon people, and as he does in temporal blessings. He does not bestow the same blessings on all, nor make all alike. He dispenses his favors by a rule which he has not made known, but which, we may be assured, is in accordance with wisdom and goodness. He wrongs no one; and he gives to all the favors which might be connected with eternal life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) no man should be proud of his endowments. Whatever they may be, they are the gifts of God, bestowed by his sovereign will and mercy. But assuredly we should not be proud of that which is the mere \"gift\" of another, and which has been bestowed, not in consequence of any merit of ours, but according to his mere sovereign will.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) no man should be depressed, or should despise his own gifts, however humble they may be. In their own place, they may be as important as the higher endowments of others. That God has placed him where he is, or has given less splendid endowments than he has to others, is no fault of his. There is no crime in it; and he should, therefore, strive to improve his \"one talent,\" and to make himself useful in the rank where he is placed. And,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) No man should despise another because be is in a more bumble rank, or is less favored than himself. God has made the difference, and we should respect and honor his arrangements, and should show that \"respect\" and \"honor\" by regarding with kindness, and treating as fellow laborers with us, all who occupy a more humble rank than we do. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(5) No man should despise another because be is in a more bumble rank, or is less favored than himself. God has made the difference, and we should respect and honor his arrangements, and should show that \"respect\" and \"honor\" by regarding with kindness, and treating as fellow laborers with us, all who occupy a more humble rank than we do. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. as he will—(1Co 12:18; Heb 2:4).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Though the Spirit of God be but one, from whom these several powers and abilities flow; yet he doth not give all this variety of gifts to all Christians, but one to this man, another to another, as the same Holy Spirit pleaseth, for the glory of God, or the good of the church. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But all these worketh that one and the selfsame Spirit,.... Though these gifts, ministrations, and operations, are so different in themselves, and are bestowed upon different persons, yet they are all wrought by one and the same Spirit of God, who is the true Jehovah, and properly God, as these his works declare; for who, but the most high God, could ever communicate such gifts to men? ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Dividing to every man severally as he will; giving one man this gift, and another that; imparting such a measure to one, and such a portion to another, just as seems good in his sight. For as his special grace in regeneration is dispensed when and where, and to whom he pleases, signified by the blowing of the wind where it listeth, John 3:8 so his gifts, ordinary and extraordinary, are severally distributed, according to his sovereign will and pleasure. This is a clear and full proof of the personality of the Spirit, who is not only distinguished from his gifts, and the distribution of them, which is a personal act described to him; but this is said to be done according to his will, which supposes him an intelligent agent, capable of choosing and willing; and whose will agrees with the Father's, and with the Son's. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Dividing to every man severally as he will; giving one man this gift, and another that; imparting such a measure to one, and such a portion to another, just as seems good in his sight. For as his special grace in regeneration is dispensed when and where, and to whom he pleases, signified by the blowing of the wind where it listeth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " so his gifts, ordinary and extraordinary, are severally distributed, according to his sovereign will and pleasure. This is a clear and full proof of the personality of the Spirit, who is not only distinguished from his gifts, and the distribution of them, which is a personal act described to him; but this is said to be done according to his will, which supposes him an intelligent agent, capable of choosing and willing; and whose will agrees with the Father's, and with the Son's. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But all these worketh that one and the selfsame Spirit, dividing to every man severally {6} as he will.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But all these worketh that one and the selfsame Spirit, dividing to every man severally ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{6}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as he will.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) He adds moreover somewhat else, that is, that although these gifts are unequal, yet they are most wisely divided, because the will of the Spirit of God is the rule of this distribution.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Amid all this diversity, however, what unity of the operative principle!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐνεργεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] namely, as the divine power endowing the different individuals differently. See what follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Διάφοροι μὲν οἱ κρουνοὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μία δὲ πάντως πηγή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Theodoret.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἰδίᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] seorsim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "severally",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See Bernhardy, p. 185. Comp Plato, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Menex.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 249 B: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἅπερ ἰδίᾳ ἑκάστῳ ἴδια γίγνεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Pind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " iii. 42; and very often in classical writers. Elsewhere in the N. T.: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατʼ ἰδίαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καθὼς βούλεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] not: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "arbitrarily",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but (comp on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in accordance with the determination of His will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which by no means precludes this divine self-determining action of the Holy Spirit from proceeding in a manner corresponding to the natural and general Christian capacity, and to the peculiar disposition and tendency of the minds, of men. Hence, on the one hand, the possibility that, from the human side, particular charismata may be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "obtained by effort",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and also, on the other hand, the duty of not estimating slightly the gifts of others. Observe, further, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καθὼς βούλεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "personality",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sums up the last par. (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:4-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), impressing on the Cor[1869] with redoubled emphasis the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "variety in unity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the “gifts,” and vindicating the sanctity of each: “But all these things worketh the one and the same Spirit” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the qualifying clause, “dividing separately (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seorsim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as He wills,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαίρουν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " takes up the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαιρέσεις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:4-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑκάστῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is resumed from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἰδίᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " adds the thought that the Spirit deals with each recipient by himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "individually",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "appropriately",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); while ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καθὼς βούλεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signifies that He acts in the distribution upon His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "choice and judgment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where lies the hidden reason for the giving or withholding of each particular gift.—For ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βούλομαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see parls.; and for its difference from ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐθέλω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 4:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and parls. Eurip., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hippol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., 1329 f., supplies a good example of the distinction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐδεὶς ἀπαντᾶν βούλεται προθυμίᾳ τῇ τοῦ θέλοντος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀλλʼ ἀφιστάμεθʼ ἀεί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “None of us ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "likes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to cross the purpose of one that is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on anything, but we always stand aside”. No predicate could more strongly imply ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "personality",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " than does ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βούλεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1869] Corinth, Corinthian or Corinthians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but all these worketh that one and the selfsame Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This consideration absolutely excludes all boasting, all possibility of setting up one gift as essentially superior to another. It is worthy of remark that what is predicated of God in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Corinthians 12:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 12:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is here predicated of His Spirit. The word translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "worketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the same in both places. “The Spirit worketh, not is worked. He worketh as He will, not as He is bidden.”—St Chrysostom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dividing to every man severally as he will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Βούλεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wills) the Spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as God willed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", He gives the several gifts, or some gifts, in various measures, to the several individuals.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "One and the selfsame Spirit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The unity of the source from which all the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "charisms",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " flowed ought to have excluded the possibility of a boastful ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "comparison",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of gifts, arid all depreciation of those gifts which, because they were less dazzling, were deemed inferior. St. Paul afterwards shows that the less dazzling might be infinitely the more valuable for purposes of spiritual edification. 1 Corinthians 12:11",
        "children": []
      }
    ]
  }
]