[{"num":4,"verse":"5 The offices of the Levites, when the host removed. 6 The number of the three families of Kohath, Gershon, and Merari."},{"num":1,"verse":"And the Lord spake unto Moses, and to Aaron, saying,"},{"num":2,"verse":"Take the sum of the sons of Kohath from among the sons of Levi, after their families, and houses of their fathers,"},{"num":3,"verse":"From thirty years old and above, even until fifty years old all that enter into the assembly to do the work in the Tabernacle of the Congregation."},{"num":4,"verse":"This shall be the office of the sons of Kohath in the Tabernacle of the Congregation about the holiest of all."},{"num":5,"verse":"¶ When the host removeth, then Aaron and his sons shall come and take down the covering veil, and shall cover the Ark of the Testimony therewith."},{"num":6,"verse":"And they shall put thereon a covering of badger’s skins, and shall spread upon it a cloth altogether of blue silk, and put to the bars thereof:"},{"num":7,"verse":"And upon the table of show bread, they shall spread a cloth of blue silk, and put thereon the dishes, and the incense cups and goblets, and coverings to cover it with, and the bread shall be thereon continually."},{"num":8,"verse":"And they shall spread upon them a covering of scarlet, and cover the same with a covering of badger’s skins, and put to the bars thereof."},{"num":9,"verse":"Then they shall take a cloth of blue silk, and cover the candlestick of light with his lamps, and his snuffers, and his snuffdishes, and all the oil vessels thereof, which they occupy about it."},{"num":10,"verse":"So they shall put it, and all the instruments thereof in a covering of badger’s skins, and put it upon the bars."},{"num":11,"verse":"Also upon the golden altar they shall spread a cloth of blue silk, and cover it with a covering of badger’s skins, and put to the bars thereof."},{"num":12,"verse":"And they shall take all the instruments of the ministry, wherewith they minister in the Sanctuary, and put them in a cloth of blue silk, and cover them with a covering of badger’s skins, and put them on the bars."},{"num":13,"verse":"Also they shall take away the ashes from the altar, and spread a purple cloth upon it,"},{"num":14,"verse":"And shall put upon it all the instruments thereof, which they occupy about it, the censers, the fleshhooks, and the besoms, and the basins, even all the instruments of the altar: and they shall spread upon it a covering of badger’s skins, and put to the bars of it."},{"num":15,"verse":"And when Aaron and his sons have made an end of covering the Sanctuary, and all the instruments of the Sanctuary, at the removing of the host, afterward the sons of Kohath shall come to bear it, but they shall not touch any holy thing lest they die. This is the charge of the sons of Kohath in the Tabernacle of the Congregation."},{"num":16,"verse":"¶ And to the office of Eleazar the son of Aaron the Priest pertaineth the oil for the light, and the sweet incense, and the daily meat offering, and the anointing oil with the oversight of all the Tabernacle, and of all that therein is, both in the Sanctuary, and in all the instruments thereof."},{"num":17,"verse":"¶ And the Lord spake unto Moses and to Aaron, saying,"},{"num":18,"verse":"Ye shall not cut off the tribe of the families of the Kohathites from among the Levites:"},{"num":19,"verse":"But thus do unto them that they may live and not die, when they come near to the most holy things: let Aaron and his sons come and appoint them, every one to his office, and to his charge."},{"num":20,"verse":"But let them not go in, to see when the Sanctuary is folden up, lest they die."},{"num":21,"verse":"¶ And the Lord spake unto Moses, saying,"},{"num":22,"verse":"Take also the sum of the sons of Gershon, every one by the houses of their fathers, throughout their families:"},{"num":23,"verse":"From thirty years old and above until fifty years old shalt thou number them, all that enter into the assembly for to do service in the Tabernacle of the Congregation."},{"num":24,"verse":"This shall be the service of the families of the Gershonites to serve and to bear."},{"num":25,"verse":"They shall bear the curtains of the Tabernacle, and the Tabernacle of the Congregation, his covering, and the covering of badger’s skins, that is on high upon it, and the veil of the door of the Tabernacle of the Congregation."},{"num":26,"verse":"The curtains also of the court, and the veil of the entering in of the gate of the court, which is near the Tabernacle and near the altar round about, with their cords: and all the instruments for their service, and all that is made for them: so shall they serve."},{"num":27,"verse":"At the commandment of Aaron and his sons shall all the service of the sons of the Gershonites be done, in all their charges and in all their service, and ye shall appoint them to keep all their charges."},{"num":28,"verse":"This is the service of the families of the sons of the Gershonites in the Tabernacle of the Congregation, and their watch shall be under the hand of Ithamar the son of Aaron the Priest."},{"num":29,"verse":"¶ Thou shalt number the sons of Merari by their families, and by the houses of their fathers."},{"num":30,"verse":"From thirty years old and above, even unto fifty years old shalt thou number them, all that enter into the assembly, to do the service of the Tabernacle of the Congregation."},{"num":31,"verse":"And this is their office and charge according to all their service in the Tabernacle of the Congregation: the boards of the Tabernacle with the bars thereof, and his pillars, and his sockets,"},{"num":32,"verse":"And the pillars round about the court, with their sockets and their pins, and their cords with all their instruments, even for all their service: and by name ye shall reckon the instruments of their office and charge."},{"num":33,"verse":"This is the service of the families of the sons of Merari, according to all their service in the Tabernacle of the Congregation under the hand of Ithamar the son of Aaron the Priest."},{"num":34,"verse":"¶ Then Moses and Aaron and the princes of the Congregation numbered the sons of the Kohathites, by their families and by the houses of their fathers,"},{"num":35,"verse":"From thirty years old and above, even unto fifty years old, all that enter into the assembly for the service of the Tabernacle of the Congregation."},{"num":36,"verse":"So the numbers of them throughout their families were two thousand, seven hundred and fifty."},{"num":37,"verse":"These are the numbers of the families of the Kohathites, all that serve in the Tabernacle of the Congregation, which Moses and Aaron did number according to the commandment of the Lord by the hand of Moses."},{"num":38,"verse":"Also the numbers of the sons of Gershon throughout their families and houses of their fathers,"},{"num":39,"verse":"From thirty years old and upward, even unto fifty years old: all that enter into the assembly for the service of the Tabernacle of the Congregation."},{"num":40,"verse":"So the numbers of them by their families, and by the houses of their fathers were two thousand six hundred and thirty."},{"num":41,"verse":"These are the numbers of the families of the sons of Gershon: of all that did service in the Tabernacle of the Congregation, whom Moses and Aaron did number according to the commandment of the Lord."},{"num":42,"verse":"¶ The numbers also of the families of the sons of Merari by their families, and by the houses of their fathers,"},{"num":43,"verse":"From thirty years old and upward, even unto fifty years old: all that enter into the assembly for the service of the Tabernacle of the Congregation."},{"num":44,"verse":"So the numbers of them by their families were three thousand, and two hundred."},{"num":45,"verse":"These are the sums of the families of the sons of Merari, whom Moses and Aaron numbered according to the commandment of the Lord, by the hand of Moses."},{"num":46,"verse":"So all the numbers of the Levites, which Moses, and Aaron, and the princes of Israel numbered by their families and by the houses of their fathers,"},{"num":47,"verse":"From thirty years old and upward, even to fifty years old, every one that came to do his duty, office, service and charge in the Tabernacle of the Congregation."},{"num":48,"verse":"So the number of them were eight thousand five hundred and four score."},{"num":49,"verse":"According to the commandment of the Lord by the hand of Moses did Aaron number them, every one according to his service, and according to his charge. Thus were they of that tribe numbered, as the Lord commanded Moses."}]