[{"header":"The Priestly Divisions"},{"num":24,"verse":"With respect to the descendants of Aaron, classes of service were organized for Nadab, Abihu, Eleazar, and Ithamar, the descendants of Aaron. "},{"num":2,"verse":"But Nadab and Abihu died before their father did, leaving no sons, so Eleazar and Ithamar became priests. "},{"num":3,"verse":"Along with Zadok, one of Eleazar’s descendants, and Ahimelech, one of Ithamar’s descendants, David organized their service according to their assigned responsibilities."},{"num":4,"verse":"More leaders were located among Eleazar’s descendants than among those of Ithamar, so sixteen leaders were appointed from the leaders of the ancestral households of Eleazar’s descendants and eight from those of Ithamar. "},{"num":5,"verse":"They were chosen by impartial lottery, since there were trustees of the sanctuary and officers of God among both Eleazar’s descendants and among Ithamar’s descendants. "},{"num":6,"verse":"Nethanel’s son Shemaiah, a Levitical scribe, made an official record of them for the king, the officers, Zadok the priest, Abiathar’s son Ahimelech, and the heads of ancestral households of both the priests and the descendants of Levi. One ancestral house was chosen for Eleazar and one for Ithamar."},{"num":7,"verse":"The first lottery was chosen in favor of Jehoiarib, the second for Jedaiah, "},{"num":8,"verse":"third for Harim, the fourth for Seorim, "},{"num":9,"verse":"the fifth for Malchijah, the sixth for Mijamin, "},{"num":10,"verse":"the seventh for Hakkoz, the eighth for Abijah, "},{"num":11,"verse":"the ninth for Jeshua, the tenth for Shecaniah, "},{"num":12,"verse":"the eleventh for Eliashib, the twelfth for Jakim, "},{"num":13,"verse":"the thirteenth for Huppah, the fourteenth for Jeshebeab, "},{"num":14,"verse":"the fifteenth for Bilgah, the sixteenth for Immer, "},{"num":15,"verse":"the seventeenth for Hezir, the eighteenth for Happizzez, "},{"num":16,"verse":"the nineteenth for Pethahiah, the twentieth for Jehezkel, "},{"num":17,"verse":"the twenty-first for Jachin, the twenty-second for Gamul, "},{"num":18,"verse":"the twenty-third for Delaiah, and the twenty-fourth for Maaziah. "},{"num":19,"verse":"These were appointed to enter the Temple of the Lord according to their protocols established by their ancestor Aaron, as commanded by the Lord God of Israel."},{"header":"Other Levitical Divisions"},{"num":20,"verse":"Now with respect to the descendants of Levi there remained Shubael from the descendants of Amram and Jehdeiah from the descendants of Shubael; "},{"num":21,"verse":"with respect to Rehabiah, Isshiah their chief from the descendants Rehabiah; "},{"num":22,"verse":"with respect to the Izharites, Shelomoth, Jahath from the descendants of Shelomoth; "},{"num":23,"verse":"with respect to the descendants of Hebron, Jeriah their chief, Amariah their second in rank, Jahaziel their third, and Jekameam their fourth; "},{"num":24,"verse":"with respect to the descendants of Uzziel, Micah; with respect to the descendants of Micah, Shamir; "},{"num":25,"verse":"with respect to Micah’s brother Isshiah; with respect to the descendants of Isshiah, Zechariah; "},{"num":26,"verse":"with respect to Merari’s sons, Mahli and Mushi; with respect to the sons of Jaaziah, Beno; "},{"num":27,"verse":"with respect to the sons of Merari, Jaaziah, Beno, Shoham, Zaccur, and Ibri; "},{"num":28,"verse":"with respect to Mahli, Eleazar, who had no sons; "},{"num":29,"verse":"with respect to Kish, Jerahmeel, one of the descendants of Kish; "},{"num":30,"verse":"and with respect to the descendants of Mushi, Mahli, Eder, and Jerimoth. These were the descendants of Levi according to their ancestral households. "},{"num":31,"verse":"These individuals also cast lots corresponding to their relatives, Aaron’s descendants, in the presence of King David, Zadok, and Ahimelech, and in the presence of the heads of the ancestral households of the priests and of the descendants of Levi, and the eldest was treated as impartially as was the younger brother."}]