[{"header":"The Groups of the Priests"},{"num":24,"verse":"These were the groups of Aaron’s sons: Aaron’s sons were Nadab, Abihu, Eleazar, and Ithamar. "},{"num":2,"verse":"But Nadab and Abihu died before their father did, and they had no sons. So Eleazar and Ithamar served as the priests. "},{"num":3,"verse":"David, with the help of Zadok, a descendant of Eleazar, and Ahimelech, a descendant of Ithamar, separated their family groups into two different groups. Each group had certain duties. "},{"num":4,"verse":"There were more leaders from Eleazar’s family than from Ithamar’s—sixteen leaders from Eleazar’s family and eight leaders from Ithamar’s family. "},{"num":5,"verse":"Men were chosen from Eleazar’s and Ithamar’s families by throwing lots. Some men from each family were chosen to be in charge of the Holy Place, and some were chosen to serve as priests."},{"num":6,"verse":"Shemaiah son of Nethanel, from the tribe of Levi, was the secretary. He recorded the names of those descendants in front of King David, the officers, Zadok the priest, Ahimelech son of Abiathar, and the leaders of the families of the priests and Levites. The work was divided by lots among the families of Eleazar and Ithamar. The following men with their groups were chosen."},{"num":7,"verse":"The first one chosen was Jehoiarib. The second was Jedaiah. "},{"num":8,"verse":"The third was Harim. The fourth was Seorim. "},{"num":9,"verse":"The fifth was Malkijah. The sixth was Mijamin. "},{"num":10,"verse":"The seventh was Hakkoz. The eighth was Abijah. "},{"num":11,"verse":"The ninth was Jeshua. The tenth was Shecaniah. "},{"num":12,"verse":"The eleventh was Eliashib. The twelfth was Jakim. "},{"num":13,"verse":"The thirteenth was Huppah. The fourteenth was Jeshebeab. "},{"num":14,"verse":"The fifteenth was Bilgah. The sixteenth was Immer. "},{"num":15,"verse":"The seventeenth was Hezir. The eighteenth was Happizzez. "},{"num":16,"verse":"The nineteenth was Pethahiah. The twentieth was Jehezkel. "},{"num":17,"verse":"The twenty-first was Jakin. The twenty-second was Gamul. "},{"num":18,"verse":"The twenty-third was Delaiah. The twenty-fourth was Maaziah."},{"num":19,"verse":"These were the groups chosen to serve in the Temple of the Lord. They obeyed the rules given them by Aaron, just as the Lord, the God of Israel, had commanded him."},{"header":"The Other Levites"},{"num":20,"verse":"These are the names of the rest of Levi’s descendants:"},{"num":21,"verse":"Isshiah was the first son of Rehabiah."},{"num":22,"verse":"From the Izhar family group, there was Shelomoth, and Jahath was a descendant of Shelomoth."},{"num":23,"verse":"Hebron’s first son was Jeriah, Amariah was his second, Jahaziel was his third, and Jekameam was his fourth."},{"num":24,"verse":"Uzziel’s son was Micah. Micah’s son was Shamir. "},{"num":25,"verse":"Micah’s brother was Isshiah, and Isshiah’s son was Zechariah."},{"num":26,"verse":"Merari’s descendants were Mahli and Mushi. Merari’s son was Jaaziah. "},{"num":27,"verse":"Jaaziah son of Merari had sons named Shoham, Zaccur, and Ibri. "},{"num":28,"verse":"Mahli’s son was Eleazar, but Eleazar did not have any sons."},{"num":29,"verse":"Kish’s son was Jerahmeel."},{"num":30,"verse":"Mushi’s sons were Mahli, Eder, and Jerimoth."},{"num":31,"verse":"They were chosen for special jobs by throwing lots in front of King David, Zadok, Ahimelech, the leaders of the families of the priests, and the Levites. They did this just as their relatives, the priests, Aaron’s descendants, had done. The families of the oldest brother and the youngest brother were treated the same."}]