[{"header":"The Work of the Religious Leaders"},{"num":24,"verse":"These were the family groups of the sons of Aaron. The sons of Aaron were Nadab, Abihu, Eleazar and Ithamar. "},{"num":2,"verse":"Nadab and Abihu died before their father died. They had no sons, so Eleazar and Ithamar became the religious leaders. "},{"num":3,"verse":"With the help of Zadok of the sons of Eleazar and Ahimelech of the sons of Ithamar, David divided them by their given duties. "},{"num":4,"verse":"More leaders were found from the sons of Eleazar than the sons of Ithamar. So they were divided in this way. There were sixteen heads of families of the sons of Eleazar. And there were eight heads of families of the sons of Ithamar. "},{"num":5,"verse":"They were divided by drawing names, all alike. For there were leaders of the holy place and leaders of God, from both the sons of Eleazar and Ithamar. "},{"num":6,"verse":"The writer Shemaiah, the Levite son of Nethanel, wrote down their names. He wrote them in front of the king, the princes, Zadok the religious leader, Ahimelech the son of Abiathar, and the heads of the families of the religious leaders and of the Levites. One family was taken for Eleazar, and one for Ithamar."},{"num":7,"verse":"The first name drawn was Jehoiarib, the second Jedaiah, "},{"num":8,"verse":"the third Harim, the fourth Seorim, "},{"num":9,"verse":"the fifth Malchijah, the sixth Mijamin. "},{"num":10,"verse":"The seventh name was Hakkoz, the eighth Abijah, "},{"num":11,"verse":"the ninth Jeshua, the tenth Shecaniah, "},{"num":12,"verse":"the eleventh Eliashib, the twelfth Jakim. "},{"num":13,"verse":"The thirteenth name was Huppah, the fourteenth Jeshebeab, "},{"num":14,"verse":"the fifteenth Bilgah, the sixteenth Immer. "},{"num":15,"verse":"The seventeenth name was Hezir, the eighteenth Happizzez, "},{"num":16,"verse":"the nineteenth Pethahiah, the twentieth Jehezkel. "},{"num":17,"verse":"The twenty-first name was Jachin, the twenty-second Gamul, "},{"num":18,"verse":"the twenty-third Delaiah, and the twenty-fourth Maaziah. "},{"num":19,"verse":"This was the way they were to come on duty to work in the Lord’s house. It was a rule given to them through their father Aaron, just as the Lord God of Israel had told him."},{"num":20,"verse":"The rest of the sons of Levi were Shubael of the sons of Amram, Jehdeiah of the sons of Shubael, "},{"num":21,"verse":"and Isshiah was the first of the sons of Rehabiah. "},{"num":22,"verse":"There was Shelomoth of the Izharites, and Jahath of the sons of Shelomoth. "},{"num":23,"verse":"Of the sons of Hebron, there were Jeriah the first, Amariah the second, Jahaziel the third, and Jekameam the fourth. "},{"num":24,"verse":"There was Micah of the sons of Uzziel, and Shamir of the sons of Micah. "},{"num":25,"verse":"The brother of Micah was Isshiah. There was Zechariah of the sons of Isshiah. "},{"num":26,"verse":"The sons of Merari were Mahli and Mushi. Jaaziah’s son was Beno. "},{"num":27,"verse":"The sons of Merari by Jaaziah were Beno, Shoham, Zaccur and Ibri. "},{"num":28,"verse":"His son by Mahli was Eleazar, who had no sons. "},{"num":29,"verse":"His son by Kish was Jerahmeel. "},{"num":30,"verse":"And the sons of Mushi were Mahli, Eder and Jerimoth. These were the sons of the Levites by their families. "},{"num":31,"verse":"The head of each family and his younger brother drew names just as their brothers the sons of Aaron did. They drew them in front of King David, Zadok, Ahimelech, and the heads of the families of the religious leaders and of the Levites."}]