[{"num":29,"verse":"`And in the seventh month, in the first of the month, a holy convocation ye have, ye do no servile work; a day of shouting it is to you;"},{"num":2,"verse":"and ye have prepared a burnt-offering, for sweet fragrance to Jehovah: one bullock, a son of the herd, one ram, seven lambs, sons of a year, perfect ones;"},{"num":3,"verse":"and their present, flour mixed with oil, three-tenth deals for the bullock, two-tenth deals for the ram,"},{"num":4,"verse":"and one-tenth deal for the one lamb, for the seven lambs;"},{"num":5,"verse":"and one kid of the goats, a sin-offering, to make atonement for you;"},{"num":6,"verse":"apart from the burnt-offering of the month, and its present, and the continual burnt-offering, and its present, and their libations, according to their ordinance, for sweet fragrance, a fire-offering to Jehovah."},{"num":7,"verse":"`And on the tenth of this seventh month a holy convocation ye have, and ye have humbled your souls; ye do no work;"},{"num":8,"verse":"and ye have brought near a burnt-offering to Jehovah, a sweet fragrance, one bullock, a son of the herd, one ram, seven lambs, sons of a year, perfect ones they are for you,"},{"num":9,"verse":"and their present, flour mixed with oil, three-tenth deals for the bullock, two-tenth deals for the one ram,"},{"num":10,"verse":"a several tenth deal for the one lamb, for the seven lambs,"},{"num":11,"verse":"one kid of the goats, a sin-offering; apart from the sin-offering of the atonements, and the continual burnt-offering, and its present, and their libations."},{"num":12,"verse":"`And on the fifteenth day of the seventh month a holy convocation ye have; ye do no servile work; and ye have celebrated a festival to Jehovah seven days,"},{"num":13,"verse":"and have brought near a burnt-offering, a fire-offering, a sweet fragrance, to Jehovah; thirteen bullocks, sons of the herd, two rams, fourteen lambs, sons of a year; perfect ones they are;"},{"num":14,"verse":"and their present, flour mixed with oil, three-tenth deals to the one bullock, for the thirteen bullocks, two-tenth deals to the one ram, for the two rams,"},{"num":15,"verse":"and a several tenth deal to the one lamb, for the fourteen lambs,"},{"num":16,"verse":"and one kid of the goats, a sin-offering; apart from the continual burnt-offering, its present, and its libation."},{"num":17,"verse":"`And on the second day twelve bullocks, sons of the herd, two rams, fourteen lambs, sons of a year, perfect ones;"},{"num":18,"verse":"and their present, and their libations, for the bullocks, for the rams, and for the sheep, in their number, according to the ordinance;"},{"num":19,"verse":"and one kid of the goats, a sin-offering; apart from the continual burnt-offering, and its present, and their libations."},{"num":20,"verse":"`And on the third day eleven bullocks, two rams, fourteen lambs, sons of a year, perfect ones;"},{"num":21,"verse":"and their present, and their libations, for the bullocks, for the rams, and for the lambs, in their number, according to the ordinance;"},{"num":22,"verse":"and one goat, a sin-offering; apart from the continual burnt-offering, and its present, and its libation."},{"num":23,"verse":"`And on the fourth day ten bullocks, two rams, fourteen lambs, sons of a year, perfect ones;"},{"num":24,"verse":"their present, and their libations, for the bullocks, for the rams, and for the lambs, in their number, according to the ordinance;"},{"num":25,"verse":"and one kid of the goats, a sin-offering, apart from the continual burnt-offering, its present, and its libation."},{"num":26,"verse":"`And on the fifth day nine bullocks, two rams, fourteen lambs, sons of a year, perfect ones;"},{"num":27,"verse":"and their present, and their libations, for the bullocks, for the rams, and for the lambs, in their number, according to the ordinance;"},{"num":28,"verse":"and one goat, a sin-offering; apart from the continual burnt-offering, and its present, and its libation."},{"num":29,"verse":"`And on the sixth day eight bullocks, two rams, fourteen lambs, sons of a year, perfect ones;"},{"num":30,"verse":"and their present, and their libations, for the bullocks, for the rams, and for the lambs, in their number, according to the ordinance;"},{"num":31,"verse":"and one goat, a sin-offering; apart from the continual burnt-offering, its present, and its libation."},{"num":32,"verse":"`And on the seventh day seven bullocks, two rams, fourteen lambs, sons of a year, perfect ones;"},{"num":33,"verse":"and their present, and their libations, for the bullocks, for the rams, and for the lambs, in their number, according to the ordinance;"},{"num":34,"verse":"and one goat, a sin-offering; apart from the continual burnt-offering, its present, and its libation."},{"num":35,"verse":"`On the eighth day a restraint ye have, ye do no servile work;"},{"num":36,"verse":"and ye have brought near a burnt-offering, a fire-offering, a sweet fragrance, to Jehovah; one bullock, one ram, seven lambs, sons of a year, perfect ones;"},{"num":37,"verse":"their present, and their libations, for the bullock, for the ram, and for the lambs, in their number, according to the ordinance;"},{"num":38,"verse":"and one goat, a sin-offering; apart from the continual burnt-offering, and its present, and its libation."},{"num":39,"verse":"`These ye prepare to Jehovah in your appointed seasons, apart from your vows, and your free-will offerings, for your burnt-offerings, and for your presents, and for your libations, and for your peace-offerings.'"},{"num":40,"verse":"And Moses saith unto the sons of Israel according to all that Jehovah hath commanded Moses."}]