[{"header":"The Temple Musicians"},{"num":25,"verse":"King David and the leaders of the Levites chose the following Levite clans to lead the worship services: Asaph, Heman, and Jeduthun. They were to proclaim God's messages, accompanied by the music of harps and cymbals. This is the list of persons chosen to lead the worship, with the type of service that each group performed:"},{"num":2,"verse":"The four sons of Asaph: Zaccur, Joseph, Nethaniah, and Asharelah. They were under the direction of Asaph, who proclaimed God's messages whenever the king commanded."},{"num":3,"verse":"The six sons of Jeduthun: Gedaliah, Zeri, Jeshaiah, Shimei, Hashabiah, and Mattithiah. Under the direction of their father they proclaimed God's message, accompanied by the music of harps, and sang praise and thanks to the Lord."},{"num":4,"verse":"The fourteen sons of Heman: Bukkiah, Mattaniah, Uzziel, Shebuel, Jerimoth, Hananiah, Hanani, Eliathah, Giddalti, Romamti Ezer, Joshbekashah, Mallothi, Hothir, and Mahazioth. "},{"num":5,"verse":"God gave to Heman, the king's prophet, these fourteen sons and also three daughters, as he had promised, in order to give power to Heman. "},{"num":6,"verse":"All of his sons played cymbals and harps under their father's direction, to accompany the Temple worship. And Asaph, Jeduthun, and Heman were under orders from the king."},{"num":7,"verse":"All these twenty-four men were experts; and their fellow Levites were trained musicians. There were 288 men in all."},{"num":8,"verse":"To determine the assignment of duties they all drew lots, whether they were young or old, experts or beginners."},{"num":9,"verse":"These 288 men were divided according to families into twenty-four groups of twelve, with a leader in charge of each group. This is the order in which they were on duty: 1) Joseph of the family of Asaph; 2) Gedaliah; 3) Zaccur; 4) Zeri; 5) Nethaniah; 6) Bukkiah; 7) Asharelah; 8) Jeshaiah; 9) Mattaniah; 10) Shimei; 11) Uzziel; 12) Hashabiah; 13) Shebuel; 14) Mattithiah; 15) Jerimoth; 16) Hananiah; 17) Joshbekashah; 18) Hanani; 19) Mallothi; 20) Eliathah; 21) Hothir; 22) Giddalti; 23) Mahazioth; 24) Romamti Ezer."}]