[{"num":25,"verse":"Therefore David, and the magistrates of the host, separated to the service of the sons of Asaph, and of Heman, and of Jeduthun, the which should prophesy in harps, and in psalteries, and in cymbals, by their number, and serve the office hallowed, or enjoined, to them. (And so David, and his officers/and his leaders, set apart for service the sons of Asaph, and of Heman, and of Jeduthun, who would prophesy to the accompaniment of harps, and lutes, and cymbals, by their number, and so do the work assigned to them.)"},{"num":2,"verse":"Of the sons of Asaph; Zaccur, and Joseph, and Nethaniah, and Asarelah; and the sons of Asaph, under the hand of Asaph, prophesied beside the king (prophesied by order of the king)."},{"num":3,"verse":"And the sons of Jeduthun were these; Gedaliah, Zeri, Jeshaiah, (Shimei,) and Hashabiah, and Mattithiah, six; under the hand of their father Jeduthun, that prophesied in an harp, upon men acknowledging and praising the Lord (who prophesied to the accompaniment of a harp, giving thanks, and praising the Lord)."},{"num":4,"verse":"Also the sons of Heman were (these of) Heman; Bukkiah, Mattaniah, Uzziel, Shebuel, and Jerimoth, Hananiah, Hanani, Eliathah, Giddalti, and Romamtiezer, and Joshbekashah, Mallothi, Hothir, and Mahazioth;"},{"num":5,"verse":"all these the sons of Heman were prophets of the king in the words of God, that he should enhance the horn, or strength. And God gave to Heman fourteen sons and three daughters. (all these were the sons of Heman, the prophet of the king, by the promises of God, to lift up his horn, or his strength. And God gave Heman fourteen sons and three daughters.)"},{"num":6,"verse":"All these under the hand of their father were dealed, either assigned, to sing in the temple of the Lord, in cymbals, and psalteries, and harps, into the service of the house of the Lord, nigh the king, that is say, Asaph, and Jeduthun, and Heman. (All these were under the hand, or the power, of their father, and were assigned to play, in the Temple of the Lord, cymbals, and lutes, and harps, for service in the House of the Lord, while Asaph, and Jeduthun, and Heman, were under the direction of the king.)"},{"num":7,"verse":"And the number of them, with their brethren that taught the song[s] of the Lord, all the teachers, was two hundred fourscore and eight. (And their number, with their kinsmen who taught the songs of the Lord, yea, all of the teachers, was two hundred and eighty-eight.)"},{"num":8,"verse":"And they sent lots by their whiles evenly, as well the greater as the less, also a wise man and an unwise. (And they all cast lots for their duties, both the greater and the lesser alike, and a wise man as well as an unwise one.)"},{"num":9,"verse":"And the first lot went out to Joseph, that was of Asaph, (and to his sons and to his brothers, twelve); the second to Gedaliah, to him, and to his sons and to his brethren, twelve;"},{"num":10,"verse":"the third to Zaccur, to his sons and to his brethren, twelve;"},{"num":11,"verse":"the fourth to Izri, to his sons and to his brethren, twelve;"},{"num":12,"verse":"the fifth to Nethaniah, to his sons and to his brethren, twelve;"},{"num":13,"verse":"the sixth to Bukkiah, to his sons and to his brethren, twelve;"},{"num":14,"verse":"the seventh to Jesharelah, to his sons and to his brethren, twelve;"},{"num":15,"verse":"the eighth to Jeshaiah, to his sons and to his brethren, twelve;"},{"num":16,"verse":"the ninth to Mattaniah, to his sons and to his brethren, twelve;"},{"num":17,"verse":"the tenth to Shimei, to his sons and to his brethren, twelve;"},{"num":18,"verse":"the eleventh to Azareel, to his sons and to his brethren, twelve;"},{"num":19,"verse":"the twelfth to Hashabiah, to his sons and to his brethren, twelve;"},{"num":20,"verse":"the thirteenth to Shubael, to his sons and to his brethren, twelve;"},{"num":21,"verse":"the fourteenth to Mattithiah, to his sons and to his brethren, twelve;"},{"num":22,"verse":"the fifteenth to Jeremoth, to his sons and to his brethren, twelve;"},{"num":23,"verse":"the sixteenth to Hananiah, to his sons and to his brethren, twelve;"},{"num":24,"verse":"the seventeenth to Joshbekashah, to his sons and to his brethren, twelve;"},{"num":25,"verse":"the eighteenth to Hanani, to his sons and to his brethren, twelve;"},{"num":26,"verse":"the nineteenth to Mallothi, to his sons and to his brethren, twelve;"},{"num":27,"verse":"the twentieth to Eliathah, to his sons and to his brethren, twelve;"},{"num":28,"verse":"the one and twentieth to Hothir, to his sons and to his brethren, twelve;"},{"num":29,"verse":"the two and twentieth to Giddalti, to his sons and to his brethren, twelve;"},{"num":30,"verse":"the three and twentieth to Mahazioth, to his sons and to his brethren, twelve;"},{"num":31,"verse":"the four and twentieth to Romamtiezer, to his sons and to his brethren, twelve."}]