[[],[{"type":"header","content":"Punishment Is Inevitable"},{"type":"prose","content":"Then the LORD said to me: Though Moses and Samuel stood before me, yet my heart would not turn toward this people. Send them out of my sight, and let them go! "}],[{"type":"prose","content":"And when they say to you, “Where shall we go?” you shall say to them: Thus says the LORD:"},{"type":"poetry","content":"Those destined for pestilence, to pestilence,"},{"type":"poetry","content":"those destined for famine, to famine,"}],[{"type":"prose","content":"And I will appoint over them four kinds of destroyers, says the LORD: the sword to kill, the dogs to drag away, and the birds of the air and the wild animals of the earth to devour and destroy. "}],[{"type":"prose","content":"I will make them a horror to all the kingdoms of the earth because of what King Manasseh son of Hezekiah of Judah did in Jerusalem."}],[{"type":"header","content":"Jeremiah Complains Again and Is Reassured"},{"type":"prose","content":"Woe is me, my mother, that you ever bore me, a man of strife and contention to the whole land! I have not lent, nor have I borrowed, yet all of them curse me. "}],[{"type":"prose","content":"The LORD said: Surely I have intervened in your life for good, surely I have imposed enemies on you in a time of trouble and in a time of distress. "}],[{"type":"prose","content":"Can iron and bronze break iron from the north?"}],[{"type":"prose","content":"Your wealth and your treasures I will give as plunder, without price, for all your sins, throughout all your territory. "}],[{"type":"prose","content":"I will make you serve your enemies in a land that you do not know, for in my anger a fire is kindled that shall burn forever."}],[{"type":"poetry","content":"O , you know;"},{"type":"poetry","content":"In your forbearance do not take me away;"}],[{"type":"poetry","content":"Your words were found, and I ate them,"},{"type":"poetry","content":"for I am called by your name,"}],[{"type":"poetry","content":"I did not sit in the company of merrymakers,"},{"type":"poetry","content":"under the weight of your hand I sat alone,"}],[{"type":"poetry","content":"Why is my pain unceasing,"},{"type":"poetry","content":"Truly, you are to me like a deceitful brook,"}]]