[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "May declare all their abominations.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This they were to do, that the false impression that God was unable to protect His people might be removed from the minds of the heathen, and the truth that He was punishing them for their sins be made known. They should do it both by word of mouth (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:8-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and also by their conduct (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 14:22-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The word “few” is literally, as shown in the margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men of number, i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "men who can easily be numbered or counted; and in the very similar expression in the original for “declare,” there is a play upon the word, something like our “count” and “recount.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall know, may grammatically refer either to the heathen, or to the Israelites in their dispersion; but the latter is so constantly the refrain of these prophecies (see Ezekiel 12:20, e.g.), that it is also to be understood here.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "They shall know, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "may grammatically refer either to the heathen, or to the Israelites in their dispersion; but the latter is so constantly the refrain of these prophecies (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "e.g.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that it is also to be understood here.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-16 By the preparation for removal, and his breaking through the wall of his house at evening, as one desirous to escape from the enemy, the prophet signified the conduct and fate of Zedekiah. When God has delivered us, we must glorify him and edify others, by acknowledging our sins. Those who by afflictions are brought to this, are made to know that God is the Lord, and may help to bring others to know him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Few - literally, as in the margin; so few, that they can easily be counted ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The few who should escape destruction should make known to all among whom they should dwell how great had been the wickedness of the people, how just their punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. I will leave a few … that they may declare … abominations—God's purpose in scattering a remnant of Jews among the Gentiles; namely, not only that they themselves should be weaned from idolatry (see Eze 12:15), but that by their own word, as also by their whole state as exiles, they should make God's righteousness manifest among the Gentiles, as vindicated in their punishment for their sins (compare Isa 43:10; Zec 8:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will restrain the rage of the Chaldeans, and move them to some compassion towards some of the Jews, so that some, yet but few, shall remain; the sword shall not slay them, for 1 commission it, and it will not exceed its commission. I send the famine, but some I will feed; and the pestilence is my arrow, and hits but where I direct it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A few men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " including the women also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That they may declare; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either by relating those sins which were committed among them in Jerusalem, for which God was justly angry, and for which he punished them, though they were his own people. Or else, that though they should be silent, yet the very thing should speak itself, and their miseries should proclaim the wickednesses they had acted against God in their own land. Or, by their wicked practices which in captivity, and under the eye of the heathen, they commit, they will manifestly show to the heathen that God was just in all his severity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall know; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either the Jews, or rather here the Chaldean heathens. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But I will leave a few men of them,.... Or, \"men of number\" (x); of a small number, such as are easily reckoned up; which will require no great skill in numbers, nor trouble to count them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from the sword, from the famine, and from the pestilence; during the siege of Jerusalem, and at the breaking of it up; but then they should be carried captive into other countries: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they may declare all their abominations among the Heathen whither they come; who, observing their calamities, and distresses, would read their sin in their punishment; and conclude they must have been guilty of great enormities, who were punished in such a manner; so that their punishment was a visible and standing declaration to the Heathens of the abominable sins they had been guilty of: or else the end of reserving a few of them from the above capital judgments was, that they being brought to a sense of their sins by their afflictions, might freely confess them, express their repentance for them, and justify God in his proceedings towards them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall know that I am the Lord; not the Heathens, among whom this declaration would be made; but the Jews, brought under a conviction of their sin, and of the justice of God in his dealings with them. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(x)  \"viros numeri\", Montanus, Vatablus; \"homines numero\", Starckius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x)  \"viros numeri\", Montanus, Vatablus; \"homines numero\", Starckius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But I will leave a {e} few men of them from the sword, from the famine, and from the pestilence; that they may declare all their abominations among the nations where they come; and they shall know that I am the LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But I will leave a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " few men of them from the sword, from the famine, and from the pestilence; that they may declare all their abominations among the nations where they come; and they shall know that I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Who would bear his Name, and would be his Church.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Explanation of the Symbolical Action",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 12:8. And the word of Jehovah came to me in the morning, saying, Ezekiel 12:9. Son of man, have they not said to thee, the house of Israel, the refractory generation, What art thou doing? Ezekiel 12:10. Say to them, Thus saith the Lord Jehovah, This burden applies to the prince in Jerusalem, and to all the house of Israel to whom they belong. Ezekiel 12:11. Say, I am your sign: as I have done, so shall it happen to them; into exile, into captivity, will they go. Ezekiel 12:12. And the prince who is in the midst of them he will lift it upon his shoulder in the dark, and will go out: they will break through the wall, and carry it out thereby: he will cover his face, that he may not see the land with eyes. Ezekiel 12:13. And I will spread my net over him, so that he will be caught in my snare: and I will take him to Babel, into the land of the Chaldeans; but he will not see it, and will die there. Ezekiel 12:14. And all that is about him, his help and all his troops, I will scatter into all winds, and draw out the sword behind them. Ezekiel 12:15. And they shall learn that I am Jehovah, when I scatter them among the nations, and winnow them in the lands. Ezekiel 12:16. Yet I will leave of them a small number of men from the sword, from the famine, and from the pestilence; that they may relate all their abominations among the nations whither they have come; and learn that I am Jehovah. - As queries introduced with הלא have, as a rule, an affirmative sense, the words \"have they not asked,\" etc., imply that the Israelites had asked the prophet what he was doing, though not in a proper state of mind, not in a penitential manner, as the epithet בּית plainly shows. The prophet is therefore to interpret the action which he had just been performing, and all its different stages. The words הנּשׂיא המּשּׂא הזּה, to which very different renderings have been given, are to be translated simply \"the prince is this burden,\" i.e., the object of this burden. Hammassâ does not mean the carrying, but the burden, i.e., the threatening prophecy, the prophetic action of the prophet, as in the headings to the oracles (see the comm. on Nahum 1:1). The \"prince\" is the king, as in Ezekiel 21:30, though not Jehoiachin, who had been carried into exile, but Zedekiah. This is stated in the apposition \"in Jerusalem,\" which belongs to \"the prince,\" though it is not introduced till after the predicate, as in Genesis 24:24. To this there is appended the further definition, \"the whole house of Israel,\" which, being co-ordinated with הנּשׂיא, affirms that all Israel (the covenant nation) will share the fate of the prince. In the last clause of Ezekiel 12:10 בּתוכם does not stand for בּתוכהּ, so that the suffix would refer to Jerusalem, \"in the midst of which they (the house of Israel) are.\" אשׁר cannot be a nominative, because in that case המּה to be understood as referring to the persons addressed, i.e., to the Israelites in exile (Hitzig, Kliefoth): in the midst of whom they are, i.e., to whom they belong. The sentence explains the reason why the prophet was to announce to those in exile the fat of the prince and people in Jerusalem; namely, because the exiles formed a portion of the nation, and would be affected by the judgment which was about to burst upon the king and people in Jerusalem. In this sense Ezekiel was also able to say to the exiles (in Ezekiel 12:11), \"I am your sign;\" inasmuch as his sign was also of importance for them, as those who were already banished would be so far affected by the departure of the king and people which Ezekiel depicted, that it would deprive them of all hope of a speedy return to their native land.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And the word of Jehovah came to me in the morning, saying, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Son of man, have they not said to thee, the house of Israel, the refractory generation, What art thou doing? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Say to them, Thus saith the Lord Jehovah, This burden applies to the prince in Jerusalem, and to all the house of Israel to whom they belong. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Say, I am your sign: as I have done, so shall it happen to them; into exile, into captivity, will they go. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And the prince who is in the midst of them he will lift it upon his shoulder in the dark, and will go out: they will break through the wall, and carry it out thereby: he will cover his face, that he may not see the land with eyes. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I will spread my net over him, so that he will be caught in my snare: and I will take him to Babel, into the land of the Chaldeans; but he will not see it, and will die there. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And all that is about him, his help and all his troops, I will scatter into all winds, and draw out the sword behind them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And they shall learn that I am Jehovah, when I scatter them among the nations, and winnow them in the lands. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Yet I will leave of them a small number of men from the sword, from the famine, and from the pestilence; that they may relate all their abominations among the nations whither they have come; and learn that I am Jehovah. - As queries introduced with הלא have, as a rule, an affirmative sense, the words \"have they not asked,\" etc., imply that the Israelites had asked the prophet what he was doing, though not in a proper state of mind, not in a penitential manner, as the epithet בּית plainly shows. The prophet is therefore to interpret the action which he had just been performing, and all its different stages. The words הנּשׂיא המּשּׂא הזּה, to which very different renderings have been given, are to be translated simply \"the prince is this burden,\" i.e., the object of this burden. Hammassâ does not mean the carrying, but the burden, i.e., the threatening prophecy, the prophetic action of the prophet, as in the headings to the oracles (see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The \"prince\" is the king, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though not Jehoiachin, who had been carried into exile, but Zedekiah. This is stated in the apposition \"in Jerusalem,\" which belongs to \"the prince,\" though it is not introduced till after the predicate, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 24:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To this there is appended the further definition, \"the whole house of Israel,\" which, being co-ordinated with הנּשׂיא, affirms that all Israel (the covenant nation) will share the fate of the prince. In the last clause of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " בּתוכם does not stand for בּתוכהּ, so that the suffix would refer to Jerusalem, \"in the midst of which they (the house of Israel) are.\" אשׁר cannot be a nominative, because in that case המּה to be understood as referring to the persons addressed, i.e., to the Israelites in exile (Hitzig, Kliefoth): in the midst of whom they are, i.e., to whom they belong. The sentence explains the reason why the prophet was to announce to those in exile the fat of the prince and people in Jerusalem; namely, because the exiles formed a portion of the nation, and would be affected by the judgment which was about to burst upon the king and people in Jerusalem. In this sense Ezekiel was also able to say to the exiles (in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), \"I am your sign;\" inasmuch as his sign was also of importance for them, as those who were already banished would be so far affected by the departure of the king and people which Ezekiel depicted, that it would deprive them of all hope of a speedy return to their native land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "להם, in Ezekiel 12:11, refers to the king and the house of Israel in Jerusalem. בּגולה is rendered more forcible by the addition of בּשּׁבי. The announcement that both king and people must go into exile, is carried out still further in Ezekiel 12:12 and Ezekiel 12:13 with reference to the king, and in Ezekiel 12:14 with regard to the people. The king will experience all that Ezekiel has described. The literal occurrence of what is predicted here is related in Jeremiah 39:1., Jeremiah 52:4.; 2 Kings 25:4. When the Chaldeans forced their way into the city after a two years' siege, Zedekiah and his men of war fled by night out of the city through the gate between the two walls. It is not expressly stated, indeed, in the historical accounts that a breach was made in the wall; but the expression \"through the gate between the two walls\" (Jeremiah 39:4; Jeremiah 52:7; 2 Kings 25:4) renders this very probable, whether the gate had been walled up during the siege, or it was necessary to break through the wall at one particular spot in order to reach the gate. The king's attendants would naturally take care that a breach was made in the wall, to secure for him a way of escape; hence the expression, \"they will break through.\" The covering of the face, also, is not mentioned in the historical accounts; but in itself it is by no means improbable, as a sign of the shame and grief with which Zedekiah left the city. The words, \"that he may not see the land with eyes,\" do not appear to indicate anything more than the necessary consequence of covering the face, and refer primarily to the simple fact that the king fled in the deepest sorrow, and did not want to see the land; but, as Ezekiel 12:13 clearly intimates, they were fulfilled in another way, namely, by the fact that Zedekiah did not see with his eyes the land of the Chaldeans into which he was led, because he had been blinded at Riblah (Jeremiah 39:5; Jeremiah 52:11; 2 Kings 25:7). לעין, by eye  equals  with his eyes, is added to give prominence to the idea of seeing. For the same purpose, the subject, which is already implied in the verb, is rendered more emphatic by הוּא; and this הוּא is placed after the verb, so that it stands in contrast with הארץ. The capture of the king was not depicted by Ezekiel; so that in this respect the announcement (Ezekiel 12:13) goes further than the symbolical action, and removes all doubt as to the credibility of the prophet's word, by a distinct prediction of the fate awaiting him. At the same time, his not seeing the land of Babylon is left so indefinite, that it cannot be regarded as a vaticinium post eventum. Zedekiah died in prison at Babylon (Jeremiah 52:11). Along with the king, the whole of his military force will be scattered in all directions (Ezekiel 12:14). עזרה, his help, i.e., the troops that break through with him. כּל־אגפּיו, all his wings (the wings of his army), i.e., all the rest of his forces. The word is peculiar to Ezekiel, and is rendered \"wings\" by Jos. Kimchi, like kenâphaim in Isaiah 8:8. For the rest of the verse compare Ezekiel 5:2; and for the fulfilment, Jeremiah 52:8; Jeremiah 40:7, Jeremiah 40:12. The greater part of the people will perish, and only a small number remain, that they may relate among the heathen, wherever they are led, all the abominations of Israel, in order that the heathen may learn that it is not from weakness, but simply to punish idolatry, that God has given up His people to them (cf. Jeremiah 22:8). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "להם, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", refers to the king and the house of Israel in Jerusalem. בּגולה is rendered more forcible by the addition of בּשּׁבי. The announcement that both king and people must go into exile, is carried out still further in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with reference to the king, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with regard to the people. The king will experience all that Ezekiel has described. The literal occurrence of what is predicted here is related in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". When the Chaldeans forced their way into the city after a two years' siege, Zedekiah and his men of war fled by night out of the city through the gate between the two walls. It is not expressly stated, indeed, in the historical accounts that a breach was made in the wall; but the expression \"through the gate between the two walls\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") renders this very probable, whether the gate had been walled up during the siege, or it was necessary to break through the wall at one particular spot in order to reach the gate. The king's attendants would naturally take care that a breach was made in the wall, to secure for him a way of escape; hence the expression, \"they will break through.\" The covering of the face, also, is not mentioned in the historical accounts; but in itself it is by no means improbable, as a sign of the shame and grief with which Zedekiah left the city. The words, \"that he may not see the land with eyes,\" do not appear to indicate anything more than the necessary consequence of covering the face, and refer primarily to the simple fact that the king fled in the deepest sorrow, and did not want to see the land; but, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " clearly intimates, they were fulfilled in another way, namely, by the fact that Zedekiah did not see with his eyes the land of the Chaldeans into which he was led, because he had been blinded at Riblah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). לעין, by eye  equals  with his eyes, is added to give prominence to the idea of seeing. For the same purpose, the subject, which is already implied in the verb, is rendered more emphatic by הוּא; and this הוּא is placed after the verb, so that it stands in contrast with הארץ. The capture of the king was not depicted by Ezekiel; so that in this respect the announcement (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") goes further than the symbolical action, and removes all doubt as to the credibility of the prophet's word, by a distinct prediction of the fate awaiting him. At the same time, his not seeing the land of Babylon is left so indefinite, that it cannot be regarded as a vaticinium post eventum. Zedekiah died in prison at Babylon (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Along with the king, the whole of his military force will be scattered in all directions (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). עזרה, his help, i.e., the troops that break through with him. כּל־אגפּיו, all his wings (the wings of his army), i.e., all the rest of his forces. The word is peculiar to Ezekiel, and is rendered \"wings\" by Jos. Kimchi, like kenâphaim in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For the rest of the verse compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and for the fulfilment, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The greater part of the people will perish, and only a small number remain, that they may relate among the heathen, wherever they are led, all the abominations of Israel, in order that the heathen may learn that it is not from weakness, but simply to punish idolatry, that God has given up His people to them (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 22:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]