[{"header":"David Is Chosen as King"},{"num":16,"verse":"The Lord said to Samuel, “How long will you mourn for Saul, since I have rejected him as king over Israel? Fill your horn with oil and go. I am sending you to Jesse of Bethlehem, for I see a king for myself among his sons.”"},{"num":2,"verse":"Samuel said, “How can I go? If Saul hears about it, he will kill me.”"},{"num":3,"verse":"Invite Jesse to the sacrifice, and I will let you know what you are to do. You are to anoint for me the person that I point out to you.”"},{"num":4,"verse":"So Samuel did what the Lord had told him to do and went to Bethlehem. Trembling with fear, the elders of the city came to meet him. They said, “Do you come in peace?”"},{"num":5,"verse":"He said, “Yes, in peace. I have come to sacrifice to the Lord. Consecrate yourselves, and come with me to the sacrifice.” He consecrated Jesse and his sons and invited them to the sacrifice."},{"num":6,"verse":"When they had come, he looked at Eliab and said, “Certainly this is the Lord’s anointed.”"},{"num":7,"verse":"But the Lord said to Samuel, “Do not look at his appearance or at how tall he is, because I have rejected him. For the Lord does not look at things the way man does. For man looks at the outward appearance, but the Lord looks at the heart.”"},{"num":8,"verse":"Then Jesse called Abinadab and had him pass in front of Samuel. But Samuel said, “The Lord has not chosen this one either.”"},{"num":9,"verse":"Then Jesse had Shammah pass by. But Samuel said, “The Lord has not chosen this one either.”"},{"num":10,"verse":"Jesse had seven of his sons pass before Samuel. Samuel said to Jesse, “The Lord has not chosen any of these.” "},{"num":11,"verse":"Samuel said to Jesse, “Is that all of the young men?”"},{"num":12,"verse":"He sent for him and brought him in. David had red hair and striking eyes, and was good-looking. The Lord said, “Get up! Anoint him, because this is the one.”"},{"num":13,"verse":"So Samuel took the horn of oil and anointed him in the presence of his brothers. The Spirit of the Lord rushed on David with power from that day forward. After that Samuel set out and returned to Ramah."},{"header":"David and Saul Meet"},{"num":14,"verse":"The Spirit of the Lord departed from Saul, and an evil spirit from the Lord tormented him."},{"num":15,"verse":"So Saul’s servants said to him, “Please listen to us. An evil spirit from God is tormenting you. "},{"num":16,"verse":"Our lord, please command your servants who are here with you to seek out a man who is skilled at playing the lyre. Then when the evil spirit from God is on you, he will play the lyre, and you will feel better.”"},{"num":17,"verse":"So Saul said to his servants, “Find a man who can play well and bring him to me.”"},{"num":18,"verse":"Then one of the young attendants replied, “As a matter of fact, I have seen a son of Jesse from Bethlehem who is a skillful player. He is a strong, brave man, fit for war. He shows good judgment in what he says and is a handsome man. And the Lord is with him.”"},{"num":19,"verse":"So Saul sent messengers to Jesse and said, “Send me your son David, who is with the sheep.”"},{"num":20,"verse":"Jesse took a donkey loaded with bread, a container of wine, and a young goat, and he sent them with his son David to Saul. "},{"num":21,"verse":"David came to Saul and stood before him. Saul loved him, and David became his armor bearer. "},{"num":22,"verse":"So Saul sent to Jesse, saying, “Permit David to remain and serve me, for I am very pleased with him.” "},{"num":23,"verse":"Whenever the spirit from God came over Saul, David would take the lyre in his hand and play. So Saul would be soothed and feel better, and the evil spirit would depart from him."}]