[{"header":"David Chosen to Be King"},{"num":16,"verse":"Yahweh asked Samuel, “How long are you going to mourn for Saul now that I have rejected him as king of Israel? Fill a flask with olive oil and go. I’m sending you to Jesse in Bethlehem because I’ve selected one of his sons to be king.”"},{"num":2,"verse":"“How can I go?” Samuel asked. “When Saul hears about it, he’ll kill me.”"},{"num":3,"verse":"Invite Jesse to the sacrifice. I will reveal to you what you should do, and you will anoint for me the one I point out to you.”"},{"num":4,"verse":"Samuel did what Yahweh told him. When he came to Bethlehem, the leaders of the city, trembling with fear, greeted him and said, “May peace be with you.”"},{"num":5,"verse":"“Greetings,” he replied, “I have come to sacrifice to Yahweh. Perform the ceremonies to make yourselves holy, and come with me to the sacrifice.” He performed the ceremonies for Jesse and his sons and invited them to the sacrifice. "},{"num":6,"verse":"When they came, he saw Eliab and thought, “Certainly, here in Yahweh’s presence is his anointed king.”"},{"num":7,"verse":"But Yahweh told Samuel, “Don’t look at his appearance or how tall he is, because I have rejected him. Elohim does not see as humans see. Humans look at outward appearances, but Yahweh looks into the heart.”"},{"num":8,"verse":"Then Jesse called Abinadab and brought him to Samuel. But Samuel said, “Yahweh has not chosen this one either.”"},{"num":9,"verse":"Then Jesse had Shammah come to Samuel. “Yahweh has not chosen this one either,” Samuel said. "},{"num":10,"verse":"So Jesse brought seven more of his sons to Samuel, but Samuel told Jesse, “Yahweh has not chosen any of these. "},{"num":11,"verse":"Are these all the sons you have?”"},{"num":12,"verse":"So Jesse sent for him. He had a healthy complexion, attractive eyes, and a handsome appearance. Yahweh said, “Go ahead, anoint him. He is the one.” "},{"num":13,"verse":"Samuel took the flask of olive oil and anointed David in the presence of his brothers. The Ruach Yahweh came over David and stayed with him from that day on. Then Samuel left for Ramah."},{"header":"David Plays the Lyre for Saul"},{"num":14,"verse":"Now, the Ruach Yahweh had left Saul, and an evil spirit from Yahweh tormented him. "},{"num":15,"verse":"Saul’s officials told him, “An evil spirit from Elohim is tormenting you. "},{"num":16,"verse":"Your Majesty, why don’t you command us to look for a man who can play the lyre well? When the evil spirit from Elohim comes to you, he’ll strum a tune, and you’ll feel better.”"},{"num":17,"verse":"Saul told his officials, “Please find me a man who can play well and bring him to me.”"},{"num":18,"verse":"One of the officials said, “I know one of Jesse’s sons from Bethlehem who can play well. He’s a courageous man and a warrior. He has a way with words, he is handsome, and Yahweh is with him.”"},{"num":19,"verse":"Saul sent messengers to Jesse to say, “Send me your son David, who is with the sheep.”"},{"num":20,"verse":"Jesse took six bushels of bread, a full wineskin, and a young goat and sent them with his son David to Saul. "},{"num":21,"verse":"David came to Saul and served him. Saul loved him very much and made David his armorbearer. "},{"num":22,"verse":"Saul sent this message to Jesse, “Please let David stay with me because I have grown fond of him.”"},{"num":23,"verse":"Whenever Elohim’s spirit came to Saul, David took the lyre and strummed a tune. Saul got relief from his terror and felt better, and the evil spirit left him."}]