[{"num":16,"verse":"And Hashem said unto Shmuel, Ad mosai wilt thou mourn for Sha’ul, seeing I have rejected him as Melech al Yisroel? Fill thine keren with shemen, and go, I will send thee to Yishai of Beit-Lechem: for I have provided Me a melech among his banim."},{"num":2,"verse":"And Shmuel said, How can I go? If Sha’ul hear it, he will kill me. And Hashem said, Take an eglat bakar (heifer of the herd) with thee, and say, I am come to sacrifice to Hashem."},{"num":3,"verse":"And call Yishai to the zevach, and I will show thee what thou shalt do; umashachta (and thou shalt anoint) unto Me him whom I say unto thee."},{"num":4,"verse":"And Shmuel did that which Hashem spoke, and came to Beit-Lechem. And the zekenim of the town trembled at his coming, and said, Comest thou in shalom?"},{"num":5,"verse":"And he said, Shalom; I am come to sacrifice unto Hashem; set yourselves apart as kodesh, and come with me to the zevach. And he set apart as kodesh Yishai and his banim, and called them to the zevach."},{"num":6,"verse":"And it came to pass, when they were come, that he [Shmuel] took one look at Eliav, and said, Surely Hashem’s Moshiach is before Him."},{"num":7,"verse":"But Hashem said unto Shmuel, Look not on his mareh (appearance), or on the height of his stature; because I have rejected him; for Hashem seeth not as HaAdam seeth; for HaAdam looketh at the einayim (eyes, outward form); Hashem looketh at the lev."},{"num":8,"verse":"Then Yishai called Avinadav, and made him pass before Shmuel. And he said, Neither hath Hashem chosen this."},{"num":9,"verse":"Then Yishai made Shammah to pass by. And he said, Neither hath Hashem chosen this."},{"num":10,"verse":"Again, Yishai made his shivat banim to pass before Shmuel. And Shmuel said unto Yishai, these Hashem hath not bachar (chosen)."},{"num":11,"verse":"And Shmuel said unto Yishai, Are here all thy ne’arim (boys)? And he said, There remaineth yet the katan (small, young), and, hinei, ro’eh batzon (tending the flock) is he. And Shmuel said unto Yishai, Send and get him; for we will not sit down [to eat] till he come here."},{"num":12,"verse":"And he sent, and brought him in. Now he was adomoni (ruddy, of healthy red complexion) and withal of a yafeh countenance, and good-looking. And Hashem said, Arise, meshachehu (anoint him); ki zeh hu (for this is he)."},{"num":13,"verse":"Then Shmuel took the keren of shemen, v’yimshach (and anointed) him in the midst of his achim; and the Ruach [Hakodesh] of Hashem came upon Dovid from that day forward. So Shmuel rose up, and went to Ramah."},{"num":14,"verse":"But the Ruach [Hakodesh] of Hashem departed from Sha’ul, and a ruach ra’ah from Hashem terrified and overwhelmed him [Sha’ul]."},{"num":15,"verse":"And the avdei Sha’ul said unto him, Hinei now, a ruach Elohim ra’ah terrifieth and overwhelmeth thee."},{"num":16,"verse":"Let adoneinu now command thy avadim, which are before thee, to seek out an ish, who is a menagen (player) on the kinnor (harp); and it shall come to pass, when the ruach Elohim ra’ah is upon thee, that he shall play with his yad, and thou shalt be tov (better, well)."},{"num":17,"verse":"And Sha’ul said unto his avadim, Look for me now an ish that can play well, and bring him to me."},{"num":18,"verse":"Then answered one of the ne’arim, and said, Hinei, I have seen a ben of Yishai of Beit-Lechem, that is skillful in playing, and a gibbor chayil and an ish milchamah prudent in matters, and an ish to’ar (handsome man), and Hashem is with him."},{"num":19,"verse":"Wherefore Sha’ul sent malachim unto Yishai, and said, Send me Dovid binecha, which is with the tzon."},{"num":20,"verse":"And Yishai took a chamor laden with lechem, and a skin of yayin, and a gedi (young goat), and sent them by Dovid bno unto Sha’ul."},{"num":21,"verse":"And Dovid came to Sha’ul, and stood before him; and he loved him greatly; and he became his no’se kelim (armor-bearer)."},{"num":22,"verse":"And Sha’ul sent to Yishai, saying, Let Dovid, now, stand before me; for he hath found chen (favor) in my eyes."},{"num":23,"verse":"And it came to pass, when the ruach Elohim was upon Sha’ul, that Dovid took the kinnor, and played with his yad; so Sha’ul was relieved, and was tov, and the ruach hara’ah departed from him."}]