[{"header":"Friendship With the World"},{"num":4,"verse":"Where do wars and fights among you come from? Do they not come from your lusts that war in your body? "},{"num":2,"verse":"You lust and do not have, so you kill. You desire to have and cannot obtain. You fight and war. Yet you do not have, because you do not ask. "},{"num":3,"verse":"You ask, and do not receive, because you ask amiss, that you may spend it on your passions."},{"num":4,"verse":"You adulterers and adulteresses, do you not know that the friendship with the world is enmity with God? Whoever therefore will be a friend of the world is the enemy of God. "},{"num":5,"verse":"Do you think that the Scripture says in vain, “He yearns jealously for the spirit that lives in us”? "},{"num":6,"verse":"But He gives more grace. For this reason it says:"},{"num":7,"verse":"Therefore submit yourselves to God. Resist the devil, and he will flee from you. "},{"num":8,"verse":"Draw near to God, and He will draw near to you. Cleanse your hands, you sinners, and purify your hearts, you double-minded. "},{"num":9,"verse":"Grieve and mourn and weep. Let your laughter be turned to mourning, and your joy to dejection. "},{"num":10,"verse":"Humble yourselves in the sight of the Lord, and He will lift you up."},{"header":"Judging a Brother"},{"num":11,"verse":"Do not speak evil of one another, brothers. He who speaks evil of his brother and judges his brother speaks evil of the law and judges the law. If you judge the law, you are not a doer of the law, but a judge. "},{"num":12,"verse":"There is one Lawgiver who is able to save and to destroy. Who are you to judge another?"},{"header":"Warning Against Boasting"},{"num":13,"verse":"Come now, you who say, “Today or tomorrow we will go into this city, spend a year there, buy and sell, and make a profit,” "},{"num":14,"verse":"whereas you do not know what will happen tomorrow. What is your life? It is just a vapor that appears for a little while and then vanishes away. "},{"num":15,"verse":"Instead you ought to say, “If the Lord wills, we shall live and do this or that.” "},{"num":16,"verse":"But now you are rejoicing in your boastings. All such rejoicing is evil. "},{"num":17,"verse":"Therefore, to him who knows to do good and does not do it, it is sin."}]