[{"header":"Give Yourselves to God"},{"num":4,"verse":"Do you know where your fights and arguments come from? They come from the selfish desires that war within you. "},{"num":2,"verse":"You want things, but you do not have them. So you are ready to kill and are jealous of other people, but you still cannot get what you want. So you argue and fight. You do not get what you want, because you do not ask God. "},{"num":3,"verse":"Or when you ask, you do not receive because the reason you ask is wrong. You want things so you can use them for your own pleasures."},{"num":4,"verse":"So, you are not loyal to God! You should know that loving the world is the same as hating God. Anyone who wants to be a friend of the world becomes God’s enemy. "},{"num":5,"verse":"Do you think the Scripture means nothing that says, “The Spirit that God made to live in us wants us for himself alone”? "},{"num":6,"verse":"But God gives us even more grace, as the Scripture says,"},{"num":7,"verse":"So give yourselves completely to God. Stand against the devil, and the devil will run from you. "},{"num":8,"verse":"Come near to God, and God will come near to you. You sinners, clean sin out of your lives. You who are trying to follow God and the world at the same time, make your thinking pure. "},{"num":9,"verse":"Be sad, cry, and weep! Change your laughter into crying and your joy into sadness. "},{"num":10,"verse":"Humble yourself in the Lord’s presence, and he will honor you."},{"header":"You Are Not the Judge"},{"num":11,"verse":"Brothers and sisters, do not tell evil lies about each other. If you speak against your fellow believers or judge them, you are judging and speaking against the law they follow. And when you are judging the law, you are no longer a follower of the law. You have become a judge. "},{"num":12,"verse":"God is the only Lawmaker and Judge. He is the only One who can save and destroy. So it is not right for you to judge your neighbor."},{"header":"Let God Plan Your Life"},{"num":13,"verse":"Some of you say, “Today or tomorrow we will go to some city. We will stay there a year, do business, and make money.” "},{"num":14,"verse":"But you do not know what will happen tomorrow! Your life is like a mist. You can see it for a short time, but then it goes away. "},{"num":15,"verse":"So you should say, “If the Lord wants, we will live and do this or that.” "},{"num":16,"verse":"But now you are proud and you brag. All of this bragging is wrong. "},{"num":17,"verse":"Anyone who knows the right thing to do, but does not do it, is sinning."}]