[{"header":"Humility and Faith"},{"num":4,"verse":"Where do wars come from? Why do people among you fight? It all comes from within, doesn’t it – from your desires for pleasure which make war in your members. "},{"num":2,"verse":"You want something and you haven’t got it, so you murder someone. You long to possess something, but you can’t get it, so you fight and wage war. The reason you don’t have it is because you don’t ask for it! "},{"num":3,"verse":"And when you do ask, you don’t get it, because you ask wrongly, intending to spend it on your pleasures. "},{"num":4,"verse":"Adulterers! Don’t you know that to be friends with the world means being enemies with God? So anyone who wants to be friends with the world is setting themselves up as God’s enemy. "},{"num":5,"verse":"Or do you suppose that when the Bible says, ‘He yearns jealously over the spirit he has made to dwell in us’, it doesn’t mean what it says?"},{"num":6,"verse":"But God gives more grace; so it says, ‘God opposes the proud, but gives grace to the humble.’ "},{"num":7,"verse":"Submit to God, then; resist the devil and he will run away from you. "},{"num":8,"verse":"Draw near to God, and he will draw near to you. Make your hands clean, you sinners; and make your hearts pure, you double-minded lot. "},{"num":9,"verse":"Make yourselves wretched; mourn and weep. Let your laughter turn to mourning, and your joy to sorrow. "},{"num":10,"verse":"Humble yourselves before the Lord, and he will exalt you."},{"header":"Living by Trust in God"},{"num":11,"verse":"Do not speak evil against one another, my dear family. Anyone who speaks evil against another family member, or passes judgment against them, speaks evil against the law and judges the law. But if you judge the law, you are not a doer of the law but a judge! "},{"num":12,"verse":"There is one lawgiver, one judge who can rescue or destroy. But who are you to judge your neighbour?"},{"num":13,"verse":"Now look here, you people who say, ‘Today, or tomorrow, we will go to such-and-such a town and spend a year there, and trade, and make some money.’ "},{"num":14,"verse":"You have no idea what the next day will bring. What is your life? You are a mist which appears for a little while and then disappears again. "},{"num":15,"verse":"Instead, you ought to say, ‘If the Lord wills, we shall live, and we shall do this, or that.’ "},{"num":16,"verse":"But, as it is, you boast in your pride. All such boasting is evil. "},{"num":17,"verse":"So then, if anyone knows the right thing to do, but doesn’t do it, it becomes sin for them."}]