[{"num":4,"verse":"What is causing the quarrels and fights among you? Isn’t it because there is a whole army of evil desires within you? "},{"num":2,"verse":"You want what you don’t have, so you kill to get it. You long for what others have, and can’t afford it, so you start a fight to take it away from them. And yet the reason you don’t have what you want is that you don’t ask God for it. "},{"num":3,"verse":"And even when you do ask you don’t get it because your whole aim is wrong—you want only what will give you pleasure."},{"num":4,"verse":"You are like an unfaithful wife who loves her husband’s enemies. Don’t you realize that making friends with God’s enemies—the evil pleasures of this world—makes you an enemy of God? I say it again, that if your aim is to enjoy the evil pleasure of the unsaved world, you cannot also be a friend of God. "},{"num":5,"verse":"Or what do you think the Scripture means when it says that the Holy Spirit, whom God has placed within us, watches over us with tender jealousy? "},{"num":6,"verse":"But he gives us more and more strength to stand against all such evil longings. As the Scripture says, God gives strength to the humble but sets himself against the proud and haughty."},{"num":7,"verse":"So give yourselves humbly to God. Resist the devil and he will flee from you. "},{"num":8,"verse":"And when you draw close to God, God will draw close to you. Wash your hands, you sinners, and let your hearts be filled with God alone to make them pure and true to him. "},{"num":9,"verse":"Let there be tears for the wrong things you have done. Let there be sorrow and sincere grief. Let there be sadness instead of laughter, and gloom instead of joy. "},{"num":10,"verse":"Then when you realize your worthlessness before the Lord, he will lift you up, encourage and help you."},{"num":11,"verse":"Don’t criticize and speak evil about each other, dear brothers. If you do, you will be fighting against God’s law of loving one another, declaring it is wrong. But your job is not to decide whether this law is right or wrong, but to obey it. "},{"num":12,"verse":"Only he who made the law can rightly judge among us. He alone decides to save us or destroy. So what right do you have to judge or criticize others?"},{"num":13,"verse":"Look here, you people who say, “Today or tomorrow we are going to such and such a town, stay there a year, and open up a profitable business.” "},{"num":14,"verse":"How do you know what is going to happen tomorrow? For the length of your lives is as uncertain as the morning fog—now you see it; soon it is gone. "},{"num":15,"verse":"What you ought to say is, “If the Lord wants us to, we shall live and do this or that.” "},{"num":16,"verse":"Otherwise you will be bragging about your own plans, and such self-confidence never pleases God."},{"num":17,"verse":"Remember, too, that knowing what is right to do and then not doing it is sin."}]