[{"num":4,"verse":"Why do you fight and quarrel? It is because your feelings are fighting inside of you. That is why you fight."},{"num":2,"verse":"You want something but you cannot get it. Then you kill. You want something very much and cannot get it. So you quarrel and fight. You do not get it because you do not ask God for it."},{"num":3,"verse":"You ask for it, but you do not get it, because you ask in a wrong way. You want to use it for yourselves and not for others."},{"num":4,"verse":"You people promised God you would be true to him, but you did not stay true! Do you not know that if you love the world you hate God? Anyone who wants to be a lover of the world makes himself an enemy of God."},{"num":5,"verse":"The holy writings say, `God gave his Spirit to live in us. And that Spirit wants us for himself.' Do you think this means nothing?"},{"num":6,"verse":"But God helps you even more than that. That is why the holy writings say, `God fights against those who are proud, but he helps those who are not proud.'"},{"num":7,"verse":"So let God control you. Fight the devil and he will run away from you."},{"num":8,"verse":"Come to God and he will come to you. You bad people, make your hands clean! You love what is good and what is wrong at the same time. Make your hearts clean."},{"num":9,"verse":"Be sad about this, and cry. Turn your laughing into crying. Stop being happy. Be sad."},{"num":10,"verse":"Do not be proud before the Lord. Then he will lift you up."},{"num":11,"verse":"My brothers, do not say wrong things about each other. A man who says wrong things about his brother or judges his brother is saying wrong things about God's law and he is judging God's law. If you judge the law, you are not obeying the law, but you are a judge."},{"num":12,"verse":"God made the law and he is the judge. And he is the one who can save you or kill you. Who are you that you should judge your neighbour?"},{"num":13,"verse":"Listen to me! You say, `Today or tomorrow we will go to that town. We will stay there a year. We will buy and sell and get rich.' But you do not know what will happen to you tomorrow."},{"num":14,"verse":"What is your life like? It is like a cloud. It is here for a little while and then it is gone."},{"num":15,"verse":"You should say `If the Lord wants to do it, we will live and do this or that.'"},{"num":16,"verse":"But now you talk about the big things you will do. All that kind of talk is wrong!"},{"num":17,"verse":"But if a person knows what he should do and he does not do it, he has done something wrong."}]