[{"num":29,"verse":"1 A prophecy against Jerusalem. 13 The vengeance of God on them that follow the traditions of men."},{"num":1,"verse":"Ah altar, altar of the city that David dwelt in: add year unto year: let them kill lambs."},{"num":2,"verse":"But I will bring the altar into distress, and there shall be heaviness and sorrow, and it shall be unto me like an altar."},{"num":3,"verse":"And I will besiege thee as a circle, and fight against thee on a mount, and will cast up ramparts against thee."},{"num":4,"verse":"So shalt thou be humbled, and shalt speak out of the ground, and thy speech shall be as out of the dust: thy voice also shall be out of the ground like him that hath a spirit of divination, and thy talking shall whisper out of the dust."},{"num":5,"verse":"Moreover, multitude of thy strangers shall be like small dust, and the multitude of strong men shall be as chaff that passeth away: and it shall be in a moment, even suddenly."},{"num":6,"verse":"Thou shalt be visited of the Lord of hosts with thunder, and shaking, and a great noise, a whirlwind, and a tempest, and a flame of a devouring fire."},{"num":7,"verse":"And the multitude of all the nations that fight against the altar, shall be as a dream or vision by night: even all they that make the war against it, and strongholds against it, and lay siege unto it."},{"num":8,"verse":"And it shall be like as an hungry man dreameth, and behold, he eateth: and when he awaketh, his soul is empty: or like as a thirsty man dreameth, and lo, he is drinking, and when he awaketh, behold, he is faint, and his soul longeth: so shall the multitude of all nations be that fight against mount Zion."},{"num":9,"verse":"Stay yourselves and wonder: they are blind, and make you blind: they are drunken, but not with wine: they stagger, but not by strong drink."},{"num":10,"verse":"For the Lord hath covered you with a spirit of slumber, and hath shut up your eyes: the Prophet, and your chief Seers hath he covered."},{"num":11,"verse":"And the vision of them all is become unto you, as the words of a book that is sealed up, which they deliver to one that can read, saying, Read this, I pray thee. Then shall he say, I cannot; for it is sealed."},{"num":12,"verse":"And the book is given unto him that cannot read, saying, Read this, I pray thee. And he shall say, I cannot read."},{"num":13,"verse":"Therefore the Lord said, Because this people come near unto me with their mouth, and honor me with their lips, but have removed their heart far from me, and their fear toward me was taught by the precept of men,"},{"num":14,"verse":"Therefore behold, I will again do a marvelous work in this people, even a marvelous work, and a wonder: for the wisdom of their wise men shall perish, and the understanding of their prudent men shall be hid."},{"num":15,"verse":"Woe unto them that seek deep to hide their counsel from the Lord: for their works are in darkness, and they say, Who seeth us? and who knoweth us?"},{"num":16,"verse":"Your turning of devices shall it not be esteemed as the potter’s clay? for shall the work say of him that made it, He made me not? or the thing formed, say of him that fashioned it, He had none understanding?"},{"num":17,"verse":"Is it not yet but a little while, and Lebanon shall be turned into Carmel? and Carmel shall be counted as a forest?"},{"num":18,"verse":"And in that day shall the deaf hear the words of the book, and the eyes of the blind shall see out of obscurity, and out of darkness."},{"num":19,"verse":"The meek in the Lord shall receive joy again, and the poor men shall rejoice in the Holy one of Israel."},{"num":20,"verse":"For the cruel man shall cease, and the scornful shall be consumed: and all that hasted to iniquity, shall be cut off:"},{"num":21,"verse":"Which made a man to sin in the word, and took him in a snare: which reproved them in the gate, and made the just to fall without cause."},{"num":22,"verse":"Therefore thus saith the Lord unto the house of Jacob, even he that redeemed Abraham: Jacob shall not now be confounded, neither now shall his face be pale."},{"num":23,"verse":"But when he seeth his children, the work of mine hands, in the midst of him, they shall sanctify my Name, and sanctify the Holy one of Jacob, and shall fear the God of Israel."},{"num":24,"verse":"Then they that erred in spirit, shall have understanding, and they that murmured, shall learn doctrine."}]