[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall not hurt nor destroy . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The pronoun may possibly refer to the evil beasts, the lion, the bear, the leopard, of the previous verses. The prophet, on this view, sees in his vision, as it were, a restored Eden, a paradise life, in which the fiercest brutes have lost their fierceness. The words admit, however, of being taken as a generalised statement: “None shall hurt nor destroy ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ". . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” The “holy mountain “is none other than the “mountain of the Lord’s house” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in its future apocalyptic glory (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 40:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 14:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but may, perhaps, include the whole of the hill-country of Israel, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The earth shall be full of the knowledge of the Lord.—If, as some have thought, the “earth” here should be the land (i.e., as in Isaiah 9:19; Isaiah 10:23, the land of Judah), that region is represented as the paradise centre of a restored world, to which, as in Isaiah 2:2, all nations turn for light and blessing. Probably, however, the words may be taken in their wider significance. This was for the prophet the crown and consummation of the work of redemption. More than all removal of physical evil, he thought of a victory over moral and spiritual darkness. As it is, in the existing order of the world, few fear God; still fewer know Him as He should be known. But in that new earth “the knowledge of Jehovah” shall flow far and wide. Even as the waters of the Mediterranean (the sea which must have suggested the prophet’s comparison) washed the shores of the far-off isles of the Gentiles, the coasts of Chittim (Numbers 24:24), as well as those of Israel, so should the knowledge of the truth of God expand beyond the limits of the people of Israel. Hence the transition was natural to the prophecies which speak at once of the restoration of Israel and the in-gathering of the heathen. It should be remembered that in Hosea 3:5; Joel 2:28; Joel 3:17, prophecies like in kind had preceded Isaiah’s utterance. In Habakkuk 2:14 it is all but verbally reproduced.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The earth shall be full of the knowledge of the Lord.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—If, as some have thought, the “earth” here should be the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "land ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the land of Judah), that region is represented as the paradise centre of a restored world, to which, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", all nations turn for light and blessing. Probably, however, the words may be taken in their wider significance. This was for the prophet the crown and consummation of the work of redemption. More than all removal of physical evil, he thought of a victory over moral and spiritual darkness. As it is, in the existing order of the world, few fear God; still fewer know Him as He should be known. But in that new earth “the knowledge of Jehovah” shall flow far and wide. Even as the waters of the Mediterranean (the sea which must have suggested the prophet’s comparison) washed the shores of the far-off isles of the Gentiles, the coasts of Chittim (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 24:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as well as those of Israel, so should the knowledge of the truth of God expand beyond the limits of the people of Israel. Hence the transition was natural to the prophecies which speak at once of the restoration of Israel and the in-gathering of the heathen. It should be remembered that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", prophecies like in kind had preceded Isaiah’s utterance. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is all but verbally reproduced.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 11:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They shall not hurt nor destroy in all my holy mountain ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Here the prophet himself gives us a key wherewith to open his meaning in the three preceding verses. By the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy mountain ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he means, the Christian Church, frequently termed ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zion, Jerusalem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and God’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy mountain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the writings of the prophets. Wherever the gospel comes and prevails; wherever the true and genuine religion of Christ takes place and is established, these effects are produced. And in due time the gospel shall prevail, and the true religion of Jesus be established everywhere. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the earth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The world, with its inhabitants, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be full of the knowledge of the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— By this he intimates, that all that savageness and malignity which are in carnal and wicked men toward the people of God, and all those unholy, unkind, and unhappy dispositions which are in any of the human race, proceed from their ignorance of God, or their want of a true and saving acquaintance with him, which, wherever it takes place, produces a marvellous and thorough change in men’s hearts and lives. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As the waters cover the sea ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As the waters spread themselves over the bottom, and entirely fill all the channels of the sea. Although this prophecy begins to be fulfilled wherever the kingdom of grace is set up among men, and is more and more fulfilled in proportion as that kingdom is enlarged; yet the perfect accomplishment of it will not be witnessed till those latter days come, when, according to the Scriptures, the knowledge and practice of Christianity will be universally diffused, and all those divine virtues which it inculcates will be most eminently exerted and displayed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:1-9 The Messiah is called a Rod, and a Branch. The words signify a small, tender product; a shoot, such as is easily broken off. He comes forth out of the stem of Jesse; when the royal family was cut down and almost levelled with the ground, it would sprout again. The house of David was brought very low at the time of Christ's birth. The Messiah thus gave early notice that his kingdom was not of this world. But the Holy Spirit, in all his gifts and graces, shall rest and abide upon him; he shall have the fulness of the Godhead dwelling in him, Col 1:19; 2:9. Many consider that seven gifts of the Holy Spirit are here mentioned. And the doctrine of the influences of the Holy Spirit is here clearly taught. The Messiah would be just and righteous in all his government. His threatening shall be executed by the working of his Spirit according to his word. There shall be great peace and quiet under his government. The gospel changes the nature, and makes those who trampled on the meek of the earth, meek like them, and kind to them. But it shall be more fully shown in the latter days. Also Christ, the great Shepherd, shall take care of his flock, that the nature of troubles, and of death itself, shall be so changed, that they shall not do any real hurt. God's people shall be delivered, not only from evil, but from the fear of it. Who shall separate us from the love of Christ? The better we know the God of love, the more shall we be changed into the same likeness, and the better disposed to all who have any likeness to him. This knowledge shall extend as the sea, so far shall it spread. And this blessed power there have been witnesses in every age of Christianity, though its most glorious time, here foretold, is not yet arrived. Meanwhile let us aim that our example and endeavours may help to promote the honour of Christ and his kingdom of peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall not hurt - That is, those who are designated above under the emblems of the lion, the leopard, the bear, and the adder.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor destroy in all my holy mountain - Mount Zion; used here, as elsewhere, to denote the seat of his reign on the earth, or his church; the notes at Isaiah 1:8; Isaiah 2:4. The disposition of people, naturally ferocious and cruel, shall be changed so entirely, that the causes of strife and contention shall cease. They shall be disposed to do justice, and to promote each other's welfare everywhere.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nor destroy in all my holy mountain - Mount Zion; used here, as elsewhere, to denote the seat of his reign on the earth, or his church; the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The disposition of people, naturally ferocious and cruel, shall be changed so entirely, that the causes of strife and contention shall cease. They shall be disposed to do justice, and to promote each other's welfare everywhere.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For the earth - That is, in the times of the Messiah, It does not say that it shall be immediate under his reign, but under his reign this shall occur on the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The knowledge of the Lord - This is put for piety, as the \"fear\" of the Lord often is. The earth shall be full of a correct understanding of the existence, perfections, plans, and claims of God; and shall be disposed to yield to those claims - thus producing universal peace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the waters cover the sea - That is, the depths or the bottom of the sea; compare Habakkuk 2:14. The vast waters of the ocean cover all its depths, find their way into all the caverns, flow into all the recesses on the shore - and thus shall the knowledge of Yahweh spread like deep, flowing waters, until the earth shall be pervaded and covered with it. It is evident that a time is here spoken of which has not yet fully come, and the mind is still directed onward, as was that of the prophet, to a future period when this shall be accomplished. The prophecy has been indeed in part fulfilled. Wherever the gospel has spread, its effect has been just that which is predicted here. It has calmed and subdued the angry passions of people; changed their feelings and their conduct; disposed them to peace; and tended to mitigate national ferocity, to produce kindness to captives, and to those who had been oppressed. It has mitigated laws that were cruel and bloody; and has abolished customs, games, sports, and pastimes that were ferocious and savage. It has often changed the bitter persecutor, as it did Saul of Tarsus, to the mildness and gentleness of a lamb; and it has spread an influence over nations tending to produce humanity and benevolence. It has produced mildness, gentleness, and love, in the domestic circle; changed a the cruel and lordly husband to a companion and friend; and the character of the stern and inexorable father to one of paternal kindness and peace. Wherever it has spread \"in truth\" and not \"in form merely,\" it has shed a mild, calming, and subduing influence over the passions, laws, and customs of people. But its effects have been but partially felt; and we are led, therefore, to look forward to future times, when the prophecy shall be entirely fulfilled, and the power of the gospel shall be felt in all nations. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As the waters cover the sea - That is, the depths or the bottom of the sea; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The vast waters of the ocean cover all its depths, find their way into all the caverns, flow into all the recesses on the shore - and thus shall the knowledge of Yahweh spread like deep, flowing waters, until the earth shall be pervaded and covered with it. It is evident that a time is here spoken of which has not yet fully come, and the mind is still directed onward, as was that of the prophet, to a future period when this shall be accomplished. The prophecy has been indeed in part fulfilled. Wherever the gospel has spread, its effect has been just that which is predicted here. It has calmed and subdued the angry passions of people; changed their feelings and their conduct; disposed them to peace; and tended to mitigate national ferocity, to produce kindness to captives, and to those who had been oppressed. It has mitigated laws that were cruel and bloody; and has abolished customs, games, sports, and pastimes that were ferocious and savage. It has often changed the bitter persecutor, as it did Saul of Tarsus, to the mildness and gentleness of a lamb; and it has spread an influence over nations tending to produce humanity and benevolence. It has produced mildness, gentleness, and love, in the domestic circle; changed a the cruel and lordly husband to a companion and friend; and the character of the stern and inexorable father to one of paternal kindness and peace. Wherever it has spread \"in truth\" and not \"in form merely,\" it has shed a mild, calming, and subduing influence over the passions, laws, and customs of people. But its effects have been but partially felt; and we are led, therefore, to look forward to future times, when the prophecy shall be entirely fulfilled, and the power of the gospel shall be felt in all nations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. my holy mountain—Zion, that is, Jerusalem. The seat of government and of Messiah's throne is put for the whole earth (Jer 3:17).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "sea—As the waters find their way into every cavern of its depths, so Christianity shall pervade every recess of the earth (Hab 2:14). As Isa 11:1-5 describe the personal qualities of Messiah, and Isa 11:6-9 the regenerating effects of His coming on creation, so Isa 11:10-16 the results of it in the restoration of His people, the Jews, and the conversion through them of the Gentiles.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In my holy mountain; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Zion, in my church. Wherever the gospel comes and prevails, it will have this effect. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The earth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " metonymically put for the inhabitants of the earth; and as before it was used for the greater part, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 11:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", so here it is used for the better part of the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of the knowledge of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of saying and practical knowledge; whereby he intimates that all that savageness and malignity which is in wicked men towards true Christians proceeded from their deep ignorance, and particularly from ignorance of God; and withal, that a right knowledge of God will make a marvellous and thorough change in the dispositions and conversations of men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sea; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the channel of the sea, the thing contained being put for the thing containing, by a metonymy common in Scripture and all authors. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They shall not hurt nor destroy in all my holy mountain,.... In the Church, so called, in allusion to the holy hill of Zion; in the latter day, after the destruction of antichrist, there will be no more persecution of the saints; they will be no more injured nor harassed by wicked men, comparable to the above mentioned creatures, either for their cruelty or cunning; the reason follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the earth shall be full of the knowledge of the Lord, as the waters cover the sea: full of the Gospel, the means of conveying the knowledge of Christ, and of God in Christ, of his person and office, of his grace and righteousness, of peace, pardon, life, and salvation by him. The phrase denotes the abundance and depth of the knowledge of divine things, and the large spread of the Gospel, and the multitude of persons that shall be blessed with it, and a profound knowledge of it; so that there will be none to molest, disturb, and distress the people of God, see Habakkuk 2:14 this has had some appearance of accomplishment at several times; as at the first times of the Gospel, when the sound of it, by the apostles, went into all the earth, and diffused the savour of the knowledge of Christ in every place; and in the times of Constantine, when Paganism was abolished, and the whole empire became Christian, persecution ceased, and peace ensued, as before described; and at the Reformation, when whole nations embraced the Gospel of Christ; but the full accomplishment of it is yet to come, when the angel shall fly in the midst of heaven, having the everlasting Gospel to preach to all men, and the earth shall be lightened with his glory; when men shall run to and fro, and knowledge be increased, and all shall know the Lord, from the least to the greatest. This passage is applied to the times of the Messiah by the Jews, ancient and modern (d). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the earth shall be full of the knowledge of the Lord, as the waters cover the sea: full of the Gospel, the means of conveying the knowledge of Christ, and of God in Christ, of his person and office, of his grace and righteousness, of peace, pardon, life, and salvation by him. The phrase denotes the abundance and depth of the knowledge of divine things, and the large spread of the Gospel, and the multitude of persons that shall be blessed with it, and a profound knowledge of it; so that there will be none to molest, disturb, and distress the people of God, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this has had some appearance of accomplishment at several times; as at the first times of the Gospel, when the sound of it, by the apostles, went into all the earth, and diffused the savour of the knowledge of Christ in every place; and in the times of Constantine, when Paganism was abolished, and the whole empire became Christian, persecution ceased, and peace ensued, as before described; and at the Reformation, when whole nations embraced the Gospel of Christ; but the full accomplishment of it is yet to come, when the angel shall fly in the midst of heaven, having the everlasting Gospel to preach to all men, and the earth shall be lightened with his glory; when men shall run to and fro, and knowledge be increased, and all shall know the Lord, from the least to the greatest. This passage is applied to the times of the Messiah by the Jews, ancient and modern (d). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Zohar in Exod. fol. 28. 3. Kimchi in Joel 2. 28. Maimon. Melachim. c. 12. sect. 1. Caphtor, fol. 57. 2. and 93. 1. and 108. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Zohar in Exod. fol. 28. 3. Kimchi in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". 28. Maimon. Melachim. c. 12. sect. 1. Caphtor, fol. 57. 2. and 93. 1. and 108. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "They shall not hurt nor destroy in all my holy mountain: for the earth shall be full of the knowledge of the LORD, as {d} the waters cover the sea.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They shall not hurt nor destroy in all my holy mountain: for the earth shall be full of the knowledge of the LORD, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the waters cover the sea.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) It will be in as great abundance as the waters in the sea.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is questionable if the subject here is still the wild beasts (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The second half of the verse is rather against this, and it is better to translate the first half: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "none shall do evil or act corruptly in all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my holy mountain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Most naturally “Zion,” but some commentators understand it of the whole hill-country of Palestine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the earth shall be full … sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the peculiar participial construction, see Driver, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Tenses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " § 135. (7) Obs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My holy mountain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As the Jewish Church is always bound up with the \"holy hill of Zion,\" so the Messianic one receives the designation of \"the mountain of the Lord\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or \"the holy mountain\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What was physically true of the type is transferred to the antitype, which is \"a city set upon a hill\" in a certain sense. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The earth shall be full of the knowledge of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (romp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":29). A fruitful knowledge, guiding and influencing conduct, seems to be intended (see below, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"All thy children shall be taught of the Lord, and great shall be the peace of thy children\"). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As the waters cover the sea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"as the ocean covers and fills the bed prepared for it.\" Isaiah 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fruit of righteousness is peace, which now reigns in humanity under the rule of the Prince of Peace, and even in the animal world, with nothing whatever to disturb it. \"And the wolf dwells with the lamb, and the leopard lies down with the kid; and calf and lion and stalled ox together: a little boy drives them. And cow and bear go to the pasture; their young ones lie down together: and the lion eats shopped straw like the ox. And the suckling plays by the hole of the adder, and the weaned child stretches its hand to the pupil of the basilisk-viper. They will not hurt nor destroy in all my holy mountain: for the land is filled with knowledge of Jehovah, like the waters covering the sea.\" The fathers, and such commentators as Luther, Calvin, and Vitringa, have taken all these figures from the animal world as symbolical. Modern rationalists, on the other hand, understand them literally, but regard the whole as a beautiful dream and wish. It is a prophecy, however, the realization of which is to be expected on this side of the boundary between time and eternity, and, as Paul has shown in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is an integral link in the predestined course of the history of salvation (Hengstenberg, Umbreit, Hofmann, Drechsler). There now reign among irrational creatures, from the greatest to the least, - even among such as are invisible, - fierce conflicts and bloodthirstiness of the most savage kind. But when the Son of David enters upon the full possession of His royal inheritance, the peace of paradise will be renewed, and all that is true in the popular legends of the golden age be realized and confirmed. This is what the prophet depicts in such lovely colours. The wolf and lamb, those two hereditary foes, will be perfectly reconciled then. The leopard will let the teazing kid lie down beside it. The lion, between the calf and stalled ox, neither seizes upon its weaker neighbour, nor longs for the fatter one. Cow and bear graze together, whilst their young ones lie side beside in the pasture. The lion no longer thirsts for blood, but contents itself, like the ox, with chopped straw. The suckling pursues its sport (pilpel of שׁעע, mulcere) by the adder's hole, and the child just weaned stretches out its hand boldly and fearlessly to me'ūrath tziph‛ōni. It is evident from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 8:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that tziph‛ōni is the name of a species of snake. According to Aquila and the Vulgate, it is basiliskos, serpens regulus, possibly from tzaph, to pipe or hiss (Ges., Frst); for Isidorus, in his Origg. xii. 4, says, Sibilus idem est qui et regulus; sibilo enim occidit, antequam mordeat vel exurat. For the hapax leg. hâdâh, the meaning dirigere, tendere, is established by the Arabic; but there is all the more uncertainty about the meaning of the hap. leg. מאורה. According to the parallel חר, it seems to signify the hollow (Syr., Vulg., lxx, κοίτη): whether from אּוּר  equals  עוּר, from which comes מערה; or from אור, the light-hole (like מאור, which occurs in the Mishna, Ohaloth xiii. 1) or opening where a cavern opens to the light of day. It is probable, however, that me'ūrâh refers to something that exerts an attractive influence upon the child, either the \"blending of colours\" (Saad. renders tziph‛oni, errakas', the motley snake), or better still, the \"pupil of the eye\" (Targum), taking the word as a feminine of mâ'ōr, the light of the eye (b. Erubin 55b - the power of vision). The look of a snake, more especially of the basilisk (not merely the basilisk-lizard, but also the basilisk-viper), was supposed to have a paralyzing and bewitching influence; but now the snake will lose this pernicious power (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the basilisk become so tame and harmless, as to let children handle its sparkling eyes as if they were jewels. All this, as we should say with Luthardt and Hofmann (Schriftbeweis, ii. 2, 567), is only colouring which the hand of the prophet employs, for the purpose of painting the peace of that glorified state which surpasses all possibility of description; and it is unquestionably necessary to take the thought of the promise in a spiritual sense, without adhering literally to the medium employed in expressing it. But, on the other hand, we must guard against treating the description itself as merely a drapery thrown around the actual object; whereas it is rather the refraction of the object in the mind of the prophet himself, and therefore a manifestation of the true nature of that which he actually saw. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But are the animals to be taken as the subject in Isaiah 11:9 also? The subject that most naturally suggests itself is undoubtedly the animals, of which a few that are alarming and destructive to men have been mentioned just before. And the fact that they really are thought of as the subject, is confirmed by Isaiah 65:25, where Isaiah 11:6-9 is repeated in a compendious form. The idea that ירעוּ requires men as the subject, is refuted by the common רעה חיּה (compare the parallel promise in Ezekiel 34:25, which rests upon Hosea 2:20). That the term yashchithu can be applied to animals, is evident from Jeremiah 2:30, and may be assumed as a matter of course. But if the animals are the subject, har kodshi (my holy mountain) is not Zion-Moriah, upon which wild beasts never made their home in historical times; but, as the generalizing col (all) clearly shows, the whole of the holy mountain-land of Israel: har kodshi has just this meaning in Isaiah 57:13 (cf., Psalm 78:54; Exodus 15:17). The fact that peace prevails in the animal world, and also peace between man and beast, is then attributed to the universal prevalence of the knowledge of God, in consequence of which that destructive hostility between the animal world and man, by which estrangement and apostasy from God were so often punished (2 Kings 17:25; Ezekiel 14:15, etc.: see also Isaiah 7:24), have entirely come to an end. The meaning of \"the earth\" is also determined by that of \"all my holy mountain.\" The land of Israel, the dominion of the Son of David in the more restricted sense, will be from this time forward the paradisaical centre, as it were, of the whole earth - a prelude of its future state of perfect and universal glorification (Isaiah 6:3, \"all the earth\"). It has now become full of \"the knowledge of Jehovah,\" i.e., of that experimental knowledge which consists in the fellowship of love (דעה, like לדה, is a secondary form of דעת, the more common infinitive or verbal noun from ידע: Ges. 133, 1), like the waters which cover the sea, i.e., bottom of the sea (compare Habakkuk 2:14, where lâda‛ath is a virtual accusative, full of that which is to be known). \"Cover:\" cissâh l' (like sâcac l', Psalm 91:4), signifies to afford a covering to another; the Lamed is frequently introduced with a participle (in Arabic regularly) as a sign of the object (Ewald, 292, e), and the omission of the article in the case of mecassim is a natural consequence of the inverted order of the words. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But are the animals to be taken as the subject in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " also? The subject that most naturally suggests itself is undoubtedly the animals, of which a few that are alarming and destructive to men have been mentioned just before. And the fact that they really are thought of as the subject, is confirmed by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:6-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is repeated in a compendious form. The idea that ירעוּ requires men as the subject, is refuted by the common רעה חיּה (compare the parallel promise in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which rests upon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). That the term yashchithu can be applied to animals, is evident from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and may be assumed as a matter of course. But if the animals are the subject, har kodshi (my holy mountain) is not Zion-Moriah, upon which wild beasts never made their home in historical times; but, as the generalizing col (all) clearly shows, the whole of the holy mountain-land of Israel: har kodshi has just this meaning in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 57:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The fact that peace prevails in the animal world, and also peace between man and beast, is then attributed to the universal prevalence of the knowledge of God, in consequence of which that destructive hostility between the animal world and man, by which estrangement and apostasy from God were so often punished (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.: see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), have entirely come to an end. The meaning of \"the earth\" is also determined by that of \"all my holy mountain.\" The land of Israel, the dominion of the Son of David in the more restricted sense, will be from this time forward the paradisaical centre, as it were, of the whole earth - a prelude of its future state of perfect and universal glorification (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"all the earth\"). It has now become full of \"the knowledge of Jehovah,\" i.e., of that experimental knowledge which consists in the fellowship of love (דעה, like לדה, is a secondary form of דעת, the more common infinitive or verbal noun from ידע: Ges. 133, 1), like the waters which cover the sea, i.e., bottom of the sea (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where lâda‛ath is a virtual accusative, full of that which is to be known). \"Cover:\" cissâh l' (like sâcac l', ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 91:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), signifies to afford a covering to another; the Lamed is frequently introduced with a participle (in Arabic regularly) as a sign of the object (Ewald, 292, e), and the omission of the article in the case of mecassim is a natural consequence of the inverted order of the words. ",
            "children": []
          }
        ]
      }
    ]
  }
]