[{"header":"Continued Opposition to Rebuilding"},{"num":6,"verse":"Sanballat, Tobiah, Geshem the Arab, and the rest of our enemies found out that I had finished rebuilding the wall and that no gaps remained—though we had not yet set up the doors in the gates."},{"num":2,"verse":"So Sanballat and Geshem sent a message asking me to meet them at one of the villages in the plain of Ono."},{"num":3,"verse":"so I replied by sending this message to them: “I am engaged in a great work, so I can’t come. Why should I stop working to come and meet with you?”"},{"num":4,"verse":"Four times they sent the same message, and each time I gave the same reply."},{"num":5,"verse":"The fifth time, Sanballat’s servant came with an open letter in his hand,"},{"num":6,"verse":"and this is what it said:"},{"num":8,"verse":"I replied, “There is no truth in any part of your story. You are making up the whole thing.”"},{"num":9,"verse":"They were just trying to intimidate us, imagining that they could discourage us and stop the work. So I continued the work with even greater determination."},{"num":10,"verse":"Later I went to visit Shemaiah son of Delaiah and grandson of Mehetabel, who was confined to his home. He said, “Let us meet together inside the Temple of God and bolt the doors shut. Your enemies are coming to kill you tonight.”"},{"num":11,"verse":"But I replied, “Should someone in my position run from danger? Should someone in my position enter the Temple to save his life? No, I won’t do it!”"},{"num":12,"verse":"I realized that God had not spoken to him, but that he had uttered this prophecy against me because Tobiah and Sanballat had hired him."},{"num":13,"verse":"They were hoping to intimidate me and make me sin. Then they would be able to accuse and discredit me."},{"header":"The Builders Complete the Wall"},{"num":15,"verse":"So on October 2 the wall was finished—just fifty-two days after we had begun."},{"num":16,"verse":"When our enemies and the surrounding nations heard about it, they were frightened and humiliated. They realized this work had been done with the help of our God."},{"num":17,"verse":"During those fifty-two days, many letters went back and forth between Tobiah and the nobles of Judah."},{"num":18,"verse":"For many in Judah had sworn allegiance to him because his father-in-law was Shecaniah son of Arah, and his son Jehohanan was married to the daughter of Meshullam son of Berekiah."},{"num":19,"verse":"They kept telling me about Tobiah’s good deeds, and then they told him everything I said. And Tobiah kept sending threatening letters to intimidate me."}]