[{"header":"Attempts to Intimidate Nehemiah"},{"num":6,"verse":"Now it was reported to Sanballat, Tobiah, Geshem the Arabian, and the rest of our enemies that I had rebuilt the wall and no breach remained in it—even though at that time I had not positioned the doors in the gates. "},{"num":2,"verse":"Sanballat and Geshem sent word to me, saying, “Come, let us meet together in one of the villages in the plain of Ono.”"},{"num":3,"verse":"So I sent messengers to them saying, “I am doing an important work, so I cannot come down. Why should the work stop while I leave it and come down to you?”"},{"num":4,"verse":"They sent me the same message four times, and each time I returned a similar response to them. "},{"num":5,"verse":"But the fifth time Sanballat sent his young aide to me in this way, he had an open letter in his hand. "},{"num":6,"verse":"In it was written:"},{"num":8,"verse":"Then I sent a message to him, saying, “Nothing like what you are saying is happening; you are devising them from your own heart.”"},{"num":9,"verse":"For they were all trying to intimidate us, thinking, “Their hands will become weak from the work and it will not be done.”"},{"num":10,"verse":"Then I went to the house of Shemaiah, son of Delaiah, son of Mehetabel. He was confined to his home. He said, “Let us meet in the House of God, within the Temple. Let us shut the doors of the Temple, for they are coming to kill you. Indeed, they will come to kill you at night.”"},{"num":11,"verse":"But I said, “Should a man like me flee? Who in my position could go into the Temple and live? I will not go in.”"},{"num":12,"verse":"I recognized that God had not really sent him, for he had pronounced the prophecy against me because Tobiah and Sanballat had hired him. "},{"num":13,"verse":"He had been hired so that I might become so frightened that I would do this and thereby sin. Then they would give me a bad name in order to discredit me."},{"num":14,"verse":"Remember, my God, Tobiah and Sanballat according to these works of theirs, and also the prophetess Noadiah and the rest of the prophets who have been trying to intimidate me."},{"num":15,"verse":"So the wall was completed on the twenty-fifth day of the month Elul, in just 52 days. "},{"num":16,"verse":"When all our enemies heard, all the surrounding nations were afraid and fell greatly in their own eyes, because they realized that this work had been accomplished by our God."},{"num":17,"verse":"Also in those days the nobles of Judah sent many letters to Tobiah and replies from Tobiah kept coming to them. "},{"num":18,"verse":"For many in Judah were under oath to him, because he was the son-in-law of Shecaniah son of Arah, and his son Jehohanan had married the daughter of Meshullam son of Berechiah. "},{"num":19,"verse":"Moreover, they kept telling me about his good deeds and then reporting my words to him. Also Tobiah sent letters to intimidate me."}]