[{"header":"Saul Tries To Have David Killed"},{"num":19,"verse":"One day, Saul told his son Jonathan and his officers to kill David. But Jonathan liked David a lot, "},{"num":2,"verse":"and he warned David, “My father is trying to have you killed, so be very careful. Hide in a field tomorrow morning, and I’ll bring him there. Then I’ll talk to him about you, and if I find out anything, I’ll let you know.”"},{"num":4,"verse":"The next morning, Jonathan reminded Saul about the many good things David had done for him. Then he said, “Why do you want to kill David? He hasn’t done anything to you. He has served in your army and has always done what’s best for you. He even risked his life to kill Goliath. The Lord helped Israel win a great victory that day, and it made you happy.”"},{"num":6,"verse":"Saul agreed and promised, “I swear by the living Lord that I won’t have David killed!”"},{"num":7,"verse":"Jonathan called to David and told him what Saul had said. Then he brought David to Saul, and David served in Saul’s army just as he had done before."},{"num":8,"verse":"The next time there was a war with the Philistines, David fought hard and forced them to retreat."},{"header":"Michal Helps David Escape"},{"num":9,"verse":"One night, David was in Saul’s home, playing the harp for him. Saul was sitting there, holding a spear, when an evil spirit from the Lord took control of him. Saul tried to pin David to the wall with the spear, but David dodged, and it stuck in the wall. David ran out of the house and escaped."},{"num":11,"verse":"Saul sent guards to watch David’s house all night and then to kill him in the morning."},{"num":12,"verse":"She helped David go through a window and climb down to the ground. As David ran off, "},{"num":13,"verse":"Michal put a statue in his bed. She put goat hair on its head and dressed it in some of David’s clothes."},{"num":14,"verse":"The next morning, Saul sent guards to arrest David. But Michal told them, “David is sick.”"},{"num":15,"verse":"Saul sent the guards back and told them, “Get David out of his bed and bring him to me, so I can have him killed.”"},{"num":16,"verse":"When the guards went in, all they found in the bed was the statue with the goat hair on its head."},{"num":17,"verse":"“Why have you tricked me this way?” Saul asked Michal. “You helped my enemy get away!”"},{"header":"Samuel Helps David Escape"},{"num":18,"verse":"Meanwhile, David went to Samuel at Ramah and told him what Saul had done. Then Samuel and David went to Prophets Village and stayed there."},{"num":19,"verse":"Someone told Saul, “David is at Prophets Village in Ramah.”"},{"num":20,"verse":"Saul sent a few soldiers to bring David back. They went to Ramah and found Samuel in charge of a group of prophets who were all prophesying. Then the Spirit of God took control of the soldiers and they started prophesying too."},{"num":21,"verse":"When Saul heard what had happened, he sent another group of soldiers, but they prophesied the same way. He sent a third group of soldiers, but the same thing happened to them. "},{"num":22,"verse":"Finally, Saul left for Ramah himself. He went as far as the deep pit at the town of Secu, and he asked, “Where are Samuel and David?”"},{"num":23,"verse":"Saul left for Ramah. But as he walked along, the Spirit of God took control of him, and he started prophesying. Then, when he reached Prophets Village, "},{"num":24,"verse":"he stripped off his clothes and prophesied in front of Samuel. He dropped to the ground and lay there naked all day and night. That’s how the saying started, “Is Saul now a prophet?”"}]