[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beginning of the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The opening words are interesting as presenting a transition stage in the history of the word Gospel, between its earlier sense, as meaning generally the “good news” of the kingdom of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the later sense, as a book recording the main facts in our Lord’s life and work. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Timothy 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it clearly includes a narrative of some kind, we have an instance of a like transition.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Son of God.—This also is significant as to the Church’s faith at the time when St. Mark wrote. He, of whom he speaks, was not a prophet or righteous man only, but was, in the highest sense which could be attached to the words, the Son of God. If we think of St. Mark as reproducing St. Peter’s teaching, we cannot fail to connect the words, thus placed, as they are, in the very title of his Gospel, with the Apostle’s confession in Matthew 16:16.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The Son of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This also is significant as to the Church’s faith at the time when St. Mark wrote. He, of whom he speaks, was not a prophet or righteous man only, but was, in the highest sense which could be attached to the words, the Son of God. If we think of St. Mark as reproducing St. Peter’s teaching, we cannot fail to connect the words, thus placed, as they are, in the very title of his Gospel, with the Apostle’s confession in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "THE STRONG FORERUNNER AND THE STRONGER SON",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "WHAT ‘THE GOSPEL’ ISMark 1:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "WHAT ‘THE GOSPEL’ IS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 1:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " My purpose now is to point out some of the various connections in which the New Testament uses that familiar phrase, ‘the gospel,’ and briefly to gather some of the important thoughts which these suggest. Possibly the process may help to restore freshness to a word so well worn that it slips over our tongues almost unnoticed and excites little thought.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The history of the word in the New Testament books is worth notice. It seldom occurs in those lives of our Lord which now are emphatically so called, and where it does occur, it is ‘the gospel of the Kingdom’ quite as frequently as ‘the gospel’ of the King. The word is never used in Luke, and only twice in the Acts of the Apostles, both times in quotations. The Apostle John never employs it, either in his ‘gospel’ or in his epistles, and in the Apocalypse the word is only once found, and then it may be a question whether it refers to the good news of salvation in Jesus Christ. John thought of the word which he had to proclaim as ‘the message,’ ‘the witness,’ ‘the truth,’ rather than as ‘the gospel.’ We search for the expression in vain in the epistles of James, Jude, and to the Hebrews. Thrice it is used by Peter. The great bulk of the instances of its occurrence are in the writings of Paul, who, if not the first to use it, at any rate is the source from which the familiar meaning of the phrase, as describing the sum total of the revelation in Jesus Christ, has flowed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The various connections in which the word is employed are remarkable and instructive. We can but touch lightly on the more important lessons which they are fitted to teach.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The Gospel is the ‘Gospel of Christ.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The Gospel is the ‘Gospel of Christ.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "On our Lord’s own lips and in the records of His life we find, as has already been noticed, the phrase, ‘the gospel of the kingdom’-the good news of the establishment on earth of the rule of God in the hearts and lives of men. The person of the King is not yet defined by it. The diffused dawn floods the sky, and upon them that sit in darkness the greatness of its light shines, before the sun is above the horizon. The message of the Forerunner proclaimed, like a herald’s clarion, the coming of the Kingdom, before he could say to a more receptive few, ‘Behold the Lamb of God.’ The order is first the message of the Kingdom, then the discovery of the King. And so that earlier phrase falls out of use, and when once Christ’s life had been lived, and His death died, the gospel is no longer the message of an impersonal revolution in the world’s attitude to God’s will, but the biography of Him who is at once first subject and monarch of the Kingdom of Heaven, and by whom alone we are brought into it. The standing expression comes to be ‘the gospel of Christ.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is His, not so much because He is the author, as because He is the subject of it. It is the good news about Christ. He is its contents and great theme. And so we are led up at once to the great central peculiarity of Christianity, namely that it is a record of historical fact, and that all the world’s life and blessedness lie in the story of a human life and death. Christ is Christianity. His biography is the good news for every child of man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Neither a philosophy nor a morality, but a history, is the true good news for men. The world is hungry, and when it cries for bread wise men give it a stone, but God gives it the fare it needs in the bread that comes down from Heaven. Though it be of small account in many people’s eyes, like the common barley cakes, the poor man’s food, it is what we all need; and humble people, and simple people, and uneducated people, and barbarous people, and dying people, and the little children can all eat and live. They would find little to keep them from starving in anything more ambitious, and would only break their teeth in mumbling the dry bones of philosophies and moralities. But the story of their Brother who has lived and died for them feeds heart and mind and will, fancy and imagination, memory and hope, nourishes the whole nature into health and beauty, and alone deserves to be called good news for men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " All that the world needs lies in that story. Out of it have come peace and gladness to the soul, light for the understanding, cleansing for the conscience, renovation for the will, which can be made strong and free by submission, a resting-place for the heart, and a starting-point and a goal for the loftiest flights of hope. Out of it have come the purifying of family and civic life, the culture of all noble social virtues, the sanctity of the household, and the elevation of the state. The thinker has found the largest problems raised and solved therein. The setting forth of a loftier morality, and the enthusiasm which makes the foulest nature aspire to and reach its heaven-touching heights, are found together there. To it poet and painter, architect and musician, owe their noblest themes. The good news of the world is the story of Christ’s life and death. Let us be thankful for its form; let us be thankful for its substance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But we must not forget that, as Paul, who is so fond of the word, has taught us, the historical fact needs some explanation and commentary to make the history a gospel. He has declared to us ‘the gospel which he preached,’ and to which he ascribes saving power, and he gives these as its elements, ‘How that Christ died for our sins, according to the Scriptures, and that He was buried, and that He rose again the third day, according to the Scriptures.’ There are three facts-death, burial, resurrection. These are the things that any eye could have seen. Are these the gospel? Is there any saving power in them? Not unless you add the commentary ‘for our sins,’ and ‘according to the Scriptures.’ That death was a death for us all, by which we are delivered from our sins-that is the main thing; and in subordination to that thought, the other that Christ’s death was the accomplishment of prophecies-these make the history a gospel. The bare facts, without the exhibition of their purpose and meaning, are no more a gospel than any other story of a death would be. The facts with any lower explanation of their meaning are no gospel, any more than the story of the death of Socrates or any innocent martyr would be. If you would know the good news that will lift your heavy heart from sorrow and break your chains of sin, that will put music into your life and make your days blaze into brightness as when the sunlight strikes some sullen mountain-side that lay black in shadow, you must take the fact with its meaning, and find your gospel in the life and death of Him who is more than example and more than martyr. ‘How that Christ died for our sins, according to the Scriptures,’ is ‘the gospel of Christ.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The Gospel of Christ is the ‘Gospel of God.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The Gospel of Christ is the ‘Gospel of God.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This form of the expression, though by no means so frequent as the other, is found throughout Paul’s epistles, thrice in the earliest-Thessalonians {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, once in the great Epistle to the Romans {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, once in Corinthians {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, and once in a modified form in the pathetic letter from the dungeon, which the old man addressed to his ‘son Timothy’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. It is also found in the writings of Peter {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. In all these cases the phrase, ‘the gospel of God,’ may mean the gospel which has God for its author or origin, but it seems rather to mean ‘which has God for its subject.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was, as we saw, mainly designated as the good news about Jesus Christ, but it is also the good news about God. So in one and the same set of facts we have the history of Jesus and the revelation of God. They are not only the biography of a man, but they are the unveiling of the heart of God. These Scripture writers take it for granted that their readers will understand that paradox, and do not stop to explain how they change the statement of the subject matter of their message, in this extraordinary fashion, between their Master who had lived and died on earth, and the Unseen Almightiness throned above all heavens. How comes that to be?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not that the gospel has two subjects, one of which is the matter of one portion, and the other of another. It does not sometimes speak of Christ, and sometimes rise to tell us of God. It is always speaking of both, and when its subject is most exclusively the man Christ Jesus, it is then most chiefly the Father God. How comes that to be? Surely this unconscious shifting of the statement of their theme, which these writers practise as a matter of course, shows us how deeply the conviction had stamped itself on their spirits, ‘He that hath seen Me hath seen the Father,’ and how the point of view from which they had learned to look on all the sweet and wondrous story of their Master’s life and death, was that of a revelation of the deepest heart of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so must we look on that whole career, from the cradle to the cross, from Calvary to Olivet, if we are to know its deepest tenderness and catch its gladdest notes. That such a man has lived and died is beautiful, and the portrait will hang for ever as that of the fairest of the children of men. But that in that life and death we have our most authentic knowledge of what God is, and that all the pity and truth, the gentleness and the brotherliness, the tears and the self-surrender, are a revelation to us of God; and that the cross, with its awful sorrow and its painful death, tells us not only how a man gave himself for those whom he loved, but how God loves the world and how tremendous is His law-this is good news of God indeed. We have to look for our truest knowledge of Him not in the majesties of the starry heavens, nor in the depths of our own souls, not in the scattered tokens of His character given by the perplexed order of the world, nor in the intuitions of the wise, but in the life and death of His Son, whose tears are the pity of God as well as the compassion of a man, and in whose life and death the whole world may behold ‘the brightness of His glory and the express image of His person,’ and be delivered from all their fears of an angry, and all their doubts of an unknown, God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a double modification of this phrase. We hear of ‘the gospel of the grace of God’ and ‘the gospel of the glory of God,’ which latter expression, rendered in the English version misleadingly ‘the glorious gospel,’ is given in its true shape in the Revised Version. The great theme of the message is further defined in these two noteworthy forms. It is the tender love of God in exercise to lowly creatures who deserve something else that the gospel is busy in setting forth, a love which flows forth unbought and unmotived save by itself, like some stream from a hidden lake high up among the pure Alpine snows. The story of Christ’s work is the story of God’s rich, unmerited love, bending down to creatures far beneath, and making a radiant pathway from earth to heaven, like the sevenfold rainbow. It is so, not merely because this mission is the result of God’s love, but also because His grace is God’s grace, and therefore every act of Christ which speaks His own tenderness is therein an apocalypse of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The second of these two expressions, ‘the gospel of the glory of God,’ leads up to that great thought that the true glory of the divine nature is its tenderness. The lowliness and death of Christ are the glory of God! Not in the awful attributes which separate that inconceivable Nature from us, not in the eternity of His existence, nor in the Infinitude of His Being, not in the Omnipotence of His unwearied arm, nor in fire-eyed Omniscience, but in the pity and graciousness which bend lovingly over us, is the true glory of God. These pompous ‘attributes’ are but the fringes of the brightness, the living white heart of which is love. God’s glory is God’s grace, and the purest expression of both is found there, where Jesus hangs dying in the dark, The true throne of God’s glory is not builded high in a remote heaven, flashing intolerable brightness and set about with bending principalities and powers, but it is the Cross of Calvary. The story of the ‘grace of our Lord Jesus Christ,’ with its humiliation and shame, is the ‘gospel of the grace,’ and therefore is the ‘gospel of the glory, of God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The good news of Christ and of God is the gospel of our salvation and peace. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The good news of Christ and of God is the gospel of our salvation and peace.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We read of ‘the gospel of your salvation’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, and in the same letter {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} of ‘the gospel of peace.’ In these expressions we pass from the consideration of the author or of the subject matter of the good news to that of its purpose and issue. It is meant to bring to men, and it does in fact bring to all who accept it, those wide and complex blessings described by those two great words.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That good news about Christ and God brings to a man salvation, if he believes it. To know and feel that I have a loving Father who has so cared for me and all my brethren that He has sent His Son to live and die for me, is surely enough to deliver me from all the bonds and death of sin, and to quicken me into humble consecration to His service. And such emancipation from the burden and misery of sin, from the gnawing consciousness of evil and the weakening sense of guilt, from the dominion of wrong tastes and habits, and from the despair of ever shaking them off which is only too well grounded in the experience of the past, is the beginning of salvation for each of us. That great keyword of the New Testament covers the whole field of positive and negative good which man can need or God can give. Negatively it includes the removal of every evil, whether of the nature of sorrow or of sin, under which men can groan. Positively it includes the endowment with all good, whether of the nature of joy or of purity, which men can hope for or receive. It is past, present, and future, for every heart that accepts ‘the word of the truth of the gospel’-past, inasmuch as the first effect of even the most incomplete acceptance is to put us in a new position and attitude towards the law of God, and to plant the germs of all holiness and joy in our souls; present, inasmuch as salvation is a growing possession and a continuous process running on all through our lives, if we be true to ourselves and our calling; future, inasmuch as its completion waits to be unveiled in another order of things, where perfect purity and perfect consecration shall issue in perfect joy. And all this ennobling and enriching of human nature is produced by that good news about the grace and glory of God and of Christ, if we will only listen to it, and let it work its work on our souls.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Substantially the same set of facts is included under that other expression, ‘the gospel of peace.’ The Hebrew use of the word ‘peace’ as a kind of shorthand for all good is probably to be remembered. But even in the narrower sense of the word, how great are the blessings set forth by it! All inward serenity and outward calm, the tranquillity of a soul free from the agitations of emotion and the storms of passions and the tumults of desire, as well as the security of a life guarded from the assaults of foes and girded about with an impregnable barrier which nothing can destroy and no enemy overleap, are ours, if we take the good news about God to our heart. They are ours in the measure in which we take it. Clearly such truths as those which the gospel brings have a plain tendency to give peace. They give peace with God, with the world, and with ourselves. They lead to trust, and trust is peace. They lead to union with God, and that is peace. They lead to submission, and that is peace. They lead to consecration, and that is peace. They lead to indifference to fleeting joys and treasures, and that is peace. They give to heart and mind and will an all-sufficient and infinite object, and that is peace. They deliver us from ourselves, and that is peace. They fill the past, the present, and the future with the loving Father’s presence, and brighten life and death with the Saviour’s footsteps-and so to live is calm, and to die is to lay ourselves down in peace and sleep, quiet by His side, like a child by its mother. The good news about God and Christ is the good news of our salvation and of our peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. The good news about Christ and God is the gospel. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. The good news about Christ and God is ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gospel.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "By far the most frequent form in which the word gospel occurs is that of the simple use of the noun with the definite article. This message is emphatically ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " good news. It is the tidings which men most of all want. It stands alone; there is no other like it. If this be not the glad tidings of great joy for the world, then there are none.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let no false liberality lead us to lose sight of the exclusive claims which are made in this phrase for the set of facts the narrative of which constitutes ‘the gospel.’ The life and death of Jesus Christ for the sins of the world, His resurrection and continuous life for the saving of the world-these are the truths, without which there can be no gospel. They may be apprehended in different ways, set forth in different perspective, proclaimed in different dialects, explained in different fashion, associated with different accompaniments, drawn out into different consequences, and yet, through all diversity of tones, the message may be one. Sounded on a ram’s horn or a silver trumpet, it may be the same saving and joy-bringing proclamation, and it will be, if Christ and His life and death are plainly set forth as the beginning and ending of all. But if there be an omission of that mighty name, or if a Christ be proclaimed without a Cross, a salvation without a Saviour, or a Saviour without a Sacrifice, all the adornments of genius and sincerity will not prevent such a half gospel from falling flat. Its preachers have never been able, and never will be able, to touch the general heart or to bring good cheer to men. They have always had to complain, ‘We have piped unto you and ye have not danced.’ They cannot get people to be glad over such a message. Only when you speak of a Christ who has died for our sins, will you cause the heavy heart of the world to sing for joy. Only that old, old message is the good news which men want.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is no second gospel. Men who preach a message of a different kind, as Paul tells us, are preaching what is not really another gospel. There cannot be two messages. There is but one genuine; all others are counterfeits. For us it is all-important that we should be no less narrow than the truth, and no more liberal than he was to whom the message ‘how that Jesus died for our sins’ was the only thing worth calling the gospel. Our own salvation depends on our firm grasp of that one message, and for some of us, the clear decisiveness with which our lips ring it out determines whether we shall be blessings or curses to our generation. There is a Babel of voices now preaching other messages which promise good tidings of good. Let us cleave with all our hearts to Christ alone, and let our tongues not falter in proclaiming, ‘Neither is there salvation in any other.’ The gospel of the Christ who died for our sins, is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And what we have for ourselves to do with it is told us in that pregnant phrase of the apostle’s, ‘my gospel,’ and ‘our gospel’; meaning not merely the message which he was charged to proclaim, but the good news which he and his brethren had made their own. So we have to make it ours. It is of no use to us, unless we do. It is not enough that it echoes all around us, like music borne upon the wind. It is not enough that we hear it, as men do some sweet melody, while their thoughts are busy on other things. It is not enough that we believe it, as we do other histories in which we have no concern. What more is needed? Another expression of the apostle’s gives the answer. He speaks of ‘the faith of the gospel,’ that is the trust which that glad message evokes, and by which it is laid hold of.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Make it yours by trusting your whole self to the Christ of whom it tells you. The reliance of heart and will on Jesus who has died for me, makes it ‘my gospel.’ There is one God, one Christ, one gospel which tells us of them, and one faith by which we lay hold upon the gospel, and upon the loving Father and the ever-helpful Saviour of whom it tells. Let us make that great word our own by simple faith, and then ‘as cold water to our thirsty soul,’ so will be that ‘good news from a far country,’ the country where the Father’s house is, and to which He has sent the Elder Brother to bring back us prodigal children.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 1:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 1:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The beginning of the gospel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, of the gospel history; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of Jesus Christ, the Son of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who was, or is, in the bosom of the Father, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and came down from heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to reveal his Father’s will unto us, to confirm his doctrine by a great variety of astonishing miracles, to set us a perfect example of every branch of piety and virtue, to expiate our sins by the sacrifice of himself, and to abolish death, with respect to such as believe aright in him, by rising from the dead as the first-fruits of them that sleep. The evangelist speaks with strict propriety in this sentence, for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the beginning of the gospel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is in the account of John the Baptist, contained in the first paragraph; the gospel itself in the rest of the book. Thus the verse must be considered as being connected with the following, and as signifying that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the gospel of Jesus Christ ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "began, according to the prediction of the prophets, with the preaching and baptism of John the Baptist. In styling Jesus the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "while the other evangelists describe him chiefly as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Song of Solomon of man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Mark gives him a title the most likely, as being the most august, to engage the attention and obedience of the Romans, those lords of the earth, to the religion which was promulgated by him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, I send my messenger, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The voice of one, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-8. Isaiah and Malachi each spake concerning the beginning of the gospel of Jesus Christ, in the ministry of John. From these prophets we may observe, that Christ, in his gospel, comes among us, bringing with him a treasure of grace, and a sceptre of government. Such is the corruption of the world, that there is great opposition to his progress. When God sent his Son into the world, he took care, and when he sends him into the heart, he takes care, to prepare his way before him. John thinks himself unworthy of the meanest office about Christ. The most eminent saints have always been the most humble. They feel their need of Christ's atoning blood and sanctifying Spirit, more than others. The great promise Christ makes in his gospel to those who have repented, and have had their sins forgiven them, is, they shall be baptized with the Holy Ghost; shall be purified by his graces, and refreshed by his comforts. We use the ordinances, word, and sacraments without profit and comfort, for the most part, because we have not of that Divine light within us; and we have it not because we ask it not; for we have his word that cannot fail, that our heavenly Father will give this light, his Holy Spirit, to those that ask it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The beginning of the gospel - The word \"gospel\" literally signifies good news, and particularly the good tidings respecting the way of salvation by the Lord Jesus Christ. Some have understood the word \"gospel\" here to mean \"history\" or \"life - the beginning of the history,\" etc.; but Mark says nothing of the early life of the Saviour. The word \"gospel\" here has reference rather to the preaching of John, an account of which immediately follows, and means the beginning of the good news, or annunciation respecting the Messiah. It was very customary thus to prefix a title to a book.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Son of God - This title was used here to attract attention, and secure the respect of those who should read the gospel. It is no common history. It does not recount the deeds of man - of a hero or a philosopher - but the doctrines and doings of the Son of God. The history, therefore, \"commands\" respect. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Son of God - This title was used here to attract attention, and secure the respect of those who should read the gospel. It is no common history. It does not recount the deeds of man - of a hero or a philosopher - but the doctrines and doings of the Son of God. The history, therefore, \"commands\" respect. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE GOSPEL ACCORDING TO MARK Commentary by David Brown   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "INTRODUCTION",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That the Second Gospel was written by Mark is universally agreed, though by what Mark, not so. The great majority of critics take the writer to be \"John whose surname was Mark,\" of whom we read in the Acts, and who was \"sister's son to Barnabas\" (Col 4:10). But no reason whatever is assigned for this opinion, for which the tradition, though ancient, is not uniform; and one cannot but wonder how it is so easily taken for granted by Wetstein, Hug, Meyer, Ebrard, Lange, Ellicott, Davidson, Tregelles, &c. Alford goes the length of saying it \"has been universally believed that he was the same person with the John Mark of the Gospels.\" But Grotius thought differently, and so did Schleiermacher, Campbell, Burton, and Da Costa; and the grounds on which it is concluded that they were two different persons appear to us quite unanswerable. \"Of John, surnamed Mark,\" says Campbell, in his Preface to this Gospel, \"one of the first things we learn is, that he attended Paul and Barnabas in their apostolical journeys, when these two travelled together (Ac 12:25; 13:5). And when afterwards there arose a dispute between them concerning him, insomuch that they separated, Mark accompanied his uncle Barnabas, and Silas attended Paul. When Paul was reconciled to Mark, which was probably soon after, we find Paul again employing Mark's assistance, recommending him, and giving him a very honorable testimony (Col 4:10; 2Ti 4:11; Phm 24). But we hear not a syllable of his attending Peter as his minister, or assisting him in any capacity.\" And yet, as we shall presently see, no tradition is more ancient, more uniform, and better sustained by internal evidence, than that Mark, in his Gospel, was but \"the interpreter of Peter,\" who, at the close of his first Epistle speaks of him as \"Marcus my son\" (1Pe 5:13), that is, without doubt, his son in the Gospel—converted to Christ through his instrumentality. And when we consider how little the Apostles Peter and Paul were together—how seldom they even met—how different were their tendencies, and how separate their spheres of labor, is there not, in the absence of all evidence of the fact, something approaching to violence in the supposition that the same Mark was the intimate associate of both? \"In brief,\" adds Campbell, \"the accounts given of Paul's attendant, and those of Peter's interpreter, concur in nothing but the name, Mark or Marcus; too slight a circumstance to conclude the sameness of the person from, especially when we consider how common the name was at Rome, and how customary it was for the Jews in that age to assume some Roman name when they went thither.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Regarding the Evangelist Mark, then, as another person from Paul's companion in travel, all we know of his personal history is that he was a convert, as we have seen, of the Apostle Peter. But as to his Gospel, the tradition regarding Peter's hand in it is so ancient, so uniform, and so remarkably confirmed by internal evidence, that we must regard it as an established fact. \"Mark,\" says Papias (according to the testimony of Eusebius, [Ecclesiastical History, 3.39]), \"becoming the interpreter of Peter, wrote accurately, though not in order, whatever he remembered of what was either said or done by Christ; for he was neither a hearer of the Lord nor a follower of Him, but afterwards, as I said, [he was a follower] of Peter, who arranged the discourses for use, but not according to the order in which they were uttered by the Lord.\" To the same effect Irenæus [Against Heresies, 3. 1]: \"Matthew published a Gospel while Peter and Paul were preaching and founding the Church at Rome; and after their departure (or decease), Mark, the disciple and interpreter of Peter, he also gave forth to us in writing the things which were preached by Peter.\" And Clement of Alexandria is still more specific, in a passage preserved to us by Eusebius [Ecclesiastical History, 6.14]: \"Peter having publicly preached the word at Rome, and spoken forth the Gospel by the Spirit, many of those present exhorted Mark, as having long been a follower of his, and remembering what he had said, to write what had been spoken; and that having prepared the Gospel, he delivered it to those who had asked him for it; which, when Peter came to the knowledge of, he neither decidedly forbade nor encouraged him.\" Eusebius' own testimony, however, from other accounts, is rather different: that Peter's hearers were so penetrated by his preaching that they gave Mark, as being a follower of Peter, no rest till he consented to write his Gospel, as a memorial of his oral teaching; and \"that the apostle, when he knew by the revelation of the Spirit what had been done, was delighted with the zeal of those men, and sanctioned the reading of the writing (that is, of this Gospel of Mark) in the churches\" [Ecclesiastical History, 2.15]. And giving in another of his works a similar statement, he says that \"Peter, from excess of humility, did not think himself qualified to write the Gospel; but Mark, his acquaintance and pupil, is said to have recorded his relations of the actings of Jesus. And Peter testifies these things of himself; for all things that are recorded by Mark are said to be memoirs of Peter's discourses.\" It is needless to go farther—to Origen, who says Mark composed his Gospel \"as Peter guided\" or \"directed him, who, in his Catholic Epistle, calls him his son,\" &c.; and to Jerome, who but echoes Eusebius.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This, certainly, is a remarkable chain of testimony; which, confirmed as it is by such striking internal evidence, may be regarded as establishing the fact that the Second Gospel was drawn up mostly from materials furnished by Peter. In Da Costa's Four Witnesses the reader will find this internal evidence detailed at length, though all the examples are not equally convincing. But if the reader will refer to our remarks on [1393]Mr 16:7, and [1394]Joh 18:27, he will have convincing evidence of a Petrine hand in this Gospel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It remains only to advert, in a word or two, to the readers for whom this Gospel was, in the first instance, designed, and the date of it. That it was not for Jews but Gentiles, is evident from the great number of explanations of Jewish usages, opinions, and places, which to a Jew would at that time have been superfluous, but were highly needful to a Gentile. We can here but refer to Mr 2:18; 7:3, 4; 12:18; 13:3; 14:12; 15:42, for examples of these. Regarding the date of this Gospel—about which nothing certain is known—if the tradition reported by Irenæus can be relied on, that it was written at Rome, \"after the departure of Peter and Paul,\" and if by that word \"departure\" we are to understand their death, we may date it somewhere between the years 64 and 68; but in all likelihood this is too late. It is probably nearer the truth to date it eight or ten years earlier.   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "CHAPTER 1",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mr 1:1-8. The Preaching and Baptism of John. ( = Mt 3:1-12; Lu 3:1-18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. The beginning of the gospel of Jesus Christ, the Son of God—By the \"Gospel\" of Jesus Christ here is evidently meant the blessed Story which our Evangelist is about to tell of His Life, Ministry, Death, Resurrection, and Glorification, and of the begun Gathering of Believers in His Name. The abruptness with which he announces his subject, and the energetic brevity with which, passing by all preceding events, he hastens over the ministry of John and records the Baptism and Temptation of Jesus—as if impatient to come to the Public Life of the Lord of glory—have often been noticed as characteristic of this Gospel—a Gospel whose direct, practical, and singularly vivid setting imparts to it a preciousness peculiar to itself. What strikes every one is, that though the briefest of all the Gospels, this is in some of the principal scenes of our Lord's history the fullest. But what is not so obvious is, that wherever the finer and subtler feelings of humanity, or the deeper and more peculiar hues of our Lord's character were brought out, these, though they should be lightly passed over by all the other Evangelists, are sure to be found here, and in touches of such quiet delicacy and power, that though scarce observed by the cursory reader, they leave indelible impressions upon all the thoughtful and furnish a key to much that is in the other Gospels. These few opening words of the Second Gospel are enough to show, that though it was the purpose of this Evangelist to record chiefly the outward and palpable facts of our Lord's public life, he recognized in Him, in common with the Fourth Evangelist, the glory of the Only-begotten of the Father.Mar 1:1-8 The Gospel begins with the preaching of John the Baptist.Mar 1:9-11 Jesus is baptized, witnessed to from heaven,Mar 1:12-13 and tempted of the devil,Mar 1:14-15 preacheth in Galilee,Mar 1:16-22 calleth Peter, Andrew, James, and John,Mar 1:23-28 healeth one possessed of an unclean spirit,Mar 1:29-31 Simeon's mother-in-law,Mar 1:32-34 and divers other diseased persons,Mar 1:35-39 prayeth alone, and goeth on to preach,Mar 1:40-45 cleanseth a leper. The Gospel seems to have taken its name, euaggelion, from the angel's words to the shepherds, Luk 2:10, I bring you good tidings of great joy;  for the word in the Greek signifies a good message, or good news or tidings. It sometimes signifieth the historical narration of the coming of Christ, John Baptist's and Christ's preaching, and what he did in the world, his birth, life, death, &c.; sometimes the doctrine of salvation by Christ, in opposition to that of the law; sometimes, the dispensation of it, or that period of time when God began to publish the mystery hid from ages openly to the world. It seemeth here to signify the latter; for both Matthew and Luke seem to begin the history higher. Luke, from the history of John the Baptist and Christ, as to what things preceded their birth. Matthew, from the birth of Christ. But the dispensation of the gospel began with the preaching of John the Baptist. Before his time the doctrine of the gospel was made known to Adam, and Abraham and David; prophesied by Jacob, Isaiah, and several of the prophets; but John was the first in whom those promises and prophecies were fulfilled, the first public and plain preacher of the doctrine of the gospel; for the law and the prophets prophesied until John: since that time the kingdom of God is preached, and every man presseth into it,  Mat 11:13 Luk 16:16. So as John's preaching was the beginning of the gospel; for though the doctrine of the gospel was before darkly made known, yet it then began to be plainly and publicly declared to the world. He was the first in whom the gospel prophecies began to have an end, as both the prophecies and the types of it had a more full completion in Christ. Two prophecies at least had their completion in John, which we find in Mal 3:1, which the evangelist mentions in the next verse, and Mar 4:5, concerning Elias first to come, which our Saviour applies to John, Mat 11:14 Mar 9:11-13, and the angel before him, Luk 1:17; besides Isaiah's prophecy, Isa 40:3, applied unto him by Mat 3:3 Mar 1:3, and by John applied to himself, Joh 1:23. This Gospel is called the Gospel of Jesus Christ,  because the history of Christ's birth, life, and death is the matter of it. Christ was by Matthew called the Son of David, the son of Abraham,  to let us know that he was truly man, a native Jew, and of the royal family, and derived from those two families, to whom the promises of the Messias were made. By Mark he is called the Son of God,  to let us know that he was more than mere man. And indeed who, but he who was the Son of God, could fully reveal his Father's will, determine the law of Moses and introduce a new way of worship, and publish a mystery of salvation, hid from all preceding ages, though not from all individual persons in them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. The beginning of the gospel of Jesus Christ, the Son of God—By the \"Gospel\" of Jesus Christ here is evidently meant the blessed Story which our Evangelist is about to tell of His Life, Ministry, Death, Resurrection, and Glorification, and of the begun Gathering of Believers in His Name. The abruptness with which he announces his subject, and the energetic brevity with which, passing by all preceding events, he hastens over the ministry of John and records the Baptism and Temptation of Jesus—as if impatient to come to the Public Life of the Lord of glory—have often been noticed as characteristic of this Gospel—a Gospel whose direct, practical, and singularly vivid setting imparts to it a preciousness peculiar to itself. What strikes every one is, that though the briefest of all the Gospels, this is in some of the principal scenes of our Lord's history the fullest. But what is not so obvious is, that wherever the finer and subtler feelings of humanity, or the deeper and more peculiar hues of our Lord's character were brought out, these, though they should be lightly passed over by all the other Evangelists, are sure to be found here, and in touches of such quiet delicacy and power, that though scarce observed by the cursory reader, they leave indelible impressions upon all the thoughtful and furnish a key to much that is in the other Gospels. These few opening words of the Second Gospel are enough to show, that though it was the purpose of this Evangelist to record chiefly the outward and palpable facts of our Lord's public life, he recognized in Him, in common with the Fourth Evangelist, the glory of the Only-begotten of the Father.",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:1-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The Gospel begins with the preaching of John the Baptist.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:9-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jesus is baptized, witnessed to from heaven,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and tempted of the devil,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:14-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " preacheth in Galilee,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:16-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " calleth Peter, Andrew, James, and John,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:23-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " healeth one possessed of an unclean spirit,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:29-31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Simeon's mother-in-law,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:32-34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and divers other diseased persons,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:35-39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prayeth alone, and goeth on to preach,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 1:40-45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cleanseth a leper.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The Gospel seems to have taken its name, euaggelion, from the angel's words to the shepherds, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Luk 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "I bring you good tidings of great joy; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for the word in the Greek signifies a good message, or good news or tidings. It sometimes signifieth the historical narration of the coming of Christ, John Baptist's and Christ's preaching, and what he did in the world, his birth, life, death, &c.; sometimes the doctrine of salvation by Christ, in opposition to that of the law; sometimes, the dispensation of it, or that period of time when God began to publish ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the mystery hid from ages",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " openly to the world. It seemeth here to signify the latter; for both Matthew and Luke seem to begin the history higher. Luke, from the history of John the Baptist and Christ, as to what things preceded their birth. Matthew, from the birth of Christ. But the dispensation of the gospel began with the preaching of John the Baptist. Before his time the doctrine of the gospel was made known to Adam, and Abraham and David; prophesied by Jacob, Isaiah, and several of the prophets; but John was the first in whom those promises and prophecies were fulfilled, the first public and plain preacher of the doctrine of the gospel; for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the law and the prophets prophesied until John: since that time the kingdom of God is preached, and every man presseth into it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": " Mat 11:13 Luk 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So as John's preaching was the beginning of the gospel; for though the doctrine of the gospel was before darkly made known, yet it then began to be plainly and publicly declared to the world. He was the first in whom the gospel prophecies began to have an end, as both the prophecies and the types of it had a more full completion in Christ. Two prophecies at least had their completion in John, which we find in ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mal 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which the evangelist mentions in the next verse, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mar 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", concerning Elias first to come, which our Saviour applies to John, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mat 11:14 Mar 9:11-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the angel before him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Luk 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; besides Isaiah's prophecy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isa 40:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", applied unto him by ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mat 3:3 Mar 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and by John applied to himself, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Joh 1:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This Gospel is called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the Gospel of Jesus Christ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " because the history of Christ's birth, life, and death is the matter of it. Christ was by Matthew called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the Son of David, the son of Abraham, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to let us know that he was truly man, a native Jew, and of the royal family, and derived from those two families, to whom the promises of the Messias were made. By Mark he is called ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "the Son of God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to let us know that he was more than mere man. And indeed who, but he who was the Son of God, could fully reveal his Father's will, determine the law of Moses and introduce a new way of worship, and publish a mystery of salvation, hid from all preceding ages, though not from all individual persons in them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The beginning of the Gospel of Jesus Christ,.... Not that the Gospel first began to be preached at this time, for it was preached by Isaiah, and other prophets before; and long before that, was preached unto Abraham; yea, it was preached as early as the times of our first parents, in Eden's garden; and is indeed that mystery, which was hid in God before the creation of the world; and was ordained before that was, to the glory of the saints: but the sense is, that this narrative Mark was about to write, began with the ministry of John the Baptist, and of Christ; which was a Gospel one, and was the beginning of the Gospel dispensation, in distinction from the legal one: the law and the prophets were until John, and they ceased and ended in him; when the , \"the world to come\", the kingdom of God, or Gospel state, took place. The design of this evangelist, is not to give an account of the genealogy of Christ, of his conception and birth, of what befell him in his infancy, or of any actions and sayings of his from thence, to his appearance in Israel; but to give an account of his ministry and miracles, sufferings and death: which is introduced with the preaching and baptism of John his forerunner, and which he chiefly intends by \"the beginning of the Gospel\": he first points out Christ, who is the author and substance, as well as the great preacher of the Gospel; the sum of which is, that he is Jesus, the Saviour and Redeemer of lost sinners; the Christ, the Messiah, that was to come; the Mediator between God and man, the prophet that has declared the whole mind and will of God; the great high priest, who has offered himself a sacrifice for his people, made peace, procured pardon, brought in everlasting righteousness, and obtained eternal redemption, and now lives to make intercession for them; and King of saints, who reigns over them, protects and defends them, and is no other than ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the Son of God; equal with his Father; of the same nature with him, possessed of the same perfections, and enjoying the same glory; and which is a grand article of the Gospel, and without which he could not be an able Saviour, nor the true Messiah. Mark begins his account of the Gospel, and which he calls the beginning of it, with the same article of the divine sonship of Christ, as the Apostle Paul began his ministry with, Acts 9:20. Matthew began his Gospel with the humanity, Mark with the divinity of Christ: the one calls him the son of David, the other the Son of God, both true: Christ is the son of David according to his human nature, the Son of God according to his divine nature; so a testimony is bore to the truth of both his natures, which are united in one person. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the Son of God; equal with his Father; of the same nature with him, possessed of the same perfections, and enjoying the same glory; and which is a grand article of the Gospel, and without which he could not be an able Saviour, nor the true Messiah. Mark begins his account of the Gospel, and which he calls the beginning of it, with the same article of the divine sonship of Christ, as the Apostle Paul began his ministry with, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Matthew began his Gospel with the humanity, Mark with the divinity of Christ: the one calls him the son of David, the other the Son of God, both true: Christ is the son of David according to his human nature, the Son of God according to his divine nature; so a testimony is bore to the truth of both his natures, which are united in one person. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The beginning of the gospel of Jesus Christ, the Son of God;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As our canonical Matthew has a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "superscription of his first section",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so also has Mark. This, however, does not embrace merely ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς γέγραπται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὰς τρίβους αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "belongs also to the superscription",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so that with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the section itself (which goes on to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to Ewald to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") begins. It is decisive in favour of this view, that with it there is nothing either to be supplied or to be put in parenthesis, and that it is in the highest degree appropriate not only to the simplicity of the style, but also to the peculiar historical standpoint of the author, seeing that he places the beginning of the Gospel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e. the first announcement of the message of salvation as to the Messiah having appeared",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—leaving out of view all the preliminary history in which this announcement was already included—in strictness only at the emergence of the Baptist; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on account of the special importance of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " initial point (and see also the remarks on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:21-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he even, contrary to his custom, elsewhere appends a prophetic utterance, in conformity with which that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρχή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " took place in such a way and not otherwise than is related in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. Moreover, in accordance with this, since the history of that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρχή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " itself does not begin till ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the want of a particle with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐγένετο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is quite in order. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If, with Fritzsche, Lachmann,[47] Hitzig, Holtzmann, we construe: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἈΡΧῊ … ἘΓΈΝΕΤΟ ἸΩΆΝΝΗς ΒΑΠΤΊΖΩΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἈΡΧῊ … ἘΓΈΝΕΤΟ ἸΩΆΝΝΗς ΒΑΠΤΊΖΩΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", then ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὡς ΓΈΓΡΑΠΤΑΙ Κ.Τ.Λ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Ὡς ΓΈΓΡΑΠΤΑΙ Κ.Τ.Λ.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " becomes a parenthetical clause, in which case the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "importance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the Scripture proof has not due justice done to it, and the structure of the sentence becomes too complicated and clumsy for the simplicity of what follows. If we take merely ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the superscription either of the first section only with Kuinoel and others, or of the entire Gospel with Erasmus, Bengel, Paulus, de Wette, and others, then ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὡς γέγραπται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " becomes protasis of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἘΓΈΝΕΤΟ Κ.Τ.Λ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἘΓΈΝΕΤΟ Κ.Τ.Λ.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", but thereby the citation, instead of being probative of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἈΡΧΉ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἈΡΧΉ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " laid down by Mark, becomes a Scripture proof for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "emergence of John in itself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in that way loses its important bearing, seeing that this emergence in itself did not need any scriptural voucher at all, and would not have received any, in accordance with Mark’s abstinence from adducing Old Testament passages. Finally, if we supply after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἦν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the beginning … was, as it stands written",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Theophylact, Euthymius Zigabenus, Vatablus, Maldonatus, Jansen, Grotius, and others), doubtless the want of the article with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρχή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not against this course (see Winer, p. 113 [E. T. 154]), nor yet the want of a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΓΆΡ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΓΆΡ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἘΓΈΝΕΤΟ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἘΓΈΝΕΤΟ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "—an asyndeton which would rather conduce to the lively impressiveness of the representation (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but it may well be urged that the supplying of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἮΝ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἮΝ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unnecessary",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and even injurious to the vivid concrete representation. Moreover, in the very fact that Mark just commences his book with the emergence of the Baptist, there is ingenuously (without any purpose of contrast to other Gospels, without neutral tendency, or the like) exhibited the original type of the view which was taken of the Gospel history,—a type which again, after the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "terminus a quo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had been extended in Matthew and Luke so as to embrace the preliminary histories, presents itself in John, inasmuch as the latter, after his general introduction and even in the course of it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), makes his historical commencement with the emergence of the Baptist. Undoubtedly, traditions of the preliminary history were also known to Mark; in leaving them unnoticed he does not reject them, but still he does not find in them—lying as they do back in the gloom prior to the great all-significant epoch of the emergence of John—the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀρχὴ τοῦ εὐαγγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰησοῦ Χριστοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When the genitive with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΕὐΑΓΓ.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΕὐΑΓΓ.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not a person",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is always genitive of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "object",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐαγγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς βασιλείας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς σωτηρίας κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is associated therewith, it is the genitive of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "subject",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as is the case also when ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " stands with it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 2:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 16:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But if ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Χριστοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is associated therewith (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it may be either the genitive ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "subjecti (auctoris",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or the genitive ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "objecti",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a point which must be determined entirely by the context. In this case it decides (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:2-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in favour of the latter. Taken as genitive ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "subjecti",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Ewald: “how Christ began to preach the gospel of God”), ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ εὐαγγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Χ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". would have reference to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; but in that case the non-originality of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is presupposed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΥἹΟῦ Τ. ΘΕΟῦ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΥἹΟῦ Τ. ΘΕΟῦ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "] not as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because Mark had primarily in his view Gentile-Christian readers;[48] see Introd. § 3. This designation of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Messiah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used in the believing consciousness of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "metaphysical",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sonship of God (comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that in the Pauline and Petrine sense (see on Matt. p. 65 f.). The supernatural generation is by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΥἹΟῦ Τ. ΘΕΟῦ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΥἹΟῦ Τ. ΘΕΟῦ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " neither assumed (Hilgenfeld) nor excluded (Köstlin); even ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " proves nothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἘΝ ἩΣΑΐΑ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἘΝ ἩΣΑΐΑ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "] The following quotation combines ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this case, instead of all sorts of hypotheses (see them in Fritzsche), we must abide by the simple admission, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by a mistake of memory",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of which, indeed, Porphyry made a bitter use, see Jerome, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad Matthew 3:3",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ad ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") Mark thought of the whole of the words as to be found in Isaiah,—a mistake which, considering the affinity of the contents of the two sayings, and the prevalence of their use and their interpretation, is all the more conceivable, as Isaiah was “copiosior et notior” (Bengel). A different judgment would have to be formed, if the passage of Isaiah ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stood first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see Surenhusius, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταλλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 45). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was a similar error of memory. According to Hengstenberg, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Christol.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " III. p. 664, Mark has ascribed the entire passage to Isaiah, because Isaiah is the auctor ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "primarius",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to whom Malachi is related only as auctor ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "secundarius",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as expositor. A process of reflection is thus imputed to the evangelist, in which, moreover, it would be sufficiently strange that he should not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have placed first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the utterance of the auctor ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "primarius",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is held to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "commented on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by that of the minor prophet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As to the two passages themselves, see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The essential agreement in form of the first citation with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cannot be used, in determining to which of the two evangelists the priority is due, as a means of proof (Anger and others, in favour of Matthew; Ritschl and others, in favour of Mark); it can only be used as a ground of confirmation, after a decision of this question has been otherwise arrived at. Just as little does the quotation form a proof for a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "primitive-Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which, according to Holtzmann and others, it is alleged not to have held a place at all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἘΓΈΝΕΤΟ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ἘΓΈΝΕΤΟ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "might",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be connected with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βαπτίζων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Erasmus, Beza, Grotius, Kuinoel, and others), see Heindorf, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad Plat. Soph.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " p. 273 f.; Lobeck, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad Aj.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 588; Kühner, II. p. 40. But the mention of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "emergence",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the Baptist is in keeping with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beginning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the history.[49] Hence: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there appeared John, baptizing in the desert",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Xen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Anab.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " iii. 4. 49, iv. 3. 29, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ΠΑΡΑΓΊΝΕΤΑΙ",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "ΠΑΡΑΓΊΝΕΤΑΙ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and on ",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The appearance and ministry of the Baptist",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 3:1-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The beginning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] St Mark commences his Gospel suddenly and concisely. He does not begin with a genealogy of our Lord, like St Matthew, or with the history of the Infancy, as St Luke, or with the doctrine of the Eternal Word, as St John. He desires to pourtray Christ in the fulness of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His living energy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See Introduction, pp. 16, 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of Jesus Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Gospel of Jesus Christ denotes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Glad Tidings concerning Jesus Christ = the Messiah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the anointed Prophet, Priest, and King. For the meaning of the name Jesus see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Contrast this with St ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of David, the Son of Abraham",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” The first Evangelist writes for Jews, the second for Gentiles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Preaching and Baptism of John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The object of St Mark is to relate ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the official life and ministry",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of our Lord. He therefore begins with His baptism, and first relates, as introductory to it, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "preaching of John the Baptist",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Αρχὴ τοῦ εὐαγγελίου Ἰησοῦ Χριστοῦ Υἱοῦ τοῦ Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the beginning of the Gospel of Jesus Christ the Son of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") There is a considerable correspondence of Mark, in part with Matthew, in part with Luke. There is described by Mark,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I.  THE BEGINNING OF THE GOSPEL.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1.  John prepares the way, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2.  He baptizes Jesus, who is thereat proclaimed the SON OF GOD, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "3.  Satan tempts Jesus: angels minister to Him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "II.  THE GOSPEL ITSELF,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1.  In Galilee. Here three periods are to be noted:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A.  John having been committed to prison: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  Summarily and Generally:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "α",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  The place and subject-matter of His preaching, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "β",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  The call of His principal apostles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:16-20",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  Specially:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "α",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  His actions, which were not found fault with by adversaries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1.  He teaches with power, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2.  He casts out the demon from one possessed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:23-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "3.  He cures the mother-in-law of Peter, as also many other sick persons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:29-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "4.  He prays, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "5.  He teaches everywhere, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:36-39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "6.  He cleanses the leper, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:40-45",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "β",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  Actions of His, found fault with by adversaries, and gradually more severely so. In this class are to be reckoned,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1.  The man sick of the palsy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2.  The call of Levi, and His eating with publicans and sinners, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "3.  The question as to fasting answered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:18-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "4.  The plucking of the ears of corn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:23-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "5.  The withered hand restored, and the lying-in-wait for Him of His adversaries, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".  The Lord withdraws Himself; and His acts,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1.  At the sea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:7-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2.  On the mountain, where the twelve apostles were called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:13-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "3.  In the house; where, after having refuted the most atrocious blasphemy of the Scribes, He corrects the question of His own friends, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:20-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 31–35",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4.  From the ship, to the people; and apart to His disciples, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:26-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "5.  On the sea, and beyond the sea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:35-41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 5:1-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "6.  On the hither side of the sea again: where Jairus and the woman with the issue of blood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 5:21-43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "7.  The Nazarites offended at Him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "8.  The sending forth of the apostles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:7-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "B.  John killed: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  1.  Herod hearing of Jesus, and his opinion of John, whom he had killed, being revived, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:14-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  2.  The withdrawal of our Lord with His apostles on their return,  ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:30-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  3.  The eagerness of the people: the compassion of the Lord: five thousand fed abundantly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:31-44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  4.  The journey by sea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:45-52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  5.  In the land of Gennesareth He heals many, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:53-56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and shows what it is that defiles or does not defile a man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  6.  On the borders of Tyre and Sidon a demon is cast out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:24-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  7.  At the sea of Galilee He cures one deaf and dumb: He feeds four thousand, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:31-37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  8.  He comes to Dalmanutha, and answers as to the sign from heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:10-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  9.  In the ship, He warns them as to the leaven of doctrine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:14-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  10.  At Bethsaida He gives sight to the blind man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:22-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "C.  Jesus acknowledged as the Son of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "  1.  On Peter confessing Him as the CHIRST, He enjoins silence on the disciples, and foretells His passion: reproves Peter: requires of His disciples that they must follow Him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  2.  On six days after, He is glorified at the transfiguration; explains the reasons for silence; cures a lunatic; again foretells His Passion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:2-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  3.  Teaches the disciples moderation, leniency [æquitatem], and concord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:33-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:38-50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2.  In Judea:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The beginning of the gospel of Jesus Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These words mean, not the title of the book, but the commencement of the narrative; and so they depend upon what follows, namely, \"as it is written\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καθῶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὠς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"even as it is written.\" The words \"the gospel of Jesus Christ\" do not signify the book which St. Mark wrote, but the evangelical teaching of Jesus Christ. St. Mark means that the gospel announcement by Jesus Christ had such a beginning as had been predicted by Isaiah and Malachi, namely, the preaching of John the Baptist, and his testimony concerning Christ, to be fully laid open by the preaching and the death of Christ. The preaching of repentance by the Baptist was the preparation and the beginning of the evangelical preaching by Christ, of whom John was the forerunner. It has been well observed that St. Matthew and St. John begin their Gospels from Christ himself; but St. Matthew from the human, and St. John from the Divine, generation of Christ. St. Mark and St. Luke commence from John the Baptist; but St. Luke from his nativity, and St, John from his preaching. The words, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Son of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are rightly retained in the Revised Version, although they are omitted by some ancient authorities. Mark 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Beginning (ἀρχὴ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "without the article, showing that the expression is a kind of title. It is 'the beginning, not of his book, but of the facts of the Gospel. He shows from the prophets that the Gospel was to begin by the sending forth of a forerunner. ",
        "children": []
      }
    ]
  }
]