[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he was there in the wilderness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See Notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:2-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St. Mark compresses the history by omitting the several forms of the Temptation. Peculiar to him are (1) the use of “Satan” instead of “the devil;” (2) the statement that Jesus was “with the wild beasts.” In our Lord’s time these might include the panther, the bear, the wolf, the hyena, possibly the lion. The implied thought is partly that their presence added to the terrors of the Temptation, partly that in His being protected from them there was the fulfilment of the promise in the very Psalm which furnished the Tempter with his chief weapon, that the true child of God should trample under foot “the lion and the adder,” the “young lion and the dragon” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:9-13 Christ's baptism was his first public appearance, after he had long lived unknown. How much hidden worth is there, which in this world is not known! But sooner or later it shall be known, as Christ was. He took upon himself the likeness of sinful flesh; and thus, for our sakes, he sanctified himself, that we also might be sanctified, and be baptized with him, Joh 17:19. See how honourably God owned him, when he submitted to John's baptism. He saw the Spirit descending upon him like a dove. We may see heaven opened to us, when we perceive the Spirit descending and working upon us. God's good work in us, is sure evidence of his good will towards us, and preparations for us. As to Christ's temptation, Mark notices his being in the wilderness and that he was with the wild beasts. It was an instance of his Father's care of him, which encouraged him the more that his Father would provide for him. Special protections are earnests of seasonable supplies. The serpent tempted the first Adam in the garden, the Second Adam in the wilderness; with different success indeed; and ever since he still tempts the children of both, in all places and conditions. Company and conversation have their temptations; and being alone, even in a wilderness, has its own also. No place or state exempts, no business, not lawful labouring, eating, or drinking, not even fasting and praying; often in these duties there are the most assaults, but in them is the sweetest victory. The ministration of the good angels is matter of great comfort in reference to the malignant designs of the evil angels; but much more does it comfort us, to have the indwelling of God the Holy Spirit in our hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Here Mark relates concisely what Matthew has recorded more at length in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Spirit driveth - The word \"driveth\" does not mean that he was compelled forcibly against his will to go there, but that he was inclined to go there by the Spirit, or was led there. The Spirit of God, for important purposes, caused him to go. Compare Matthew 9:25, where the same word is used in the original: \"And when they were all put forth\" in Greek, \"all driven out.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Spirit driveth - The word \"driveth\" does not mean that he was compelled forcibly against his will to go there, but that he was inclined to go there by the Spirit, or was led there. The Spirit of God, for important purposes, caused him to go. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the same word is used in the original: \"And when they were all put forth\" in Greek, \"all driven out.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And was with the wild beasts - This is added to show the desolation and danger of his dwelling there. In this place, surrounded by such dangers, the temptations offered by Satan were the stronger. Amid want and perils, Satan might suppose that he would be more easily seduced from God. But he trusted in his Father, and was alike delivered from dangers, from the wild beasts, and from the power of temptation, thus teaching us what to do in the day of danger and trial.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the angels ministered unto him - From Luke 4:2 we learn that in those days he did eat nothing. When Mark says, therefore, that the angels ministered to him, it means after the days of temptation had expired, as is said by Matthew 4:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the angels ministered unto him - From ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we learn that in those days he did eat nothing. When Mark says, therefore, that the angels ministered to him, it means after the days of temptation had expired, as is said by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mr 1:12, 13. Temptation of Christ. ( = Mt 4:1-11; Lu 4:1-13).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on [1398]Mt 4:1-11.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 1:12\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he was there in the wilderness forty days,.... The Vulgate Latin, Arabic, and Ethiopic versions add, \"and forty nights\": for so long was he there, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "tempted of Satan: the several temptations of Satan, and how they were overcome by Christ, are particularly related by the Evangelist Matthew, Matthew 4:3, which are here omitted; and what is not mentioned there, is here recorded: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "tempted of Satan: the several temptations of Satan, and how they were overcome by Christ, are particularly related by the Evangelist Matthew, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which are here omitted; and what is not mentioned there, is here recorded: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and was with the wild beasts: which shows, that he was now in an uncultivated and uninhabited part of the desert by men, and where only the most fierce and most savage of creatures dwelt; and yet was as secure and unhurt by them, being the Lord of them, as Adam in Eden's garden, or Daniel in the lions' den. This circumstance is only related by the Evangelist Mark, and is what adds to the uncomfortable situation Christ was in, when tempted by Satan; and his being not hurt by them, may declare, partly his innocence, as man, being as pure and holy as the first man was in his state of integrity, when all creatures were brought before him, to give them names; and partly the power of God, who shut up the mouths of these creatures, that they did him no hurt; and also may signify, the awe they stood in of him, who, as God, is Lord of all. These creatures were more gentle to Christ, and used him better than the wicked Jews, among whom he dwelt, who are compared to lions, dogs, and \"bulls\" of Bashan, Psalm 22:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and was with the wild beasts: which shows, that he was now in an uncultivated and uninhabited part of the desert by men, and where only the most fierce and most savage of creatures dwelt; and yet was as secure and unhurt by them, being the Lord of them, as Adam in Eden's garden, or Daniel in the lions' den. This circumstance is only related by the Evangelist Mark, and is what adds to the uncomfortable situation Christ was in, when tempted by Satan; and his being not hurt by them, may declare, partly his innocence, as man, being as pure and holy as the first man was in his state of integrity, when all creatures were brought before him, to give them names; and partly the power of God, who shut up the mouths of these creatures, that they did him no hurt; and also may signify, the awe they stood in of him, who, as God, is Lord of all. These creatures were more gentle to Christ, and used him better than the wicked Jews, among whom he dwelt, who are compared to lions, dogs, and \"bulls\" of Bashan, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the angels ministered unto him; after the temptations were over, and Satan had left him, preparing for him, and bringing to him proper food, after so long a fast; and waiting upon him, and serving him as their great Lord and master; See Gill on Matthew 4:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the angels ministered unto him; after the temptations were over, and Satan had left him, preparing for him, and bringing to him proper food, after so long a fast; and waiting upon him, and serving him as their great Lord and master; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he was there in the wilderness forty days, tempted of Satan; and was with the wild beasts; and the angels ministered unto him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πειραζόμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", being tempted, presumably the whole time; doubtless the real truth. Two powers at work all through, the Spirit of God and the spirit of evil.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἦν μετὰ τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θηρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: not merely pictorial or intended to hint danger; meant rather to indicate the uninhabited nature of the place; no supplies obtainable there, hunger therefore a part of the experience.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ ἄγγελοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": angels as opposed, not to devils (Schanz), but to human beings, of whom there were none.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διηκόνουν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ministered; in what way not said, but implying exhaustion. These few touches of Mk. suggest a vivid picture of a spiritual crisis: intense preoccupation, instinctive retreat into congenial grim solitudes, temptation, struggle, fierce and protracted, issuing in weakness, calling for preternatural aid.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tempted of Satan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", He is said to have been tempted by the Devil, i. e. the “Slanderer,” who slanders God to man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:1-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and man to God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 12:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). St Mark, who never uses this word, says He was tempted by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Satan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i e. “the Enemy” of God and man alike. He seems to have been permitted to tempt our Lord during the whole of the forty days, but at the end of that period to have assailed Him with increased intensity through every avenue that could allure, as afterwards in Gethsemane through every channel that could terrify and appal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the wild beasts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] St Mark relates the Temptation very briefly, but he alone adds the graphic touch to the picture that the Saviour was “with the wild beasts,” unhurt by them, as Adam was in Paradise. Comp. Daniel in the den of lions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the angels",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] St Matthew records the ministry of Angels at the close as to a Heavenly Prince (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). St Mark records a ministry of the same celestial Visitants apparently ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "throughout the trial",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Μετὰ τῶν θηρίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with the wild beasts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") An important fact; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This was a state more trying than the mere solitude of the desert. [",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Here the Saviour was removed apart from angels and men; and yet, however, not liable to the attacks of wild beasts. He even now, in the very height of His humiliation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (self-emptying), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exercised over the beasts the dominion which Adam had so soon suffered himself to lose; how much more so, when exalted!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.] Mark not only exhibits in a more compendious compass the history described by Matthew, but also, as it were in the manner of a supplement, some particulars of considerable value, which had not been previously recorded by Matthew, but which were calculated to afford profitable instruction to believers, who by this time had become proficients in the truth.[8]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[8] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Michaelis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Enleitung",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., T. ii., p. 1154, etc., has tried to prove, by induction of particulars, that those things which Mark has either ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "omitted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "supplied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", most especially accord with the tradition of the ancients, which represented Mark’s aim in writing to have been with a view to the conversion and edification of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Romans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—E. B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Forty days tempted of Satan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St. Mark gathers up the whole temptation into this one sentence; and the passage would seem to imply that the three temptations recorded by St. Matthew and St. Luke were not the only trials through which our Lord passed during those forty days, although they were no doubt the prominent and the most powerful assaults upon our Redeemer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he was with the wild beasts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "μετὰ τῶν θηρίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This shows the extreme solitude of the place. It shows also the innocence of our Lord, that there, in that wild and desolate district, amongst lions, and wolves, and leopards, and serpents, he neither feared them nor was injured by them. He dwelt amongst them as Adam lived with them in his state of innocence in Paradise. These wild beasts recognized and revered their Creater and their Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": ". And the angels ministered unto him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This, as we learn from St. Matthew (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was after his temptation and victory. Some have thought that Jesus became known to the devil as the Son of God, by the reverence and adoration of the angels. Thus Jesus showed in his own person, when alone he had striven with Satan and, had overcome him, that heavenly comfort and the ministry of angels are provided by God for those who overcome temptation. Mark 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With the wild beasts",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Peculiar to Mark. The region just alluded to abounds in boars, jackals, wolves, foxes, leopards, hyenas, etc. ",
        "children": []
      }
    ]
  }
]