[{"num":1,"verse":"It was the month of Nisan in the twentieth year of Artaxerxes the king. At the hour for serving wine I brought it in and gave it to the king. I had never been hangdog in his presence before, so he asked me, “Why the long face? You’re not sick are you? Or are you depressed?”"},{"num":2,"verse":"That made me all the more agitated. I said, “Long live the king! And why shouldn’t I be depressed when the city, the city where all my family is buried, is in ruins and the city gates have been reduced to cinders?”"},{"num":4,"verse":"The king then asked me, “So what do you want?”"},{"num":6,"verse":"The king, with the queen sitting alongside him, said, “How long will your work take and when would you expect to return?”"},{"num":7,"verse":"Then I said, “If it please the king, provide me with letters to the governors across the Euphrates that authorize my travel through to Judah; and also an order to Asaph, keeper of the king’s forest, to supply me with timber for the beams of The Temple fortress, the wall of the city, and the house where I’ll be living.”"},{"num":8,"verse":"The generous hand of my God was with me in this and the king gave them to me. When I met the governors across The River (the Euphrates) I showed them the king’s letters. The king even sent along a cavalry escort."},{"num":10,"verse":"When Sanballat the Horonite and Tobiah the Ammonite official heard about this, they were very upset, angry that anyone would come to look after the interests of the People of Israel."},{"header":"“Come—Let’s Build the Wall of Jerusalem”"},{"num":11,"verse":"And so I arrived in Jerusalem. After I had been there three days, I got up in the middle of the night, I and a few men who were with me. I hadn’t told anyone what my God had put in my heart to do for Jerusalem. The only animal with us was the one I was riding."},{"num":13,"verse":"Under cover of night I went past the Valley Gate toward the Dragon’s Fountain to the Dung Gate looking over the walls of Jerusalem, which had been broken through and whose gates had been burned up. I then crossed to the Fountain Gate and headed for the King’s Pool but there wasn’t enough room for the donkey I was riding to get through. So I went up the valley in the dark continuing my inspection of the wall. I came back in through the Valley Gate. The local officials had no idea where I’d gone or what I was doing—I hadn’t breathed a word to the Jews, priests, nobles, local officials, or anyone else who would be working on the job."},{"num":17,"verse":"Then I gave them my report: “Face it: we’re in a bad way here. Jerusalem is a wreck; its gates are burned up. Come—let’s build the wall of Jerusalem and not live with this disgrace any longer.” I told them how God was supporting me and how the king was backing me up."},{"num":19,"verse":"When Sanballat the Horonite, Tobiah the Ammonite official, and Geshem the Arab heard about it, they laughed at us, mocking, “Ha! What do you think you’re doing? Do you think you can cross the king?”"},{"num":20,"verse":"I shot back, “The God-of-Heaven will make sure we succeed. We’re his servants and we’re going to work, rebuilding. You can stick to your own business. You get no say in this—Jerusalem’s none of your business!”"}]