[{"header":"Chapter 2"},{"num":1,"verse":"Appointment by the King. In the month Nisan of the twentieth year of King Artaxerxes, when the wine was in my charge, I took some and offered it to the king. Because I had never before been sad in his presence, "},{"num":2,"verse":"the king asked me, “Why do you look sad? If you are not sick, you must be sad at heart.” Though I was seized with great fear, "},{"num":3,"verse":"I answered the king: “May the king live forever! How could I not look sad when the city where my ancestors are buried lies in ruins, and its gates consumed by fire?” "},{"num":4,"verse":"The king asked me, “What is it, then, that you wish?” I prayed to the God of heaven "},{"num":5,"verse":"and then answered the king: “If it please the king, and if your servant is deserving of your favor, send me to Judah, to the city where my ancestors are buried, that I may rebuild it.” "},{"num":6,"verse":"Then the king, with the queen seated beside him, asked me, “How long will your journey take and when will you return?” My answer was acceptable to the king and he agreed to let me go; I set a date for my return."},{"num":7,"verse":"I asked the king further: “If it please the king, let letters be given to me for the governors of West-of-Euphrates, that they may give me safe-conduct till I arrive in Judah; "},{"num":8,"verse":"also a letter for Asaph, the keeper of the royal woods, that he may give me timber to make beams for the gates of the temple citadel, for the city wall and the house that I will occupy.” Since I enjoyed the good favor of my God, the king granted my requests. "},{"num":9,"verse":"Thus I proceeded to the governors of West-of-Euphrates and presented the king’s letters to them. The king also sent with me army officers and cavalry."},{"num":10,"verse":"When Sanballat the Horonite and Tobiah the Ammonite official had heard of this, they were very much displeased that someone had come to improve the lot of the Israelites."},{"num":11,"verse":"Circuit of the City. When I arrived in Jerusalem, and had been there three days, "},{"num":12,"verse":"I set out by night with only a few other men and with no other animals but my own mount (for I had not told anyone what my God had inspired me to do for Jerusalem). "},{"num":13,"verse":"I rode out at night by the Valley Gate, passed by the Dragon Spring, and came to the Dung Gate, observing how the walls of Jerusalem were breached and its gates consumed by fire. "},{"num":14,"verse":"Then I passed over to the Fountain Gate and to the King’s Pool. Since there was no room here for my mount to pass with me astride, "},{"num":15,"verse":"I continued on foot up the wadi by night, inspecting the wall all the while, until I once more reached the Valley Gate, by which I went back in. "},{"num":16,"verse":"The magistrates knew nothing of where I had gone or what I was doing, for as yet I had disclosed nothing to the Jews, neither to the priests, nor to the nobles, nor to the magistrates, nor to the others who were to do the work."},{"num":17,"verse":"Decision to Rebuild the City Wall. Afterward I said to them: “You see the trouble we are in: how Jerusalem lies in ruins and its gates have been gutted by fire. Come, let us rebuild the wall of Jerusalem, so that we may no longer be a reproach!” "},{"num":18,"verse":"Then I explained to them how God had shown his gracious favor to me, and what the king had said to me. They replied, “Let us begin building!” And they undertook the work with vigor."},{"num":19,"verse":"When they heard about this, Sanballat the Horonite, Tobiah the Ammonite official, and Geshem the Arab mocked and ridiculed us. “What are you doing?” they asked. “Are you rebelling against the king?” "},{"num":20,"verse":"My answer to them was this: “It is the God of heaven who will grant us success. We, his servants, shall set about the rebuilding; but you have neither share nor claim nor memorial in Jerusalem.”"}]