[[],[{"type":"header","content":"Nehemiah Goes to Jerusalem"},{"type":"prose","content":"Early the following spring, in the month of Nisan, during the twentieth year of King Artaxerxes’ reign, I was serving the king his wine. I had never before appeared sad in his presence."}],[{"type":"prose","content":"So the king asked me, “Why are you looking so sad? You don’t look sick to me. You must be deeply troubled.”Then I was terrified,"}],[{"type":"prose","content":"but I replied, “Long live the king! How can I not be sad? For the city where my ancestors are buried is in ruins, and the gates have been destroyed by fire.”"}],[{"type":"prose","content":"The king asked, “Well, how can I help you?”With a prayer to the God of heaven,"}],[{"type":"prose","content":"I replied, “If it please the king, and if you are pleased with me, your servant, send me to Judah to rebuild the city where my ancestors are buried.”"}],[{"type":"prose","content":"The king, with the queen sitting beside him, asked, “How long will you be gone? When will you return?” After I told him how long I would be gone, the king agreed to my request."}],[{"type":"prose","content":"I also said to the king, “If it please the king, let me have letters addressed to the governors of the province west of the Euphrates River, instructing them to let me travel safely through their territories on my way to Judah."}],[{"type":"prose","content":"And please give me a letter addressed to Asaph, the manager of the king’s forest, instructing him to give me timber. I will need it to make beams for the gates of the Temple fortress, for the city walls, and for a house for myself.” And the king granted these requests, because the gracious hand of God was on me."}],[{"type":"prose","content":"When I came to the governors of the province west of the Euphrates River, I delivered the king’s letters to them. The king, I should add, had sent along army officers and horsemen to protect me."}],[{"type":"prose","content":"But when Sanballat the Horonite and Tobiah the Ammonite official heard of my arrival, they were very displeased that someone had come to help the people of Israel."}],[{"type":"header","content":"Nehemiah Inspects Jerusalem’s Wall"},{"type":"prose","content":"So I arrived in Jerusalem. Three days later,"}],[{"type":"prose","content":"I slipped out during the night, taking only a few others with me. I had not told anyone about the plans God had put in my heart for Jerusalem. We took no pack animals with us except the donkey I was riding."}],[{"type":"prose","content":"After dark I went out through the Valley Gate, past the Jackal’s Well, and over to the Dung Gate to inspect the broken walls and burned gates."}],[{"type":"prose","content":"Then I went to the Fountain Gate and to the King’s Pool, but my donkey couldn’t get through the rubble."}],[{"type":"prose","content":"So, though it was still dark, I went up the Kidron Valley instead, inspecting the wall before I turned back and entered again at the Valley Gate."}],[{"type":"prose","content":"The city officials did not know I had been out there or what I was doing, for I had not yet said anything to anyone about my plans. I had not yet spoken to the Jewish leaders—the priests, the nobles, the officials, or anyone else in the administration."}],[{"type":"prose","content":"But now I said to them, “You know very well what trouble we are in. Jerusalem lies in ruins, and its gates have been destroyed by fire. Let us rebuild the wall of Jerusalem and end this disgrace!”"}],[{"type":"prose","content":"Then I told them about how the gracious hand of God had been on me, and about my conversation with the king.They replied at once, “Yes, let’s rebuild the wall!” So they began the good work."}],[{"type":"prose","content":"But when Sanballat, Tobiah, and Geshem the Arab heard of our plan, they scoffed contemptuously. “What are you doing? Are you rebelling against the king?” they asked."}],[{"type":"prose","content":"I replied, “The God of heaven will help us succeed. We, his servants, will start rebuilding this wall. But you have no share, legal right, or historic claim in Jerusalem.”"}]]