[{"header":"Jacob’s Second and Third Encounters with God"},{"num":31,"verse":"Jacob heard that Laban’s sons were saying, “Jacob has taken everything that belonged to our father and has gained all his wealth from him.” "},{"num":2,"verse":"He also noticed that Laban did not appear as friendly to him as before."},{"num":3,"verse":"Then Yahweh said to Jacob, “Go back to the land of your ancestors and to your relatives, and I will be with you.”"},{"num":4,"verse":"So Jacob sent a message to Rachel and Leah to come out to the open country where his flocks were. "},{"num":5,"verse":"He said to them, “I have seen that your father isn’t as friendly to me as he was before, but the Elohim of my father has been with me. "},{"num":6,"verse":"You know that I have worked as hard as I could for your father. "},{"num":7,"verse":"Your father has cheated me. He has changed my wages ten times. But Elohim hasn’t let him harm me. "},{"num":8,"verse":"Whenever he said, ‘The speckled ones will be your wages,’ all the flocks gave birth to speckled young. And whenever he said, ‘The striped ones will be your wages,’ all the flocks gave birth to striped young. "},{"num":9,"verse":"So Elohim has taken away your father’s livestock and has given them to me."},{"num":10,"verse":"“During the mating season I had a dream: I looked up and saw that the male goats which were mating were striped, speckled, or spotted. "},{"num":11,"verse":"In the dream the Messenger of Elohim called to me, ‘Jacob!’ And I answered, ‘Yes, here I am.’ "},{"num":12,"verse":"He said, ‘Look up and see that all the male goats which are mating are striped, speckled, or spotted, because I have seen everything that Laban is doing to you. "},{"num":13,"verse":"I am the El who appeared to you at Bethel, where you poured olive oil on a stone marker for a holy purpose and where you made a vow to me. Now leave this land, and go back to the land of your relatives.’”"},{"num":14,"verse":"Rachel and Leah answered him, “Is there anything left in our father’s household for us to inherit? "},{"num":15,"verse":"Doesn’t he think of us as foreigners? Not only did he sell us, but he has used up the money that was paid for us. "},{"num":16,"verse":"Certainly, all the wealth that Elohim took away from our father belongs to us and our children. Now do whatever Elohim has told you.”"},{"header":"Laban and Jacob Make Peace"},{"num":17,"verse":"Then Jacob put his children and his wives on camels. "},{"num":18,"verse":"He drove all his livestock ahead of him and took all the possessions that he had accumulated. He took his own livestock that he had accumulated in Paddan Aram and went back to his father Isaac in Canaan."},{"num":19,"verse":"When Laban went to shear his sheep, Rachel stole her father’s idols. "},{"num":20,"verse":"Jacob also tricked Laban the Aramean by not telling him he was leaving. "},{"num":21,"verse":"So he left in a hurry with all that belonged to him. He crossed the Euphrates River and went toward the mountains of Gilead."},{"num":22,"verse":"Two days later Laban was told that Jacob had left in a hurry. "},{"num":23,"verse":"He and his relatives pursued Jacob for seven days. Laban caught up with him in the mountains of Gilead."},{"num":24,"verse":"Elohim came to Laban the Aramean in a dream at night and said to him, “Be careful not to say anything at all to Jacob.”"},{"num":25,"verse":"When Laban finally caught up with Jacob, Jacob had put up his tents in the mountains. So Laban and his relatives put up their tents in the mountains of Gilead. "},{"num":26,"verse":"Then Laban asked Jacob, “What have you done by tricking me? You’ve carried off my daughters like prisoners of war. "},{"num":27,"verse":"Why did you leave secretly and trick me? You didn’t even tell me you were leaving. I would have sent you on your way rejoicing, with songs accompanied by tambourines and lyres. "},{"num":28,"verse":"You didn’t even let me kiss my grandchildren and my daughters. You’ve done a foolish thing. "},{"num":29,"verse":"I have the power to harm you. Last night the Elohim of your father said to me, ‘Be careful not to say anything at all to Jacob.’ "},{"num":30,"verse":"Now you have left for your father’s home because you were so homesick. But why did you steal my gods?”"},{"num":31,"verse":"Jacob answered Laban, “I left because I was afraid. I thought you would take your daughters away from me by force. "},{"num":32,"verse":"If you find your gods, the one who has them will not be allowed to live. In the presence of our relatives, search as much as you want through what I have, and take what is yours.” (Jacob didn’t know that Rachel had stolen the gods.)"},{"num":33,"verse":"So Laban went into Jacob’s tent, into Leah’s tent, and into the tent of the two slaves. But he found nothing. He came out of Leah’s tent and went into Rachel’s tent. "},{"num":34,"verse":"Rachel had taken the idols and had put them in her camel’s saddle-bag and was sitting on them. Laban rummaged through the whole tent but found nothing."},{"num":35,"verse":"Rachel said to her father, “Don’t be angry, Father, but I can’t get up to greet you; I’m having my period.” So even though Laban had made a thorough search, he didn’t find the idols."},{"num":36,"verse":"Then Jacob became angry and confronted Laban. “What is my crime?” Jacob demanded of Laban. “What is my offense that you have come chasing after me? "},{"num":37,"verse":"Now that you’ve rummaged through all my things, did you find anything from your house? Put it here in front of all our relatives. Let them decide which one of us is right."},{"num":38,"verse":"“I’ve been with you for 20 years. Your sheep and goats never miscarried, and I never ate any rams from your flocks. "},{"num":39,"verse":"I never brought you any of the flock that was killed by wild animals. I paid for the loss myself. That’s what you demanded of me when any of the flock was stolen during the day or at night. "},{"num":40,"verse":"The scorching heat during the day and the cold at night wore me down, and I lost a lot of sleep. "},{"num":41,"verse":"I’ve been with your household 20 years now. I worked for you 14 years for your two daughters and 6 years for your flocks, and you changed my wages ten times. "},{"num":42,"verse":"If the Elohim of my father, the Elohim of Abraham and the Fear of Isaac, had not been with me, you would have sent me away empty-handed by now. Elohim has seen my misery and hard work, and last night he made it right.”"},{"num":43,"verse":"Then Laban answered Jacob, “These are my daughters, my grandchildren, and my flocks. Everything you see is mine! Yet, what can I do today for my daughters or for their children? "},{"num":44,"verse":"Now, let’s make an agreement and let it stand as a witness between you and me.”"},{"num":45,"verse":"Jacob took a stone and set it up as a marker. "},{"num":46,"verse":"Then Jacob said to his relatives, “Gather some stones.” They took stones, put them into a pile, and ate there by the pile of stones. "},{"num":47,"verse":"In his language Laban called it Jegar Sahadutha [Witness Pile], but Jacob called it Galeed."},{"num":48,"verse":"Laban said, “This pile of stones stands as a witness between you and me today.” This is why it was named Galeed "},{"num":49,"verse":"and also Mizpah [Watchtower], because he said, “May Yahweh watch between you and me when we’re unable to see each other. "},{"num":50,"verse":"If you mistreat my daughters or marry other women behind my back, remember that Elohim stands as a witness between you and me.”"},{"num":51,"verse":"Laban said to Jacob, “Here is the pile of stones, and here is the marker that I have set up between you and me. "},{"num":52,"verse":"This pile of stones and this marker stand as witnesses that I will not go past the pile of stones to harm you, and that you will not go past the pile of stones or marker to harm me. "},{"num":53,"verse":"May the Elohim of Abraham and Nahor—the Elohim of their father—judge between us.”"},{"num":54,"verse":"and offered a sacrifice on the mountain. He invited his relatives to eat the meal with him. They ate with him and spent the night on the mountain."},{"num":55,"verse":"Early the next morning Laban kissed his grandchildren and his daughters and blessed them. Then Laban left and went back home."}]