[{"num":3,"verse":"Na‘omi her mother-in-law said to her, “My daughter, I should be seeking security for you; so that things will go well with you. "},{"num":2,"verse":"Now there’s Bo‘az our relative — you were with his girls. He’s going to be winnowing barley tonight at the threshing-floor. "},{"num":3,"verse":"So bathe, anoint yourself, put on your good clothes, and go down to the threshing-floor; but don’t reveal your presence to the man until he’s finished eating and drinking. "},{"num":4,"verse":"Then, when he lies down, take note of where he’s lying; later, go in, uncover his feet, and lie down. He will tell you what to do.” "},{"num":5,"verse":"She responded, “I will do everything you tell me.”"},{"num":6,"verse":"She went down to the threshing-floor and did everything as her mother-in-law had instructed her. "},{"num":7,"verse":"After Bo‘az was through eating and drinking and was feeling good, he went to lie down at the end of the pile of grain. She stole in, uncovered his feet and lay down. "},{"num":8,"verse":"In the middle of the night the man was startled and turned over, and — there was a woman lying at his feet! "},{"num":9,"verse":"He asked, “Who are you?” and she answered, “I’m your handmaid Rut. Spread your robe over your handmaid, because you are a redeeming kinsman.” "},{"num":10,"verse":"He said, “May Adonai bless you, my daughter. Your latest kindness is even greater than your first, in that you didn’t go after the young men, neither the rich ones nor the poor. "},{"num":11,"verse":"And now, my daughter, don’t be afraid. I will do for you everything you say, for all the city leaders among my people know that you are a woman of good character. "},{"num":12,"verse":"Now, it is true that I am a redeeming kinsman; but there is a redeemer who is a closer relative than I am. "},{"num":13,"verse":"Stay tonight. If, in the morning, he will redeem you, fine! — let him redeem you. But if he doesn’t want to redeem you, then, as Adonai lives, I will redeem you. Now, lie down until morning.”"},{"num":14,"verse":"She lay at his feet until morning; then, before [it was light enough that] people could recognize each other, she got up; because he said, “No one should know that the woman came to the threshing-floor.” "},{"num":15,"verse":"He also said, “Bring the shawl you are wearing, and take hold of it.” She held it while he put six measures of barley into it; then he went into the city."},{"num":16,"verse":"When she came to her mother-in-law, she asked, “Who are you? My daughter?” She told her everything the man had done for her. "},{"num":17,"verse":"Then she added, “He gave me these six measures of barley; because he said to me, “You shouldn’t return to your mother-in-law with nothing.” "},{"num":18,"verse":"Na‘omi said, “My daughter, just stay where you are, until you learn how the matter comes out; for the man won’t rest unless he resolves the matter today.”"}]