[{"header":"Naomi Offers to Find a Husband for Ruth"},{"num":3,"verse":"Ruth’s mother-in-law Naomi, told her, “My daughter, should I not make inquiries about your financial security, so you’ll be better off in life? "},{"num":2,"verse":"Isn’t Boaz one of our close relatives? You’ve been associating with his women servants lately. Look, he’ll be winnowing barley at the threshing floor tonight. "},{"num":3,"verse":"So get cleaned up, put on some perfume, dress up, and go to the threshing floor, but don’t let him see you until after he’s finished eating and drinking. "},{"num":4,"verse":"When he lies down, be sure to notice where he is resting. Then go over, uncover his feet, and lie down. He’ll tell you what to do.”"},{"num":5,"verse":"Ruth replied, “I’ll do everything you’ve said.” "},{"num":6,"verse":"So she went out to the threshing floor and did precisely what her mother-in-law had advised."},{"header":"Ruth’s Meeting with Boaz"},{"num":7,"verse":"After Boaz had finished eating and drinking to his heart’s content, he went over and lay down next to the pile of threshed grain. Ruth came in quietly, uncovered his feet, and lay down. "},{"num":8,"verse":"In the middle of the night, Boaz was startled awake and turned over in surprise to see a woman lying at his feet."},{"num":9,"verse":"He asked her, “Who are you?”"},{"num":10,"verse":"He replied, “May you be blessed by the Lord, my daughter. You’ve added to the gracious love you’ve already demonstrated by not pursuing younger men, whether rich or poor. "},{"num":11,"verse":"Don’t be afraid, my daughter. I’ll do for you everything that you have asked, since all of my people in town are aware that you’re a virtuous woman. "},{"num":12,"verse":"It’s true that I’m your related redeemer, but there is another related redeemer even closer than I. "},{"num":13,"verse":"Stay the night, and if he fulfills his duty as your related redeemer in the morning, that will be acceptable. But if he isn’t inclined to do so, then, as the Lord lives, I will act as your related redeemer myself. So lie down until morning.”"},{"num":14,"verse":"So she lay down at his feet until dawn approached, then got up while it was still difficult for anyone to be recognized. Then he told her, “It shouldn’t be known that a woman has come to the threshing floor.” "},{"num":15,"verse":"So he said, “Take your cloak and hold it out.” She did so, and he measured out six units of barley and placed them in a sack on her. Then she left for town."},{"header":"Naomi’s Response to Ruth"},{"num":16,"verse":"When Ruth returned to her mother-in-law, Naomi asked her, “How did it go, my daughter?”"},{"num":17,"verse":"Ruth also said, “He gave me these six units of barley and told me, ‘Don’t go back to your mother-in-law empty-handed.’”"},{"num":18,"verse":"Naomi replied, “Be patient, my daughter, until you learn how this works out, because the man won’t rest until he finishes everything today.”"}]