[{"header":"Ruth and Boaz at the Threshing Floor"},{"num":3,"verse":"One day Ruth’s mother-in-law Naomi spoke to her. She said, “My daughter, I must find a home for you. It should be a place where you will be provided for. "},{"num":2,"verse":"You have been working with the women who work for Boaz. He’s a relative of ours. Tonight he’ll be separating the straw from his barley on the threshing floor. "},{"num":3,"verse":"So wash yourself. Put on some perfume. And put on your best clothes. Then go down to the threshing floor. But don’t let Boaz know you are there. Wait until he has finished eating and drinking. "},{"num":4,"verse":"Notice where he lies down. Then go over and uncover his feet. Lie down there. He’ll tell you what to do.”"},{"num":5,"verse":"“I’ll do everything you say,” Ruth answered. "},{"num":6,"verse":"So she went down to the threshing floor. She did everything her mother-in-law had told her to do."},{"num":7,"verse":"When Boaz had finished eating and drinking, he was in a good mood. He went over to lie down at the far end of the grain pile. Then Ruth approached quietly. She uncovered his feet and lay down there. "},{"num":8,"verse":"In the middle of the night, something surprised Boaz and woke him up. He turned and found a woman lying there at his feet!"},{"num":9,"verse":"“Who are you?” he asked."},{"num":10,"verse":"“Dear woman, may the Lord bless you,” he replied. “You are showing even more kindness now than you did earlier. You didn’t run after the younger men, whether they were rich or poor. "},{"num":11,"verse":"Dear woman, don’t be afraid. I’ll do for you everything you ask. All the people of my town know that you are an excellent woman. "},{"num":12,"verse":"It’s true that I’m a relative of yours. But there’s a family protector who is more closely related to you than I am. "},{"num":13,"verse":"So stay here for the night. In the morning if he wants to help you, good. Let him help you. But if he doesn’t want to, then I’ll do it. You can be sure that the Lord lives. And you can be just as sure that I’ll help you. Lie down here until morning.”"},{"num":14,"verse":"So she stayed at his feet until morning. But she got up before anyone could be recognized. Boaz thought, “No one must know that a woman came to the threshing floor.”"},{"num":15,"verse":"He said to Ruth, “Bring me the coat you have around you. Hold it out.” So she did. He poured more than fifty pounds of barley into it and helped her pick it up. Then he went back to town."},{"num":16,"verse":"Ruth came to her mother-in-law. Naomi asked, “How did it go, my daughter?”"},{"num":17,"verse":"She said, “He gave me all this barley. He said, ‘Don’t go back to your mother-in-law with your hands empty.’ ”"},{"num":18,"verse":"Naomi said, “My daughter, sit down until you find out what happens. The man won’t rest until he settles the whole matter today.”"}]