[{"header":"Ruth and Boaz at the Grain-Floor"},{"num":3,"verse":"Then Ruth’s mother-in-law Naomi said to her, “My daughter, should I not look for a home for you, so all will be well with you? "},{"num":2,"verse":"Is not Boaz of our family, with whose women servants you were? See, he is dividing the grain from the waste at his grain-floor tonight. "},{"num":3,"verse":"So wash yourself. Pour oil on yourself and wear your best clothes. Then go down to the grain-floor. But do not let the man know who you are until he has finished eating and drinking. "},{"num":4,"verse":"When he lies down, watch where he lies. Go in and take the covers off his feet and lie down. Then he will tell you what to do.” "},{"num":5,"verse":"Ruth said to her, “I will do all that you say.”"},{"num":6,"verse":"So Ruth went down to the grain-floor and did all her mother-in-law had told her to do. "},{"num":7,"verse":"When Boaz had finished eating and drinking and his heart was happy, he went to lie down beside the grain. Then Ruth came in secret. She took the covers off his feet and lay down. "},{"num":8,"verse":"The man was surprised late in the night. He turned and saw that a woman was lying at his feet. "},{"num":9,"verse":"He said, “Who are you?” She answered, “I am Ruth, your woman servant. Spread your covering over me. For you are of our family.” "},{"num":10,"verse":"And Boaz said, “May the Lord bring good to you, my daughter. You have shown your last kindness to be better than your first by not going after young men, with or without riches. "},{"num":11,"verse":"Now my daughter, do not be afraid. I will do for you whatever you ask. For all my people in the city know that you are a good woman. "},{"num":12,"verse":"It is true that I am of your family. But there is one closer than I. "},{"num":13,"verse":"Stay this night. In the morning, if he will have you for his own, let him take you. But if he does not want to have you, then I will take you, as the Lord lives. Lie down until morning.”"},{"num":14,"verse":"So Ruth lay at his feet until morning. She got up before the people could see each other. For Boaz said, “Do not let it be known that the woman came to the grain-floor.” "},{"num":15,"verse":"And he said, “Bring the coat you are wearing and hold it out.” So she held it, and he loaded her with six jars full of grain. Then she went into the city. "},{"num":16,"verse":"When she came to her mother-in-law, Naomi said, “How did it go, my daughter?” And Ruth told her all that the man had done for her. "},{"num":17,"verse":"She said, “He gave me these six jars full of grain. For he said, ‘Do not go to your mother-in-law with empty hands.’” "},{"num":18,"verse":"Naomi said, “Wait until you know what is going to happen, my daughter. For the man will not rest until the thing is decided upon today.”"}]