[{"num":41,"verse":"But in the seventh month, Ishmael came to Mizpah with ten of his soldiers. He had been one of the king’s officials and was a member of the royal family. Ishmael and his men were invited to eat with Gedaliah. "},{"num":2,"verse":"During the meal, Ishmael and his soldiers killed Gedaliah, the man chosen as ruler of Judah by the king of Babylonia. "},{"num":3,"verse":"Then they killed the Jews who were with Gedaliah, and they also killed the Babylonian soldiers who were there."},{"num":4,"verse":"The next day, the murders had still not been discovered, "},{"num":5,"verse":"when eighty men came down the road toward Mizpah from the towns of Shechem, Shiloh, and Samaria. They were on their way to the temple to offer gifts of grain and incense to the Lord. They had shaved off their beards, torn their clothes, and cut themselves, because they were mourning."},{"num":6,"verse":"Ishmael went out the town gate to meet them. He pretended to be weeping, and he asked them to come into Mizpah to meet with Gedaliah, the ruler of Judah. "},{"num":7,"verse":"But after they were inside the town, Ishmael had his soldiers kill them and throw their bodies into a well. "},{"num":8,"verse":"He let ten of the men live, because they offered to give him supplies of wheat, barley, olive oil, and honey they had hidden in a field. "},{"num":9,"verse":"The well that he filled with bodies had been dug by King Asa of Judah to store rainwater, because he was afraid that King Baasha of Israel might surround Mizpah and keep the people from getting to their water supply."},{"num":10,"verse":"Nebuzaradan, King Nebuchadnezzar’s officer in charge of the guard, had left King Zedekiah’s daughters and many other people at Mizpah, and he had put Gedaliah in charge of them. But now Ishmael took them all prisoner and led them toward Ammon, on the other side of the Jordan River."},{"num":11,"verse":"Johanan and the other army officers heard what Ishmael had done. "},{"num":12,"verse":"So they and their troops chased Ishmael and caught up with him at the large pit at Gibeon. "},{"num":13,"verse":"When Ishmael’s prisoners saw Johanan and the officers, they were happy "},{"num":14,"verse":"and turned around and ran toward Johanan. "},{"num":15,"verse":"But Ishmael and eight of his men escaped and went to Ammon."},{"header":"Johanan Decides To Take the People to Egypt"},{"num":16,"verse":"Johanan and the officers had rescued the women, children, and royal officials that Ishmael had taken prisoner after killing Gedaliah. Johanan led the people from Gibeon "},{"num":17,"verse":"toward Egypt. They wanted to go there, because they were afraid of what the Babylonians would do when they found out that Ishmael had killed Gedaliah, the ruler appointed by King Nebuchadnezzar."},{"header":"The People Ask Jeremiah To Pray for Them"}]