[{"num":41,"verse":"In the seventh month of that year, Ishmael, the son of Nethaniah and grandson of Elishama, a member of the royal family and one of the king's chief officers, went to Mizpah with ten men to see Governor Gedaliah. While they were all eating a meal together, "},{"num":2,"verse":"Ishmael and the ten men with him pulled out their swords and killed Gedaliah. "},{"num":3,"verse":"Ishmael also killed all the Israelites who were with Gedaliah at Mizpah and the Babylonian soldiers who happened to be there."},{"num":4,"verse":"The next day, before anyone knew about Gedaliah's murder, "},{"num":5,"verse":"eighty men arrived from Shechem, Shiloh, and Samaria. They had shaved off their beards, torn their clothes, and gashed themselves. They were taking grain and incense to offer in the Temple. "},{"num":6,"verse":"So Ishmael went out from Mizpah to meet them, weeping as he went. When he came to them, he said, “Please come in to see Gedaliah.” "},{"num":7,"verse":"As soon as they were inside the city, Ishmael and his men killed them and threw their bodies in a well."},{"num":8,"verse":"But there were ten men in the group who said to Ishmael, “Please don't kill us! We have wheat, barley, olive oil, and honey hidden in the fields.” So he spared them. "},{"num":9,"verse":"The well into which Ishmael threw the bodies of the men he had killed was the large one that King Asa had dug when he was being attacked by King Baasha of Israel. Ishmael filled the well with the bodies. "},{"num":10,"verse":"Then he made prisoners of the king's daughters and all the rest of the people in Mizpah, whom Nebuzaradan the commanding officer had placed under the care of Gedaliah. Ishmael took them prisoner and started off in the direction of the territory of Ammon."},{"num":11,"verse":"Johanan and all the army leaders with him heard of the crime that Ishmael had committed. "},{"num":12,"verse":"So they went after him with their men and overtook him near the large pool at Gibeon. "},{"num":13,"verse":"When Ishmael's prisoners saw Johanan and the leaders of the forces with him, they were glad, "},{"num":14,"verse":"and turned and ran to them. "},{"num":15,"verse":"But Ishmael and eight of his men got away from Johanan and escaped to the land of Ammon."},{"num":16,"verse":"Then Johanan and the leaders of the forces with him took charge of the people whom Ishmael had taken away as prisoners from Mizpah after murdering Gedaliah—soldiers, women, children, and eunuchs. "},{"num":17,"verse":"They were afraid of the Babylonians because Ishmael had murdered Gedaliah, whom the king of Babylonia had made governor of the land. So they set out for Egypt, in order to get away from the Babylonians. On the way they stopped at Chimham near Bethlehem."}]