[{"header":"Offerings for the Sacred Tent(A)"},{"num":25,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Tell the Israelites to make an offering to me. Receive whatever offerings anyone wishes to give. "},{"num":3,"verse":"These offerings are to be: gold, silver, and bronze; "},{"num":4,"verse":"fine linen; blue, purple, and red wool; cloth made of goats' hair; "},{"num":5,"verse":"rams' skin dyed red; fine leather; acacia wood; "},{"num":6,"verse":"oil for the lamps; spices for the anointing oil and for the sweet-smelling incense; "},{"num":7,"verse":"carnelians and other jewels to be set in the ephod of the High Priest and in his breastpiece. "},{"num":8,"verse":"The people must make a sacred Tent for me, so that I may live among them. "},{"num":9,"verse":"Make it and all its furnishings according to the plan that I will show you."},{"header":"The Covenant Box(B)"},{"num":10,"verse":"“Make a Box out of acacia wood, 45 inches long, 27 inches wide, and 27 inches high. "},{"num":11,"verse":"Cover it with pure gold inside and out and put a gold border all around it. "},{"num":12,"verse":"Make four carrying rings of gold for it and attach them to its four legs, with two rings on each side. "},{"num":13,"verse":"Make carrying poles of acacia wood and cover them with gold "},{"num":14,"verse":"and put them through the rings on each side of the Box. "},{"num":15,"verse":"The poles are to be left in the rings and must not be taken out. "},{"num":16,"verse":"Then put in the Box the two stone tablets that I will give you, on which the commandments are written."},{"num":17,"verse":"“Make a lid of pure gold, 45 inches long and 27 inches wide. "},{"num":18,"verse":"Make two winged creatures of hammered gold, "},{"num":19,"verse":"one for each end of the lid. Make them so that they form one piece with the lid. "},{"num":20,"verse":"The winged creatures are to face each other across the lid, and their outspread wings are to cover it. "},{"num":21,"verse":"Put the two stone tablets inside the Box and put the lid on top of it. "},{"num":22,"verse":"I will meet you there, and from above the lid between the two winged creatures I will give you all my laws for the people of Israel."},{"header":"The Table for the Bread Offered to God(D)"},{"num":23,"verse":"“Make a table out of acacia wood, 36 inches long, 18 inches wide, and 27 inches high. "},{"num":24,"verse":"Cover it with pure gold and put a gold border around it. "},{"num":25,"verse":"Make a rim 3 inches wide around it and a gold border around the rim. "},{"num":26,"verse":"Make four carrying rings of gold for it and put them at the four corners, where the legs are. "},{"num":27,"verse":"The rings to hold the poles for carrying the table are to be placed near the rim. "},{"num":28,"verse":"Make the poles of acacia wood and cover them with gold. "},{"num":29,"verse":"Make plates, cups, jars, and bowls to be used for the wine offerings. All of these are to be made of pure gold. "},{"num":30,"verse":"The table is to be placed in front of the Covenant Box, and on the table there is always to be the sacred bread offered to me."},{"header":"The Lampstand(F)"},{"num":31,"verse":"“Make a lampstand of pure gold. Make its base and its shaft of hammered gold; its decorative flowers, including buds and petals, are to form one piece with it. "},{"num":32,"verse":"Six branches shall extend from its sides, three from each side. "},{"num":33,"verse":"Each of the six branches is to have three decorative flowers shaped like almond blossoms with buds and petals. "},{"num":34,"verse":"The shaft of the lampstand is to have four decorative flowers shaped like almond blossoms with buds and petals. "},{"num":35,"verse":"There is to be one bud below each of the three pairs of branches. "},{"num":36,"verse":"The buds, the branches, and the lampstand are to be a single piece of pure hammered gold. "},{"num":37,"verse":"Make seven lamps for the lampstand and set them up so that they shine toward the front. "},{"num":38,"verse":"Make its tongs and trays of pure gold. "},{"num":39,"verse":"Use seventy-five pounds of pure gold to make the lampstand and all this equipment. "},{"num":40,"verse":"Take care to make them according to the plan that I showed you on the mountain."}]