[{"num":1,"verse":"Jehovah said to Moses, “Tell the people of Israel that everyone who wants to may bring me an offering from this list: gold, silver, bronze, blue cloth, purple cloth, scarlet cloth, fine-twined linen, goats’ hair, red-dyed rams’ skins, goatskins, acacia wood, olive oil for the lamps, spices for the anointing oil and for the fragrant incense, onyx stones, stones to be set in the ephod and in the breastplate."},{"num":8,"verse":"“For I want the people of Israel to make me a sacred Temple where I can live among them."},{"num":9,"verse":"“This home of mine shall be a tent pavilion—a Tabernacle. I will give you a drawing of the construction plan and the details of each furnishing."},{"num":10,"verse":"“Using acacia wood, make an Ark 3¾ feet long, 2¼ feet wide, and 2¼ feet high. "},{"num":11,"verse":"Overlay it inside and outside with pure gold, with a molding of gold all around it. "},{"num":12,"verse":"Cast four rings of gold for it and attach them to the four lower corners, two rings on each side. "},{"num":13,"verse":"Make poles from acacia wood overlaid with gold, and fit the poles into the rings at the sides of the Ark to carry it. "},{"num":15,"verse":"These carrying poles shall never be taken from the rings, but are to be left there permanently. "},{"num":16,"verse":"When the Ark is finished, place inside it the tablets of stone I will give you, with the Ten Commandments engraved on them."},{"num":17,"verse":"“And make a lid of pure gold, 3¾ feet long and 2¼ feet wide. This is the place of mercy for your sins. "},{"num":18,"verse":"Then make two statues of Guardian Angels using beaten gold, and place them at the two ends of the lid of the Ark. "},{"num":19,"verse":"They shall be one piece with the mercy place, one at each end. "},{"num":20,"verse":"The Guardian Angels shall be facing each other, looking down upon the place of mercy, and shall have wings spread out above the gold lid. "},{"num":21,"verse":"Install the lid upon the Ark, and place within the Ark the tablets of stone I shall give you. "},{"num":22,"verse":"And I will meet with you there and talk with you from above the place of mercy between the Guardian Angels; and the Ark will contain the laws of my covenant. There I will tell you my commandments for the people of Israel."},{"num":23,"verse":"“Then make a table of acacia wood 3 feet long, 1½ feet wide, and 2¼ feet high. "},{"num":24,"verse":"Overlay it with pure gold, and run a rib of gold around it. "},{"num":25,"verse":"Put a molding four inches wide around the edge of the top, and a gold ridge along the molding, all around. "},{"num":26,"verse":"Make four gold rings and put the rings at the outside corner of the four legs, close to the top; these are rings for the poles that will be used to carry the table. "},{"num":28,"verse":"Make the poles from acacia wood overlaid with gold. "},{"num":29,"verse":"And make gold dishes, spoons, pitchers, and flagons; "},{"num":30,"verse":"and always keep the special Bread of the Presence on the table before me."},{"num":31,"verse":"“Make a lampstand of pure, beaten gold. The entire lampstand and its decorations shall be one piece—the base, shaft, lamps, and blossoms. "},{"num":32,"verse":"It will have three branches going out from each side of the center shaft, each branch decorated with three almond flowers. "},{"num":34,"verse":"The central shaft itself will be decorated with four almond flowers—one placed between each set of branches; also, there will be one flower above the top set of branches and one below the bottom set. "},{"num":36,"verse":"These decorations and branches and the shaft are all to be one piece of pure, beaten gold. "},{"num":37,"verse":"Then make seven lamps for the lampstand, and set them so that they reflect their light forward. "},{"num":38,"verse":"The snuffers and trays are to be made of pure gold. "},{"num":39,"verse":"You will need about 95 pounds of pure gold for the lampstand and its accessories."},{"num":40,"verse":"“Be sure that everything you make follows the pattern I am showing you here on the mountain."}]