[{"header":"King Jehoshaphat of Judah"},{"num":17,"verse":"Jehoshaphat son of Asa became king and strengthened his defenses against Israel. "},{"num":2,"verse":"He assigned troops to the fortified cities in Judah, as well as to other towns in Judah and to those towns in Ephraim that his father Asa had captured."},{"num":3,"verse":"When Jehoshaphat’s father had first become king of Judah, he was faithful to the Lord and refused to worship the god Baal as the kings of Israel did. Jehoshaphat followed his father’s example and obeyed and worshiped the Lord. And so the Lord blessed Jehoshaphat "},{"num":5,"verse":"and helped him keep firm control of his kingdom. The people of Judah brought gifts to Jehoshaphat, but even after he became very rich and respected, "},{"num":6,"verse":"he remained completely faithful to the Lord. He destroyed all the local shrines in Judah, including the places where the goddess Asherah was worshiped."},{"num":7,"verse":"In the third year of Jehoshaphat’s rule, he chose five officials and gave them orders to teach the Lord’s Law in every city and town in Judah. They were Benhail, Obadiah, Zechariah, Nethanel, and Micaiah. "},{"num":8,"verse":"Their assistants were the following nine Levites: Shemaiah, Nethaniah, Zebadiah, Asahel, Shemiramoth, Jehonathan, Adonijah, Tobijah, and Tob-Adonijah. Two priests, Elishama and Jehoram, also went along. "},{"num":9,"verse":"They carried with them a copy of the Lord’s Law wherever they went and taught the people from it."},{"num":10,"verse":"The nations around Judah were afraid of the Lord’s power, so none of them attacked Jehoshaphat. "},{"num":11,"verse":"Philistines brought him silver and other gifts to keep peace. Some of the Arab people brought him seventy-seven hundred rams and the same number of goats."},{"num":12,"verse":"As Jehoshaphat became more powerful, he built fortresses and cities "},{"num":13,"verse":"where he stored supplies. He also kept in Jerusalem some experienced soldiers "},{"num":14,"verse":"from the Judah and Benjamin tribes. These soldiers were grouped according to their clans."},{"num":15,"verse":"Jehohanan was second in command, with two hundred eighty thousand soldiers under him. "},{"num":16,"verse":"Amasiah son of Zichri, who had volunteered to serve the Lord, was third in command, with two hundred thousand soldiers under him."},{"num":17,"verse":"Eliada was a brave warrior who commanded the troops from Benjamin. He had two hundred thousand soldiers under his command, all of them armed with bows and shields. "},{"num":18,"verse":"Jehozabad was second in command, with one hundred eighty thousand soldiers under him. "},{"num":19,"verse":"These were the troops who protected the king in Jerusalem, not counting those he had assigned to the fortified cities throughout the country."}]