[{"num":17,"verse":"Then Y’hoshafat his son became king in his place. He strengthened his position against Isra’el "},{"num":2,"verse":"by placing forces in all the fortified cities of Y’hudah, and by garrisoning troops in the territory of Y’hudah and in the cities of Efrayim that Asa his father had captured. "},{"num":3,"verse":"Adonai was with Y’hoshafat, because he lived according to the first ways of his ancestor David, not seeking the ba‘alim, "},{"num":4,"verse":"but seeking the God of his father and living by his mitzvot, not by what Isra’el did. "},{"num":5,"verse":"Therefore Adonai consolidated his rulership; all Y’hudah brought presents to Y’hoshafat, so that he had wealth and honor in abundance. "},{"num":6,"verse":"In his heart he highly regarded Adonai’s ways; moreover, he removed the high places and sacred poles from Y’hudah."},{"num":7,"verse":"In the third year of his reign he sent his leading men Ben-Chayil, ‘Ovadyah, Z’kharyah, N’tan’el and Mikhayahu to teach in the cities of Y’hudah; "},{"num":8,"verse":"with them were the L’vi’im Sh’ma‘yahu, N’tanyahu, Z’vadyahu, ‘Asah’el, Sh’miramot, Y’honatan, Adoniyahu, Tuviyahu and Tov-Adoniyah, the L’vi’im; and with them Elishama and Y’horam the cohanim. "},{"num":9,"verse":"They taught in Y’hudah, having a scroll of the Torah of Adonai with them; they circulated through all the cities of Y’hudah, teaching among the people."},{"num":10,"verse":"A panic from Adonai seized all the kingdoms in the lands surrounding Y’hudah, so that they did not make war against Y’hoshafat. "},{"num":11,"verse":"Some of the P’lishtim brought Y’hoshafat gifts and silver as tribute; the Arabs too brought him flocks — 7,700 rams and 7,700 male goats."},{"num":12,"verse":"So Y’hoshafat grew increasingly powerful. In Y’hudah he built fortresses and storage cities. "},{"num":13,"verse":"He had many projects in the cities of Y’hudah; and in Yerushalayim he had warriors, strong brave men. "},{"num":14,"verse":"Here is a listing of them by clans: from Y’hudah, the captains of thousands: ‘Adnah the leader, and with him 300,000 strong, brave men; "},{"num":15,"verse":"next to him Y’hochanan the leader, and with him 280,000; "},{"num":16,"verse":"next to him ‘Amasyah the son of Zikhri, who volunteered to serve Adonai, and with him 200,000 strong, brave men. "},{"num":17,"verse":"From Binyamin: Elyada, a strong, brave man, and with him 200,000 equipped with bows and shields; "},{"num":18,"verse":"next to him Y’hozavad, and with him 180,000 prepared for war. "},{"num":19,"verse":"These served the king, in addition to those the king assigned to the fortified cities throughout all Y’hudah."}]