[{"header":"Jehoshaphat of Judah"},{"num":1,"verse":"Asa’s son Jehoshaphat was the next king; he started out by working on his defense system against Israel. He put troops in all the fortress cities of Judah and deployed garrisons throughout Judah and in the towns of Ephraim that his father Asa had captured. God was on Jehoshaphat’s side because he stuck to the ways of his father Asa’s early years. He didn’t fool around with the popular Baal religion—he was a seeker and follower of the God of his father and was obedient to him; he wasn’t like Israel. And God secured the kingdom under his rule, gave him a firm grip on it. And everyone in Judah showed their appreciation by bringing gifts. Jehoshaphat ended up very rich and much honored. He was single-minded in following God; and he got rid of the local sex-and-religion shrines."},{"num":7,"verse":"In the third year of his reign he sent his officials—excellent men, every one of them—Ben-Hail, Obadiah, Zechariah, Nethanel, and Micaiah on a teaching mission to the cities of Judah. They were accompanied by Levites—Shemaiah, Nethaniah, Zebadiah, Asahel, Shemiramoth, Jehonathan, Adonijah, Tobijah, and Tob-Adonijah; the priests Elishama and Jehoram were also in the company. They made a circuit of the towns of Judah, teaching the people and using the Book of The Revelation of God as their text."},{"num":10,"verse":"There was a strong sense of the fear of God in all the kingdoms around Judah—they didn’t dare go to war against Jehoshaphat. Some Philistines even brought gifts and a load of silver to Jehoshaphat, and the desert bedouin brought flocks—7,700 rams and 7,700 goats. So Jehoshaphat became stronger by the day, and constructed more and more forts and store-cities—an age of prosperity for Judah!"},{"num":13,"verse":"He also had excellent fighting men stationed in Jerusalem. The captains of the military units of Judah, classified according to families, were: Captain Adnah with 300,000 soldiers; his associate Captain Jehohanan with 280,000; his associate Amasiah son of Zicri, a volunteer for God, with 200,000. Officer Eliada represented Benjamin with 200,000 fully equipped with bow and shield; and his associate was Jehozabad with 180,000 armed and ready for battle. These were under the direct command of the king; in addition there were the troops assigned to the fortress cities spread all over Judah."}]