[{"header":"The Descendants of Adam(A)"},{"num":5,"verse":"This is the list of the descendants of Adam. (When God created human beings, he made them like himself. "},{"num":2,"verse":"He created them male and female, blessed them, and named them “Human Beings.”) "},{"num":3,"verse":"When Adam was 130 years old, he had a son who was like him, and he named him Seth. "},{"num":4,"verse":"After that, Adam lived another 800 years. He had other children "},{"num":5,"verse":"and died at the age of 930."},{"num":6,"verse":"When Seth was 105, he had a son, Enosh, "},{"num":7,"verse":"and then lived another 807 years. He had other children "},{"num":8,"verse":"and died at the age of 912."},{"num":9,"verse":"When Enosh was 90, he had a son, Kenan, "},{"num":10,"verse":"and then lived another 815 years. He had other children "},{"num":11,"verse":"and died at the age of 905."},{"num":12,"verse":"When Kenan was 70, he had a son, Mahalalel, "},{"num":13,"verse":"and then lived another 840 years. He had other children "},{"num":14,"verse":"and died at the age of 910."},{"num":15,"verse":"When Mahalalel was 65, he had a son, Jared, "},{"num":16,"verse":"and then lived another 830 years. He had other children "},{"num":17,"verse":"and died at the age of 895."},{"num":18,"verse":"When Jared was 162, he had a son, Enoch, "},{"num":19,"verse":"and then lived another 800 years. He had other children "},{"num":20,"verse":"and died at the age of 962."},{"num":21,"verse":"When Enoch was 65, he had a son, Methuselah. "},{"num":22,"verse":"After that, Enoch lived in fellowship with God for 300 years and had other children. "},{"num":23,"verse":"He lived to be 365 years old. "},{"num":24,"verse":"He spent his life in fellowship with God, and then he disappeared, because God took him away."},{"num":25,"verse":"When Methuselah was 187, he had a son, Lamech, "},{"num":26,"verse":"and then lived another 782 years. He had other children "},{"num":27,"verse":"and died at the age of 969."},{"num":28,"verse":"When Lamech was 182, he had a son "},{"num":29,"verse":"and said, “From the very ground on which the Lord put a curse, this child will bring us relief from all our hard work”; so he named him Noah. "},{"num":30,"verse":"Lamech lived another 595 years. He had other children "},{"num":31,"verse":"and died at the age of 777."},{"num":32,"verse":"After Noah was 500 years old, he had three sons, Shem, Ham, and Japheth."}]