[{"header":"The Families from Adam to Noah"},{"num":5,"verse":"This is the book of the children of Adam and of their children’s children. When God made man, He made him in the likeness of God. "},{"num":2,"verse":"He made them male and female, and brought good to them. And He gave them the name Man when they were made. "},{"num":3,"verse":"When Adam had lived 130 years, he gave birth to a son in his own likeness. And he gave him the name Seth. "},{"num":4,"verse":"Adam lived 800 years after he became the father of Seth. He had other sons and daughters. "},{"num":5,"verse":"So Adam lived 930 years, and he died."},{"num":6,"verse":"When Seth had lived 105 years, he became the father of Enosh. "},{"num":7,"verse":"Seth lived 807 years after the birth of Enosh. He had other sons and daughters. "},{"num":8,"verse":"So Seth lived 912 years, and he died."},{"num":9,"verse":"When Enosh had lived ninety years, he became the father of Kenan. "},{"num":10,"verse":"Enosh lived 815 years after the birth of Kenan. He had other sons and daughters. "},{"num":11,"verse":"So Enosh lived 905 years, and he died."},{"num":12,"verse":"When Kenan had lived seventy years, he became the father of Mahalalel. "},{"num":13,"verse":"Kenan lived 840 years after the birth of Mahalalel. He had other sons and daughters. "},{"num":14,"verse":"So Kenan lived 910 years, and he died."},{"num":15,"verse":"When Mahalalel had lived sixty-five years, he became the father of Jared. "},{"num":16,"verse":"Mahalalel lived 830 years after the birth of Jared. He had other sons and daughters. "},{"num":17,"verse":"So Mahalalel lived 895 years, and he died."},{"num":18,"verse":"When Jared had lived 162 years, he became the father of Enoch. "},{"num":19,"verse":"Jared lived 800 years after the birth of Enoch. He had other sons and daughters. "},{"num":20,"verse":"So Jared lived 962 years, and he died."},{"num":21,"verse":"When Enoch had lived sixty-five years, he became the father of Methuselah. "},{"num":22,"verse":"Enoch walked with God 300 years after the birth of Methuselah. He had other sons and daughters. "},{"num":23,"verse":"So Enoch lived 365 years. "},{"num":24,"verse":"Enoch walked with God, and he was seen no more, for God took him."},{"num":25,"verse":"When Methuselah had lived 187 years, he became the father of Lamech. "},{"num":26,"verse":"Methuselah lived 782 years after the birth of Lamech. He had other sons and daughters. "},{"num":27,"verse":"So Methuselah lived 969 years, and he died."},{"num":28,"verse":"When Lamech had lived 182 years, he became the father of a son. "},{"num":29,"verse":"He gave him the name Noah. He said, “This one will give us rest from our work, from the hard work of our hands because the ground was cursed by the Lord.” "},{"num":30,"verse":"Lamech lived 595 years after the birth of Noah. He had other sons and daughters. "},{"num":31,"verse":"So Lamech lived 777 years, and he died."},{"num":32,"verse":"When Noah had lived 500 years, he became the father of Shem, Ham, and Japheth."}]