[{"num":5,"verse":"Here is a list of some of the descendants of Adam—the man who was like God* from the day of his creation. "},{"num":2,"verse":"God created man and woman and blessed them, and called them Man from the start."},{"num":3,"verse":"Adam: Adam was 130 years old when his son Seth was born, the very image of his father in every way.* After Seth was born,* Adam lived another 800 years, producing sons and daughters, and died at the age of 930."},{"num":6,"verse":"Seth: Seth was 105 years old when his son Enosh was born. Afterwards he lived another 807 years, producing sons and daughters, and died at the age of 912."},{"num":9,"verse":"Enosh: Enosh was ninety years old when his son Kenan was born. Afterwards he lived another 815 years, producing sons and daughters, and died at the age of 905."},{"num":12,"verse":"Kenan: Kenan was seventy years old when his son Mahalalel was born. Afterwards he lived another 840 years, producing sons and daughters, and died at the age of 910."},{"num":15,"verse":"Mahalalel: Mahalalel was sixty-five years old when his son Jared was born. Afterwards he lived 830 years, producing sons and daughters, and died at the age of 895."},{"num":18,"verse":"Jared: Jared was 162 years old when his son Enoch was born. Afterwards he lived another 800 years, producing sons and daughters, and died at the age of 962."},{"num":21,"verse":"Enoch: Enoch was sixty-five years old when his son Methuselah was born. Afterwards he lived another 300 years in fellowship with God, and produced sons and daughters; then, when he was 365, and in constant touch with God, he disappeared, for God took him!"},{"num":25,"verse":"Methuselah: Methuselah was 187 years old when his son Lamech was born; afterwards he lived another 782 years, producing sons and daughters, and died at the age of 969."},{"num":28,"verse":"Lamech: Lamech was 182 years old when his son Noah was born. Lamech named him Noah (meaning “Relief”) because he said, “He will bring us relief from the hard work of farming this ground which God has cursed.” Afterwards Lamech lived 595 years, producing sons and daughters, and died at the age of 777."},{"num":32,"verse":"Noah: Noah was 500 years old and had three sons, Shem, Ham, and Japheth."}]