[{"header":"Miriam Dies"},{"num":20,"verse":"The Israelites arrived at the desert of Zin in the first month of the year. The people stayed at Kadesh. Miriam died and was buried there."},{"header":"Moses Makes a Mistake"},{"num":2,"verse":"There was not enough water for the people at that place. So the people met together to complain against Moses and Aaron."},{"num":3,"verse":"The people argued with Moses and said, “Maybe we should have died in front of the Lord like our brothers did."},{"num":4,"verse":"Why did you bring the Lord’s people into this desert? Do you want us and our animals to die here?"},{"num":5,"verse":"Why did you bring us from Egypt? Why did you bring us to this bad place? There is no grain. There are no figs, grapes, or pomegranates, and there is no water to drink.”"},{"num":6,"verse":"So Moses and Aaron left the crowd of people and went to the entrance of the Meeting Tent. They bowed down to the ground, and the Glory of the Lord appeared to them."},{"num":7,"verse":"The Lord spoke to Moses and said,"},{"num":8,"verse":"“Get the special walking stick. Take your brother Aaron and the crowd of people and go to that rock. Speak to the rock in front of the people. Then water will flow from the rock, and you can give that water to the people and to their animals.”"},{"num":9,"verse":"The walking stick was in the Holy Tent, in front of the Lord. Moses took the walking stick as the Lord said."},{"num":10,"verse":"Moses and Aaron told the people to meet together in front of the rock. Then Moses said, “You people are always complaining. Now listen to me. I will cause water to flow from this rock.”"},{"num":11,"verse":"Moses lifted his arm and hit the rock twice. Water began flowing from the rock, and the people and their animals drank that water."},{"num":12,"verse":"But the Lord said to Moses and Aaron, “You did not trust me enough to honor me and show the people that I am holy. You did not show the Israelites that the power to make the water came from me. So you will not lead the people into the land that I have given them.”"},{"num":13,"verse":"This place was called the waters of Meribah. This is where the Israelites argued with the Lord and where he showed them that he was holy."},{"header":"Edom Will Not Let Israel Pass"},{"num":14,"verse":"While Moses was at Kadesh, he sent some men with a message to the king of Edom. The message said,"},{"num":15,"verse":"Many years ago our ancestors went down into Egypt, and we lived there for many years. The people of Egypt were cruel to us."},{"num":16,"verse":"But we asked the Lord for help, and he heard us and sent an angel to help us. The Lord has brought us out of Egypt."},{"num":17,"verse":"Please let us travel through your country. We will not travel through any fields or vineyards. We will not drink water from any of your wells. We will travel only along King’s Road. We will not leave that road to the right or to the left. We will stay on the road until we have traveled through your country.”"},{"num":18,"verse":"But the king of Edom answered, “You may not travel through our land. If you try to travel through our land, we will come and fight you with swords.”"},{"num":19,"verse":"The Israelites answered, “We will travel along the main road. If our animals drink any of your water, we will pay you for it. We only want to walk through your country. We don’t want to take it for ourselves.”"},{"num":20,"verse":"But again the king of Edom answered, “We will not allow you to come through our country.”"},{"num":21,"verse":"The king of Edom refused to let the Israelites travel through his country, so the Israelites turned around and went another way."},{"header":"Aaron Dies"},{"num":22,"verse":"All the Israelites traveled from Kadesh to Mount Hor."},{"num":23,"verse":"Mount Hor was near the border of Edom. The Lord said to Moses and Aaron,"},{"num":24,"verse":"“It is time for Aaron to die and go to be with his ancestors. Aaron will not enter the land that I promised to the Israelites. Moses, I say this to you because both you and Aaron did not fully obey the command I gave you at the waters of Meribah."},{"num":25,"verse":"“Now, bring Aaron and his son Eleazar up to Mount Hor."},{"num":26,"verse":"Take Aaron’s special clothes from him and put these clothes on his son Eleazar. Aaron will die there on the mountain. And he will go to be with his ancestors.”"},{"num":27,"verse":"Moses obeyed the Lord’s command. Moses, Aaron, and Eleazar went up on Mount Hor. All the Israelites watched them go."},{"num":28,"verse":"Moses removed Aaron’s special clothes and put them on Aaron’s son Eleazar. Then Aaron died there on top of the mountain. Moses and Eleazar came back down the mountain."},{"num":29,"verse":"All the Israelites learned that Aaron was dead. So everyone in Israel mourned for 30 days."}]