[{"header":"Chapter 36"},{"num":1,"verse":"“Bezalel, therefore, will set to work with Oholiab and with all the artisans whom the Lord has endowed with skill and understanding in knowing how to do all the work for the service of the sanctuary, just as the Lord has commanded.”"},{"num":2,"verse":"Moses then called Bezalel and Oholiab and all the other artisans whom the Lord had endowed with skill, men whose hearts moved them to come and do the work. "},{"num":3,"verse":"They received from Moses all the contributions which the Israelites had brought for the work to be done for the sanctuary service. Still, morning after morning the people continued to bring their voluntary offerings to Moses. "},{"num":4,"verse":"Thereupon all the artisans who were doing the work for the sanctuary came from the work each was doing, "},{"num":5,"verse":"and told Moses, “The people are bringing much more than is needed to carry out the work which the Lord has commanded us to do.” "},{"num":6,"verse":"Moses, therefore, ordered a proclamation to be made throughout the camp: “Let neither man nor woman make any more contributions for the sanctuary.” So the people stopped bringing their offerings; "},{"num":7,"verse":"there was already enough at hand, and more than enough, to complete the work to be done."},{"num":8,"verse":"The Tent Cloth and Coverings. The various artisans who were doing the work made the tabernacle with its ten sheets woven of fine linen twined, having cherubim embroidered on them with violet, purple, and scarlet yarn. "},{"num":9,"verse":"The length of each sheet was twenty-eight cubits, and the width four cubits; all the sheets were the same size. "},{"num":10,"verse":"Five of the sheets were joined together, edge to edge; and the other five sheets likewise, edge to edge. "},{"num":11,"verse":"Loops of violet yarn were made along the edge of the end sheet in the first set, and the same along the edge of the end sheet in the second set. "},{"num":12,"verse":"Fifty loops were thus put on one inner sheet, and fifty loops on the inner sheet in the other set, with the loops directly opposite each other. "},{"num":13,"verse":"Then fifty clasps of gold were made, with which the sheets were joined so that the tabernacle formed one whole."},{"num":14,"verse":"Sheets of goat hair were also woven as a tent over the tabernacle. Eleven such sheets were made. "},{"num":15,"verse":"The length of each sheet was thirty cubits and the width four cubits; all eleven sheets were the same size. "},{"num":16,"verse":"Five of these sheets were joined into one set, and the other six sheets into another set. "},{"num":17,"verse":"Fifty loops were made along the edge of the end sheet in one set, and fifty loops along the edge of the corresponding sheet in the other set. "},{"num":18,"verse":"Fifty bronze clasps were made with which the tent was joined so that it formed one whole. "},{"num":19,"verse":"A covering for the tent was made of rams’ skins dyed red and, above that, a covering of tahash skins."},{"num":20,"verse":"The Framework. Frames were made for the tabernacle, acacia-wood uprights. "},{"num":21,"verse":"The length of each frame was ten cubits, and the width one and a half cubits. "},{"num":22,"verse":"Each frame had two arms, fastening them one to another. In this way all the frames of the tabernacle were made. "},{"num":23,"verse":"The frames for the tabernacle were made as follows: twenty frames on the south side, "},{"num":24,"verse":"with forty silver pedestals under the twenty frames, two pedestals under each frame for its two arms; "},{"num":25,"verse":"twenty frames on the other side of the tabernacle, the north side, "},{"num":26,"verse":"with their forty silver pedestals, two pedestals under each frame. "},{"num":27,"verse":"At the rear of the tabernacle, to the west, six frames were made, "},{"num":28,"verse":"and two frames were made for the corners of the tabernacle, at its rear. "},{"num":29,"verse":"These were double at the bottom, and likewise double at the top, to the first ring. That is how both corner frames were made. "},{"num":30,"verse":"Thus, there were eight frames, with their sixteen silver pedestals, two pedestals under each frame. "},{"num":31,"verse":"Bars of acacia wood were also made, five for the frames on one side of the tabernacle, "},{"num":32,"verse":"five for those on the other side, and five for those at the rear, to the west. "},{"num":33,"verse":"The center bar, at the middle of the frames, was made to reach across from end to end. "},{"num":34,"verse":"The frames were plated with gold, and gold rings were made on them as holders for the bars, which were also plated with gold."},{"num":35,"verse":"The Veil. The veil was made of violet, purple, and scarlet yarn, and of fine linen twined, with cherubim embroidered on it. "},{"num":36,"verse":"Four gold-plated columns of acacia wood, with gold hooks, were made for it, and four silver pedestals were cast for them."},{"num":37,"verse":"The curtain for the entrance of the tent was made of violet, purple, and scarlet yarn, and of fine linen twined, woven in a variegated manner. "},{"num":38,"verse":"Its five columns, with their hooks as well as their capitals and bands, were plated with gold; their five pedestals were of bronze."}]