[{"num":2,"verse":"As for me, brothers, when I came to you, I did not come with superior speech or wisdom in order to proclaim to you the testimony of God. "},{"num":2,"verse":"For I had no intention of knowing anything among you except Jesus Christ, and him crucified. "},{"num":3,"verse":"I came to you in weakness, in fear, and with much trembling. "},{"num":4,"verse":"My message and my preaching were not marked by persuasive words of human wisdom, but by a demonstration of the Spirit and of power, "},{"num":5,"verse":"so that your faith would not rest on human wisdom, but on God’s power."},{"header":"In-Depth Wisdom Is for Spiritual People"},{"num":6,"verse":"Yet we do speak wisdom among those who are mature, but it is not a wisdom of this world or of the rulers of this world, who are being reduced to nothing. "},{"num":7,"verse":"Instead we speak God’s wisdom that has been hidden in mystery—before the ages, God foreordained that this wisdom would result in our glory. "},{"num":8,"verse":"None of the rulers of this world knew it. (If they had known it, they would not have crucified the Lord of glory.) "},{"num":9,"verse":"But as it is written:"},{"num":10,"verse":"But God revealed it to us through his Spirit. For the Spirit searches all things, even the depths of God. "},{"num":11,"verse":"Indeed, who among men knows a man’s thoughts except the man’s spirit within him? So also, no one else knows God’s thoughts except God’s Spirit."},{"num":12,"verse":"What we received is not the spirit of the world, but the Spirit who is from God, so that we might know the blessings freely given to us by God. "},{"num":13,"verse":"We also speak about these things, not in words taught by human wisdom, but in words taught by the Spirit, combining spiritual truths with spiritual words. "},{"num":14,"verse":"However, an unspiritual person does not accept the truths taught by God’s Spirit, because they are foolishness to him, and he cannot understand them, because they are spiritually evaluated. "},{"num":15,"verse":"But the spiritual person evaluates all things, and he himself is evaluated by no one. "},{"num":16,"verse":"Indeed, “Who has known the mind of the Lord? Who will instruct him?” But we have the mind of Christ."}]