[{"num":2,"verse":"When I came to you, brothers, I didn’t come with excellence of speech or of wisdom, proclaiming to you the testimony of God. "},{"num":2,"verse":"For I determined not to know anything among you except Jesus Christ and him crucified. "},{"num":3,"verse":"I was with you in weakness, in fear, and in much trembling. "},{"num":4,"verse":"My speech and my preaching were not in persuasive words of human wisdom, but in demonstration of the Spirit and of power, "},{"num":5,"verse":"that your faith wouldn’t stand in the wisdom of men, but in the power of God."},{"num":6,"verse":"We speak wisdom, however, among those who are full grown, yet a wisdom not of this world nor of the rulers of this world who are coming to nothing. "},{"num":7,"verse":"But we speak God’s wisdom in a mystery, the wisdom that has been hidden, which God foreordained before the worlds for our glory, "},{"num":8,"verse":"which none of the rulers of this world has known. For had they known it, they wouldn’t have crucified the Lord of glory. "},{"num":9,"verse":"But as it is written,"},{"num":10,"verse":"But to us, God revealed them through the Spirit. For the Spirit searches all things, yes, the deep things of God. "},{"num":11,"verse":"For who among men knows the things of a man, except the spirit of the man, which is in him? Even so, no one knows the things of God, except God’s Spirit. "},{"num":12,"verse":"But we received not the spirit of the world, but the Spirit which is from God, that we might know the things that were freely given to us by God. "},{"num":13,"verse":"We also speak these things, not in words which man’s wisdom teaches, but which the Holy Spirit teaches, comparing spiritual things with spiritual things. "},{"num":14,"verse":"Now the natural man doesn’t receive the things of God’s Spirit, for they are foolishness to him, and he can’t know them, because they are spiritually discerned. "},{"num":15,"verse":"But he who is spiritual discerns all things, and he himself is judged by no one. "},{"num":16,"verse":"“For who has known the mind of the Lord, that he should instruct him?” Isaiah 40:13 But we have Christ’s mind."}]