[[],[{"type":"prose","content":"And I, having come unto you, brethren, came -- not in superiority of discourse or wisdom -- declaring to you the testimony of God,"}],[{"type":"prose","content":"for I decided not to know any thing among you, except Jesus Christ, and him crucified;"}],[{"type":"prose","content":"and I, in weakness, and in fear, and in much trembling, was with you;"}],[{"type":"prose","content":"and my word and my preaching was not in persuasive words of human wisdom, but in demonstration of the Spirit and of power --"}],[{"type":"prose","content":"that your faith may not be in the wisdom of men, but in the power of God."}],[{"type":"prose","content":"And wisdom we speak among the perfect, and wisdom not of this age, nor of the rulers of this age -- of those becoming useless,"}],[{"type":"prose","content":"but we speak the hidden wisdom of God in a secret, that God foreordained before the ages to our glory,"}],[{"type":"prose","content":"which no one of the rulers of this age did know, for if they had known, the Lord of the glory they would not have crucified;"}],[{"type":"prose","content":"but, according as it hath been written, `What eye did not see, and ear did not hear, and upon the heart of man came not up, what God did prepare for those loving Him --'"}],[{"type":"prose","content":"but to us did God reveal [them] through His Spirit, for the Spirit all things doth search, even the depths of God,"}],[{"type":"prose","content":"for who of men hath known the things of the man, except the spirit of the man that [is] in him? so also the things of God no one hath known, except the Spirit of God."}],[{"type":"prose","content":"And we the spirit of the world did not receive, but the Spirit that [is] of God, that we may know the things conferred by God on us,"}],[{"type":"prose","content":"which things also we speak, not in words taught by human wisdom, but in those taught by the Holy Spirit, with spiritual things spiritual things comparing,"}],[{"type":"prose","content":"and the natural man doth not receive the things of the Spirit of God, for to him they are foolishness, and he is not able to know [them], because spiritually they are discerned;"}],[{"type":"prose","content":"and he who is spiritual, doth discern indeed all things, and he himself is by no one discerned;"}],[{"type":"prose","content":"for who did know the mind of the Lord that he shall instruct Him? and we -- we have the mind of Christ."}]]