[{"header":"The First Sin"},{"num":3,"verse":"The snake was sneakier than any of the other wild animals that the Lord God had made. One day it came to the woman and asked, “Did God tell you not to eat fruit from any tree in the garden?”"},{"num":2,"verse":"The woman answered, “God said we could eat fruit from any tree in the garden, "},{"num":3,"verse":"except the one in the middle. He told us not to eat fruit from that tree or even to touch it. If we do, we will die.”"},{"num":4,"verse":"“No, you won’t!” the snake replied. "},{"num":5,"verse":"“God understands what will happen on the day you eat fruit from that tree. You will see what you have done, and you will know the difference between right and wrong, just as God does.”"},{"num":6,"verse":"The woman stared at the fruit. It looked beautiful and tasty. She wanted the wisdom that it would give her, and she ate some of the fruit. Her husband was there with her, so she gave some to him, and he ate it too. "},{"num":7,"verse":"Right away they saw what they had done, and they realized they were naked. Then they sewed fig leaves together to make something to cover themselves."},{"num":8,"verse":"Late in the afternoon a breeze began to blow, and the man and woman heard the Lord God walking in the garden. They were frightened and hid behind some trees."},{"header":"The Trouble with Sin"},{"num":9,"verse":"The Lord called out to the man and asked, “Where are you?”"},{"num":10,"verse":"The man answered, “I was naked, and when I heard you walking through the garden, I was frightened and hid!”"},{"num":11,"verse":"“How did you know you were naked?” God asked. “Did you eat any fruit from that tree in the middle of the garden?”"},{"num":12,"verse":"“It was the woman you put here with me,” the man said. “She gave me some of the fruit, and I ate it.”"},{"num":13,"verse":"The Lord God then asked the woman, “What have you done?”"},{"num":14,"verse":"So the Lord God said to the snake:"},{"num":16,"verse":"Then the Lord said to the woman,"},{"num":17,"verse":"The Lord said to the man,"},{"num":20,"verse":"The man Adam named his wife Eve because she would become the mother of all who live."},{"num":21,"verse":"Then the Lord God made clothes out of animal skins for the man and his wife."},{"num":22,"verse":"The Lord said, “These people now know the difference between right and wrong, just as we do. But they must not be allowed to eat fruit from the tree that lets them live forever.” "},{"num":23,"verse":"So the Lord God sent them out of the Garden of Eden, where they would have to work the ground from which the man had been made. "},{"num":24,"verse":"Then God put winged creatures at the entrance to the garden and a flaming, flashing sword to guard the way to the life-giving tree."}]