[{"header":"Special Promises"},{"num":30,"verse":"Moses spoke with the leaders of the Israelite tribes. He told them these commands from the Lord."},{"num":2,"verse":"“A person might make a promise to the Lord. He might promise to do something special. If he does, he must keep his promise. He must do what he said. "},{"num":3,"verse":"A young woman still living at home might make a promise to the Lord. She might pledge to do something special. "},{"num":4,"verse":"Her father might hear about the promise or pledge and say nothing. Then she must do what she promised. She must keep her pledge. "},{"num":5,"verse":"But when her father hears about the promise or pledge, he might not allow it. Then the promise or pledge does not have to be kept. Her father would not allow them. So the Lord will free her from her promise."},{"num":6,"verse":"“A woman might make a pledge or a careless promise and then get married. "},{"num":7,"verse":"Her husband might hear about it and say nothing. Then she must keep her promise or the pledge she made. "},{"num":8,"verse":"But when her husband hears about it, he might not allow it. He cancels her pledge or the careless promise she made. The Lord will free her from keeping it."},{"num":9,"verse":"“A widow or divorced woman might make a promise. She must do whatever she promised."},{"num":10,"verse":"“A woman might make a promise or pledge while she was married. "},{"num":11,"verse":"When her husband hears about it, he might say nothing. He might not stop her. Then she must keep her promise or pledge. "},{"num":12,"verse":"But when her husband hears about it, he might cancel it. Then she does not have to do what she said. Her husband has canceled it. The Lord will free her from it. "},{"num":13,"verse":"A woman’s husband may make her keep or cancel any promise or pledge she has made. "},{"num":14,"verse":"But her husband might say nothing to her about it for several days. Then she must keep her promises. If he hears about them and says nothing, she must keep her promises. "},{"num":15,"verse":"But he might cancel them long after he heard about them. Then he is responsible if she breaks her promise.”"},{"num":16,"verse":"These are commands that the Lord gave to Moses. They are for husbands and wives. And they are for fathers with daughters living at home."}]