[[],[{"type":"header","content":"Laws concerning Vows"},{"type":"prose","content":"Then Moses summoned the leaders of the tribes of Israel and told them, “This is what the  has commanded:"}],[{"type":"prose","content":"A man who makes a vow to the  or makes a pledge under oath must never break it. He must do exactly what he said he would do."}],[{"type":"prose","content":"“If a young woman makes a vow to the  or a pledge under oath while she is still living at her father’s home,"}],[{"type":"prose","content":"and her father hears of the vow or pledge and does not object to it, then all her vows and pledges will stand."}],[{"type":"prose","content":"But if her father refuses to let her fulfill the vow or pledge on the day he hears of it, then all her vows and pledges will become invalid. The  will forgive her because her father would not let her fulfill them."}],[{"type":"prose","content":"“Now suppose a young woman makes a vow or binds herself with an impulsive pledge and later marries."}],[{"type":"prose","content":"If her husband learns of her vow or pledge and does not object on the day he hears of it, her vows and pledges will stand."}],[{"type":"prose","content":"But if her husband refuses to accept her vow or impulsive pledge on the day he hears of it, he nullifies her commitments, and the  will forgive her."}],[{"type":"prose","content":"If, however, a woman is a widow or is divorced, she must fulfill all her vows and pledges."}],[{"type":"prose","content":"“But suppose a woman is married and living in her husband’s home when she makes a vow or binds herself with a pledge."}],[{"type":"prose","content":"If her husband hears of it and does not object to it, her vow or pledge will stand."}],[{"type":"prose","content":"But if her husband refuses to accept it on the day he hears of it, her vow or pledge will be nullified, and the  will forgive her."}],[{"type":"prose","content":"So her husband may either confirm or nullify any vows or pledges she makes to deny herself."}],[{"type":"prose","content":"But if he does not object on the day he hears of it, then he is agreeing to all her vows and pledges."}],[{"type":"prose","content":"If he waits more than a day and then tries to nullify a vow or pledge, he will be punished for her guilt.”"}],[{"type":"prose","content":"These are the regulations the  gave Moses concerning relationships between a man and his wife, and between a father and a young daughter who still lives at home."}]]