[[],[{"type":"header","content":"Vows Made by Women"},{"type":"prose","content":"Then Moses said to the heads of the tribes of the Israelites: This is what the LORD has commanded. "}],[{"type":"prose","content":"When a man makes a vow to the LORD, or swears an oath to bind himself by a pledge, he shall not break his word; he shall do according to all that proceeds out of his mouth."}],[{"type":"prose","content":"When a woman makes a vow to the LORD, or binds herself by a pledge, while within her father’s house, in her youth, "}],[{"type":"prose","content":"and her father hears of her vow or her pledge by which she has bound herself, and says nothing to her; then all her vows shall stand, and any pledge by which she has bound herself shall stand. "}],[{"type":"prose","content":"But if her father expresses disapproval to her at the time that he hears of it, no vow of hers, and no pledge by which she has bound herself, shall stand; and the LORD will forgive her, because her father had expressed to her his disapproval."}],[{"type":"prose","content":"If she marries, while obligated by her vows or any thoughtless utterance of her lips by which she has bound herself, "}],[{"type":"prose","content":"and her husband hears of it and says nothing to her at the time that he hears, then her vows shall stand, and her pledges by which she has bound herself shall stand. "}],[{"type":"prose","content":"But if, at the time that her husband hears of it, he expresses disapproval to her, then he shall nullify the vow by which she was obligated, or the thoughtless utterance of her lips, by which she bound herself; and the LORD will forgive her. "}],[{"type":"prose","content":"(But every vow of a widow or of a divorced woman, by which she has bound herself, shall be binding upon her.) "}],[{"type":"prose","content":"And if she made a vow in her husband’s house, or bound herself by a pledge with an oath, "}],[{"type":"prose","content":"and her husband heard it and said nothing to her, and did not express disapproval to her, then all her vows shall stand, and any pledge by which she bound herself shall stand. "}],[{"type":"prose","content":"But if her husband nullifies them at the time that he hears them, then whatever proceeds out of her lips concerning her vows, or concerning her pledge of herself, shall not stand. Her husband has nullified them, and the LORD will forgive her. "}],[{"type":"prose","content":"Any vow or any binding oath to deny herself, her husband may allow to stand, or her husband may nullify. "}],[{"type":"prose","content":"But if her husband says nothing to her from day to day, then he validates all her vows, or all her pledges, by which she is obligated; he has validated them, because he said nothing to her at the time that he heard of them. "}],[{"type":"prose","content":"But if he nullifies them some time after he has heard of them, then he shall bear her guilt."}],[{"type":"prose","content":"These are the statutes that the LORD commanded Moses concerning a husband and his wife, and a father and his daughter while she is still young and in her father’s house."}]]