[[],[{"type":"header","content":"The Seventy-two Sent Out"},{"type":"prose","content":"Now after this the Lord appointed seventy-two others, and sent them in pairs ahead of Him to every city and place where He Himself was going to come."}],[{"type":"prose","content":"And He was saying to them, "}],[{"type":"header","content":"The Joyful Results"},{"type":"prose","content":"Now the seventy-two returned with joy, saying, “Lord, even the demons are subject to us in Your name!”"}],[{"type":"prose","content":"And He said to them, "}],[{"type":"prose","content":"At that very time He rejoiced greatly in the Holy Spirit, and said, "}],[{"type":"prose","content":"Turning to the disciples, He said privately, "}],[{"type":"prose","content":"And behold, a lawyer stood up and put Him to the test, saying, “Teacher, what shall I do to inherit eternal life?”"}],[{"type":"prose","content":"And He said to him, "}],[{"type":"prose","content":"And he answered, “YOU SHALL LOVE THE LORD YOUR GOD WITH ALL YOUR HEART, AND WITH ALL YOUR SOUL, AND WITH ALL YOUR STRENGTH, AND WITH ALL YOUR MIND; AND YOUR NEIGHBOR AS YOURSELF.”"}],[{"type":"prose","content":"And He said to him, "}],[{"type":"prose","content":"But wanting to justify himself, he said to Jesus, “And who is my neighbor?”"}],[{"type":"header","content":"The Good Samaritan"},{"type":"prose","content":"Jesus replied and said, "}],[{"type":"prose","content":"And he said, “The one who showed compassion to him.” Then Jesus said to him, "}],[{"type":"header","content":"Martha and Mary"},{"type":"prose","content":"Now as they were traveling along, He entered a village; and a woman named Martha welcomed Him into her home."}],[{"type":"prose","content":"And she had a sister called Mary, who was also seated at the Lord’s feet, and was listening to His word."}],[{"type":"prose","content":"But Martha was distracted with all her preparations; and she came up  and said, “Lord, do You not care that my sister has left me to do the serving by myself? Then tell her to help me.”"}],[{"type":"prose","content":"But the Lord answered and said to her, "}]]