[{"num":10,"verse":"And after these things, the Lord did appoint also other seventy, and sent them by twos before his face, to every city and place whither he himself was about to come,"},{"num":2,"verse":"then said he unto them, `The harvest indeed [is] abundant, but the workmen few; beseech ye then the Lord of the harvest, that He may put forth workmen to His harvest."},{"num":3,"verse":"`Go away; lo, I send you forth as lambs in the midst of wolves;"},{"num":4,"verse":"carry no bag, no scrip, nor sandals; and salute no one on the way;"},{"num":5,"verse":"and into whatever house ye do enter, first say, Peace to this house;"},{"num":6,"verse":"and if indeed there may be there the son of peace, rest on it shall your peace; and if not so, upon you it shall turn back."},{"num":7,"verse":"`And in that house remain, eating and drinking the things they have, for worthy [is] the workman of his hire; go not from house to house,"},{"num":8,"verse":"and into whatever city ye enter, and they may receive you, eat the things set before you,"},{"num":9,"verse":"and heal the ailing in it, and say to them, The reign of God hath come nigh to you."},{"num":10,"verse":"`And into whatever city ye do enter, and they may not receive you, having gone forth to its broad places, say,"},{"num":11,"verse":"And the dust that hath cleaved to us, from your city, we do wipe off against you, but this know ye, that the reign of God hath come nigh to you;"},{"num":12,"verse":"and I say to you, that for Sodom in that day it shall be more tolerable than for that city."},{"num":13,"verse":"`Wo to thee, Chorazin; wo to thee, Bethsaida; for if in Tyre and Sidon had been done the mighty works that were done in you, long ago, sitting in sackcloth and ashes, they had reformed;"},{"num":14,"verse":"but for Tyre and Sidon it shall be more tolerable in the judgment than for you."},{"num":15,"verse":"`And thou, Capernaum, which unto the heaven wast exalted, unto hades thou shalt be brought down."},{"num":16,"verse":"`He who is hearing you, doth hear me; and he who is putting you away, doth put me away; and he who is putting me away, doth put away Him who sent me.'"},{"num":17,"verse":"And the seventy turned back with joy, saying, `Sir, and the demons are being subjected to us in thy name;'"},{"num":18,"verse":"and he said to them, `I was beholding the Adversary, as lightning from the heaven having fallen;"},{"num":19,"verse":"lo, I give to you the authority to tread upon serpents and scorpions, and on all the power of the enemy, and nothing by any means shall hurt you;"},{"num":20,"verse":"but, in this rejoice not, that the spirits are subjected to you, but rejoice rather that your names were written in the heavens.'"},{"num":21,"verse":"In that hour was Jesus glad in the Spirit, and said, `I do confess to thee, Father, Lord of the heaven and of the earth, that Thou didst hide these things from wise men and understanding, and didst reveal them to babes; yes, Father, because so it became good pleasure before Thee."},{"num":22,"verse":"`All things were delivered up to me by my Father, and no one doth know who the Son is, except the Father, and who the Father is, except the Son, and he to whom the Son may wish to reveal [Him].'"},{"num":23,"verse":"And having turned unto the disciples, he said, by themselves, `Happy the eyes that are perceiving what ye perceive;"},{"num":24,"verse":"for I say to you, that many prophets and kings did wish to see what ye perceive, and did not see, and to hear what ye hear, and did not hear.'"},{"num":25,"verse":"And lo, a certain lawyer stood up, trying him, and saying, `Teacher, what having done, life age-during shall I inherit?'"},{"num":26,"verse":"And he said unto him, `In the law what hath been written? how dost thou read?'"},{"num":27,"verse":"And he answering said, `Thou shalt love the Lord thy God out of all thy heart, and out of all thy soul, and out of all thy strength, and out of all thy understanding, and thy neighbour as thyself.'"},{"num":28,"verse":"And he said to him, `Rightly thou didst answer; this do, and thou shalt live.'"},{"num":29,"verse":"And he, willing to declare himself righteous, said unto Jesus, `And who is my neighbour?'"},{"num":30,"verse":"and Jesus having taken up [the word], said, `A certain man was going down from Jerusalem to Jericho, and fell among robbers, and having stripped him and inflicted blows, they went away, leaving [him] half dead."},{"num":31,"verse":"`And by a coincidence a certain priest was going down in that way, and having seen him, he passed over on the opposite side;"},{"num":32,"verse":"and in like manner also, a Levite, having been about the place, having come and seen, passed over on the opposite side."},{"num":33,"verse":"`But a certain Samaritan, journeying, came along him, and having seen him, he was moved with compassion,"},{"num":34,"verse":"and having come near, he bound up his wounds, pouring on oil and wine, and having lifted him up on his own beast, he brought him to an inn, and was careful of him;"},{"num":35,"verse":"and on the morrow, going forth, taking out two denaries, he gave to the innkeeper, and said to him, Be careful of him, and whatever thou mayest spend more, I, in my coming again, will give back to thee."},{"num":36,"verse":"`Who, then, of these three, seemeth to thee to have become neighbour of him who fell among the robbers?'"},{"num":37,"verse":"and he said, `He who did the kindness with him,' then Jesus said to him, `Be going on, and thou be doing in like manner.'"},{"num":38,"verse":"And it came to pass, in their going on, that he entered into a certain village, and a certain woman, by name Martha, did receive him into her house,"},{"num":39,"verse":"and she had also a sister, called Mary, who also, having seated herself beside the feet of Jesus, was hearing the word,"},{"num":40,"verse":"and Martha was distracted about much serving, and having stood by him, she said, `Sir, dost thou not care that my sister left me alone to serve? say then to her, that she may partake along with me.'"},{"num":41,"verse":"And Jesus answering said to her, `Martha, Martha, thou art anxious and disquieted about many things,"},{"num":42,"verse":"but of one thing there is need, and Mary the good part did choose, that shall not be taken away from her.'"}]