[{"header":"The Gold Idol and Blazing Furnace"},{"num":3,"verse":"King Nebuchadnezzar made a gold statue ·ninety feet [sixty cubits] high and ·nine feet [six cubits] wide [unclear whether the statue was of Nebuchadnezzar or a Babylonian god like Marduk] and set it up on the plain of Dura [from a Babylonian word meaning “wall” or “fortress”] in the ·area [province] of Babylon. "},{"num":2,"verse":"Then he ·called for the leaders: […sent for] the ·governors [satraps], ·assistant governors [prefects], ·captains of the soldiers [governors], ·people who advised the king [counselors], ·keepers of the treasury [treasurers], ·judges [justices], ·rulers [magistrates], and all other officers ·in his kingdom [of the provinces]. He wanted them to ·come [assemble] ·to the special service for [for the dedication of] the statue he had set up. "},{"num":3,"verse":"So ·they all [the satraps, prefects, governors, counselors, treasurers, justices, magistrates, and all other officers of the provinces] came for the ·special service [dedication] and stood in front of the statue that King Nebuchadnezzar had set up. "},{"num":4,"verse":"Then the herald [someone who made royal announcements] said in a loud voice, “People, nations, and those of every language, this is what you are commanded to do: "},{"num":5,"verse":"When you hear the sound of the horns, flutes, lyres, zithers [a string instrument], harps, pipes, and all the other musical instruments, you must ·bow [fall] down and worship the gold statue that King Nebuchadnezzar has set up. "},{"num":6,"verse":"Anyone who doesn’t ·bow [fall] down and worship will immediately be thrown into a blazing furnace.”"},{"num":7,"verse":"Now people, nations, and those who spoke every language were there. When they heard the sound of the horns, flutes, lyres, zithers [v. 5], pipes, and all the other musical instruments, they ·bowed [fell] down and worshiped the gold statue King Nebuchadnezzar had set up."},{"num":8,"verse":"Then some ·Babylonians [Chaldeans] came up to the king and ·began speaking against [denounced; ate pieces of] the men of Judah. "},{"num":9,"verse":"They said to King Nebuchadnezzar, “O king, live forever! "},{"num":10,"verse":"O king, you ·gave a command [set a decree] that everyone who heard the horns, lyres, zithers [v. 5], harps, pipes, and all the other musical instruments would have to ·bow [fall] down and worship the gold statue. "},{"num":11,"verse":"Anyone who wouldn’t ·do this [fall down and worship] was to be thrown into a blazing furnace. "},{"num":12,"verse":"O king, there are some men of Judah whom you ·made officers in [appointed/delegated over] the ·area [province] of Babylon that did not pay attention to your order. Their names are Shadrach, Meshach, and Abednego. They do not serve your gods and do not worship the gold statue you have set up.”"},{"num":13,"verse":"Nebuchadnezzar ·became very angry [flew into a rage] and called for Shadrach, Meshach, and Abednego. When they were brought to the king, "},{"num":14,"verse":"Nebuchadnezzar said, “Shadrach, Meshach, and Abednego, is it true that you do not serve my gods nor worship the gold statue I have set up? "},{"num":15,"verse":"In a moment you will again hear the sound of the horns, flutes, lyres, zithers [v. 5], harps, pipes, and all the other musical instruments. If you ·bow [fall] down and worship the statue I made, that will be good. But if you do not worship it, you will immediately be thrown into the blazing furnace. What god will be able to ·save [rescue; deliver] you from my ·power [hands] then?”"},{"num":16,"verse":"Shadrach, Meshach, and Abednego answered the king, saying, “Nebuchadnezzar, we do not need to defend ourselves to you. "},{"num":17,"verse":"If you throw us into the blazing furnace, the God we ·serve [fear; Prov. 1:7] is able to save us from the furnace. He will save us from your ·power [hand], O king. "},{"num":18,"verse":"But even if God does not save us, we want you, O king, to know this: We will not serve your gods or worship the gold statue you have set up [Ex. 20:3–6].”"},{"num":19,"verse":"Then Nebuchadnezzar was furious with Shadrach, Meshach, and Abednego, and ·he changed his mind [or his appearance changed; his image/visage of his face changed]. He ordered the furnace to be heated seven times hotter than usual. "},{"num":20,"verse":"Then he commanded some of the ·strongest soldiers in his army [men mighty in strength] to ·tie up [bind] Shadrach, Meshach, and Abednego and throw them into the blazing furnace."},{"num":21,"verse":"So ·Shadrach, Meshach, and Abednego [the men] were ·tied up [bound] and thrown into the blazing furnace while still wearing their ·robes [tunics], trousers, turbans, and other clothes. "},{"num":22,"verse":"The king’s command was ·very strict [urgent], and the furnace was made so hot that the flames killed the strong soldiers who threw Shadrach, Meshach, and Abednego into the furnace. "},{"num":23,"verse":"Firmly tied, Shadrach, Meshach, and Abednego fell into the blazing furnace."},{"num":24,"verse":"Then King Nebuchadnezzar was so surprised that he ·jumped to his feet [rose up in haste]. He asked the men who advised him, “Didn’t we tie up only three men and throw them into the fire?”"},{"num":25,"verse":"The king said, “Look! I see four men walking around in the fire. They are not ·tied [bound] up, and they are not ·burned [hurt]. The fourth man looks like a son of the gods [a divine figure].”"},{"num":26,"verse":"Then Nebuchadnezzar ·went to [approached] the opening of the blazing furnace and shouted, “Shadrach, Meshach, and Abednego, come out! Servants of the Most High God, come here!”"},{"num":27,"verse":"When they came out, the ·governors [satraps], ·assistant governors [prefects], ·captains of the soldiers [governors], and ·royal advisers [counselors] crowded around them and saw that the fire had ·not harmed [no power over] their bodies. Their hair was not ·burned [singed], their ·robes [tunics] were not burned, and they didn’t even smell like smoke!"},{"num":28,"verse":"Then Nebuchadnezzar said, “·Praise [Blessed be] the God of Shadrach, Meshach, and Abednego. Their God has sent his ·angel [or messenger] and ·saved [rescued; delivered] his servants from the fire! These three men trusted their God and ·refused to obey [defied] ·my [the king’s] command. They were willing to ·die [forfeit/yield up their bodies] rather than serve or worship any god other than their own God. "},{"num":29,"verse":"So I now give this ·command [decree]: Anyone from any nation or ·language [tongue] who says anything against the God of Shadrach, Meshach, and Abednego will be torn ·apart [limb from limb] and have his house turned into a pile of stones [2:5; Ezra 6:11]. No other god can ·save [rescue; deliver] his people like this.” "},{"num":30,"verse":"Then the king promoted Shadrach, Meshach, and Abednego in the ·area [province] of Babylon."}]