[{"header":"Nebuchadnezzar Commands Everyone to Worship a Gold Statue"},{"num":3,"verse":"King Nebuchadnezzar had a gold statue made, ninety feet high and nine feet wide, and he had it set up in the plain of Dura in the province of Babylon. "},{"num":2,"verse":"Then the king gave orders for all his officials to come together—the princes, governors, lieutenant governors, commissioners, treasurers, judges, magistrates, and all the other officials of the provinces. They were to attend the dedication of the statue which King Nebuchadnezzar had set up. "},{"num":3,"verse":"When all these officials gathered for the dedication and stood in front of the statue, "},{"num":4,"verse":"a herald announced in a loud voice, “People of all nations, races, and languages! "},{"num":5,"verse":"You will hear the sound of the trumpets, followed by the playing of oboes, lyres, zithers, and harps; and then all the other instruments will join in. As soon as the music starts, you are to bow down and worship the gold statue that King Nebuchadnezzar has set up. "},{"num":6,"verse":"Anyone who does not bow down and worship will immediately be thrown into a blazing furnace.” "},{"num":7,"verse":"And so, as soon as they heard the sound of the instruments, the people of all the nations, races, and languages bowed down and worshiped the gold statue which King Nebuchadnezzar had set up."},{"header":"Daniel's Three Friends Are Accused of Disobedience"},{"num":8,"verse":"It was then that some Babylonians took the opportunity to denounce the Jews. "},{"num":9,"verse":"They said to King Nebuchadnezzar, “May Your Majesty live forever! "},{"num":10,"verse":"Your Majesty has issued an order that as soon as the music starts, everyone is to bow down and worship the gold statue, "},{"num":11,"verse":"and that anyone who does not bow down and worship it is to be thrown into a blazing furnace. "},{"num":12,"verse":"There are some Jews whom you put in charge of the province of Babylon—Shadrach, Meshach, and Abednego—who are disobeying Your Majesty's orders. They do not worship your god or bow down to the statue you set up.”"},{"num":13,"verse":"At that, the king flew into a rage and ordered the three men to be brought before him. "},{"num":14,"verse":"He said to them, “Shadrach, Meshach, and Abednego, is it true that you refuse to worship my god and to bow down to the gold statue I have set up? "},{"num":15,"verse":"Now then, as soon as you hear the sound of the trumpets, oboes, lyres, zithers, harps, and all the other instruments, bow down and worship the statue. If you do not, you will immediately be thrown into a blazing furnace. Do you think there is any god who can save you?”"},{"num":16,"verse":"Shadrach, Meshach, and Abednego answered, “Your Majesty, we will not try to defend ourselves. "},{"num":17,"verse":"If the God whom we serve is able to save us from the blazing furnace and from your power, then he will. "},{"num":18,"verse":"But even if he doesn't, Your Majesty may be sure that we will not worship your god, and we will not bow down to the gold statue that you have set up.”"},{"header":"Daniel's Three Friends Are Sentenced to Death"},{"num":19,"verse":"Then Nebuchadnezzar lost his temper, and his face turned red with anger at Shadrach, Meshach, and Abednego. So he ordered the furnace to be heated seven times hotter than usual. "},{"num":20,"verse":"And he commanded the strongest men in his army to tie the three men up and throw them into the blazing furnace. "},{"num":21,"verse":"So they tied them up, fully dressed—shirts, robes, caps, and all—and threw them into the blazing furnace. "},{"num":22,"verse":"Now because the king had given strict orders for the furnace to be made extremely hot, the flames burned up the guards who took the men to the furnace. "},{"num":23,"verse":"Then Shadrach, Meshach, and Abednego, still tied up, fell into the heart of the blazing fire."},{"num":24,"verse":"Suddenly Nebuchadnezzar leaped to his feet in amazement. He asked his officials, “Didn't we tie up three men and throw them into the blazing furnace?”"},{"num":25,"verse":"“Then why do I see four men walking around in the fire?” he asked. “They are not tied up, and they show no sign of being hurt—and the fourth one looks like an angel.”"},{"header":"The Three Men Are Released and Promoted"},{"num":26,"verse":"So Nebuchadnezzar went up to the door of the blazing furnace and called out, “Shadrach! Meshach! Abednego! Servants of the Supreme God! Come out!” And they came out at once. "},{"num":27,"verse":"All the princes, governors, lieutenant governors, and other officials of the king gathered to look at the three men, who had not been harmed by the fire. Their hair was not singed, their clothes were not burned, and there was no smell of smoke on them."},{"num":28,"verse":"The king said, “Praise the God of Shadrach, Meshach, and Abednego! He sent his angel and rescued these men who serve and trust him. They disobeyed my orders and risked their lives rather than bow down and worship any god except their own."},{"num":29,"verse":"“And now I command that if anyone of any nation, race, or language speaks disrespectfully of the God of Shadrach, Meshach, and Abednego, he is to be torn limb from limb, and his house is to be made a pile of ruins. There is no other god who can rescue like this.”"},{"num":30,"verse":"And the king promoted Shadrach, Meshach, and Abednego to higher positions in the province of Babylon."}]