[{"header":"The Golden Image"},{"num":3,"verse":"King Nebuchadnezzar made a golden statue whose height was sixty cubits and whose width was six cubits; he set it up on the plain of Dura in the province of Babylon. "},{"num":2,"verse":"Then King Nebuchadnezzar sent for the satraps, the prefects, and the governors, the counsellors, the treasurers, the justices, the magistrates, and all the officials of the provinces, to assemble and come to the dedication of the statue that King Nebuchadnezzar had set up. "},{"num":3,"verse":"So the satraps, the prefects, and the governors, the counsellors, the treasurers, the justices, the magistrates, and all the officials of the provinces, assembled for the dedication of the statue that King Nebuchadnezzar had set up. When they were standing before the statue that Nebuchadnezzar had set up, "},{"num":4,"verse":"the herald proclaimed aloud, ‘You are commanded, O peoples, nations, and languages, "},{"num":5,"verse":"that when you hear the sound of the horn, pipe, lyre, trigon, harp, drum, and entire musical ensemble, you are to fall down and worship the golden statue that King Nebuchadnezzar has set up. "},{"num":6,"verse":"Whoever does not fall down and worship shall immediately be thrown into a furnace of blazing fire.’ "},{"num":7,"verse":"Therefore, as soon as all the peoples heard the sound of the horn, pipe, lyre, trigon, harp, drum, and entire musical ensemble, all the peoples, nations, and languages fell down and worshipped the golden statue that King Nebuchadnezzar had set up."},{"num":8,"verse":"Accordingly, at this time certain Chaldeans came forward and denounced the Jews. "},{"num":9,"verse":"They said to King Nebuchadnezzar, ‘O king, live for ever! "},{"num":10,"verse":"You, O king, have made a decree, that everyone who hears the sound of the horn, pipe, lyre, trigon, harp, drum, and entire musical ensemble, shall fall down and worship the golden statue, "},{"num":11,"verse":"and whoever does not fall down and worship shall be thrown into a furnace of blazing fire. "},{"num":12,"verse":"There are certain Jews whom you have appointed over the affairs of the province of Babylon: Shadrach, Meshach, and Abednego. These pay no heed to you, O king. They do not serve your gods and they do not worship the golden statue that you have set up.’"},{"num":13,"verse":"Then Nebuchadnezzar in furious rage commanded that Shadrach, Meshach, and Abednego be brought in; so they brought those men before the king. "},{"num":14,"verse":"Nebuchadnezzar said to them, ‘Is it true, O Shadrach, Meshach, and Abednego, that you do not serve my gods and you do not worship the golden statue that I have set up? "},{"num":15,"verse":"Now if you are ready when you hear the sound of the horn, pipe, lyre, trigon, harp, drum, and entire musical ensemble to fall down and worship the statue that I have made, well and good. But if you do not worship, you shall immediately be thrown into a furnace of blazing fire, and who is the god that will deliver you out of my hands?’"},{"num":16,"verse":"Shadrach, Meshach, and Abednego answered the king, ‘O Nebuchadnezzar, we have no need to present a defence to you in this matter. "},{"num":17,"verse":"If our God whom we serve is able to deliver us from the furnace of blazing fire and out of your hand, O king, let him deliver us. "},{"num":18,"verse":"But if not, be it known to you, O king, that we will not serve your gods and we will not worship the golden statue that you have set up.’"},{"header":"The Fiery Furnace"},{"num":19,"verse":"Then Nebuchadnezzar was so filled with rage against Shadrach, Meshach, and Abednego that his face was distorted. He ordered the furnace to be heated up seven times more than was customary, "},{"num":20,"verse":"and ordered some of the strongest guards in his army to bind Shadrach, Meshach, and Abednego and to throw them into the furnace of blazing fire. "},{"num":21,"verse":"So the men were bound, still wearing their tunics, their trousers, their hats, and their other garments, and they were thrown into the furnace of blazing fire. "},{"num":22,"verse":"Because the king’s command was urgent and the furnace was so overheated, the raging flames killed the men who lifted Shadrach, Meshach, and Abednego. "},{"num":23,"verse":"But the three men, Shadrach, Meshach, and Abednego, fell down, bound, into the furnace of blazing fire."},{"header":"The Prayer of Azariah in the Furnace"},{"num":24,"verse":"They walked around in the midst of the flames, singing hymns to God and blessing the Lord. "},{"num":25,"verse":"Then Azariah stood still in the fire and prayed aloud:"},{"header":"The Song of the Three Jews"},{"num":46,"verse":"Now the king’s servants who threw them in kept stoking the furnace with naphtha, pitch, tow, and brushwood. "},{"num":47,"verse":"And the flames poured out above the furnace forty-nine cubits, "},{"num":48,"verse":"and spread out and burned those Chaldeans who were caught near the furnace. "},{"num":49,"verse":"But the angel of the Lord came down into the furnace to be with Azariah and his companions, and drove the fiery flame out of the furnace, "},{"num":50,"verse":"and made the inside of the furnace as though a moist wind were whistling through it. The fire did not touch them at all and caused them no pain or distress."},{"num":51,"verse":"Then the three with one voice praised and glorified and blessed God in the furnace:"},{"num":91,"verse":"Hearing them sing, and amazed at seeing them alive, King Nebuchadnezzar was astonished and rose up quickly. He said to his counsellors, ‘Was it not three men that we threw bound into the fire?’ They answered the king, ‘True, O king.’ "},{"num":92,"verse":"He replied, ‘But I see four men unbound, walking in the middle of the fire, and they are not hurt; and the fourth has the appearance of a god.’ "},{"num":93,"verse":"Nebuchadnezzar then approached the door of the furnace of blazing fire and said, ‘Shadrach, Meshach, and Abednego, servants of the Most High God, come out! Come here!’ So Shadrach, Meshach, and Abednego came out from the fire. "},{"num":94,"verse":"And the satraps, the prefects, the governors, and the king’s counsellors gathered together and saw that the fire had not had any power over the bodies of those men; the hair of their heads was not singed, their tunics were not harmed, and not even the smell of fire came from them. "},{"num":95,"verse":"Nebuchadnezzar said, ‘Blessed be the God of Shadrach, Meshach, and Abednego, who has sent his angel and delivered his servants who trusted in him. They disobeyed the king’s command and yielded up their bodies rather than serve and worship any god except their own God. "},{"num":96,"verse":"Therefore I make a decree: Any people, nation, or language that utters blasphemy against the God of Shadrach, Meshach, and Abednego shall be torn limb from limb, and their houses laid in ruins; for there is no other god who is able to deliver in this way.’ "},{"num":97,"verse":"Then the king promoted Shadrach, Meshach, and Abednego in the province of Babylon."}]