[{"header":"A Gold Idol and a Blazing Furnace"},{"num":3,"verse":"King Nebuchadnezzar made an image of gold, sixty cubits high and six cubits wide. He set it up on the plain of Dura in the province of Babylon. "},{"num":2,"verse":"Then King Nebuchadnezzar summoned the satraps, prefects, governors, counselors, treasurers, judges, magistrates, and all the authorities of the provinces to come to the dedication of the image which Nebuchadnezzar the king had set up. "},{"num":3,"verse":"Then the satraps, administrators, governors, counselors, treasurers, judges, magistrates and all the authorities of the provinces assembled for the dedication of the image that King Nebuchadnezzar had erected. They stood before the image that Nebuchadnezzar had set up."},{"num":4,"verse":"Then the herald loudly proclaimed, “You are commanded O peoples, nations and languages, "},{"num":5,"verse":"that when you hear the sound of the horn, flute, zither, lyre, harp, pipes and all kinds of music, you must fall down and worship the golden image that King Nebuchadnezzar has set up. "},{"num":6,"verse":"Whoever does not fall down and worship will that same hour be thrown into the midst of a furnace of blazing fire.” "},{"num":7,"verse":"Therefore, as soon as all the peoples heard the sound of the horn, flute, zither, lyre, harp and pipes, and all kinds of music, all the peoples, nations and languages fell down and worshipped the golden image that Nebuchadnezzar the king had set up."},{"num":8,"verse":"At that time certain Chaldeans came forward and denounced the Jews. "},{"num":9,"verse":"They spoke up and said to King Nebuchadnezzar, “May the king live forever! "},{"num":10,"verse":"You, O king, made a decree that everyone who hears the sound of the horn, flute, zither, lyre, harp, pipes and all kinds of music, must fall down and worship the golden image, "},{"num":11,"verse":"and that whoever does not fall down and worship will be thrown into the midst of a furnace of blazing fire. "},{"num":12,"verse":"There are certain Jews whom you appointed over the administration of the province of Babylon—Shadrach, Meshach and Abed-nego—those men pay no heed to you, O king. They do not serve your gods, nor will they worship the golden image that you have set up.”"},{"num":13,"verse":"Furious with rage, Nebuchadnezzar ordered Shadrach, Meshach and Abed-nego to be summoned. When these men were brought before the king, "},{"num":14,"verse":"Nebuchadnezzar responded to them saying, “Is it true, Shadrach, Meshach and Abed-nego, that you don’t serve my gods or worship the golden image that I set up? "},{"num":15,"verse":"Now if you are ready, at the moment you hear the sound of the horn, flute, zither, lyre, harp and pipes and all kinds of music you must fall down and worship the image that I have made. But if you do not worship, you will immediately be thrown into the midst of a furnace of blazing fire! Then what god will be able to deliver you out of my hands?”"},{"num":16,"verse":"Shadrach, Meshach and Abed-nego replied to the king saying, “O Nebuchadnezzar, we do not need to answer you concerning this matter. "},{"num":17,"verse":"If it is so, our God whom we serve is able to save us from the furnace of blazing fire and He will deliver us out of your hand, O king. "},{"num":18,"verse":"Yet even if He does not, let it be known to you, O king, that we will not serve your gods, nor worship the golden image that you set up.”"},{"num":19,"verse":"Then Nebuchadnezzar was filled with rage and the appearance of his face changed toward Shadrach, Meshach and Abed-nego. He ordered the furnace to be heated seven times hotter than it was normally heated "},{"num":20,"verse":"and commanded some of the mighty men in his army to tie up Shadrach, Meshach and Abed-nego and to cast them into the furnace of blazing fire. "},{"num":21,"verse":"So these men, wearing their robes, tunics, hats and other clothes, were bound and thrown into the furnace of blazing fire. "},{"num":22,"verse":"But because the king’s order was so urgent and the furnace so extremely hot, a raging flame killed those men who carried up Shadrach, Meshach and Abed-nego. "},{"num":23,"verse":"And these three men, Shadrach, Meshach and Abed-nego, fell bound into the midst of the furnace of blazing fire."},{"num":24,"verse":"Then King Nebuchadnezzar was astonished and leapt to his feet. He asked his ministers, “Didn’t we cast three men bound into the middle of the fire?”"},{"num":25,"verse":"But he answered saying, “Look! I see four men walking about unbound and unharmed in the middle of the fire, and the fourth has the appearance like a son of the gods!”"},{"num":26,"verse":"Nebuchadnezzar then approached the door of the furnace of blazing fire and exclaimed, “Shadrach, Meshach and Abed-nego, servants of the Most High God, come out and come here!”"},{"num":27,"verse":"When the satraps, administrators, governors and royal ministers had gathered around, they saw that the fire had no effect on the bodies of these men. Not a hair of their head was singed, nor were their robes scorched, nor was there a smell of fire on them."},{"num":28,"verse":"Nebuchadnezzar exclaimed, “Blessed be the God of Shadrach, Meshach and Abed-nego, who has sent His angel and delivered His servants who trusted in Him! They defied the king’s edict and to gave up their lives rather than serve or worship any god except their own God. "},{"num":29,"verse":"Therefore I hereby decree that any people, nation or language that says anything slanderous against the God of Shadrach, Meshach and Abed-nego will be torn limb from limb and their house made a pile of rubble, because there is no other god that is able to deliver in this way.”"},{"num":30,"verse":"Then the king promoted Shadrach, Meshach and Abed-nego in the province of Babylon."},{"header":"Nebuchadnezzar Acknowledges God’s Kingdom"},{"num":31,"verse":"King Nebuchadnezzar—"},{"num":32,"verse":"It seemed good to me to declare the signs and wonders that God Most High has done for me."}]