[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For thy sake.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—For St. Paul’s quotation of this verse (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), see Note, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "N. Test. Commentary.Benson CommentaryPsalm 44:22. Yea, or but, for thy sake we are killed all the day — We do not suffer for our apostacy, but because we will not apostatize from thee. We are persecuted and put to death because we are thy people, and continue constantly and resolutely in the profession and practice of thy worship, which they abhor, and from which they seek to draw or drive us. It is well known that the Jews were exposed to a variety of evils from their conquerors, on account of their strict adherence to the Mosaic law. And it is well observed by a learned writer, “that as this and the like passages of this Psalm may be applied primarily to the persecuted Jews; so do they, in a secondary sense, refer to suffering Christians, and their persecutions from heathen and unbelieving adversaries; and, accordingly, St. Paul so accommodates the present verse, Romans 8:36.”Matthew Henry's Concise Commentary44:17-26 In afflictions, we must not seek relief by any sinful compliance; but should continually meditate on the truth, purity, and knowledge of our heart-searching God. Hearts sins and secret sins are known to God, and must be reckoned for. He knows the secret of the heart, therefore judges of the words and actions. While our troubles do not drive us from our duty to God, we should not suffer them to drive us from our comfort in God. Let us take care that prosperity and ease do not render us careless and lukewarm. The church of God cannot be prevailed on by persecution to forget God; the believer's heart does not turn back from God. The Spirit of prophecy had reference to those who suffered unto death, for the testimony of Christ. Observe the pleas used, ver. 25,26. Not their own merit and righteousness, but the poor sinner's pleas. None that belong to Christ shall be cast off, but every one of them shall be saved, and that for ever. The mercy of God, purchased, promised, and constantly flowing forth, and offered to believers, does away every doubt arising from our sins; while we pray in faith, Redeem us for thy mercies' sake.Barnes' Notes on the BibleYea, for thy sake are we killed all the day long - That is, we are continually or constantly subjected to these calamities. It is not a single defeat, but it is a continued slaughter. This verse contains, in the apprehension of the psalmist, the true cause of the calamities which had come upon the nation. The emphasis in the passage lies in the phrase \"for thy sake.\" The meaning is, It is on thy account; it is in thy cause; it is because we are thy friends, and because we worship thee. It is not on account of our national sins; it is not because there is any prevalent idolatry, but it is because we are the worshippers of the true God, and we are, therefore, martyrs. All these calamities have come upon us in consequence of our attachment to thee. There is no evidence that there was any self-glorying in this, or any intention to blame God as if he were unjust or severe, but it is the feeling of martyrs as suffering in the cause of religion. This passage is applied by the apostle Paul to Christians in his time, as fitly describing their sufferings, and the cause of the calamities which came upon them. See the notes at Romans 8:36.We are counted as sheep for the slaughter - We are reckoned like sheep designed for the slaughter. That is, It is not because we are guilty, but we are regarded and treated as innocent sheep who are driven to be slaughtered. See the notes at Romans 8:36. Their attachment to the true religion - their devotion to Yahweh as the true God - was the secret cause of all the calamities which had come upon them. As a nation they were his friends, and as such they were opposed by the worshippers of other gods. Jamieson-Fausset-Brown Bible Commentary22. Their protracted sufferings as God's people attests the constancy. Paul (Ro 8:36) uses this to describe Christian steadfastness in persecution.Matthew Poole's Commentary Yea;  or, but. We do not suffer for our apostacy, but because we will not apostatize from thee. For thy sake;  because we are thy people, and continue constantly and resolutely in the profession and practice of thy worship, which they abhor, and from which they seek to draw or drive us. Gill's Exposition of the Entire BibleYea, for thy sake are we killed all the day long,.... These words are cited by the Apostle Paul in Romans 8:36; and are applied to his times, showing the then close attachment of the saints to Christ, and their strong love and affection for him; and they have the same sense here, being an instance and proof of the church's integrity and faithfulness in the cause of God, amidst the sorest afflictions and persecutions; for the truth of which she appeals to the searcher of hearts; and had their accomplishment in the ten persecutions under the Heathen emperors, and under the Papal tyranny; and may be understood of their being threatened with death, being in danger of it, and exposed unto it continually, 1 Corinthians 15:31; or of their being in such troubles and afflictions, which may be called death, 2 Corinthians 1:8; or of the actual slaying them: and what was done to many of the members of the church she attributes to herself, because of the union between them; and for the sake of the worship of the true God, because they would not worship the gods of the Heathens, nor the image of the beast, multitudes of them were put to death; and that all the day long, and every day, and that for a long series and course of time, or continually; and indeed, ever since the Gospel day or dispensation began, this killing work has been more or less; and it will continue during the reign of antichrist, until the measure of his iniquity is filled up, and the afflictions of the saints are accomplished; we are counted as sheep for the slaughter; or \"as sheep of slaughter\" (q); see Zechariah 11:4; that is, either as sheep to be slaughtered for food, their enemies delighting to eat their flesh and drink their blood; See Gill on Psalm 44:11, or for sacrifice, they reckoning it doing God good service to take away their lives, as though they sacrificed a lamb or a sheep unto him; and which, like sheep, they have patiently endured: this is the account made of them, not by the Lord, in whose sight their death is precious; nor by the saints, with whom their memory is dear; but by their furious persecutors, among whom they are as sheep among wolves; see 1 Corinthians 4:13. (q)  \"ut pecus mactationis\", Montanus, Vatablus; so Musculus, Cocceius, Gejerus, Michaelis, Ainsworth. Geneva Study BibleYea, for thy sake {r} are we killed all the day long; we are counted as sheep for the slaughter.(r) The faithful take comfort in this, that the wicked punish them not for their sins, but for because of God, Mt 5:10, 1Pe 4:14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "N. Test. Commentary.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 44:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Yea, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "but, for thy sake we are killed all the day — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "We do not suffer for our apostacy, but because we will not apostatize from thee. We are persecuted and put to death because we are thy people, and continue constantly and resolutely in the profession and practice of thy worship, which they abhor, and from which they seek to draw or drive us. It is well known that the Jews were exposed to a variety of evils from their conquerors, on account of their strict adherence to the Mosaic law. And it is well observed by a learned writer, “that as this and the like passages of this Psalm may be applied primarily to the persecuted Jews; so do they, in a secondary sense, refer to suffering Christians, and their persecutions from heathen and unbelieving adversaries; and, accordingly, St. Paul so accommodates the present verse, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".”",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "44:17-26 In afflictions, we must not seek relief by any sinful compliance; but should continually meditate on the truth, purity, and knowledge of our heart-searching God. Hearts sins and secret sins are known to God, and must be reckoned for. He knows the secret of the heart, therefore judges of the words and actions. While our troubles do not drive us from our duty to God, we should not suffer them to drive us from our comfort in God. Let us take care that prosperity and ease do not render us careless and lukewarm. The church of God cannot be prevailed on by persecution to forget God; the believer's heart does not turn back from God. The Spirit of prophecy had reference to those who suffered unto death, for the testimony of Christ. Observe the pleas used, ver. 25,26. Not their own merit and righteousness, but the poor sinner's pleas. None that belong to Christ shall be cast off, but every one of them shall be saved, and that for ever. The mercy of God, purchased, promised, and constantly flowing forth, and offered to believers, does away every doubt arising from our sins; while we pray in faith, Redeem us for thy mercies' sake.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Yea, for thy sake are we killed all the day long - That is, we are continually or constantly subjected to these calamities. It is not a single defeat, but it is a continued slaughter. This verse contains, in the apprehension of the psalmist, the true cause of the calamities which had come upon the nation. The emphasis in the passage lies in the phrase \"for thy sake.\" The meaning is, It is on thy account; it is in thy cause; it is because we are thy friends, and because we worship thee. It is not on account of our national sins; it is not because there is any prevalent idolatry, but it is because we are the worshippers of the true God, and we are, therefore, martyrs. All these calamities have come upon us in consequence of our attachment to thee. There is no evidence that there was any self-glorying in this, or any intention to blame God as if he were unjust or severe, but it is the feeling of martyrs as suffering in the cause of religion. This passage is applied by the apostle Paul to Christians in his time, as fitly describing their sufferings, and the cause of the calamities which came upon them. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "We are counted as sheep for the slaughter - We are reckoned like sheep designed for the slaughter. That is, It is not because we are guilty, but we are regarded and treated as innocent sheep who are driven to be slaughtered. See the notes at Romans 8:36. Their attachment to the true religion - their devotion to Yahweh as the true God - was the secret cause of all the calamities which had come upon them. As a nation they were his friends, and as such they were opposed by the worshippers of other gods. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "22. Their protracted sufferings as God's people attests the constancy. Paul (Ro 8:36) uses this to describe Christian steadfastness in persecution.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Yea; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "but",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". We do not suffer for our apostacy, but because we will not apostatize from thee. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "For thy sake; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " because we are thy people, and continue constantly and resolutely in the profession and practice of thy worship, which they abhor, and from which they seek to draw or drive us. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Yea, for thy sake are we killed all the day long,.... These words are cited by the Apostle Paul in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and are applied to his times, showing the then close attachment of the saints to Christ, and their strong love and affection for him; and they have the same sense here, being an instance and proof of the church's integrity and faithfulness in the cause of God, amidst the sorest afflictions and persecutions; for the truth of which she appeals to the searcher of hearts; and had their accomplishment in the ten persecutions under the Heathen emperors, and under the Papal tyranny; and may be understood of their being threatened with death, being in danger of it, and exposed unto it continually, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or of their being in such troubles and afflictions, which may be called death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or of the actual slaying them: and what was done to many of the members of the church she attributes to herself, because of the union between them; and for the sake of the worship of the true God, because they would not worship the gods of the Heathens, nor the image of the beast, multitudes of them were put to death; and that all the day long, and every day, and that for a long series and course of time, or continually; and indeed, ever since the Gospel day or dispensation began, this killing work has been more or less; and it will continue during the reign of antichrist, until the measure of his iniquity is filled up, and the afflictions of the saints are accomplished; ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "we are counted as sheep for the slaughter; or \"as sheep of slaughter\" (q); see Zechariah 11:4; that is, either as sheep to be slaughtered for food, their enemies delighting to eat their flesh and drink their blood; See Gill on Psalm 44:11, or for sacrifice, they reckoning it doing God good service to take away their lives, as though they sacrificed a lamb or a sheep unto him; and which, like sheep, they have patiently endured: this is the account made of them, not by the Lord, in whose sight their death is precious; nor by the saints, with whom their memory is dear; but by their furious persecutors, among whom they are as sheep among wolves; see 1 Corinthians 4:13. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(q)  \"ut pecus mactationis\", Montanus, Vatablus; so Musculus, Cocceius, Gejerus, Michaelis, Ainsworth. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Yea, for thy sake {r} are we killed all the day long; we are counted as sheep for the slaughter.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(r) The faithful take comfort in this, that the wicked punish them not for their sins, but for because of God, Mt 5:10, 1Pe 4:14.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yea, for thy sake",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, Nay, but for thy sake. Not only have we not been unfaithful to Thee, but we are actually suffering as martyrs for Thy sake. Such a protest was no doubt particularly true in the persecution of Antiochus, but not in that period only. Cp. the complaints of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This verse is quoted by St Paul in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to encourage his converts in view of the possibility that they might have to face even death for Christ’s sake. If the saints of old time had to suffer persecution even to the death, they need not be surprised if a like fate should befall them. And the quotation is doubtless intended (as so often) to carry with it the thought of its context, and to remind them of the steadfastness of the Old Testament saints under the sharpest trial of their faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yea, for thy sake are we killed all the day long",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "continually",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the phrase is often translated. Not only are the Israelites not suffering on account of any previous desertion of God, or other misconduct, but they are suffering for their fidelity to God. The heathen hate them, and make war upon them, as worshippers of one exclusive God, Jehovah, and contemners of their many gods, whom they hold to be \"no-gods.\" They are martyrs, like the Christians of the early Church (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "We",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "are counted as sheep for the slaughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ver. 11). Psalm 44:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 44:23-27) The church is not conscious of any apostasy, for on the contrary it is suffering for the sake of its fidelity. Such is the meaning intended by כּי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The emphasis lies on עליך, which is used exactly as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Paul, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", transfers this utterance to the sufferings of the New Testament church borne in witnessing for the truth, or I should rather say he considers it as a divine utterance corresponding as it were prophetically to the sufferings of the New Testament church, and by anticipation, coined concerning it and for its use, inasmuch as he cites it with the words καθὼς γέγραπται. The suppliant cries עוּרה and הקיצה are Davidic, and found in his earlier Ps; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:65",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God is said to sleep when He does not interpose in whatever is taking place in the outward world here below; for the very nature of sleep is a turning in into one's own self from all relationship to the outer world, and a resting of the powers which act outwardly. The writer of our Psalm is fond of couplets of synonyms like ענינוּ ולחצנוּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ימינך וּזרועך. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is an echo of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The suppliant cry קוּמה (in this instance in connection with the עזרתה which follows, it is to be accented on the ultima) is Davidic, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but originally it is Mosaic. Concerning the ah of עזרתה, here as also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 63:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of like meaning with לעזרתי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]