[{"num":4,"verse":"Before God and Jesus Christ, I give you a command. Christ Jesus is the one who will judge all people—those who are living and those who have died. He is coming again to rule in his kingdom. So I give you this command:"},{"num":2,"verse":"Tell everyone God’s message. Be ready at all times to do whatever is needed. Tell people what they need to do, tell them when they are doing wrong, and encourage them. Do this with great patience and careful teaching."},{"num":3,"verse":"The time will come when people will not listen to the true teaching. But people will find more and more teachers who please them. They will find teachers who say what they want to hear."},{"num":4,"verse":"People will stop listening to the truth. They will begin to follow the teaching in false stories."},{"num":5,"verse":"But you should control yourself at all times. When troubles come, accept them. Do the work of telling the Good News. Do all the duties of a servant of God."},{"num":6,"verse":"My life is being given as an offering for God. The time has come for me to leave this life here."},{"num":7,"verse":"I have fought the good fight. I have finished the race. I have served the Lord faithfully."},{"num":8,"verse":"Now, a prize is waiting for me—the crown that will show I am right with God. The Lord, the judge who judges rightly, will give it to me on that Day. Yes, he will give it to me and to everyone else who is eagerly looking forward to his coming."},{"header":"Personal Notes"},{"num":9,"verse":"Do your best to come to me as soon as you can."},{"num":10,"verse":"Demas loved this world too much. That is why he left me. He went to Thessalonica. Crescens went to Galatia. And Titus went to Dalmatia."},{"num":11,"verse":"Luke is the only one still with me. Get Mark and bring him with you when you come. He can help me in my work here."},{"num":12,"verse":"I sent Tychicus to Ephesus."},{"num":13,"verse":"When I was in Troas, I left my coat there with Carpus. So when you come, bring it to me. Also, bring my books. The books written on parchment are the ones I need."},{"num":14,"verse":"Alexander the metalworker caused me so much harm. The Lord will punish him for what he did."},{"num":15,"verse":"He fought against everything we teach. You should be careful that he doesn’t hurt you too."},{"num":16,"verse":"The first time I defended myself, no one helped me. Everyone left me. I pray that God will forgive them."},{"num":17,"verse":"But the Lord stayed with me. The Lord gave me strength so that I could tell the Good News everywhere. He wanted all those who are not Jews to hear that Good News. So I was saved from the lion’s mouth."},{"num":18,"verse":"The Lord will save me when anyone tries to hurt me. He will bring me safely to his heavenly kingdom. Glory forever and ever be the Lord’s. Amen."},{"header":"Final Greetings"},{"num":19,"verse":"Give my greetings to Priscilla and Aquila and to the family of Onesiphorus."},{"num":20,"verse":"Erastus stayed in Corinth. And I left Trophimus in Miletus—he was sick."},{"num":21,"verse":"Try as hard as you can to come to me before winter."},{"num":22,"verse":"The Lord be with your spirit. Grace be with you."}]