[{"num":4,"verse":"Therefore, I Charge you before God and before the Lord Jesus Christ, Who shall judge the living and dead at His appearing and in His Kingdom -"},{"num":2,"verse":"preach the word! Be ready, in season and out of season. Convict, rebuke, encourage, with all longsuffering and teaching."},{"num":3,"verse":"For the time will come when they will not endure sound doctrine. But having itching ears, they shall gather a heap of teachers according to their own lusts"},{"num":4,"verse":"and shall turn their ears from the truth and shall be given to fables."},{"num":5,"verse":"But you, be sober in all things. Suffer adversity. Do the work of an evangelist. Carry out your ministry fully."},{"num":6,"verse":"For I am already being offered. And the time of my departing is at hand."},{"num":7,"verse":"I have fought the good fight and have finished my course. I have kept the faith."},{"num":8,"verse":"Hereafter, the crown of righteousness - which the Lord, the Righteous Judge, shall give me on that Day - is laid up for me. And not only to me but also to all those who love His appearing."},{"num":9,"verse":"Hurry to come to me at once!"},{"num":10,"verse":"For Demas has forsaken me, and has embraced this present world, and has departed to Thessalonica. Crescens has gone to Galatia; Titus to Dalmatia."},{"num":11,"verse":"Only Luke is with me. Take Mark and bring him with you. For he is useful to me for ministry."},{"num":12,"verse":"And I have sent Tychicus to Ephesus."},{"num":13,"verse":"When you come, bring the cloak with you which I left with Carpus at Troas, and the books (especially the parchments)."},{"num":14,"verse":"Alexander, the coppersmith, has done me much evil. May the Lord reward him according to his works."},{"num":15,"verse":"You beware of him also. For he greatly opposes our preaching."},{"num":16,"verse":"At my first defense, no one stood by me. But, all deserted me. May it not be counted against them."},{"num":17,"verse":"But the Lord assisted me and strengthened me; so that by me the preaching might be fully believed, and that all the Gentiles should hear. And I was delivered out of the mouth of the lion."},{"num":18,"verse":"And the Lord will deliver me from every evil work and will preserve me for His Heavenly Kingdom. To Him be praise for ever and ever! Amen."},{"num":19,"verse":"Greet Prisca and Aquila and the household of Onesiphorus."},{"num":20,"verse":"Erastus stayed at Corinth. I left Trophimus at Miletus, sick."},{"num":21,"verse":"Hurry to come before winter. Eubulus greets you, and Pudens, and Linus, and Claudia, and all the brothers."},{"num":22,"verse":"The Lord Jesus Christ be with your Spirit. Grace be with you. Amen."}]