[{"header":"Word about Jerusalem"},{"num":22,"verse":"The special word about the Valley of Visions: What is wrong, that you have all gone up to the house tops, "},{"num":2,"verse":"you who were full of noise, you loud town, you joy-filled city? Your dead were not killed with the sword. They did not die in battle. "},{"num":3,"verse":"All your rulers have run away together, and were taken without using the bow. All of you who were found were taken away together, even though you had run far away. "},{"num":4,"verse":"So I said, “Turn your eyes away from me. Let me cry with much sorrow. Do not try to comfort me about my people being destroyed.” "},{"num":5,"verse":"For the Lord God of All has a day of fear, crushing down, and trouble in the Valley of Vision. There is a breaking down of walls and a crying out to the mountain. "},{"num":6,"verse":"Elam took up the arrows with the war-wagons, soldiers and horsemen. And Kir let the battle-covering be seen. "},{"num":7,"verse":"Your best valleys were full of war-wagons, and the horsemen took their places at the gate. "},{"num":8,"verse":"Then God took away the safe-covering of Judah. In that day you trusted in the objects you had to fight with that were stored in the house among the trees. "},{"num":9,"verse":"You saw that there were many broken places in the wall of the city of David. You stored water in the lower pool. "},{"num":10,"verse":"Then you numbered the houses of Jerusalem, and tore down houses to make the wall stronger. "},{"num":11,"verse":"You made a place to store water between the two walls for the waters of the old pool. But you did not trust in God Who made it. You did not think about Him Who planned it long ago."},{"num":12,"verse":"So in that day the Lord God of All called you to cry in sorrow, to cut off the hair from your head, and to wear cloth made from hair. "},{"num":13,"verse":"But instead, there is joy and happiness, killing of cattle and sheep, eating of meat, and drinking of wine. You say, “Let us eat and drink, for tomorrow we die.” "},{"num":14,"verse":"But the Lord of All has made Himself known to me. The Lord God of All says, “For sure you will not be forgiven for this sin until you die.”"},{"header":"Word about Shebna"},{"num":15,"verse":"The Lord God of All says, “Come, go to this person in Shebna who is taking care of the king’s house. Say to him, "},{"num":16,"verse":"‘What right do you have here? Who told you that you could cut out a grave for yourself here? You cut out a grave on a high place! You cut a resting place for yourself in the rock! "},{"num":17,"verse":"See, the Lord will throw you away without pity, O you strong man. He will take a strong hold of you "},{"num":18,"verse":"and roll you up like a ball to be thrown into a wide land. There you will die, and there your great war-wagons will be. You are a shame to your king’s house.’ "},{"num":19,"verse":"I will throw you out of your place of power. I will take you down from your place. "},{"num":20,"verse":"In that day I will call My servant Eliakim, the son of Hilkiah. "},{"num":21,"verse":"I will clothe him with your coat, and tie your belt around him. I will give him the power you had. He will become a father to the people of Jerusalem and to the family of Judah. "},{"num":22,"verse":"Then I will put on his shoulder the rule of the family of David. What he opens, no one will shut. What he shuts, no one will open. "},{"num":23,"verse":"I will drive him like a nail in a hard place. He will become a throne of honor to his father’s house. "},{"num":24,"verse":"So they will put on him all the honor of his father’s house, and of his children, and every little dish, from the cups to all the jars. "},{"num":25,"verse":"“In that day,” says the Lord of All, “the nail driven in a hard place will give way. It will break off and fall, and the load hanging on it will be cut off. For the Lord has spoken.”"}]