[{"num":22,"verse":"This is God’s message concerning Jerusalem:"},{"num":2,"verse":"The whole city is in terrible uproar. What’s the trouble in this busy, happy city? Bodies! Lying everywhere, slain by plague* and not by sword. "},{"num":3,"verse":"All your leaders flee; they surrender without resistance. The people slip away but they are captured too. "},{"num":4,"verse":"Leave me alone to weep. Don’t try to comfort me—let me cry for my people as I watch them being destroyed. "},{"num":5,"verse":"Oh, what a day of crushing trouble! What a day of confusion and terror from the Lord God of heaven’s armies! The walls of Jerusalem are breached, and the cry of death echoes from the mountainsides. "},{"num":6,"verse":"Elamites are the archers; Syrians drive the chariots; the men of Kir hold up the shields. They fill your choicest valleys and crowd against your gates."},{"num":8,"verse":"God has removed his protecting care. You run to the armory for your weapons! "},{"num":9,"verse":"You inspect the walls of Jerusalem to see what needs repair! You check over the houses and tear some down for stone for fixing walls. Between the city walls, you build a reservoir for water from the lower pool! But all your feverish plans will not avail, for you never ask for help from God, who lets this come upon you. He is the one who planned it long ago. "},{"num":12,"verse":"The Lord God called you to repent, to weep and mourn, to shave your heads in sorrow for your sins, and to wear clothes made of sackcloth to show your remorse. "},{"num":13,"verse":"But instead, you sing and dance and play, and feast and drink. “Let us eat, drink, and be merry,” you say: “What’s the difference, for tomorrow we die.” "},{"num":14,"verse":"The Lord Almighty has revealed to me that this sin will never be forgiven you until the day you die."},{"num":15,"verse":"Furthermore, the same Lord God of the armies of heaven has told me this: Go and say to Shebna, the palace administrator: “And who do you think you are, building this beautiful sepulchre in the rock for yourself? "},{"num":17,"verse":"For the Lord who allowed you to be clothed so gorgeously will hurl you away, sending you into captivity, O strong man! "},{"num":18,"verse":"He will wad you up in his hands like a ball and toss you away into a distant, barren land; there you will die, O glorious one—you who disgrace your nation!"},{"num":19,"verse":"“Yes, I will drive you out of office,” says the Lord, “and pull you down from your high position. "},{"num":20,"verse":"And then I will call my servant Eliakim, the son of Hilkiah, to replace you. "},{"num":21,"verse":"He shall have your uniform and title and authority, and he will be a father to the people of Jerusalem and all Judah. "},{"num":22,"verse":"I will give him responsibility over all my people; whatever he says will be done; none will be able to stop him. "},{"num":23,"verse":"I will make of him a strong and steady peg to support my people; they will load him with responsibility, and he will be an honor to his family name.” "},{"num":25,"verse":"But the Lord will pull out that other peg that seems to be so firmly fastened to the wall! It will come out and fall to the ground, and everything it supports will fall with it, for the Lord has spoken."}]