[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:21-36 Having stated his distress and temptation, the prophet shows how he was raised above it. Bad as things are, it is owing to the mercy of God that they are not worse. We should observe what makes for us, as well as what is against us. God's compassions fail not; of this we have fresh instances every morning. Portions on earth are perishing things, but God is a portion for ever. It is our duty, and will be our comfort and satisfaction, to hope and quietly to wait for the salvation of the Lord. Afflictions do and will work very much for good: many have found it good to bear this yoke in their youth; it has made many humble and serious, and has weaned them from the world, who otherwise would have been proud and unruly. If tribulation work patience, that patience will work experience, and that experience a hope that makes not ashamed. Due thoughts of the evil of sin, and of our own sinfulness, will convince us that it is of the Lord's mercies we are not consumed. If we cannot say with unwavering voice, The Lord is my portion; may we not say, I desire to have Him for my portion and salvation, and in his word do I hope? Happy shall we be, if we learn to receive affliction as laid upon us by the hand of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Neither does God approve of wanton cruelty inflicted by one man on another. Three examples are given: the treatment of prisoners of war; the procuring an unjust sentence before a legal tribunal acting in the name of God (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and the perversion of justice generally. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "36. subvert—to wrong.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mem.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Here are three things mentioned, of all which it is said that God ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "approveth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " them ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " neither all, nor any of them. The first is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to crush the prisoners of the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": he hath power to crush all men in the world, they are his prisoners, and cannot flee from him, but he delighteth not in it. Some think it spoken with special reference to the Jews, who now were all captives. A second thing which it is said God approveth not is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "turning away the right of a man before the face of the Most High",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Most High",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " understand God, and make the sense to be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the sight of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Others think that a superior magistrate is understood, who, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 5:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 5:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "highest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that seemeth the most probable sense. The turning away the right of a man before them, signifieth the use of any arts to deprive them of their just right by misrepresenting their cause, aspersing their persons, &c. The third thing mentioned is, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "subverting",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a man in his cause, either by art and rhetoric, making it to appear bad when it is not so, or by mere will and power, overruling it contrary to right and justice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To subvert a man in his cause,.... A poor man, as the Targum, which aggravates it; as by courses and methods taken in an open court, so by secret underhand ways, to get the cause from him, and injure him in his property: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord approveth not; or, \"seeth not\" (g); which some understand as spoken by wicked men, who do the above things, and flatter themselves that God sees not, and takes no notice of them, Ezekiel 9:9; and others read it interrogatively, \"doth not the Lord see?\" (h) he does; he sees all the actions of men, nothing is hid from him; but he sees not with approbation; he do not look upon such things with delight and pleasure, but with abhorrence, Habakkuk 1:13. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the Lord approveth not; or, \"seeth not\" (g); which some understand as spoken by wicked men, who do the above things, and flatter themselves that God sees not, and takes no notice of them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and others read it interrogatively, \"doth not the Lord see?\" (h) he does; he sees all the actions of men, nothing is hid from him; but he sees not with approbation; he do not look upon such things with delight and pleasure, but with abhorrence, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"is it possible that it should not be revealed before the Lord?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g)  \"non vidit, vel videt\", Pagninus, Montanus, Calvin. (h) \"Non videret?\" Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(g)  \"non vidit, vel videt\", Pagninus, Montanus, Calvin. (h) \"Non videret?\" Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "To subvert a man in his cause, the Lord {q} approveth not.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To subvert a man in his cause, the Lord ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " approveth not.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) He does not delight in it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 36.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Approveth not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sense is an excellent one, but it is very doubtful whether it can be obtained without altering one of the letters of the word in the text (reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "racah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ra'ah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The text reading is, \"the Lord seeth not.\" This may be explained either as \"the Lord regardeth not (such thing),\" or as a question, \"Doth not the Lord regard (this)?\" Lamentations 3:36",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These verses form one connected sentence: while the subject and predicate for the three infinitival clauses do not follow till the words אדני לא ראה, the infinitives with their objects depend on ראה. If there were any foundation for the assertion of Bttcher in his Aehrenlese, that ראה never occurs in construction with ל, we could take the infinitives with ל as the objects of ראה, in the sense, \"As to the crushing of all the prisoners,\" etc. But the assertion is devoid of truth, and disproved by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", האדם יראה לעינים ויהוה יראה. In the three infinitival clauses three modes of unjust dealing are set forth. The treading down to the earth of all prisoners under his (the treader's) feet, refers to cruel treatment of the Jews by the Chaldeans at the taking of Jerusalem and Judah, and generally to deeds of violence perpetrated by victors in war. This explains כּל, which Kalkschmidt and Thenius incorrectly render \"all captives of the land (country).\" Those intended are prisoners generally, who in time of war are trodden down to the earth, i.e., cruelly treated. The other two crimes mentioned, vv. 35 and 36, are among the sins of which Judah and Israel have been guilty, - the former being an offence against the proper administration of justice, and the latter falling under the category of unjust practices in the intercourse of ordinary life. \"To pervert the right of a man before the face of the Most High\" does not mean, in general, proterve, et sine ull numinis inspectantis reverenti (C. B. Michaelis, Rosenmller); but just as הטות משׁפּט is taken from the law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), so also is נגד פּני עליון to be explained in accordance with the directions given in the law (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that certain clauses were to be brought before האלהים, where this word means the judge or judges pronouncing sentence in the name of God; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 82:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the judges, as God's representatives, are called אלהים and בּני אלהים. \"Before the face of the Most High\" thus means, before the tribunal which is held in the name of the Most High. \"To turn aside a man in his cause\" means to pervert his right in a dispute (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 34:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), which may also be done in contested matters that do not come before the public tribunal. The meaning of the three verses depends on the explanation given of אדני לא ראה, which is a disputed point. ראה with ל, \"to look on something,\" may mean to care for it, be concerned about it, but not to select, choose, or to resolve upon, approve (Michaelis, Ewald, Thenius). Nor can the prophet mean to say, \"The Lord does not look upon the treading down of the prisoners, the perversion of justice.\" If any one be still inclined, with Rosenmller and others, to view the words as the expression of a fact, then he must consider them as an exception taken by those who murmur against God, but repelled in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Moreover, he must, in some such way as the following, show the connection between ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by carrying out the idea presented in the exhortation to hope for compassion: \"But will any one say that the Lord knows nothing of this - does not trouble Himself about such sufferings?\" Whereupon, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the answer follows: \"On the contrary, nothing happens without the will of God\" (Gerlach). But there is no point of attachment that can possibly be found in the words of the text for showing such a connection; we must therefore reject this view as being artificial, and forced upon the text. The difficulty is solved in a simple manner, by taking the words אדני לא  as a question, just as has been already done in the Chaldee paraphrase: fierine potest ut in conspectu Jovae non reveletur? The absence of the interrogative particle forms no objection to this, inasmuch as a question is pretty often indicated merely by the tone. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must also be taken interrogatively. Bצttcher and Thenius, indeed, think that the perfect ראה is incompatible with this; but the objection merely tells against the rendering, \"Should not the Lord see it?\" (De Wette, Maurer, Kalkschmidt), which of course would require יראה. But the idea rather is, \"Hath not the Lord looked upon this?\" The various acts of injustice mentioned in the three verses are not set forth merely as possible events, but as facts that have actually occurred.",
        "children": []
      }
    ]
  }
]