[{"num":25,"verse":"Amaziah was twenty-five years old when he began to reign, and he reigned twenty-nine years in Jerusalem. His mother was Jehoaddan of Jerusalem."},{"num":2,"verse":"He did right in the Lord’s sight, but not with a perfect or blameless heart."},{"num":3,"verse":"When his kingdom was firmly established, he slew his servants who had killed the king his father."},{"num":4,"verse":"But he did not slay their children; he did as it is written in the Law, in the Book of Moses, where the Lord commanded, The fathers shall not die for the children, or the children die for the fathers; but every man shall die for his own sin."},{"num":5,"verse":"Amaziah assembled the men of Judah and set them by fathers’ houses under commanders of thousands and of hundreds for all Judah and Benjamin. He numbered them from twenty years old and over and found them to be 300,000 choice men fit for war and able to handle spear and shield."},{"num":6,"verse":"He hired also 100,000 mighty men of valor from Israel for 100 talents of silver."},{"num":7,"verse":"But a man of God came to him, saying, O king, do not let all this army of Ephraimites of Israel go with you [of Judah], for the Lord is not with you,"},{"num":8,"verse":"For if you go [in spite of warning], no matter how strong you are for battle, God will cast you down before the enemy, for God has power to help and to cast down."},{"num":9,"verse":"And Amaziah said to the man of God, But what shall we do about the 100 talents which I have given to the army of Israel? The man of God answered, The Lord is able to give you much more than this."},{"num":10,"verse":"So Amaziah discharged the army that came to him from Ephraim to go home. So their anger was greatly kindled against Judah; they returned home in fierce wrath."},{"num":11,"verse":"And Amaziah took courage and led forth his people to the Valley of Salt and smote 10,000 of the men of Seir [Edom]."},{"num":12,"verse":"Another 10,000 the men of Judah captured alive and brought them to the top of a crag and cast them down from it, and they were all dashed to pieces."},{"num":13,"verse":"But the soldiers of the band which Amaziah sent back, not allowing them to go with him to battle, fell upon the cities of Judah, from Samaria even to Beth-horon, and smote 3,000 [men] and took much spoil."},{"num":14,"verse":"After Amaziah came back from the slaughter of the Edomites, he brought their gods and set them up to be his gods and bowed before them and burned incense to them."},{"num":15,"verse":"So the anger of the Lord was kindled against Amaziah, and He sent to him a prophet, who said, Why have you sought after the gods of the people, which could not deliver their own people out of your hand?"},{"num":16,"verse":"As he was talking, the king said to him, Have we made you the king’s counselor? Stop it! Why should you be put to death? The prophet stopped but said, I know that God has determined to destroy you, because you have done this and ignored my counsel."},{"num":17,"verse":"Then Amaziah king of Judah took counsel and sent to Jehoash son of Jehoahaz, the son of Jehu, king of Israel, saying, Come [to battle], let us look one another in the face."},{"num":18,"verse":"Jehoash king of Israel sent to Amaziah king of Judah, saying, A little thistle in Lebanon sent to a great cedar in Lebanon, saying, Give your daughter to my son as wife. And a wild beast of Lebanon passed by and trampled down the thistle."},{"num":19,"verse":"You say, See, [I] have smitten Edom! Your heart lifts you up to boast. Stay at home; why should you meddle [and court disaster], so you will fall and Judah with you?"},{"num":20,"verse":"But Amaziah would not hear, for it came from God, that He might deliver Judah into the hands of their enemies, because they sought after the gods of Edom."},{"num":21,"verse":"So Jehoash king of Israel went up; and he and Amaziah king of Judah faced one another at Beth-shemesh of Judah."},{"num":22,"verse":"And Judah was defeated before Israel, and they fled every man to his tent."},{"num":23,"verse":"And Jehoash king of Israel took Amaziah king of Judah, the son of Joash, the son of Jehoahaz, at Beth-shemesh and brought him to Jerusalem and broke down the wall of Jerusalem from the Ephraim Gate to the Corner Gate, 400 cubits."},{"num":24,"verse":"And he took all the gold, the silver, and all the vessels found in God’s house with [the doorkeeper] Obed-edom, and the treasures of the king’s house and hostages also, and returned to Samaria."},{"num":25,"verse":"And Amaziah son of Joash king of Judah lived after the death of Jehoash son of Jehoahaz king of Israel fifteen years."},{"num":26,"verse":"The rest of the acts of Amaziah, from first to last, are they not written in the Book of the Kings of Judah and Israel?"},{"num":27,"verse":"Now after Amaziah turned away from the Lord, they made a conspiracy against him in Jerusalem, and he fled to Lachish. But they sent to Lachish and slew him there."},{"num":28,"verse":"And they brought him upon horses and buried him with his fathers in the City of [David in] Judah."}]