[{"num":25,"verse":"Amatzyahu was twenty-five years old when he began his reign, and he ruled for twenty-nine years in Yerushalayim. His mother’s name was Y’ho‘adan, from Yerushalayim. "},{"num":2,"verse":"He did what was right from Adonai’s perspective, but not wholeheartedly."},{"num":3,"verse":"As soon as he had the kingdom firmly in his control, he put to death the servants of his who had assassinated the king his father. "},{"num":4,"verse":"But he did not put their children to death; rather, he acted according to what is written in the Torah, in the scroll of Moshe, as Adonai ordered when he said, “Fathers are not to die for the children, nor are the children to die for the fathers; every person will die for his own sin.”"},{"num":5,"verse":"Amatzyahu assembled Y’hudah together and put them in order by clans under captains of thousands and captains of hundreds — all Y’hudah and Binyamin. He registered everyone twenty years old and older, and found that there were 300,000 select troops able to go to war, capable of using spears and shields. "},{"num":6,"verse":"He also hired 100,000 strong, brave men from Isra’el for three-and-a-third tons of silver. "},{"num":7,"verse":"But a man of God came to him and said, “King, don’t let the army of Isra’el go with you; because Adonai is not with Isra’el or with any of the people of Efrayim. "},{"num":8,"verse":"And if you do go, then no matter how fiercely you fight, God will cause you to fail before the enemy. For God has the power to help and to cause failure.” "},{"num":9,"verse":"Amatzyahu said to the man of God, “But what do we do about the three-and-a-third tons [of silver] I paid for Isra’el’s army?” The man of God answered, “Adonai can give you far more than that!” "},{"num":10,"verse":"Then Amatzyahu separated out the battalion that had come to him from Efrayim and told them to go back home — which made their anger burn hotly against Y’hudah, and they returned home enraged."},{"num":11,"verse":"Amatzyahu took courage, led his people out and went to the Salt Valley, where he killed 10,000 of the people of Se‘ir. "},{"num":12,"verse":"The people of Y’hudah took another 10,000 away alive, brought them to the top of the Rock and threw them off the top of the Rock, so that they were all dashed to pieces."},{"num":13,"verse":"Meanwhile, the men in the army that Amatzyahu had sent back and hadn’t allowed to join him in battle fell on the cities of Y’hudah, all the way from Shomron to Beit-Horon, killed 3,000 of them and took much spoil."},{"num":14,"verse":"After Amatzyahu returned from the slaughter of the people from Edom, he brought the gods of the people of Se‘ir and set them up as his own gods, prostrating himself before them and offering incense to them. "},{"num":15,"verse":"As a result, the anger of Adonai blazed up against Amatzyah, and he sent him a prophet, who said to him, “Why have you sought out the gods of those people, when they couldn’t even rescue their own people from you?” "},{"num":16,"verse":"But as [the prophet] was speaking to him, he interrupted him: “Were you made an adviser to the king? You had better stop before you get yourself killed!” So the prophet stopped, but he added, “I know that God is planning to destroy you for having done this and for refusing to listen to my advice.”"},{"num":17,"verse":"Then, after taking counsel, Amatzyah king of Y’hudah sent a challenge to Yo’ash the son of Y’ho’achaz, the son of Yehu, king of Isra’el: “Come on, let’s have it out face-to-face.” "},{"num":18,"verse":"Yo’ash the king of Isra’el sent this reply to Amatzyah king of Y’hudah: “Once, in the L’vanon, the thistle sent a message to the cedar: ‘Give your daughter to my son in marriage.’ But a wild animal passed by the thistle and squashed it. "},{"num":19,"verse":"You say you defeated Edom, which is true; so you’re excited and itching for more glory. But now, stay home! Why provoke calamity, to your own ruin, yours and Y’hudah’s too?” "},{"num":20,"verse":"But Amatzyah wouldn’t listen. And this was from God, so that he could hand them over [to their enemies], because they had sought the gods of Edom. "},{"num":21,"verse":"So Yo’ash king of Isra’el went up; and he and Amatzyah king of Y’hudah had it out face-to-face at Beit-Shemesh, which belongs to Y’hudah. "},{"num":22,"verse":"Y’hudah was defeated by Isra’el, and every man fled to his tent. "},{"num":23,"verse":"Yo’ash king of Isra’el took Amatzyah king of Y’hudah, the son of Yo’ash the son of Y’ho’achaz, prisoner at Beit-Shemesh. Then he brought him to Yerushalayim and demolished the wall of Yerushalayim between the Gate of Efrayim and the Corner Gate, a section 600 feet long. "},{"num":24,"verse":"[He took] all the gold and silver, all the articles he could find in the house of God, with ‘Oved-Edom, and the treasures of the royal palace, together with hostages; then he returned to Shomron."},{"num":25,"verse":"Amatzyahu the son of Yo’ash, king of Y’hudah, lived another fifteen years after the death of Yo’ash son of Y’ho’achaz king of Isra’el. "},{"num":26,"verse":"Other activities of Amatzyah, from beginning to end, are recorded in the Annals of the Kings of Y’hudah and Isra’el."},{"num":27,"verse":"From the time that Amatzyahu turned away from following Adonai, they formed a conspiracy against him in Yerushalayim. So he fled to Lakhish; but they followed him to Lakhish and killed him there. "},{"num":28,"verse":"They brought his body back on horses and buried him with his ancestors in the City of Y’hudah."}]