[{"header":"Amaziah King of Judah"},{"num":25,"verse":"Amaziah was twenty-five years old when he became king, and he ruled for twenty-nine years in Jerusalem. His mother’s name was Jehoaddin, and she was from Jerusalem. "},{"num":2,"verse":"Amaziah did what the Lord said was right, but he did not really want to obey him. "},{"num":3,"verse":"As soon as Amaziah took strong control of the kingdom, he executed the officers who had murdered his father the king. "},{"num":4,"verse":"But Amaziah did not put to death their children. He obeyed what was written in the Book of Moses, where the Lord commanded, “Parents must not be put to death when their children do wrong, and children must not be put to death when their parents do wrong. Each must die for his own sins.”"},{"num":5,"verse":"Amaziah gathered the people of Judah together. He grouped all the people of Judah and Benjamin by families, and he put commanders over groups of a thousand and over groups of a hundred. He counted the men who were twenty years old and older. In all there were three hundred thousand soldiers ready to fight and skilled with spears and shields. "},{"num":6,"verse":"Amaziah also hired one hundred thousand soldiers from Israel for about seventy-five hundred pounds of silver. "},{"num":7,"verse":"But a man of God came to Amaziah and said, “My king, don’t let the army of Israel go with you. The Lord is not with Israel or the people from the tribe of Ephraim. "},{"num":8,"verse":"You can make yourself strong for war, but God will defeat you. He has the power to help you or to defeat you.”"},{"num":9,"verse":"Amaziah said to the man of God, “But what about the seventy-five hundred pounds of silver I paid to the Israelite army?”"},{"num":10,"verse":"So Amaziah sent the Israelite army back home to Ephraim. They were very angry with the people of Judah and went home angry."},{"num":11,"verse":"Then Amaziah became very brave and led his army to the Valley of Salt in the country of Edom. There Amaziah’s army killed ten thousand Edomites. "},{"num":12,"verse":"The army of Judah also captured ten thousand and took them to the top of a cliff and threw them off so that they split open."},{"num":13,"verse":"At the same time the Israelite troops that Amaziah had not let fight in the war were robbing towns in Judah. From Samaria to Beth Horon they killed three thousand people and took many valuable things."},{"num":14,"verse":"When Amaziah came home after defeating the Edomites, he brought back the idols they worshiped and started to worship them himself. He bowed down to them and offered sacrifices to them. "},{"num":15,"verse":"The Lord was very angry with Amaziah, so he sent a prophet to him who said, “Why have you asked their gods for help? They could not even save their own people from you!”"},{"num":16,"verse":"As the prophet spoke, Amaziah said to him, “We never gave you the job of advising the king. Stop, or you will be killed.”"},{"num":17,"verse":"Amaziah king of Judah talked with those who advised him. Then he sent a message to Jehoash son of Jehoahaz, who was the son of Jehu king of Israel. Amaziah said to Jehoash, “Come, let’s meet face to face.”"},{"num":18,"verse":"Then Jehoash king of Israel answered Amaziah king of Judah, “A thornbush in Lebanon sent a message to a cedar tree in Lebanon. It said, ‘Let your daughter marry my son.’ But then a wild animal from Lebanon came by, walking on and crushing the thornbush. "},{"num":19,"verse":"You say to yourself that you have defeated Edom, but you have become proud, and you brag. But you stay at home! Don’t ask for trouble, or you and Judah will be defeated.”"},{"num":20,"verse":"But Amaziah would not listen. God caused this to happen so that Jehoash would defeat Judah, because Judah asked for help from the gods of Edom. "},{"num":21,"verse":"So Jehoash king of Israel went to attack. He and Amaziah king of Judah faced each other in battle at Beth Shemesh in Judah. "},{"num":22,"verse":"Israel defeated Judah, and every man of Judah ran away to his home. "},{"num":23,"verse":"At Beth Shemesh Jehoash king of Israel captured Amaziah king of Judah. (Amaziah was the son of Joash, who was the son of Ahaziah.) Then Jehoash brought him to Jerusalem. Jehoash broke down the wall of Jerusalem, from the Gate of Ephraim to the Corner Gate, about six hundred feet. "},{"num":24,"verse":"He took all the gold and silver and all the utensils from the Temple of God that Obed-Edom had taken care of. He also took the treasures from the palace and some hostages. Then he returned to Samaria."},{"num":25,"verse":"Amaziah son of Joash, the king of Judah, lived fifteen years after the death of Jehoash son of Jehoahaz, the king of Israel. "},{"num":26,"verse":"The other things Amaziah did as king, from the beginning to the end, are written in the book of the kings of Judah and Israel. "},{"num":27,"verse":"When Amaziah stopped obeying the Lord, the people in Jerusalem made plans against him. So he ran away to the town of Lachish, but they sent men after him to Lachish and killed him. "},{"num":28,"verse":"They brought his body back on horses, and he was buried with his ancestors in Jerusalem, the city of David."}]