[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(51) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The things which David his father had dedicated.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—For the account of the dedication of various treasures, by David and by the princes of Israel, for the House of the Lord, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 18:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 18:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 22:3-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 22:14-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 28:14-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 29:2-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The accumulation was enormous. It had evidently been the work of years to gather it out of the spoils of many victories, offered in that spirit of thankful devotion which is expressed in David’s own words: “Both riches and honour come of thee . . . and of thine own have we given unto thee” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The words used in the text seem to indicate that besides the vessels of gold, silver, and brass, gold and silver, in money or in ingots, were brought into the sacred treasury.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 7:51",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Solomon brought in the things which David his father had dedicated — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The silver and gold, and other things which David had provided for erecting this temple, and which had not been expended in the house itself, or its furniture, Solomon laid up in the treasury belonging to it, for repairs, exigences, and the constant charge of the temple-service. Although this splendid edifice had cost him immense sums, besides what David had prepared for building it, he would not repay himself in any degree by diverting from their intended purpose, and transferring to his own secular use, these devoted, or, as they are termed in the margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy things of David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“What parents have dedicated to God,” says Henry, here, “the children ought by no means to alienate or recall; but cheerfully confirm what was intended for pious and charitable uses, that they may with their estates inherit the blessing.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the vessels did he put among",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the treasures of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — With those which David had dedicated, he laid up the altar of Moses, and some other of the old utensils which belonged to the tabernacle, as being of no further use, far better being provided in their room. Indeed, the tabernacle itself was thus laid up, for which, as the temple was now built, there was no further occasion; and yet it was proper to preserve the parts of so sacred a structure, which had been formed, in all respects, by divine direction, and had long been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy to the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So was ended all the work — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“Concerning this temple, we may observe, upon the whole, that the glory of it did not consist in its bulk or largeness, (for in itself it was but a small pile of building, no more than one hundred and fifty feet in length, and one hundred and five in breadth, taking the whole together, and is exceeded by many of our parish churches,) but its chief grandeur and excellence lay in its out-buildings and ornaments, in its workmanship, which was everywhere very curious, and in its overlayings, which were vast and prodigious. The overlaying of the holy of holies only, which was a room but thirty feet square and twenty high, amounted to six hundred talents of gold, which comes to four millions three hundred and twenty thousand pounds of our sterling money. ‘The whole frame,’ says Josephus, ‘was raised upon stones, polished to the highest degree of perfection, and so artificially put together, that there was no joint to be discerned, no sign of any working-tools having been upon them, but the whole looked more like the work of providence and nature, than the product of art and human invention. And as for the inside, what carving, gilding, embroidery, rich silks, and fine linen could do, of these there was the greatest profusion. The very floor of the temple was overlaid with beaten gold; the doors were large, and proportioned to the height of the walls, twenty cubits broad, and still gold upon gold.’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Antiq., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "lib. 8. chap. 2. In a word, it was gold all over, and nothing was wanting, either within or without, that might contribute to the glory and magnificence of the work.” — Dr. Dodd. Some have intimated, that one principal reason why Solomon bestowed all this outward splendour and glory on the temple of the one living and true God, probably was that he might keep the people from idolatry, knowing how much they were taken with such things. Certainly none of the idol temples were to be compared to it for riches and magnificence. Indeed, there was nothing like it in the whole world. But if this were any part of his design, the event showed how far it was from being answered thereby, and how little the expedient availed. Multitudes of the Israelites, and those not only of the more distant tribes, but even of the tribe of Judah itself, in the very midst of whom this most splendid and sumptuous fabric stood, soon relapsed into that most unreasonable and stupid of all sins. Nearly the whole Hebrew nation, even, became idolatrous. Nay, what is more astonishing, Solomon himself, who erected this most costly and superb edifice, was drawn away from the worship of that God to whose honour he had raised it, and was ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "turned in his heart after other gods, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so true it is, that nothing merely external, whether in the place or ceremonies of God’s worship, however sumptuous or dazzling, can engage or secure the attachment of fallen man to him and his service. An acquaintance with his spiritual and holy nature and infinite perfections, and his love shed abroad in our hearts by the Holy Ghost given unto us, can only effect this; which blessings if we would receive and retain, we must ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "keep our hearts with all diligence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and not suffer their desires to wander after vain things, which cannot profit. Had Solomon continued to attend to this, his own advice, the glory of his youth would not have suffered so dreadful an eclipse in his declining years; but the bright example of his wisdom and piety would have continued to shine with undiminished, nay, with increasing lustre, to the credit of the true religion, and the edification of millions, while he himself, in soul and body would have remained a temple of the living God, a habitation of Jehovah through the Spirit, a fabric unspeakably more glorious than that which, with such immense expense of treasure, time, and labour, he had erected in Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:48-51 Christ is now the Temple and the Builder; the Altar and the Sacrifice; the Light of our souls, and the Bread of life; able to supply all the wants of all that have applied or shall apply to him. Outward images cannot represent, words cannot express, the heart cannot conceive, his preciousness or his love. Let us come to him, and wash away our sins in his blood; let us seek for the purifying grace of his Spirit; let us maintain communion with the Father through his intercession, and yield up ourselves and all we have to his service. Being strengthened by him, we shall be accepted, useful, and happy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The things which David had dedicated - Not only the things described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 28:14-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but also the spoil of the nations which he had subdued (margin reference), and also the vessels of gold, silver, and brass, sent him by Toi king of Hamath, on his victory over Hadadezer. Solomon now brought these into the temple treasury. A sacred treasury had been established at least as early as the time of Saul, to which Saul himself, Abner, Joab, and others, had contributed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 26:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49. candlesticks of pure gold—made, probably, according to the model of that in the tabernacle, which, along with the other articles of furniture, were deposited with due honor, as sacred relics, in the temple. But these seem not to have been used in the temple service; for Solomon made new lavers, tables, and candlesticks, ten of each. (See further regarding the dimensions and furniture of the temple, in 2Ch 3:1-5:14).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The silver and the gold; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, first, all of it; and so Solomon built it wholly at his own charge; or, secondly, so much of it its was left. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The vessels; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those which David had dedicated, and with them the altar of Moses, and some other of the old utensils which were now laid aside, far better being put in the room of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So was ended all the work that King Solomon made for the house of the Lord,.... Which he ordered to be made to be put into it, either for the ornament of it, or for the use and service of it; all was completely finished in the space of seven years: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Solomon had brought in the things which David his father had dedicated; had laid up for, and devoted to the building of the temple, and for the service of it; not all, but what was left; what was over and above there was a need of; though the Jews commonly say, that he made use of none of his father's, but built it and furnished it at his own expense; for which reason he did not begin to build as soon as he came to the throne, they suppose, but waited four years, until he had laid up a sufficiency of his own to defray the expense of it; but it is certain he made use of the brass his father reserved for this work, see 1 Chronicles 18:8 and which, perhaps it may be said, is the reason it is not mentioned here as laid up: even the silver, and the gold, and the vessels, did he put among the treasures of the house of the Lord; he did not convert them to his own use, but laid them up in the treasury of the sanctuary, for the purchase of sacrifices, the repair of the house in future times, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Solomon had brought in the things which David his father had dedicated; had laid up for, and devoted to the building of the temple, and for the service of it; not all, but what was left; what was over and above there was a need of; though the Jews commonly say, that he made use of none of his father's, but built it and furnished it at his own expense; for which reason he did not begin to build as soon as he came to the throne, they suppose, but waited four years, until he had laid up a sufficiency of his own to defray the expense of it; but it is certain he made use of the brass his father reserved for this work, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 18:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and which, perhaps it may be said, is the reason it is not mentioned here as laid up: even the silver, and the gold, and the vessels, did he put among the treasures of the house of the Lord; he did not convert them to his own use, but laid them up in the treasury of the sanctuary, for the purchase of sacrifices, the repair of the house in future times, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So was ended all the work that king Solomon made for the house of the LORD. And Solomon brought in the things which David his father had dedicated; even the silver, and the gold, and the vessels, did he put among the treasures of the house of the LORD.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So was ended",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The changes of order and words in this verse made by R.V. (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "viz",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thus all the work that king Solomon wrought in the house of the Lord was finished",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) are such as to bring as nearly as possible this passage and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into accord. Where the Hebrew words are the same there seems a gain in representing them in such a recital as the present by the same translation. On ‘in the house of the Lord,’ cf. above on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 7:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among the treasures",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘in the treasuries.’",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The word is used rather of the place than of the things kept in it. Thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is rendered ‘garners,’ and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘storehouses,’ and two verses later in the same chapter ‘cellars’ for wine. It is noteworthy that in Kings nothing is said of the treasures amassed by David, while in Chronicles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 29:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") they are dwelt on at some length.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 51.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So was ended all the work that king Solomon made for the house of the Lord. And Solomon brought in the things which David his father had dedicated",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [marg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "holy things of David",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 8:8, 10, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 22:3, 14, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 28:14-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Cf. 26:26-28]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "even the surer, and the gold, and the vessels, did he put among the treasures of the house of the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [So that all the store of precious metal and the brass that David had prepared was not absorbed in the decoration and furniture of the temple. There would seem to have been a considerable overplus, which was stored in the temple treasury.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1 Kings 7:51",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The פּתות were also of gold, possibly of inferior quality. These were either the hinges of the doors, or more probably the sockets, in which the pegs of the doors turned. They were provided for the doors of the inner temple, viz., the Holy Place and the Most Holy Place. We must supply Vv before לדלתי.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All the vessels mentioned in 1 Kings 7:48, 1 Kings 7:49 belonged to the Holy Place of the temple, and were the same as those in the tabernacle; so that the remarks made in the Comm. on Exodus 25:30, Exodus 25:39, and Exodus 30:1-10, as to their purpose and signification, apply to them as well. Only the number of the tables and candlesticks was ten times greater. If a multiplication of the number of these two vessels appeared appropriate on account of the increases in the size of the room, the number was fixed at ten, to express the idea of completeness by that number. No new vessel was made for the Most Holy Place, because the Mosaic ark of the covenant was placed therein (1 Kings 8:4 : compare the remarks on this at Exodus 25:10-22). - The account of the vessels of the temple is brought to a close in 1 Kings 7:51 : \"So was ended all the work that king Solomon made in the house of the Lord; and Solomon brought all that was consecrated by his father, (namely) the silver and the gold (which were not wrought), and the vessels he placed in the treasuries of the house of Jehovah.\" As so much gold and brass had already been expended upon the building, it might appear strange that Solomon should not have used up all the treasures collected by his father, but should still be able to bring a large portion of it into the treasuries of the temple. But according to 1 Chronicles 22:14, 1 Chronicles 22:16, and 1 Chronicles 29:2., David had collected together an almost incalculable amount of gold, silver, and brass, and had also added his own private treasure and the freewill offerings of the leading men of the nation (1 Chronicles 29:7-9). Solomon was also able to devote to the building of the temple a considerable portion of his own very large revenues (cf. 1 Kings 10:14), so that a respectable remnant might still be left of the treasure of the sanctuary, which was not first established by David, but had been commenced by Samuel and Saul, and in which David's generals, Joab and others, had deposited a portion of the gold and silver that they had taken as booty (1 Chronicles 26:20-28). For it is evident that not a little had found its way into this treasure through the successful wars of David, from the fact that golden shields were taken from the generals of Hadadezer, and that these were consecrated to the Lord along with the silver, golden, and brazen vessels offered as gifts of homage by king Toi of Hamath, in addition to the gold and silver which David had consecrated from the defeated Syrians, Moabites, Ammonites, Philistines, and Amalekites (2 Samuel 8:7, 2 Samuel 8:11-12; 1 Chronicles 18:7, 1 Chronicles 18:10-11).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All the vessels mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:49",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " belonged to the Holy Place of the temple, and were the same as those in the tabernacle; so that the remarks made in the Comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 25:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 25:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:1-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as to their purpose and signification, apply to them as well. Only the number of the tables and candlesticks was ten times greater. If a multiplication of the number of these two vessels appeared appropriate on account of the increases in the size of the room, the number was fixed at ten, to express the idea of completeness by that number. No new vessel was made for the Most Holy Place, because the Mosaic ark of the covenant was placed therein (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : compare the remarks on this at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 25:10-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). - The account of the vessels of the temple is brought to a close in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 7:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"So was ended all the work that king Solomon made in the house of the Lord; and Solomon brought all that was consecrated by his father, (namely) the silver and the gold (which were not wrought), and the vessels he placed in the treasuries of the house of Jehovah.\" As so much gold and brass had already been expended upon the building, it might appear strange that Solomon should not have used up all the treasures collected by his father, but should still be able to bring a large portion of it into the treasuries of the temple. But according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., David had collected together an almost incalculable amount of gold, silver, and brass, and had also added his own private treasure and the freewill offerings of the leading men of the nation (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:7-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Solomon was also able to devote to the building of the temple a considerable portion of his own very large revenues (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so that a respectable remnant might still be left of the treasure of the sanctuary, which was not first established by David, but had been commenced by Samuel and Saul, and in which David's generals, Joab and others, had deposited a portion of the gold and silver that they had taken as booty (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 26:20-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For it is evident that not a little had found its way into this treasure through the successful wars of David, from the fact that golden shields were taken from the generals of Hadadezer, and that these were consecrated to the Lord along with the silver, golden, and brazen vessels offered as gifts of homage by king Toi of Hamath, in addition to the gold and silver which David had consecrated from the defeated Syrians, Moabites, Ammonites, Philistines, and Amalekites (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 8:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 18:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 18:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The amazing extent to which this booty may possibly have reached, may be inferred from the accounts we have concerning the quantity of the precious metals in Syria in the Macedonian age. In the gaza regia of Damascus, Alexander found 2600 talents of gold and 600 talents of uncoined silver (Curt. iii. 13, 16, cf. Arrian, ii. 11, 10). In the temple of Jupiter at Antioch there was a statue of this god of solid silver fifteen cubits high (Justin, xxxix. 2, 5. 6); and in the temple at Hierapolis there was also a golden statue (Lucian, de Dea Syr. 31). According to Appian (Parth. 28, ed. Schweigh.), this temple was so full of wealth, that Crassus spent several days weighing the vessels of silver and gold. And from the unanimous testimony of the ancients, the treasures of the palaces and temples of Asia in the earlier times were greater still. Of the many accounts which Bhr (Symbolik, i. p. 258ff.) and Movers (Phnizier, ii. 3, p. 40ff.) have collected together on this subject, we will mention only a few here, the credibility of which cannot be disputed. According to Varro (in Plin. 33:15), Cyrus had taken 34,000 pounds of gold as booty after the conquest of Asia, beside the gold wrought into vessels and ornaments, and 500,000 talents of silver. In Susa, Alexander took 40,000, or, according to other accounts, 50,000, talents from the royal treasury; or, as it is still more definitely stated, 40,000 talents of uncoined gold and silver, and 9000 talents of coined dariks. Alexander had these brought to Ecbatana, where he accumulated 180,000 talents. Antigonus afterwards found in Susa 15,000 talents more in vessels and wrought gold and silver. In Persepolis, Alexander took 120,000 talents, and in Pasargada 6000 talents. For the proofs, see Movers, pp. 42, 43.) ",
        "children": []
      }
    ]
  }
]