[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So Jotham became mighty.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The chronicler’s customary phrase. “Strengthened himself,” “gained strength” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 13:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because he prepared.—For he directed his ways (Proverbs 21:29; comp. also 2Chronicles 12:14; 2Chronicles 20:33). Jotham directed his ways “before,” i.e., in the chronicler’s usage, “to meet,” “towards” Jehovah his God. (Comp. 1Chronicles 12:17; 1Samuel 7:3.) “Direct your heart towards Jehovah.” Perhaps, however, “before” simply means “as in the sight of” Jehovah. (Comp. Genesis 17:1, “walk before me.”)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Because he prepared.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "For he directed his",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ways",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 21:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; comp. also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 20:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Jotham directed his ways “before,” ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the chronicler’s usage, “to meet,” “towards” Jehovah his God. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Chronicles 12:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 7:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) “Direct your heart towards Jehovah.” Perhaps, however, “before” simply means “as in the sight of” Jehovah. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “walk before me.”)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The verse is a moral reflection of the writer on the preceding facts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Chronicles",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "JOTHAM2 Chronicles 27:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "JOTHAM",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 27:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This King Jotham is one of the obscurer of the Jewish monarchs, and we know next to nothing about him. The most memorable event in his reign is that ‘in the year when King Uzziah,’ his father, ‘died,’ and consequently in Jotham’s first year, Isaiah saw the Lord sitting in the Temple on the empty throne, and had the lips which were to utter so many immortal words touched with fire from the altar. Whether it were the effect of the prophet’s words, or from other causes, the little that is told of him is good, and he is eulogised as having imitated his father’s God-pleasing acts, and not having stained himself by repeating his father’s sin. The rest that we hear of him in Chronicles is a mere sketch of campaigns, buildings, and victories, and then he and his reign are summed up in the words of our text, which is the analysis of the man and the disclosure of the secret of his prosperity: ‘He became mighty, because he prepared his ways’-and, more than that, ‘he prepared them before the Lord his God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So then, if we begin, as it were, at the bottom, as we ought to do, in studying a character, taking the deepest thing first, and laying hold upon the seminal and germinal principle of the whole, this text reminds us that-The secret of true strength lies in the continual recognition that life is lived ‘Before the Lord our God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now to say, ‘Walk thou ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Me,’ the command given to Abraham, suggests a somewhat different modification of the idea from the apparently parallel phrase, ‘to walk ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God’ which is declared to have been the life’s habit of Enoch. The one expression suggests simple companionship and communion; the other suggests rather the vivid and continual realisation of the thought that we are ‘ever in the great Taskmaster’s eye.’ To walk before God is to feel thrillingly and continually, and yet without being abased or crushed or discomposed, but rather being encouraged and quickened and calmed and ennobled and gladdened thereby: ‘Thou God seest me.’ It seems to me that one of the plainest pieces of Christian duty, and, alas! one of the most neglected of them, is the cultivation, definitely and consciously, by effort and by self-discipline, of that consciousness as a present factor in all our lives, and an influencing motive in everything that we do. If once we could bring before the eye of our minds that great, blazing, white throne, and Him that sits upon it, we should want nothing else to burn up the commonplaces of life, and to flash its insignificance into splendour and awfulness. We should want nothing else to lift us to a ‘solemn scorn of ills,’ and to deliver us from the false sweetnesses and fading delights that grow on the low levels of a sense-bound life! Brethren! our whole life would be transformed and glorified, and we should be different men and women if we ordered our ways as ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before the Lord our God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ What meanness could live when we knew that it was seen by those pure Eyes? How we should be ashamed of ourselves, of our complaints, of our murmurings, of our reluctance to do our duty, of our puerile regrets for vanished blessings, and of all the low cares and desires that beset and spoil our lives, if once this thought, ‘before God,’ were habitual with us, and we walked in it as in an atmosphere!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Why is it not? and might it not be? and if it might not, ought it not to be? And what are we to say to Him whom we profess to love as our Supreme Good, if all the day long the thought of Him seldom comes into our minds, and if any triviality, held near the eye, is large enough and bright enough to shut Him out from our sight? With deep ethical significance and accuracy was the command given to Abraham as the sole, all-sufficient direction for both inward and outward life: ‘Walk before Me and {so} be thou perfect.’ For indeed the full realisation-adequate and constant and solid enough to be a motive-of ‘Thou God seest me,’ would be found to contain practical directions in regard to all moral difficulties, and would unfailingly detect the evil, howsoever wrapped up, and would carry in itself not only motive but impulse, not only law but power to fulfil it. The Master’s eye makes diligent servants. How schoolboys bend themselves over their slates and quicken their effort when the teacher is walking behind the benches! And how a gang of idle labourers will buckle to the spade and tax their muscles in an altogether different fashion when the overseer appears upon the field! If we realised, as we should do, the presence in all our little daily life of that great, sovereign Lord, there would be less skulking, less superficially performed tasks, less jerry work put into our building; more of our strength cast into all our work, and less of ourselves in any of it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Remember, too, how connected with this is another piece of effort needful in the religious life, and suggested by the last words of this text, ‘Before the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God.’ Cultivate the habit of narrowing down the general truths of religion to their relation to yourselves. Do not be content with ‘the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God,’ or ‘the Lord the God of the whole earth,’ but put a ‘my’ in, and realise not only the presence of a divine Inspector, but the closeness of the personal bond that unites to Him; and the individual responsibility, in all its width and depth and unshiftableness-if I may use such a word-which results therefrom. You cannot shake off or step out of the tasks that ‘the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God’ lays upon you. You and He are as if alone in the world. Make Him your God by choice, by your own personal acceptance of His authority and dependence upon His power, and try to translate into daily life the great truth, ‘Thou God seest ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ and bring it to bear upon the veriest trifles and smallest details.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now the text follows the order of observation, so to speak, and mentions the outward facts of Jotham’s success before it goes deeper and accounts for them. We have reversed the process and dealt first with the cause. The spring of all lay in his conscious recognition of his relation to God and God’s to him. From that, of course, followed that he ‘prepared,’ according to the Authorised Version, or ‘ordered,’ according to the Revised Version, ‘his ways.’ There is an alternative rendering of the word rendered ‘prepared’ or ‘ordered’ given in the margin of the Authorised Version, which reads, ‘established his ways.’ Both the ideas of ordering and establishing are contained in the word.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now that fact, that the same word means both these, conveys a piece of practical wisdom, which it will do us all good to note clearly and take to heart. For it teaches us that whatever is ‘ordered’ is firm, and whatever is disorderly, haphazard, done without the exercise of one’s mind on the act, being chaotic, is necessarily short-lived.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The ordered life is the established life. The life of impulse, chance, passion, the life that is lived without choice and plan, without reflection and consideration of consequences, the following of nature, which some people tell us is the highest law, and which is woefully likely to degenerate into following the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lower",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nature, which ought not to be followed, but covered and kept under hatches-such a life is sure to be a topsy-turvy life, which, being based upon the narrowest point, must, by the laws of equilibrium, topple over sooner or later. If you would have your lives established, they must be ordered. You must bring your brains to bear upon them, and you must bring more than brain, you must bring to bear on every part of them the spiritual instincts that are quickened by contact with the thought of the All-seeing God, and let these have the ordering of them. Such lives, and only such, will endure ‘when all that seems shall suffer shock.’ ‘He that doeth the will of God abideth for ever.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the lesson that is pressed upon us by this word, understood in the other meanings of ‘prepared’ or ‘ordered,’ is that all our ‘ways,’ that is, our practical life, our acts, direction of mind, habits, should be regulated by continual consciousness of, and reference to, the All-discerning Eye that looks down upon us, and ‘the God in whose hands our breath is, and whose are’-whether we make them so or not-’all our ways.’ To translate that into less picturesque, and less forcible, but more modern words, it is just this: You Christian people ought to make it a point of duty to cultivate the habit of referring everything that you do to the will and judgment of God. Take Him into account in everything great or small, and in nothing say, ‘Thus I will, thus I command. My will shall stand instead of all other reasons’; but say, ‘Lord! by Thee and for Thee I try to do this’; and having done it, say, ‘Lord! the seed is sown in Thy name; bless Thou the springing thereof.’ Works thus begun, continued and ended, will never be put to confusion, and ‘ways’ thus ordered will be established. A path of righteousness like that can no more fail to be a way of peace than can God’s throne ever totter or fall. An ordered life in which He is consulted, and which is all shaped at His bidding, and by His strength, and for His dear name, will ‘stand four-square to all the winds that blow,’ and, being founded upon a rock, will never fall.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But we may also note that in the strength of that thought, that we are before the Lord our God, we shall best establish our ways in the sense that we shall keep on steadily and doggedly on the path. Well begun may be half ended, but there is often a long dreary grind before it is wholly ended, and the last half of the march is the wearisome half. The Bible has a great deal to say about the need of obstinate persistence on the right road. ‘Ye did run well, what did hinder you?’ ‘Cast not away your confidence, which hath great recompense of reward.’ ‘We are made partakers of Christ if we hold fast the beginning of our confidence firm unto the end.’ ‘He that overcometh and keepeth My words unto the end, to him will I give authority.’ Lives which derive their impulse from communion with God will not come to a dead stop half-way on their road, like a motor the fuel of which fails; and it will be impossible for any man to ‘endure unto the end’ and so to be heir of the promise-’the same shall be saved,’ unless he draws his persistency from Him who ‘fainteth not, neither is weary’ and who ‘reneweth strength to them that have no might’ so that in all the monotonous levels they shall ‘walk and not faint,’ and in all the crises, demanding brief spurts of energy, ‘they shall run and not be weary,’ and at last ‘shall mount up with wings as eagles.’ A path ordered and a path persisted in ought to be the path of every Christian man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The text finally tells of the prosperity and growing power which attends such a course. ‘Jotham became mighty.’ That was simple outward blessing. His kingdom prospered, and, according to the theocratic constitution of Judah, faithfulness to God and material well-being went together. You cannot apply these words, of course, to the outward lives of Christians. It is no doubt true that ‘Godliness ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " profitable for all things,’ but there are a great many other things besides the godliness of the man that does them which determine whether a man’s undertakings shall prosper in the world’s sense or not. It would be a pitiable thing if the full revelation of God in Christ did not teach us Christians more about the meaning and the worth of outward success and inward prosperity than the Old Testament could teach. I hope we have learned that lesson; at least, it is not the fault of our lesson book if we have not. Although it is true that religion does make the best of both worlds, it does not do so by taking the world’s estimate of what its best for to-day is, and giving a religious man ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Sometimes it does, and sometimes it does not, and whether it does or no depends on other considerations than the reality of the man’s devotion. Good men are often made better by being made sad and unsuccessful. And if they are not bettered by adversity, it is not the fault of the discipline but of the people who undergo it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But though the husk of my text falls away-and we should thank God that it has fallen away-the kernel of it is ever true. Whosoever will thus root his life in the living thought of a loving, divine Eye being perpetually upon him, and make that thought a motive for holiness and loving obedience and effort after service, will find that the true success, the only success and the only strength that are worth a man’s ambition to desire or his effort to secure, will assuredly be his. He may be voted a failure as regards the world’s prizes. But a man that ‘orders his ways,’ and perseveres in ways thus ordered, ‘before the Lord’ will for reward get more power to order his ways, and a purer and more thrilling, less interrupted and more childlike vision of the Face that looks upon him. God’s ‘eyes behold the upright,’ and the upright behold His eyes, and in the interchange of glances there is power; and in that power is the highest reward for ordered lives. We shall get power to do, power to bear, power to think aright, power to love, power to will, power to behold, power to deny ourselves, ‘power to become sons of God.’ This is the success of life, when out of all its changes, and by reason of all its efforts, we realise more fully our filial possession of our Father, and our Father’s changeless love to us. We shall become mighty with the might that is born of obedience and faith if we order our ways before the Lord our God. ‘The path of the just is as the shining light, that shineth more and more until the noontide of the day.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:1-9 Jotham's reign in Judah. - The people did corruptly. Perhaps Jotham was wanting towards the reformation of the land. Men may be very good, and yet not have courage and zeal to do what they might. It certainly casts blame upon the people. Jotham prospered, and became mighty. The more stedfast we are in religion, the more mighty we are, both to resist evil, and to do good. The Lord often removes wise and pious rulers, and sends others, whose follies and vices punish a people that valued not their mercies.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Ammonites, who had submitted to Uzziah ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", revolted against Jotham. This revolt he firmly repressed; and, to punish it, he exacted a high rate of tribute for the three years following the termination of the war. The productiveness of the Ammonite country in grain, which is here indicated, has been remarked upon as extraordinary by modern travelers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2Ch 27:5-9. He Subdues the Ammonites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5. He fought also with the king of the Ammonites—This invasion he not only repelled, but, pursuing the Ammonites into their own territory, he imposed on them a yearly tribute, which, for two years, they paid. But when Rezin, king of Syria, and Pekah, king of Israel, combined to attack the kingdom of Judah, they took the opportunity of revolting, and Jotham was too distracted by other matters to attempt the reconquest (see on [458]2Ki 15:37).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "directed his ways",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. his counsels and actions, by the rule of God’s law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So Jotham became mighty,.... Having built towers and castles, and fortified cities, and conquered his enemies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because he prepared his ways before the Lord his God; ordered, directed, and guided them according to the word and will of God, and walked as in the sight of God, having the fear of him continually before him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because he prepared his ways before the Lord his God; ordered, directed, and guided them according to the word and will of God, and walked as in the sight of God, having the fear of him continually before him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So Jotham became mighty, {d} because he prepared his ways before the LORD his God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So Jotham became mighty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " because he prepared his ways before the LORD his God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) He shows that all prosperity comes from God, who never fails when we put our trust in him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "became mighty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The same Heb. word as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see note). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prepared",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "ordered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The virtue of the reflection of this verse is apparent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Prepared",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "הֵכִין",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ordered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; with some others (such as \"set straight,\" etc.), a good rendering in keeping with other Old Testament renderings of words betokening moral ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "habitude.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 2 Chronicles 27:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "By all these undertakings Jotham strengthened himself, sc. in the kingdom, i.e., he attained to greater power, because he made his ways firm before Jahve, i.e., walked stedfastly before Jahve; did not incur guilt by falling away into idolatry, or by faithless infringement of the rights of the Lord (as Uzziah did by his interference with the rights of the priesthood). From the כּל־מלחמתיו in the concluding remark (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 27:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we learn that he had waged still other successful wars. The older commentators reckon among these wars, the war against Rezin and Pekah, which kings the Lord began in his days to send against Judah (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but hardly with justice. The position of this note, which is altogether omitted in the Chronicle, at the end of the account of Jotham in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", appears to hint that this war broke out only towards the end of Jotham's reign, so that he could not undertake anything important against this foe.",
        "children": []
      }
    ]
  }
]