[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leave there thy gift.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words describe an act which would appear to men as a breach of liturgical propriety. To leave the gift and the priest, the act of sacrifice unfinished, would be strange and startling, yet that, our Lord teaches, were better than to sacrifice with the sense of a wrong unconfessed and unatoned for, and, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "à fortiori,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " better than the deeper evil of not being ready to forgive. The Talmud gives a curious rule, to which the words may perhaps allude: “If a man is on the point of offering the Passover, and remembers that there is any leaven left in the house, let him return to his house, and remove it, and then come and finish the Passover” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pesachim,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. 49). What the scribes laid down as a duty in regard to the “leaven of bread,” our Lord applies to the leaven of malice and wickedness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Be reconciled.—It is not enough to see in this only a command to remove ill-will and enmity from our own mind, though that, of course, is implied. There must be also confession of wrong and the endeavour to make amends, to bring about, as far as in us lies, reconciliation, or atonement.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Be reconciled.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It is not enough to see in this only a command to remove ill-will and enmity from our own mind, though that, of course, is implied. There must be also confession of wrong and the endeavour to make amends, to bring about, as far as in us lies, reconciliation, or atonement.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:21-26 The Jewish teachers had taught, that nothing except actual murder was forbidden by the sixth commandment. Thus they explained away its spiritual meaning. Christ showed the full meaning of this commandment; according to which we must be judged hereafter, and therefore ought to be ruled now. All rash anger is heart murder. By our brother, here, we are to understand any person, though ever so much below us, for we are all made of one blood. Raca, is a scornful word, and comes from pride: Thou fool, is a spiteful word, and comes from hatred. Malicious slanders and censures are poison that kills secretly and slowly. Christ told them that how light soever they made of these sins, they would certainly be called into judgment for them. We ought carefully to preserve Christian love and peace with all our brethren; and if at any time there is a quarrel, we should confess our fault, humble ourselves to our brother, making or offering satisfaction for wrong done in word or deed: and we should do this quickly; because, till this is done, we are unfit for communion with God in holy ordinances. And when we are preparing for any religious exercises, it is good for us to make that an occasion of serious reflection and self-examination. What is here said is very applicable to our being reconciled to God through Christ. While we are alive, we are in the way to his judgement-seat; after death, it will be too late. When we consider the importance of the case, and the uncertainty of life, how needful it is to seek peace with God, without delay!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore, if thou bring thy gift to the altar ... - The Pharisees were intent only on the external act in worship. They looked not at all to the internal state of the mind. If a man conformed to the external rites of religion, however much envy, and malice, and secret hatred he might have, they thought he was doing well. Our Saviour taught a different doctrine. It was of more consequence to have the heart right than to perform the outward act. If, therefore, says he, a man has gone so far as to bring his gift to the very altar, and should remember that anyone had anything against him, it was his duty there to leave his offering and go and be reconciled. While a difference of this nature existed, his offering could not be acceptable. He was not to wait until the offended brother should come to him; he was to go and seek him out, and be reconciled. So now the worship of God will not be acceptable, however well performed externally, until we are at peace with those that we have injured. \"To obey is better than sacrifice,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He that comes to worship his Maker filled with malice, and hatred, and envy, and at war with his brethren, is a hypocritical worshipper, and must meet with God's displeasure. God is not deceived, and he will not be mocked.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thy gift - Thy sacrifice. What thou art about to devote to God as an offering.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To the altar - The altar was situated in front of the temple, and was the place on which sacrifices were made. See the notes on plan, Matthew 21:12. To bring a gift to the altar was expressive of worshipping God, for this was the way in which he was formerly worshipped.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To the altar - The altar was situated in front of the temple, and was the place on which sacrifices were made. See the notes on plan, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 21:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To bring a gift to the altar was expressive of worshipping God, for this was the way in which he was formerly worshipped.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thy brother - Any man, especially any fellow-worshipper. Anyone of the same religious society.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hath aught - Is offended, or thinks he has been injured by you in any manner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "First be reconciled - This means to settle the difficulty; to make proper acknowledgment or satisfaction for the injury. If you have wronged him, make restitution. If you owe him a debt which ought to be paid, pay it. If you have injured his character, confess it and seek pardon. If he is under an erroneous impression, if your conduct has been such as to lead him to suspect that you have injured him, make an explanation. Do all in your power; and all you ought to do, to have the matter settled. From this we learn:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That, in order to worship God acceptably, we must do justice to our fellow-men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. Our worship will not be acceptable unless we do all we can to live peaceably with others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. It is our duty to seek reconciliation with others when we have injured them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. This should be done before we attempt to worship God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5. This is often the reason why God does not accept our offerings, and we go empty away from our devotions. We do not do what we ought to others; we cherish improper feelings or refuse to make proper acknowledgments, and God will not accept such attempts to worship him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "5. This is often the reason why God does not accept our offerings, and we go empty away from our devotions. We do not do what we ought to others; we cherish improper feelings or refuse to make proper acknowledgments, and God will not accept such attempts to worship him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. Leave there thy gift before the altar, and go thy way; first be reconciled to thy brother—The meaning evidently is—not, \"dismiss from thine own breast all ill feeling,\" but \"get thy brother to dismiss from his mind all grudge against thee.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and then come and offer thy gift—\"The picture,\" says Tholuck, \"is drawn from life. It transports us to the moment when the Israelite, having brought his sacrifice to the court of the Israelites, awaited the instant when the priest would approach to receive it at his hands. He waits with his gift at the rails which separate the place where he stands from the court of the priests, into which his offering will presently be taken, there to be slain by the priest, and by him presented upon the altar of sacrifice.\" It is at this solemn moment, when about to cast himself upon divine mercy, and seek in his offering a seal of divine forgiveness, that the offerer is supposed, all at once, to remember that some brother has a just cause of complaint against him through breach of this commandment in one or other of the ways just indicated. What then? Is he to say, As soon as I have offered this gift I will go straight to my brother, and make it up with him? Nay; but before another step is taken—even before the offering is presented—this reconciliation is to be sought, though the gift have to be left unoffered before the altar. The converse of the truth here taught is very strikingly expressed in Mr 11:25, 26: \"And when ye stand praying (in the very act), forgive, if ye have aught (of just complaint) against any; that your Father also which is in heaven may forgive you your trespasses. But if ye do not forgive, neither will your Father which is in heaven forgive you,\" &c. Hence the beautiful practice of the early Church, to see that all differences amongst brethren and sisters in Christ were made up, in the spirit of love, before going to the Holy Communion; and the Church of England has a rubrical direction to this effect in her Communion service. Certainly, if this be the highest act of worship on earth, such reconciliation though obligatory on all other occasions of worship—must be peculiarly so then.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The Jews were to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "offer gifts and sacrifices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Hebrews 5:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their gifts were their free will offerings, they were the most frequent oblations amongst the Jews, as may appear from Leviticus, and what the priests pressed with the greatest importunity, as may appear from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 7:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 7:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; therefore our Saviour instanceth in these, rather than in other parts of their worship. Bring unto God the best and most acceptable sacrifices (in your or, the teacher’s judgment) that you can, if there be found malice or rash anger in your hearts, God will not accept them. Therefore, how near soever you be come to a religious action, if you there remember that your brother hath a just reason to be offended with you, for any malice or rash anger showed or expressed by you, do not think this will discharge you of your obligation to pay your homage to God; but forbear a while, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "leave your gift before the altar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and do what in you lies to be reconciled to your brother, to have a placable spirit to him, to purge your heart of wrath and malice, and any desire of revenge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and then come and offer your gift, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " pay that homage which you owe, and it was in your heart to pay to God. It is a text usually applied with reference to communion with God in the Lord’s supper, but equally extensive to any other part of worship, hearing the word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jam 1:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jam 1:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and prayer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Timothy 2:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 2:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". God accepteth no service, no homage, from an implacable, malicious heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Leave there thy gift before the altar,.... This might easily be done, and the business soon dispatched, at some seasons; particularly, at their public feasts, as the passover, pentecost, and feast of tabernacles, when all the Israelites were together: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and go thy way; make what haste thou canst, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "first be reconciled to thy brother: use all means to reconcile him; acknowledge the offence; ask his pardon; assure him that thou wishest well to him, and not ill; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and then come and offer thy gift, by putting it on the altar, before which it was left. This shows, that acts of love and friendship are preferable to sacrifices; and that sacrifices offered up in wrath, and whilst unreconciled to others, are unacceptable to God, and of no avail: and so much the Jews themselves seem to acknowledge; when they say (e): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"that transgressions, which are between a man and God, the day of atonement expiates; the transgressions which are between a man and his neighbour, the day of atonement does not expiate,   , \"until he hath reconciled his neighbour.\"'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which is enlarged upon, and explained by Maimonides (f), after this manner: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the day of atonement does not expiate any transgressions, but those that are between a man and God, as when one eats anything that is forbidden, and lies with anything that is forbidden, or the like; but transgressions which are between a man and his neighbour, as he that hurts his neighbour, or curses his neighbour, or steals from him, and the like, are never forgiven, until he has given his neighbour what he owed him, and has \"reconciled\" him; yea, though he has returned to him the money he owed him, he ought to \"reconcile\" him, and desire him to forgive him; yea, even though \"he has only provoked him by words\", (which is the very case in the text before us,) , \"he ought to reconcile him\", and to meet him until he forgives him: if his neighbour will not forgive, he must bring with him three of his friends, and meet him, and entreat him; and if he will not be reconciled by them, he must bring them a second, and a third time.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So that he was to use all means to obtain a reconciliation. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Misn. Yoma, c. 8. sect. 9. (f) Hilchot Teshuba, c. 2. sect. 9. Vid. T. Bab. Yoma, fol. 87. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Misn. Yoma, c. 8. sect. 9. (f) Hilchot Teshuba, c. 2. sect. 9. Vid. T. Bab. Yoma, fol. 87. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Leave there thy gift before the altar, and go thy way; first be reconciled to thy brother, and then come and offer thy gift.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before the altar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Stay the sacrifice, though begun, for God will not accept it unless the heart be free from anger, and the conscience from offence. It is an application of the great principle summed up in “I will have mercy and not sacrifice.” Cp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 26:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “I will wash my hands in innocency, O Lord, and so will I go to thine altar.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὕπαγε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρῶτον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go thy way, first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") placed antithetically to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τότε ἐλθὼν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "then having come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διαλλάγηθι τῷ ἀδελφῷ σῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be reconciled to thy brother",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) that thou mayest be reconciled to God.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐλθὼν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "coming",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "returning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the first going being in vain is not reckoned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "First",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Joined in the Authorized Version and Revised Version to \"be reconciled,\" and rightly, since the point is not \"the unavoidable, surprising, nay, repellent removal of one's self from the temple\" (Meyer), but reconciliation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Be reconciled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διαλλάγηθι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); here only in the New Testament. There seems to be no essential difference between this and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καταλλάσσω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Thayer). Matthew 5:24",
        "children": []
      }
    ]
  }
]