[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To lust after her.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The intent is more strongly marked in the Greek than in the English. It is not the passing glance, not even the momentary impulse of desire, but the continued gaze by which the impulse is deliberately cherished till it becomes a passion. This noble and beautiful teaching, it has often been remarked, and by way of disparagement, is found elsewhere. Such disparagement is out of place. By the mercy of God the Light that “lighteth every man” has led men to recognise the truth thus asserted, and parallels to it may be found in the writings of Conlucius, Seneca, Epictetus, and even of the Jewish Rabbis themselves. The words of Juvenal closely express the general sentiment:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“ Scelus intra se tacitus qui cogitat ullum,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Facti crimen habet.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "[“Who in his breast a guilty thought doth cherish,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He bears the guilt of action.”]",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Our Lord’s words speak primarily of “adultery,” but are, of course, applicable to every form of sensual impurity.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Our Lord’s words speak primarily of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "“",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "adultery,” but are, of course, applicable to every form of sensual impurity.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:27-32 Victory over the desires of the heart, must be attended with painful exertions. But it must be done. Every thing is bestowed to save us from our sins, not in them. All our senses and powers must be kept from those things which lead to transgression. Those who lead others into temptation to sin, by dress or in other ways, or leave them in it, or expose them to it, make themselves guilty of their sin, and will be accountable for it. If painful operations are submitted to, that our lives may be saved, what ought our minds to shrink from, when the salvation of our souls is concerned? There is tender mercy under all the Divine requirements, and the grace and consolations of the Spirit will enable us to attend to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye have heard that it was said by them of old time, Thou shalt not commit adultery - See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Our Saviour in these verses explains the seventh commandment. It is probable that the Pharisees had explained this commandment, as they had the sixth, as extending only to the external act; and that they regarded evil thoughts and a wanton imagination as of little consequence, or as not forbidden by the law. Our Saviour assures them that the commandment did not regard the external act merely, but the secrets of the heart, and the movements of the eye. He declares that they who indulge a wanton desire, that they who look on a woman to increase their lust, have already, in the sight of God, violated the commandment, and committed adultery in the heart. Such was the guilt of David, whose deep and awful crime fully shows the danger of indulging in evil desires, and in the rovings of a wanton eye. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So exceeding strict and broad is the law of God! And so heinous in his sight axe thoughts and feelings which may be forever concealed from the world! ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28. But I say unto you, That whosoever looketh on a woman to lust after her—with the intent to do so, as the same expression is used in Mt 6:1; or, with the full consent of his will, to feed thereby his unholy desires.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hath committed adultery with her already in his heart—We are not to suppose, from the word here used—\"adultery\"—that our Lord means to restrict the breach of this commandment to married persons, or to criminal intercourse with such. The expressions, \"whosoever looketh,\" and \"looketh upon a woman,\" seem clearly to extend the range of this commandment to all forms of impurity, and the counsels which follow—as they most certainly were intended for all, whether married or unmarried—seem to confirm this. As in dealing with the sixth commandment our Lord first expounds it, and then in the four following verses applies His exposition (Mt 5:21-25), so here He first expounds the seventh commandment, and then in the four following verses applies His exposition (Mt 5:28-32).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The scope of our Saviour in these verses is the very same as in the verses immediately preceding, viz. to correct the jejune interpretation which the Pharisees had put upon the Divine law, and to show that he, instead of coming to destroy the law, came to fulfil it, as other ways, so by giving a more strict and true interpretation of it; and whereas they interpreted it only as to overt acts, which disturb human society and break civil order, he showeth that it reacheth to the inward thoughts, and unlawful desires of the heart, and any means that have a tendency to such prohibited acts. It was said by God to those fathers of the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou shalt not commit adultery, Exodus 20:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thou shalt not commit adultery, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This law (saith our Saviour) your doctors expound, You shall not carnally lie with a woman that is not your wife; but there is a great deal more in it than so, for he that but secretly in his heart desireth such a thing, or taketh pleasure in such thoughts, and casts his eyes upon a woman in order to such a thing, is in the sight of God an adulterer. Hence we read of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eyes full of adultery, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to avoid which Job ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "made a covenant with his eyes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Job 31:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and would not suffer his heart to walk after his eyes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 31:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". We must so interpret the commandments of God, as not to extend them only to forbid or command those acts which are plainly mentioned in them, but the inward pleasing of our hearts with such things as are forbidden, the desires of our hearts after them, or whatsoever is a probable means to give us that sinful pleasure of our thoughts, or further inflame such unlawful desires in our souls. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But I say unto you, that whosoever looketh on a woman,.... Many and severe are the prohibitions of the Jews, concerning looking upon a woman, which they aggravate as a very great sin: they say (k), it is not lawful to look upon a beautiful woman, though unmarried; nor upon another man's wife, though deformed; nor upon a woman's coloured garments: they forbid (l) looking on a woman's little finger, and say (m), that he that tells money to a woman, out of his hand into her's, that he may look upon her, though he is possessed of the law and good works, even as Moses, he shall not escape the damnation of hell: they affirm (n), that he that looks upon a woman's heel, his children shall not be virtuous; and that a man may not go after a woman in the way, no, not after his wife: should he meet her on a bridge, he must take her to the side of him; and whoever goes through a river after a woman, shall have no part in the world to (o) come: nay, they forbid (p) a man looking on the beauty of his own wife. Now these things were said by them, chiefly to cover themselves, and because they would be thought to be very chaste; when they were, as Christ calls them, an \"adulterous generation\" in a literal sense: they usually did what our Lord observes, \"strain at a gnat, and swallow a camel\". We read in the Talmud (q), of , a \"foolish saint\" and it is asked, who is he? and it is answered, one that sees a woman drowning in a river, and says it is not lawful for me , \"to look\" upon her, and deliver her. It was not any looking upon a woman, that is forbid by Christ as criminal; but so to look, as \"to lust after her\"; for such an one ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hath committed adultery with her already in his heart. But these men, who forbad external looking upon a woman, generally speaking, had no notion of heart sins; and which was the prevailing opinion of the Pharisees, in Christ's time. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"A good thought, they (r) allow, is reckoned as if done; as it is said, Malachi 3:16. Upon which it is asked, what is the meaning of that, and \"that thought\" upon \"his name?\" Says R. Ase, if a man thinks to do a good work, and is hindered, and does it not, the Scripture reckons it to him, as if he did it; but an evil thought, the holy blessed God does not account of it as if done, as is said,  Psalm 66:18.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"A good thought, they (r) allow, is reckoned as if done; as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Upon which it is asked, what is the meaning of that, and \"that thought\" upon \"his name?\" Says R. Ase, if a man thinks to do a good work, and is hindered, and does it not, the Scripture reckons it to him, as if he did it; but an evil thought, the holy blessed God does not account of it as if done, as is said,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 66:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon which words, a noted commentator (s) of their's has this remark: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Though I regard iniquity in my heart to do it, even in thought, yea, against God himself, as if I had expressed it with my lips, he does not hear it; that is,   , \"he does not reckon it to me for sin\"; because the holy blessed God does not account an evil thought for an action, to them that are in the faith of God, or of the true religion.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For it seems, this is only true of the Israelites; it is just the reverse with the Gentiles, in whom God does not reckon of a good thought, as if it was done, but does of an evil one, as if it was in act (t). It must be owned, that this is not the sense of them all; for some of them have gone so far as to say (u), that ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the thoughts of sin are greater, or harder, than sin itself:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "by which they mean, that it is more difficult to subdue sinful lusts, than to refrain from the act of sin itself; and particularly, some of them say things which agree with, and come very near to what our Lord here says; as when they affirm (w), that ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"everyone that looks upon a woman  with intention, it is all one as if he lay with her.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And that   , \"he that committeth adultery with his eyes, is called an adulterer\" (x). Yea, they also observe (y), that a woman may commit adultery in her heart, as well as a man; but the Pharisees of Christ's time were of another mind. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) T. Bab. Avoda Zara, fol. 1, 2.((l) T. Bab. Beracot, fol. 24. 1. Sabbat. fol. 64. 2.((m) T. Bab. Beracot, fol. 61. 1. Eruvin, fol. 18. 2.((n) T. Bab. Nedarim, fol. 20. 1. T. Hieros. Challa, fol. 58. 3. Derech Eretz. c. 1. fol. 17. 3.((o) T. Bab. Beracot, fol. 61. 1. Eruvin, fol. 18. 2.((p) Zohar in Lev. fol. 34. 4. (q) T. Bab Sota, fol. 21. 2.((r) T. Bab. Kiddushin, fol. 40. 1.((s) R. David Kimchi, in Psal. lxvi. 18. (t) T. Hieros. Peah, fol. 16. 2.((u) T. Bab. Yoma, fol. 29. 1.((w) T. Hieros. Challa, fol. 58. 3. Massechet Calah, fol. 16. 4. Vid. Maimon. Issure Bia, c. 21. sect. 2. & Moses Kotsensis Mitzvot Tora precept. neg. 126. (x) Vajikra Rabba, sect. 23. fol. 265. 1.((y) Bemidbar Rabba, sect. 9. fol. 196. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) T. Bab. Avoda Zara, fol. 1, 2.((l) T. Bab. Beracot, fol. 24. 1. Sabbat. fol. 64. 2.((m) T. Bab. Beracot, fol. 61. 1. Eruvin, fol. 18. 2.((n) T. Bab. Nedarim, fol. 20. 1. T. Hieros. Challa, fol. 58. 3. Derech Eretz. c. 1. fol. 17. 3.((o) T. Bab. Beracot, fol. 61. 1. Eruvin, fol. 18. 2.((p) Zohar in Lev. fol. 34. 4. (q) T. Bab Sota, fol. 21. 2.((r) T. Bab. Kiddushin, fol. 40. 1.((s) R. David Kimchi, in Psal. lxvi. 18. (t) T. Hieros. Peah, fol. 16. 2.((u) T. Bab. Yoma, fol. 29. 1.((w) T. Hieros. Challa, fol. 58. 3. Massechet Calah, fol. 16. 4. Vid. Maimon. Issure Bia, c. 21. sect. 2. & Moses Kotsensis Mitzvot Tora precept. neg. 126. (x) Vajikra Rabba, sect. 23. fol. 265. 1.((y) Bemidbar Rabba, sect. 9. fol. 196. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ βλέπων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the looker is supposed to be a husband who by his look wrongs his own wife.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γυναῖκα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": married or unmarried.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρὸς τὸ ἐπιθυμῆσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". he look is supposed to be not casual but persistent, the desire not involuntary or momentary, but cherished with longing. Augustine, a severe judge in such matters, defines the offence thus: “Qui hoc fine et hoc animo attenderit ut eam concupiscat; quod jam non est titillari delectatione carnis sed plene consentire libidini” (De ser. Domini). Chrysostom, the merciless scourge of the vices of Antioch, says: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ ἑαυτῷ τὴν ἐπιθυμίαν συλλέγων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ μηδενὸς ἀναγκάζοντος τὸ θηρίον ἐπεισάγων ἠρεμοῦντι τῷ λογισμῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hom. xvii. The Rabbis also condemned unchaste looks, but in how coarse a style compared with Jesus let this quotation given by Fritzsche show: “Intuens vel in minimum digitum feminae est ac si intueretur in locum pudendum”. In better taste are these sayings quoted by Wünsche (Beiträge): “The eye and the heart are the two brokers of sin”; “Passions lodge only in him who sees”.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (bracketed as doubtful by W. H[24]): the accusative after ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπιθ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is rare and late.—We cannot but think of the personal relations to woman of One who understood so well the subtle sources of sexual sin. Shall we say that He was tempted in all points as we are, but desire was expelled by the mighty power of a pure love to which every woman was as a daughter, a sister, or a betrothed: a sacred object of tender respect?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[24] Westcott and Hort.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "β",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Adultery, 27–32.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to lust after her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i. e. “with a view to lust after her.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in his heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Contrast with the pure ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in heart, Matthew 5:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in heart, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 5:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὁ βλέπων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that looketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Refer to this expression the right eye mentioned in the next verse.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This particle determines the character of the looking.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἤδη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "already",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") by that very act.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But I say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (ver. 22, note). The bare command forbidding an external action is insufficient. It must extend to the thought. Contrast Josephus ('Ant.,' 12:09. 1), \"The purposing to do a thing, without actually doing it, is not worthy of punishment.\" Generally, however, the sinfulness of wrong thoughts must have been acknowledged (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the tenth commandment; cf. late examples in Schott-gen). Hammond ('Pr. Cat.,' in Ford) says, \"In the Law, the fastening of the eyes on an idol, considering the beauty of it, saith Maimonides, is forbidden (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and not only the worship of it\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Maimonides, 'Hilk. Ab. Zar.,' 2:2, by whom, however, the thought is, perhaps, rather condemned for what it leads to than per ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "se",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and similarly with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Whosoever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "every one who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (ver. 22, note). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Looketh...  to lust after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρὸς τὸ ἐπιθυμῆσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρὸς τό",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the infinitive (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), primarily denotes purpose; this may be equivalent to \"looketh in order that he may lust, looketh to stimulate his lust\" (cf. Meyer, Trench); but, as Weiss points out, this surely belongs to the refinement, not to the beginning of sin. Hence Nosgen ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "suggests",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "looketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "...  lustfully\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Probably this is one of those cases where, as Ellicott says on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρὸς τό",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the infinitive has \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shade of meaning that seems to lie between ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "purpose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "result",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and even sometimes to approximate to the latter.\" At all events, it does not express, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰς τό",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would have expressed, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "immediate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " purpose of the look (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ellicott, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "loc. cit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "αὐτήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", B, D, etc.); accusative with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐπιθυμεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here only in the New Testament. Perhaps the pronoun should be omitted, with ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Matthew 5:28",
        "children": []
      }
    ]
  }
]