[{"header":"Loss of hope"},{"num":16,"verse":"The Lord’s word came to me:"},{"num":2,"verse":"Don’t marry or have children in this place."},{"num":3,"verse":"This is what the Lord proclaims concerning children who are born in this place and their mothers and fathers who give birth to them in this place:"},{"num":8,"verse":"Don’t enter a house where there is feasting and sit down to eat and drink."},{"num":9,"verse":"This is what the Lord of heavenly forces, the God of Israel, proclaims:"},{"num":10,"verse":"When you proclaim all these things to the people, and they ask you, “Why has the Lord pronounced such massive devastation against us? What have we done wrong? How have we sinned against the Lord our God?”"},{"num":11,"verse":"then you should tell them: It’s because your ancestors have deserted me and followed other gods, declares the Lord. They have served and worshipped them, while abandoning me and refusing to keep my Instruction."},{"num":12,"verse":"And you, you have acted worse than your ancestors, each of you following your own willful, evil hearts and paying no attention to me."},{"num":13,"verse":"So I will banish you from this land to a place that neither you nor your ancestors have known, and there you will serve other gods day and night, for I will show you no mercy."},{"num":14,"verse":"But the time is coming, declares the Lord, when no one will say, “As the Lord lives who brought up the Israelites from the land of Egypt”;"},{"num":15,"verse":"instead, they will say, “As the Lord lives who brought up the Israelites from the land of the north and from all the lands where he has banished them.” I will bring them back to the land that I gave to their ancestors."},{"num":16,"verse":"I’m going to send hordes of fishermen to catch them, declares the Lord. Afterward I will send a party of hunters to hunt them down on every mountain, hill, and cave."},{"num":17,"verse":"I am watching their every move; not one is hidden from me. Nor is their sin concealed from my sight."},{"num":18,"verse":"I will initially pay them back double for their evil and sin, because they have corrupted my land with their disgusting, lifeless idols and have filled my inheritance with their detestable practices."}]