[{"header":"Jeremiah is Commanded Not to Marry"},{"num":16,"verse":"And the word of Yahweh came to me, saying, "},{"num":2,"verse":"“You shall not take for yourself a wife, there shall not be for you sons and daughters in this place.” "},{"num":3,"verse":"For thus says Yahweh concerning the sons and concerning the daughters born in this place, and concerning their mothers who gave birth to them, and concerning their fathers who fathered them in this land: "},{"num":4,"verse":"“They will die by diseases, they will not be mourned, and they will not be buried. They will be as dung on the face of the earth. And they will perish by the sword and they will perish by the famine. And their dead bodies will become food for the birds of the air, and for the wild animals of the earth.”"},{"num":5,"verse":"For thus says Yahweh, “You must not enter the house of the funeral meal, and you must not go to lament, and you must not show sympathy for them, for I have taken away my peace from this people,” declares Yahweh, “the loyal love and the compassion. "},{"num":6,"verse":"Both the great and small will die in this land. They will not be buried, and they will not mourn for them, and no one will cut himself with a blade, and no one will shave himself for them. "},{"num":7,"verse":"And they will not break bread for the mourning ceremony for them, to comfort him because of the dead. And they will not give drink to them, the cup of desolation, for their fathers, or for their mothers. "},{"num":8,"verse":"And you shall not enter the house of the banquet, to sit with them, to eat and drink.”"},{"num":9,"verse":"For thus says Yahweh of hosts, the God of Israel, “Look, I am about to cause to disappear from this place, before your eyes and in your days, the voice of jubilation, and the voice of joy, and the voice of the bridegroom, and the voice of the bride. "},{"num":10,"verse":"And then when you tell this people all these words and they ask you, ‘Why has Yahweh pronounced against us all this great evil, and what is our iniquity, and what is our sin that we have sinned against Yahweh our God?’ "},{"num":11,"verse":"Then you shall say to them, ‘Because your ancestors have forsaken me,’ declares Yahweh, ‘and they have gone after other gods, and they have served them, and they have bowed down in worship to them, and they have forsaken me, and they have not kept my laws. "},{"num":12,"verse":"And you have behaved badly more than your ancestors, and look, you are going each one after the stubbornness of his evil heart, without listening to me. "},{"num":13,"verse":"So I will throw you from this land to the land that you have not known, you or your ancestors, and there you will serve other gods day and night, for I will not show you favor."},{"header":"The Nation’s Return to the Land"},{"num":14,"verse":"Therefore look, days are coming,’ declares Yahweh, ‘and it will no longer be said, “As Yahweh lives, who led up the Israelites from the land of Egypt,” "},{"num":15,"verse":"but only “As Yahweh lives, who led up the Israelites from the land of the north, and from all the lands where he had driven them,” for I will bring them back to their ground that I gave to their ancestors. "},{"num":16,"verse":"Look, I am sending for many fishermen,’ declares Yahweh, ‘and they will fish them out, and afterward I will send for many hunters, and they will hunt them from every mountain, and from every hill, and from the clefts of the cliffs. "},{"num":17,"verse":"For my eyes are on all their ways, they are not hidden from before me, and their iniquity is not concealed from before my eyes. "},{"num":18,"verse":"And I will first doubly repay their iniquity and their sin because of their profaning my land with the dead bodies of their abhorrences, and with their abominations they have filled up my inheritance.’”"}]