[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Matthew",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE KING’S HIGHWAYMatthew 14:22 - Matthew 14:36",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE KING’S HIGHWAY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:36",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The haste and urgency with which the disciples were sent away, against their will, after the miracle of feeding the five thousand, is explained in John’s account. The crowd had been excited to a dangerous enthusiasm by a miracle so level to their tastes. A prophet who could feed them was something like a prophet. So they determine to make him a king. Our Lord, fearing the outburst, resolves to withdraw into the lonely hills, that the fickle blaze may die down. If the disciples had remained with Him, He could not have so easily stolen away, and they might have caught the popular fervour. To divide would distract the crowd, and make it easier for Him to disperse them, while many of them, as really happened, would be likely to set off by land for Capernaum, when they saw the boat had gone. The main teaching of this miracle, over and above its demonstration of the Messianic power of our Lord, is symbolical. All the miracles are parables, and this eminently so. Thus regarding it, we have-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The struggling toilers and the absent Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The struggling toilers and the absent Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They had a short row of some five or six miles in prospect, when they started in the early evening. An hour or so might have done it, but, for some unknown reason, they lingered. Perhaps instead of pulling across, they may have kept inshore, by the head of the lake, expecting Jesus to join them at some point. Thus, night finds them but a short way on their voyage. The paschal moon would be shining down on them, and perhaps in their eager talk about the miracle they had just seen, they did not make much speed. A sudden breeze sprang up, as is common at nightfall on mountain lakes; and soon a gale, against which they could make no headway, was blowing in their teeth. This lasted for eight or nine hours. Wet and weary, they tugged at the oars through the livelong night, the seas breaking over them, and the wind howling down the glens.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " They had been caught in a similar storm once before, but then He had been on board, and it was daylight. Now it was dark, ‘and Jesus had not yet come to them,’ How they would look back at the dim outline of the hills, where they knew He was, and wonder why He had sent them out into the tempest alone! Mark tells us that He saw them distressed, hours before He came to them, and that makes His desertion the stranger. It is but His method of lovingly training them to do without His personal presence, and a symbol of what is to be the life of His people till the end. He is on the mountain in prayer, and He sees the labouring boat and the distressed rowers. The contrast is the same as is given in the last verses of Mark’s Gospel, where the serene composure of the Lord, sitting at the right hand of God, is sharply set over against the wandering, toiling lives of His servants, in their evangelistic mission. The commander-in-chief sits apart on the hill, directing the fight, and sending regiment after regiment to their deaths. Does that mean indifference? So it might seem but for the words which follow, ‘the Lord working with them.’ He shares in all the toil; and the lifting up of His holy hands sways the current of the fight, and inclines the balance. His love appoints effort and persistent struggle as the law of our lives. Nor are we to mourn or wonder; for the purpose of the appointment, so far as we are concerned, is to make character, and to give us ‘the wrestling thews that throw the world.’ Difficulties make men of us. Summer sailors, yachting in smooth water, have neither the joy of conflict nor the vigour which it gives. Better the darkness, when we cannot see our way, and the wind in our faces, if the good of things is to be estimated by their power to ‘strengthen us with strength in our soul!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We have the approaching Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We have the approaching Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Not till the last watch of the night does He come, when they have long struggled, and the boat is out in the very middle of the lake, and the storm is fiercest. We may learn from this the delays of His love. Because He loved Mary and Martha and Lazarus, He stayed still, in strange inaction, for two days, after their message. Because He loved Peter and the praying band, He let him lie in prison till the last hour of the last watch of the last night before his intended execution, and then delivered him with a leisureliness {making him put on article after article of dress} which tells of conscious omnipotence. Heaven’s clock goes at a different rate from our little timepieces. God’s day is a thousand years, and the longest tarrying is but ‘a little while.’ When He has come, we find that it is ‘right early,’ though before He came He seemed to us to delay. He comes across the waves. Their restless and yielding crests are smoothed and made solid by the touch of His foot. ‘He walketh on the sea as on a pavement’ {Septuagint version of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. It is a revelation of divine power. It is one of the very few miracles affecting Christ’s own person, and may perhaps be regarded as being, like the Transfiguration, a casual gleam of latent glory breaking through the body of His humiliation, and so, in some sense, prophetic. But it is also symbolic. He ever uses tumults and unrest as a means of advancing His purposes. The stormy sea is the recognised Old Testament emblem of antagonism to the divine rule; and just as He walked on the billows, so does He reach His end by the very opposition to it, ‘girding Himself’ with the wrath of men, and making it to praise Him. In this sense, too, His ‘paths are in the great waters.’ In another aspect, we have here the symbol of Christ’s using our difficulties and trials as the means of His loving approach to us. He comes, giving a deeper and more blessed sense of His presence by means of our sorrows, than in calm sunny weather. It is generally over a stormy sea that He comes to us, and golden treasures are thrown on our shores after a tempest.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. We have the terror and the recognition. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. We have the terror and the recognition.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The disciples were as yet little lifted above their fellows; they had no expectation of His coming, and thought just what any rude minds would have thought, that this mysterious Thing stalking towards them across the waters came from the unseen world, and probably that it was the herald of their drowning. Terror froze their blood, and brought out a shriek {as the word might be rendered} which was heard above the dash of waves and the raving wind. They had gallantly fought the tempest, but this unmanned them. We too often mistake Christ, when He comes to us. We do not recognise His working in the storm, nor His presence giving power to battle with it. We are so absorbed in the circumstances that we fail to see Him through them. Our tears weave a veil which hides Him, or the darkness obscures His face, and we see nothing but the threatening crests of the waves, curling high above our little boat. We mistake our best friend, and we are afraid of Him as we dimly see Him; and sometimes we think that the tokens of His presence are only phantasms of our own imagination.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " They who were deceived by His appearance knew Him by His voice, as Mary did at the sepulchre. How blessed must have been the moment when that astounding certitude thrilled through their souls! That low voice is audible through all the tumult. He speaks to us by His word, and by the silent speech in our spirits, which makes us conscious that He is there. He does speak to us in the deepest of our sorrows, in the darkest of our nights; and when we hear of His voice, and with wonder and joy cry out, ‘It is the Lord,’ our sorrow is soothed, and the darkness is light about us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The consciousness of His presence banishes all fear. ‘Be not afraid,’ follows ‘It is I.’ It is of no use to preach courage unless we preach Christ first. If we have not Him with us, we do well to fear: His presence is the only rational foundation for calm fearlessness. Only when the Lord of Hosts is with us, ought we not to fear, ‘though the waters roar . . . and be troubled.’ ‘Through the dear might of Him that walked the waves’ can we feeble creatures face all terrors, and feel no terror.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. We have the end of the storm and of the voyage. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. We have the end of the storm and of the voyage.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The storm ceases as soon as Jesus is on board. John does not mention the cessation of the tempest, but tells us that they were immediately at the shore. It does not seem necessary to suppose another miracle, but only that the voyage ended very speedily. It is not always true that His presence is the end of dangers and difficulties, but the consciousness of His presence does hush the storm. The worst of trouble is gone when we know that He shares it; and though the long swell after the gale may last, it no longer threatens. Nor is it always true that His coming, and our consciousness that He has come, bring a speedy close to toils. We have to labour on, but in how different a mood these men would bend to their oars after they had Him on board! With Him beside us toil is sweet, burdens are lighter, and the road is shortened. Even with Him on board, life is a stormy voyage; but without Him, it ends in shipwreck. With Him, it may be long, but it will look all the shorter while it lasts, and when we land the rough weather will be remembered but as a transient squall. These wearied rowers, who had toiled all night, stepped on shore as the morning broke on the eastern bank. So we, if we have had Him for our shipmate, shall land on the eternal shore, and dry our wet garments in the sunshine, and all the stormy years that seemed so long shall be remembered but as a watch in the night.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:22-33 Those are not Christ's followers who cannot enjoy being alone with God and their own hearts. It is good, upon special occasions, and when we find our hearts enlarged, to continue long in secret prayer, and in pouring out our hearts before the Lord. It is no new thing for Christ's disciples to meet with storms in the way of duty, but he thereby shows himself with the more grace to them and for them. He can take what way he pleases to save his people. But even appearances of deliverance sometimes occasion trouble and perplexity to God's people, from mistakes about Christ. Nothing ought to affright those that have Christ near them, and know he is theirs; not death itself. Peter walked upon the water, not for diversion or to boast of it, but to go to Jesus; and in that he was thus wonderfully borne up. Special supports are promised, and are to be expected, but only in spiritual pursuits; nor can we ever come to Jesus, unless we are upheld by his power. Christ bade Peter come, not only that he might walk upon the water, and so know his Lord's power, but that he might know his own weakness. And the Lord often lets his servants have their choice, to humble and prove them, and to show the greatness of his power and grace. When we look off from Christ, and look at the greatness of opposing difficulties, we shall begin to fall; but when we call to him, he will stretch out his arm, and save us. Christ is the great Saviour; those who would be saved, must come to him, and cry to him, for salvation; we are never brought to this, till we find ourselves sinking: the sense of need drives us to him. He rebuked Peter. Could we but believe more, we should suffer less. The weakness of faith, and the prevailing of our doubts, displease our Lord Jesus, for there is no good reason why Christ's disciples should be of a doubtful mind. Even in a stormy day he is to them a very present help. None but the world's Creator could multiply the loaves, none but its Governor could tread upon the waters of the sea: the disciples yield to the evidence, and confess their faith. They were suitably affected, and worshipped Christ. He that comes to God, must believe; and he that believes in God, will come, Heb 11:6.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Peter answered ... - Here is an instance of the characteristic ardor and rashness of Peter. He had less real faith than he supposed, and more ardor than his faith would justify. He was rash, headlong, incautious, really attached to Jesus, but still easily daunted and prone to fall. He was afraid, therefore, when in danger, and, sinking, cried again for help. Thus he was suffered to learn his own character, and his dependence on Jesus: a lesson which all Christians are permitted sooner or later to learn by dear-bought experience. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29. And he said, Come. And when Peter had come down out of the boat. he walked on the water, to go to Jesus—(Also see on [1305]Mr 6:50.)",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 14:31\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said, come,.... This he said, partly to assure them who he was; for had he denied him, he and the rest might have concluded, it was none of Jesus; and partly to commend his love, and confirm his faith, by giving a further instance of his power, in enabling him to walk upon the water, as he did: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and when Peter was come down out of the ship; as he immediately did, having orders from Christ; and being by this second speech fully convinced it was he ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he walked on the water; a little way, being supported and enabled by the power of Christ; for this was an extraordinary and miraculous action: for if it was so in Christ, it was much more so in Peter: Christ walked upon the water by his own power, as God; Peter walked upon the water, being held up by the power of Christ. The Jews (w) indeed, call swimming   , \"walking upon the face of the waters\": hence we read of a swimmer's vessel, which is explained to be what men make to learn in it, how    \"to go or walk upon the face of the waters\" (x); but then this is not going upon them upright, but prone, or lying along upon the surface of the waters, which was not Peter's case; he did not, as at another time, cast himself into the sea, and swim to Christ; see John 21:7 but as soon as he came down from the ship, standing upright, he walked upon the waters, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he walked on the water; a little way, being supported and enabled by the power of Christ; for this was an extraordinary and miraculous action: for if it was so in Christ, it was much more so in Peter: Christ walked upon the water by his own power, as God; Peter walked upon the water, being held up by the power of Christ. The Jews (w) indeed, call swimming   , \"walking upon the face of the waters\": hence we read of a swimmer's vessel, which is explained to be what men make to learn in it, how    \"to go or walk upon the face of the waters\" (x); but then this is not going upon them upright, but prone, or lying along upon the surface of the waters, which was not Peter's case; he did not, as at another time, cast himself into the sea, and swim to Christ; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 21:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but as soon as he came down from the ship, standing upright, he walked upon the waters, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "to go to Jesus; not merely for walking sake, but for the sake of Christ, he dearly loved; that he might be with him, and be still more confirmed of the truth of its being he, and not a spirit. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) R. David Kimchi, Sepher Shorash. rad.  (x) R. Sol. Urbin. Ohel moed, fol. 78. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) R. David Kimchi, Sepher Shorash. rad.  (x) R. Sol. Urbin. Ohel moed, fol. 78. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said, Come. And when Peter was come down out of the ship, he walked on the water, to go to Jesus.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he said, Come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The boat was so near that the voice of Jesus could be heard even through the storm, though the wind was strong and the oarsmen labouring and perhaps calling out to one another. The hand of the Saviour was quite close to the sinking disciple.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐλθε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") More is required of him who offers himself spontaneously to Christ; he is more greatly tempted, more mightily preserved.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said, Come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Our Lord takes him at his word, and gives the command. It is not merely a permission. Observe that our Lord never blames him for having made the request. His venture of faith would have been altogether successful had his faith continued. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Peter was come down out of the ship.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Revised Version has more simply, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And Peter went down from the boat, and. He walked on the water.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Peter went down from the boat, and.",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " He walked on the water.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For the narrator was chiefly interested in his walking there (contrast ver. 28). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To go to Jesus;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and came to Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Westcott and Hort; cf. margin of Revised Version). The true text states what did, in fact, happen, notwithstanding Peter's lack of faith (cf. ver. 31). Matthew 14:29",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To go to (ἐλθεῖν πρὸς)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But some of the best texts read καὶ ἦλθεν πρὸς, and went toward. ",
        "children": []
      }
    ]
  }
]