[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The king was sorry.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It was the last struggle of conscience. In that moment there must have come before his mind his past reverence for the prophet, the joy which had for a time accompanied the strivings of a better life, possibly the counsels of his foster-brother Manaen. Had there been only the personal influence of Herodias these might have prevailed against it, but, like most weak men, Herod feared to be thought weak. It was not so much his regard for the oath which he had taken (that, had it been taken in secret, he might have got over), but his shrinking from the taunt, or whispered jest, or contemptuous gesture of the assembled guests, if they should see him draw back from his plighted word. A false regard for public opinion, for what people will say or think of us in our own narrow circle, was in this, as in so many other instances, an incentive to guilt instead of a restraint.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-12 The terror and reproach of conscience, which Herod, like other daring offenders, could not shake off, are proofs and warnings of a future judgment, and of future misery to them. But there may be the terror of convictions, where there is not the truth of conversion. When men pretend to favour the gospel, yet live in evil, we must not favour their self-delusion, but must deliver our consciences as John did. The world may call this rudeness and blind zeal. False professors, or timid Christians, may censure it as want of civility; but the most powerful enemies can go no further than the Lord sees good to permit. Herod feared that the putting of John to death might raise a rebellion among the people, which it did not; but he never feared it might stir up his own conscience against him, which it did. Men fear being hanged for what they do not fear being damned for. And times of carnal mirth and jollity are convenient times for carrying on bad designs against God's people. Herod would profusely reward a worthless dance, while imprisonment and death were the recompence of the man of God who sought the salvation of his soul. But there was real malice to John beneath his consent, or else Herod would have found ways to get clear of his promise. When the under shepherds are smitten, the sheep need not be scattered while they have the Great Shepherd to go to. And it is better to be drawn to Christ by want and loss, than not to come to him at all.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the king was sorry - There might have been several reasons for this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Herod had a high respect for John, and feared him. He knew that he was a holy man, and had \"observed him,\" Mark 6:20. In the margin (Mark) this is \"kept him,\" or \"saved him.\" In fact he had interposed and saved John from being put to death by Herodias, who had had a quarrel with John, and would have killed him but for Herod, Mark 6:19. Herod, though a bad man, had a respect and veneration for John as a holy and just man, as wicked people often will have.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. Herod had a high respect for John, and feared him. He knew that he was a holy man, and had \"observed him,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 6:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In the margin (Mark) this is \"kept him,\" or \"saved him.\" In fact he had interposed and saved John from being put to death by Herodias, who had had a quarrel with John, and would have killed him but for Herod, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 6:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Herod, though a bad man, had a respect and veneration for John as a holy and just man, as wicked people often will have.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "2. John was in high repute among the people, and Herod might have been afraid that his murder might excite commotion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. Herod, though a wicked man, does not appear to have been insensible to some of the common principles of human nature. Here was a great and most manifest crime proposed - no less than the murder of an acknowledged prophet of the Lord. It was deliberate. It was to gratify the malice of a wicked woman. It was the price of a few moments' entertainment. His conscience, though in feeble and dying accents, checked him. He would have preferred a request not so manifestly wicked, and that would not have involved him in so much difficulty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the oath's sake - Herod felt that he was bound by this oath; but he was not. The oath should not have been taken: but, being taken, he could not be bound by it. No oath could justify a man in committing murder. The true principle is, that Herod was bound by a prior obligation - by the law of God - not to commit murder; and no act of his, be it an oath or anything else, could free him from that obligation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And them which sat with him at meat - This was the strongest reason why Herod murdered John. He had not firmness enough to obey the law of God and to follow the dictates of conscience against the opinions of wicked people. He was afraid of the charge of cowardice and want of spirit; afraid of ridicule and the contempt of the wicked. This is the principle of the laws of honor; this the foundation of dwelling. It is not so much for his own sake that one man murders another in a duel, for the offence is often a mere trifle - it is a word, or look, that never would injure him. It is because the \"men of honor,\" as they call themselves, his companions, would consider him a coward and would laugh at him. Those companions may be unprincipled contemners of the laws of God and man; and yet the duellist, against his own conscience, against the laws of God, against the good opinion of the virtuous part of the world, and against the laws of his country, seeks by deadly aim to murder another merely to gratify his dissolute companions. And this is the law of honor! This is the secret of duelling! This the source of that remorse that settles in awful blackness, and that thunders damnation around the duellist in his dying hours! It should be added, this is the course of all youthful guilt. Young men are led along by others. They have not firmness enough to follow the teachings of a father and of the law of God. They are afraid of being called mean and cowardly by the wicked; and they often sink low in vice and crime, never to rise again.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "At meat - That is, at supper. The word \"meat,\" at the time the Bible was translated, meant provisions of all kinds. It is now restricted to flesh, and does not convey a full idea of the original.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "At meat - That is, at supper. The word \"meat,\" at the time the Bible was translated, meant provisions of all kinds. It is now restricted to flesh, and does not convey a full idea of the original.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. And said unto his servants—his counsellors or court-ministers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This is John the Baptist: he is risen from the dead, &c.—The murdered prophet haunted his guilty breast like a specter and seemed to him alive again and clothed with unearthly powers in the person of Jesus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Account of the Baptist's Imprisonment and Death (Mt 14:3-12). For the exposition of this portion, see on [1301]Mr 6:17-29.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 14:11\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the king was sorry,.... As he might be upon many accounts; partly on account of John, whom, notwithstanding his freedom in reproving him, he had a respect; and partly on his own account, his conscience dictating to him that it was an evil action, and would leave a brand of perpetual infamy upon him; as also on account of the people, who were so much affected to John, lest they should make an insurrection, and rebel against him; and likewise, because it was reckoned an ill omen with the Romans, to take away life on that day they received their own; and therefore carefully abstained, on such days, from executions. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nevertheless for his oath's sake; that he might not be guilty of perjury, chose rather to commit murder; though it would have been no iniquity in him, to have acted contrary to such a rash promise, and wicked oath; which would have been better to have been broke, than kept; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and them which sat with him at meat; lest he should be thought by them fickle and inconstant, and not a man of his word, and who had no regard to an oath: or it may be, they, either to curry favour with Herodias, or out of ill will they might bear to John; or in great respect to the damsel, who had so well pleased them with her dancing; instead of dissuading him from it, pressed him much to perform his promise: and therefore, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he commanded it to be given her; in the form and manner she requested it. Some have thought, that the whole of this affair was a concerted scheme; and that Herod himself was in it, though he pretended to be sorry and uneasy, having fixed on this season as a convenient time for it; and chose to have it done in this way, and in so public a manner, to lessen the odium of it; or otherwise, it is not easy to account for his extravagant promise, and his punctual performance of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he commanded it to be given her; in the form and manner she requested it. Some have thought, that the whole of this affair was a concerted scheme; and that Herod himself was in it, though he pretended to be sorry and uneasy, having fixed on this season as a convenient time for it; and chose to have it done in this way, and in so public a manner, to lessen the odium of it; or otherwise, it is not easy to account for his extravagant promise, and his punctual performance of it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the king was sorry: nevertheless for the oath's sake, and them which sat with him at meat, he commanded it to be given her.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Λυπηθείς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he was annoyed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διότι ἔμελλε μέγαν ἀνελεῖν ἄνδρα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ κινῆσαι πρὸς μῖσος ἑαυτοῦ τὸν ὄχλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Euth. Zigabenus, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Altogether, he was deeply pained at finding matters take this sudden and tragic turn, which is not inconsistent with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but may be accounted for psychologically as arising out of that disturbed state of the conscience which this unlooked-for catastrophe has occasioned; consequently, we must not, with Schneckenburger, suppose (comp. Weiss and Holtzmann) that Matthew has failed to notice Mark’s statement that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Herodias",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was desirous to see John put to death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " circumstance is involved in what Matthew says in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Bengel appropriately observes: “Latuerat in rege judicii aliquid.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ τοὺς ὅρκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μεθʼ ὅρκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " represents a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "series",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of oaths that had been given, one at one time and another at another.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συνανακειμένους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] to whom he did not wish to appear as perjured. A case of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unlawful",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " adhering to an oath, similar in its character to what was done by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jephthah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λυπηθεὶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": participle used concessively, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "though",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " grieved he granted the request, the grief quite compatible with the truculent wish in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βασιλεύς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": only by courtesy.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅρκους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", plural, singular in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; spoken in passion, more like profane swearing than deliberate utterance once for all of a solemn oath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the oaths’ sake",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] “Because of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "oaths;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” he had sworn repeatedly.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐλυπήθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Conscience was not yet entirely banished from the monarch’s breast. The sudden necessity of executing an evil purpose startles even the worst. The joys of this world are accompanied by sadness.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ βασιλεὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") strictly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tetrarch",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συνανακειμένους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "reclining at his table",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The king feared the guests, the guests the king. By not interceding as they ought to have done for John, they became accomplices in his murder.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the king was sorry: nevertheless for the oath's sake;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and though the king was grieved, yet for the sake of his oaths",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ λυπηθεὶς ὁ βασιλεὺς διὰ τὺος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὅρκους κ.τ.λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). That he was grieved at John's death is a verbal contradiction to  ver. 5, but after some weeks' or months' delay psychologically quite possible (cf. note there). Kubel attributes the change to his conscience recoiling when his wish had a sudden chance of being accomplished; or it may be that he still fearest the multitude (cf. ver. 5), and felt anxious lest he should bring about some political disturbance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Oaths",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for in making the promise of ver. 7 he would certainly take more than one. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And them which sat with him at meat.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Had he uttered the promise and the oaths in private, it would have been different, but now there were so many witnesses. Observe that these said nothing to stop him. They were no friends of the enthusiast who was now a prisoner. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He commanded it to be given her.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Matthew 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The oath's sake (διὰ τοὺς ὅρκους)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the A. V. puts the apostrophe in the wrong place. The word is plural, and the Rev. rightly renders for the sake of his oaths. It is implied that Herod in his mad excitement had confirmed his promise with repeated oaths. ",
        "children": []
      }
    ]
  }
]