[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:1-10 As soon as they were come into Canaan, they must set up a monument, on which they must write the words of this law. They must set up an altar. The word and prayer must go together. Though they might not, of their own heads, set up any altar besides that at the tabernacle; yet, by the appointment of God, they might, upon special occasion. This altar must be made of unhewn stones, such as they found upon the field. Christ, our Altar, is a stone cut out of the mountain without hands, refused by the builders, as having no form or comeliness, but accepted of God the Father, and made the Head of the corner. In the Old Testament the words of the law are written, with the curse annexed; which would overcome us with horror, if we had not, in the New Testament, an altar erected close by, which gives consolation. Blessed be God, the printed copies of the Scriptures among us, do away the necessity of such methods as were presented to Israel. The end of the gospel ministry is, and the end of preachers ought to be, to make the word of God as plain as possible. Yet, unless the Spirit of God prosper such labours with Divine power, we shall not, even by these means, be made wise unto salvation: for this blessing we should therefore daily and earnestly pray.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In mount Ebal - Compare the marginal references. The Samaritan Pentateuch and Version read here Gerizim instead of Ebal; but the original text was probably, as nearly all modern authorities hold, altered in order to lend a show of scriptural sanction to the Samaritan temple on Mount Gerizim.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The erection of the altar, the offering thereon burnt-offerings and peace-offerings Deuteronomy 27:6-7, the publication of the Law in writing, form altogether a solemn renewal of the covenant on the entrance of the people into the promised land, and recall the ceremonies observed on the original grant of the covenant at Sinai (compare Exodus 24:5). And Ebal (the mount of \"barrenness \"),the mount of cursing, was the fitting spot on which to celebrate them. For the curses were the penalties under which the children of Israel bound themselves to keep the Law. Suitably also was the same place selected as that in which were to be set up both the monumental stones containing the Law, and the altar at which the covenant was to be renewed. We must note too the fact that Deuteronomy 27:15 ff set out verbatim the curses only, the blessings being omitted. The law because of man's sinfulness brings on him first and chiefly a curse: compare Deuteronomy 31:16-17; Galatians 3:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The erection of the altar, the offering thereon burnt-offerings and peace-offerings ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 27:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the publication of the Law in writing, form altogether a solemn renewal of the covenant on the entrance of the people into the promised land, and recall the ceremonies observed on the original grant of the covenant at Sinai (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). And Ebal (the mount of \"barrenness \"),the mount of cursing, was the fitting spot on which to celebrate them. For the curses were the penalties under which the children of Israel bound themselves to keep the Law. Suitably also was the same place selected as that in which were to be set up both the monumental stones containing the Law, and the altar at which the covenant was to be renewed. We must note too the fact that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 27:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff set out verbatim the curses only, the blessings being omitted. The law because of man's sinfulness brings on him first and chiefly a curse: compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 31:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. thou shalt write upon them all the words of this law—It might be, as some think, the Decalogue; but a greater probability is that it was \"the blessings and curses,\" which comprised in fact an epitome of the law (Jos 8:34).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mount Ebal; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the mount of cursing. Here the law is written, to signify that a curse was due to the violators of it, and that no man could expect justification or blessing from the works of the law, by the sentence whereof all men are justly accursed, as being all guilty of the transgression of it in one kind and deuce or other. Here the sacrifices are to be offered, to show that there is no way to be delivered from this curse but by the blood of Christ, which all these sacrifices did typify, and by Christ’s being made a curse for us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Galatians 3:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And therefore it shall be, when ye be gone over Jordan,.... Some time after they had passed that river: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that ye shall set up these stones, which I command you this day, in Mount Ebal; a mountain near Shechem in Samaria, and was, as Benjamin of Tudela says (r), dry as stones and rocks itself, and perhaps had its name, as some think (s), from the root in the Arabic language which signifies to strip a tree of its leaves, and a derivative from it, white stones and a mountain in which such are found. Hither the stones commanded to be set up were to be brought, and fixed here; from whence it is not certain; it may be from some part of the mountain. Here the Samaritan version has Gerizim instead of Ebal, which is generally thought to be a wilful corruption of the Samaritans, in favour of their temple built at Gerizim: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and thou shall plaster them with plaster; as before directed, Deuteronomy 27:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and thou shall plaster them with plaster; as before directed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 27:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Itinerar. p. 40. (s) Reland. Dissert. 3. de Monte Gerizim, p. 128. See Castel. Lexic. Heptaglott col 2642. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) Itinerar. p. 40. (s) Reland. Dissert. 3. de Monte Gerizim, p. 128. See Castel. Lexic. Heptaglott col 2642. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore it shall be when ye be gone over Jordan, that ye shall set up these stones, which I command you this day, in mount Ebal, and thou shalt plaster them with plaster.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which I command you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] LXX B, etc., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; other codd. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in mount Ebal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and introd. note to this passage. Sam. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gerizîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the sacred mountain of the Samaritans. How far this direction for the site of the erected stones is consistent with that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deuteronomy 27:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 27:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on the day on which ye shall pass over Jordan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", may be seen from the following. Mt ‘Ebal is about 18 miles from the nearest of the Jordan fords, at the present Jisr ed-Damieh, the most natural place of passage from E. to W. Palestine. Even if the writer intended this as the place of Israel’s crossing of the Jordan the interval is considerable between it and their arrival at Shechem. And, of course, the interval between Israel’s crossing at Jericho and their attainment of Shechem, as recorded in the Book of Joshua, is very much greater.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The stones were to be set up on Mount Ebal (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Samaritan Codex and Version have Gerizim here, in place of Ebal; but though some critics have accepted this, it is generally regarded as an arbitrary alteration introduced to favor Samaritan pretensions (see the exhaustive and conclusive Dissertation of Gesenius, 'De Pentat. Samarit'). All the ancient versions, as well as all the Hebrew manuscripts, support the received text. Deuteronomy 27:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the further expansion of this command, Moses first of all fixes the place where the stones were to be set up, namely, upon Mount Ebal (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), - not upon Gerizim, according to the reading of the Samaritan Pentateuch; for since the discussion of the question by Verschuir (dissertt. phil. exeg. diss. 3) and Gesenius (de Pent. Samar. p. 61), it may be regarded as an established fact, that this reading is an arbitrary alteration. The following clause, \"thou shalt plaister,\" etc., is a repetition in the earliest form of historical writing among the Hebrews. To this there are appended in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the new and further instructions, that an altar was to be built upon Ebal, and burnt-offerings and slain-offerings to be sacrificed upon it. The notion that this altar was to be built of the stones with the law written upon them, or even with a portion of them, needs no refutation, as it has not the slightest support in the words of the text. For according to these the altar was to be built of unhewn stones (therefore not of the stones covered with cement), in obedience to the law in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the exposition of this passage, where the reason for this is discussed). The spot selected for the setting up of the stones with the law written upon it, as well as for the altar and the offering of sacrifice, was Ebal, the mountain upon which the curses were to be proclaimed; not Gerizim, which was appointed for the publication of the blessings, for the very same reason for which only the curses to be proclaimed are given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". and not the blessings, - not, as Schultz supposes, because the law in connection with the curse speaks more forcibly to sinful man than in connection with the blessing, or because the curse, which manifests itself on every hand in human life, sounds more credible than the promise; but, as the Berleburger Bible expresses it, \"to show how the law and economy of the Old Testament would denounce the curse which rests upon the whole human race because of sin, to awaken a desire for the Messiah, who was to take away the curse and bring the true blessing instead.\" For however remote the allusion to the Messiah may be here, the truth is unquestionably pointed out in these instructions, that the law primarily and chiefly brings a curse upon man because of the sinfulness of his nature, as Moses himself announces to the people in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And for this very reason the book of the law was to be laid by the side of the ark of the covenant as a \"testimony against Israel\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 31:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But the altar was built for the offering of sacrifices, to mould and consecrate the setting up of the law upon the stones into a renewal of the covenant. In the burnt-offerings Israel gave itself up to the Lord with all its life and labour, and in the sacrificial meal it entered into the enjoyment of the blessings of divine grace, to taste of the blessedness of vital communion with its God. By connecting the sacrificial ceremony with the setting up of the law, Israel gave a practical testimony to the fact that its life and blessedness were founded upon its observance of the law. The sacrifices and the sacrificial meal have the same signification here as at the conclusion of the covenant at Sinai (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the writing of the law upon the stones is commanded once more, and the further injunction is added, \"very plainly.\" - The writing of the law is mentioned last, as being the most important, and not because it was to take place after the sacrificial ceremony. The different instructions are arranged according to their character, and not in chronological order.",
        "children": []
      }
    ]
  }
]