[{"num":14,"verse":"These are the inheritances in the land of Canaan distributed to the Israelites by Eleazar the priest, Joshua son of Nun, and the heads of the fathers’ houses of their tribes."},{"num":2,"verse":"Their inheritance was by lot, as the Lord commanded Moses, for the nine and one-half tribes."},{"num":3,"verse":"For Moses had given an inheritance to the two and one-half tribes beyond the Jordan, but to the Levites he gave no inheritance among them,"},{"num":4,"verse":"For the people of Joseph were two tribes, Manasseh and Ephraim. And no part was given in the land to the Levites except cities in which to live, with their pasturelands for their livestock and for their possessions."},{"num":5,"verse":"As the Lord commanded Moses, so the Israelites did, and they divided the land."},{"num":6,"verse":"Then the people of Judah came to Joshua in Gilgal, and Caleb son of Jephunneh the Kenizzite said to him, You know what the Lord said to Moses the man of God concerning me and you in Kadesh-barnea."},{"num":7,"verse":"Forty years old was I when Moses the servant of the Lord sent me from Kadesh-barnea to scout out the land. And I brought him a report as it was in my heart."},{"num":8,"verse":"But my brethren who went up with me made the hearts of the people melt; yet I wholly followed the Lord my God."},{"num":9,"verse":"And Moses swore on that day, Surely the land on which your feet have walked shall be an inheritance to you and your children always, because you have wholly followed the Lord my God."},{"num":10,"verse":"And now, behold, the Lord has kept me alive, as He said, these forty-five years since the Lord spoke this word to Moses, while the Israelites wandered in the wilderness; and now, behold, I am this day eighty-five years old."},{"num":11,"verse":"Yet I am as strong today as I was the day Moses sent me; as my strength was then, so is my strength now for war and to go out and to come in."},{"num":12,"verse":"So now give me this hill country of which the Lord spoke that day. For you heard then how the [giantlike] Anakim were there and that the cities were great and fortified; if the Lord will be with me, I shall drive them out just as the Lord said."},{"num":13,"verse":"Then Joshua blessed him and gave Hebron to Caleb son of Jephunneh for an inheritance."},{"num":14,"verse":"So Hebron became the inheritance of Caleb son of Jephunneh the Kenizzite to this day, because he wholly followed the Lord, the God of Israel."},{"num":15,"verse":"The name of Hebron before was Kiriath-arba [city of Arba]. This Arba was the greatest of the Anakim. And the land had rest from war."}]