[{"num":14,"verse":"Eleazar the priest [the son of Aaron; Ex. 28:1; Num. 34:17], Joshua son of Nun, and the ·leaders [heads of the fathers] of all the tribes of Israel decided what land to give to the people in the land of Canaan. "},{"num":2,"verse":"The Lord had commanded Moses long ago how he wanted the people to choose their land. The people of the nine-and-a-half tribes threw lots [casting lots left the decision to God; the Urim and Thummim may have been used; Ex. 28:30; Num. 27:21] to decide which land they would receive. "},{"num":3,"verse":"Moses had already given the two-and-a-half tribes their land east of the Jordan River. But the tribe of Levi was not given any ·land [inheritance] like the others. "},{"num":4,"verse":"The sons of Joseph had ·divided into [become] two tribes—Manasseh and Ephraim. The tribe of Levi was not given any ·land [inheritance]. It was given only some towns in which to live and pastures for its ·animals [cattle and property]. "},{"num":5,"verse":"The Lord had told Moses how to give the land to the tribes of Israel, and the ·Israelites [sons/children of Israel] divided the land."},{"header":"Caleb’s Land"},{"num":6,"verse":"One day ·some men from the tribe of Judah [the sons/descendants of Judah] went to Joshua at Gilgal [4:19]. Among them was Caleb son of Jephunneh the Kenizzite. He said to Joshua, “You remember what the Lord said at Kadesh Barnea when he was speaking to ·the prophet Moses [Moses, the man of God] about you and me [Num. 14:6–9, 24, 30]. "},{"num":7,"verse":"Moses, the Lord’s servant, sent me to ·look at [spy out] the land where we were going. I was forty years old then. When I came back, I ·told Moses what I thought about the land [brought back an honest report; brought him word as it was in my heart; Num. 13:30]. "},{"num":8,"verse":"The other men who went with me ·frightened the people [made the heart of the people melt; Num. 13:27–29; 14:1–4], but I ·fully believed the Lord would allow us to take the land [or remained loyal to the Lord; followed the Lord]. "},{"num":9,"verse":"So that day Moses ·promised [swore to; made an oath to] me, ‘The land where ·you went [your foot has trodden] will become your ·land [inheritance], and your children will own it forever. I will give you that land because you ·fully believed in [or remained loyal to; followed] the Lord, my God.’"},{"num":10,"verse":"“Now then, [look; behold] the Lord has kept his promise. He has kept me alive for forty-five years from the time he said this to Moses during the time ·we all [Israel] wandered in the ·desert [wilderness]. Now ·here [look; behold] I am, eighty-five years old. "},{"num":11,"verse":"I am still as strong today as I was the day Moses sent me out, ·and I am just as ready to fight now as I was then [my strength then is like my strength now, for battle and for going out and coming in]. "},{"num":12,"verse":"So give me the mountain country the Lord promised me that day long ago. Back then you heard that the ·Anakite people [Anakim] lived there and the cities were large and well protected. But now with the Lord helping me, I will ·force [drive] them out, just as the Lord said.”"},{"num":13,"verse":"Joshua blessed Caleb son of Jephunneh and gave him the city of Hebron [southwest of Jerusalem in the Judean hills] as his ·own [inheritance]. "},{"num":14,"verse":"Hebron still ·belongs to [remains the inheritance of] the family of Caleb son of Jephunneh the Kenizzite because he ·had faith and obeyed [remained loyal to; wholly followed] the Lord, the God of Israel. "},{"num":15,"verse":"(In the past Hebron was called Kiriath Arba, named for Arba, the greatest man among the Anakites.)"}]