[{"header":"The First Stage in Dividing the Land"},{"num":14,"verse":"This is the land that the people of Israel inherited in Canaan. The priest Eleazar, Joshua (son of Nun), and the heads of Israel’s tribes distributed it to the people. "},{"num":2,"verse":"The land inherited by the nine-and-a-half tribes was determined by drawing lots as Yahweh had commanded through Moses. "},{"num":3,"verse":"Moses had given the two-and-a-half tribes their inheritance east of the Jordan River. He did not give any land as an inheritance to Levi’s tribe, "},{"num":4,"verse":"because Joseph’s descendants, Manasseh and Ephraim, formed two tribes. The Levites were not given a share of the land. Joseph’s descendants gave the Levites cities to live in with pasturelands for their cattle and everything they had. "},{"num":5,"verse":"So the people of Israel divided the land as Yahweh had commanded Moses."},{"header":"Special Land for Caleb"},{"num":6,"verse":"Then the people of Judah came to Joshua at Gilgal. Caleb, son of Jephunneh and grandson of Kenaz, said to him, “You know what Yahweh said to Moses, the man of Elohim, at Kadesh Barnea about you and me. "},{"num":7,"verse":"I was 40 years old when Yahweh’s servant Moses sent me from Kadesh Barnea to explore the land. I reported to him exactly what I thought. "},{"num":8,"verse":"But my companions discouraged the people. However, I was completely loyal to Yahweh my Elohim. "},{"num":9,"verse":"On that day Moses swore this oath: ‘The land your feet walked on will be a permanent inheritance for you and your descendants because you were completely loyal to Yahweh my Elohim.’"},{"num":10,"verse":"“So look at me. Yahweh has kept me alive as he promised. It’s been 45 years since Israel wandered in the desert when Yahweh made this promise to Moses. So now look at me today. I’m 85 years old. "},{"num":11,"verse":"I’m still as fit to go to war now as I was when Moses sent me out. "},{"num":12,"verse":"Now give me this mountain region which Yahweh spoke of that day. You heard that the people of Anak are still there and that they have large, fortified cities. If Yahweh is with me, I can force them out, as Yahweh promised.”"},{"num":13,"verse":"So Joshua blessed Caleb, son of Jephunneh, and gave him Hebron as his inheritance. "},{"num":14,"verse":"Hebron is still the inheritance of Caleb, son of Jephunneh and grandson of Kenaz, because Caleb was completely loyal to Yahweh Elohim of Israel. "},{"num":15,"verse":"In the past Hebron was called Kiriath Arba. Arba was the greatest man among the people of Anak. So the land had peace."}]