[{"num":10,"verse":"And when the queen of Sheba heard of the fame of Solomon concerning the name of the Lord, she came to test him with hard questions."},{"num":2,"verse":"And she came to Jerusalem with a very great train, with camels that bore spices and very much gold and precious stones; and when she had come to Solomon, she communed with him about all that was in her heart."},{"num":3,"verse":"And Solomon told her all her questions; there was not any thing hidden from the king which he told her not."},{"num":4,"verse":"And when the queen of Sheba had seen all Solomon’s wisdom, and the house that he had built,"},{"num":5,"verse":"and the meat of his table, and the sitting of his servants, and the attendance of his ministers, and their apparel, and his cupbearers, and his ascent by which he went up unto the house of the Lord, there was no more spirit in her."},{"num":6,"verse":"And she said to the king, “It was a true report that I heard in mine own land of thy acts and of thy wisdom."},{"num":7,"verse":"However I believed not the words until I came and mine eyes had seen it; and behold, the half was not told me. Thy wisdom and prosperity exceedeth the fame which I heard."},{"num":8,"verse":"Happy are thy men, happy are these thy servants, who stand continually before thee and who hear thy wisdom."},{"num":9,"verse":"Blessed be the Lord thy God, who delighted in thee, to set thee on the throne of Israel! Because the Lord loved Israel for ever, therefore made He thee king to do judgment and justice.”"},{"num":10,"verse":"And she gave the king a hundred and twenty talents of gold, and of spices a very great store, and precious stones; there came no more such abundance of spices as these which the queen of Sheba gave to King Solomon."},{"num":11,"verse":"And the navy also of Hiram, that brought gold from Ophir, brought in from Ophir a great plenty of almug trees and precious stones."},{"num":12,"verse":"And the king made of the almug trees pillars for the house of the Lord and for the king’s house, harps also and psalteries for singers. There came no more such almug trees, nor were seen unto this day."},{"num":13,"verse":"And King Solomon gave unto the queen of Sheba all her desire, whatsoever she asked, besides that which Solomon gave her of his royal bounty. So she turned and went to her own country, she and her servants."},{"num":14,"verse":"Now the weight of gold that came to Solomon in one year was six hundred threescore and six talents of gold,"},{"num":15,"verse":"besides what he had from the merchants, and from the traffic of the spice merchants, and from all the kings of Arabia, and from the governors of the country."},{"num":16,"verse":"And King Solomon made two hundred bucklers of beaten gold; six hundred shekels of gold went to one buckler."},{"num":17,"verse":"And he made three hundred shields of beaten gold; three pounds of gold went to one shield. And the king put them in the House of the Forest of Lebanon."},{"num":18,"verse":"Moreover the king made a great throne of ivory, and overlaid it with the best gold."},{"num":19,"verse":"The throne had six steps, and the top of the throne was round behind and there were stays on either side on the place of the seat, and two lions stood beside the stays."},{"num":20,"verse":"And twelve lions stood there on the one side and on the other upon the six steps. There was not the like made in any kingdom."},{"num":21,"verse":"And all King Solomon’s drinking vessels were of gold, and all the vessels of the House of the Forest of Lebanon were of pure gold. None were of silver; it was accounted as nothing in the days of Solomon."},{"num":22,"verse":"For the king had at sea a navy of Tarshish with the navy of Hiram. Once in three years came the navy of Tarshish bringing gold and silver, ivory, and apes, and peacocks."},{"num":23,"verse":"So King Solomon exceeded all the kings of the earth in riches and in wisdom."},{"num":24,"verse":"And all the earth sought Solomon to hear his wisdom, which God had put in his heart."},{"num":25,"verse":"And they brought every man his present: vessels of silver and vessels of gold, and garments, and armor, and spices, horses, and mules, at a set rate year by year."},{"num":26,"verse":"And Solomon gathered together chariots and horsemen; and he had a thousand and four hundred chariots and twelve thousand horsemen, whom he placed in the cities for chariots and with the king at Jerusalem."},{"num":27,"verse":"And the king made silver to be in Jerusalem as stones, and cedars made he to be as the sycamore trees that are in the vale, for abundance."},{"num":28,"verse":"And Solomon had horses brought out of Egypt, and linen yarn; the king’s merchants received the linen yarn at a price."},{"num":29,"verse":"And a chariot came up and went out of Egypt for six hundred shekels of silver, and a horse for a hundred and fifty; and so for all the kings of the Hittites and for the kings of Syria they brought them out by their means."}]