[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For though I preach the gospel, I have nothing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to glory of.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For though I preach the gospel, I have no ground of boasting.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " St. Paul proceeds now to show how his maintenance by the Church would deprive him of his right to boast or glory in his work. The mere preaching of the gospel supplies no ground of boasting; it is a necessity; God’s woe would await him in the judgment-if he did not so. A man can have no ground of boasting in doing that which he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Corinthians",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SIN OF SILENCE1 Corinthians 9:16 - 1 Corinthians 9:17",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SIN OF SILENCE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The original reference of these words is to the Apostle’s principle and practice of not receiving for his support money from the churches. Gifts he did accept; pay he did not. The exposition of his reason is interesting, ingenuous, and chivalrous. He strongly asserts his right, even while he as strongly declares that he will waive it. The reason for his waiving it is that he desires to have somewhat in his service beyond the strict line of his duty. His preaching itself, with all its toils and miseries, was but part of his day’s work, which he was bidden to do, and for doing which he deserved no thanks nor praise. But he would like to have a little bit of glad service over and above what he is ordered to do, that, as he ingenuously says, he may have ‘somewhat to boast of.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In this exposition of motives we have two great principles actuating the Apostle-one, his profound sense of obligation, and the other his desire, if it might be, to do more than he was bound to do, because he loved his work so much. And though he is speaking here as an apostle, and his example is not to be unconditionally transferred to us, yet I think that the motives which actuated his conduct are capable of unconditional application to ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are three things here. There is the obligation of speech, there is the penalty of silence, and there is the glad obedience which transcends obligation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, mark the obligation of speech. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, mark the obligation of speech.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "No doubt the Apostle had, in a special sense, a ‘necessity laid upon’ him, which was first laid upon him on that road to Damascus, and repeated many a time in his life. But though he differs from us in the direct supernatural commission which was given to him, in the width of the sphere in which he had to work, and in the splendour of the gifts which were entrusted to his stewardship, he does not differ from us in the reality of the obligation which was laid upon him. Every Christian man is as truly bound as was Paul to preach the Gospel. The commission does not depend upon apostolic dignity. Jesus Christ, when He said, ‘Go ye into all the world, and preach the Gospel to every creature,’ was not speaking to the eleven, but to all generations of His Church. And whilst there are many other motives on which we may rest the Christian duty of propagating the Christian faith, I think that we shall be all the better if we bottom it upon this, the distinct and definite commandment of Jesus Christ, the grip of which encloses all who for themselves have found that the Lord is gracious.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For that commandment is permanent. It is exactly contemporaneous with the duration of the promise which is appended to it, and whosoever suns himself in the light of the latter is bound by the precept of the former. ‘Lo! I am with you alway, even to the end of the world,’ defines the duration of the promise, and it defines also the duration of the duty. Nay, even the promise is made conditional upon the discharge of the duty enjoined. For it is to the Church ‘going into all the world, and preaching the Gospel to every creature,’ that the promise of an abiding presence is made.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us remember, too, that, just because this commission is given to the whole Church, it is binding on every individual member of the Church. There is a very common fallacy, not confined to this subject, but extending over the whole field of Christian duty, by which things that are obligatory on the community are shuffled off the shoulders of the individual. But we have to remember that the whole Church is nothing more than the sum total of all its members, and that nothing is incumbent upon it which is not in their measure incumbent upon each of them. Whatsoever Christ says to all, He says to each, and the community has no duties which you and I have not.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Of course, there are diversities of forms of obedience to this commandment; of course, the restrictions of locality and the other obligations of life, come in to modify it; and it is not every man’s duty to wander over the whole world doing this work. But the direct work of communicating to others who know it not the sweetness and the power of Jesus Christ belongs to every Christian man. You cannot buy yourselves out of the ranks, as they used to be able to do out of the militia, by paying for a substitute. Both forms of service are obligatory upon each of us. We all, if we know anything of Christ and His love and His power, are bound, by the fact that we do know it, to tell it to those whom we can reach. You have all got congregations if you would look for them. There is not a Christian man or woman in this world who has not somebody that he or she can speak to more efficiently than anybody else can. You have your friends, your relations, the people with whom you are brought into daily contact, if you have no wider congregations. You cannot all stand up and preach in the sense in which I do so. But this is not the meaning of the word in the New Testament. It does not imply a pulpit, nor a set discourse, nor a gathered multitude; it simply implies a herald’s task of proclaiming. Everybody who has found Jesus Christ can say, ‘I have found the Messiah,’ and everybody who knows Him can say, ‘Come and hear, and I will tell what the Lord hath done for my soul.’ Since you can do it you are bound to do it; and if you are one of ‘the dumb dogs, lying down and loving to slumber,’ of whom there are such crowds paralysing the energies and weakening the witness of every Church upon earth, then you are criminally and suicidally oblivious of an obligation which is a joy and a privilege as much as a duty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh, brethren! I do want to lay on the consciences of all you Christian people this, that nothing can absolve you from the obligation of personal, direct speech to some one of Christ and His salvation. Unless you can say, ‘I have not refrained my lips, O Lord! Thou knowest,’ there frowns over against you an unfulfilled duty, the neglect of which is laming your spiritual activity, and drying up the sources of your spiritual strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But, then, besides this direct effort, there are the other indirect methods in which this commandment can be discharged, by sympathy and help of all sorts, about which I need say no more here.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Jesus Christ’s ideal of His Church was an active propaganda, an army in which there were no non-combatants, even although some of the combatants might be detailed to remain in the camp and look after the stuff, and others of them might be in the forefront of the battle. But is that ideal ever fulfilled in any of our churches? How many amongst us there are who do absolutely nothing in the shape of Christian work! Some of us seem to think that the voluntary principle on which our Nonconformist churches are largely organised means, ‘I do not need to do anything unless I like. Inclination is the guide of duty, and if I do not care to take any active part in the work of our church, nobody has anything to say.’ No man can force me, but if Jesus Christ says to me, ‘Go!’ and I say, ‘I had rather not,’ Jesus Christ and I have to settle accounts between us. The less ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " control, the more stringent ought to be the control of Christ. And if the principle of Christian obedience is a willing heart, then the duty of a Christian is to see that the heart is willing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A stringent obligation, not to be shuffled off by any of the excuses that we make, is laid upon us all. It makes very short work of a number of excuses. There is a great deal in the tone of this generation which tends to chill the missionary spirit. We know more about the heathen world, and familiarity diminishes horror. We have taken up, many of us, milder and more merciful ideas about the condition of those who die without knowing the name of Jesus Christ. We have taken to the study of comparative religion as a science, forgetting sometimes that the thing that we are studying as a science is spreading a dark cloud of ignorance and apathy over millions of men. And all these reasons somewhat sap the strength and cool the fervour of a good many Christian people nowadays. Jesus Christ’s commandment remains just as it was.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then some of us say, ‘I prefer working at home!’ Well, if you are doing all that you can there, and really are enthusiastically devoted to one phase of Christian service, the great principle of division of labour comes in to warrant your not entering upon other fields which others cultivate. But unless you are thus casting all your energies into the work which you say that you prefer, there is no reason in it why you should do nothing in the other direction. Jesus Christ still says, ‘Go ye into all the world.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then some of you say, ‘Well, I do not much believe in your missionary societies. There is a great deal of waste of money about them. A number of things there are that one does not approve of. I have heard stories about missionaries being very idle, very luxurious, and taking too much pay, and doing too little work.’ Well, be it so! Very probably it is partly true; though I do not know that the people whose testimony is so willingly accepted, to the detriment of our brethren in foreign lands, are precisely the kind of people that should talk much about self-sacrifice and luxurious living, or whose estimate of Christian work is to be relied upon. I fancy many of them, if they walked about the streets of an English town, would have a somewhat similar report to give, as they have when they walk about the streets of an Indian one. But be that as it may, does that indictment draw a wet sponge across the commandment of Jesus Christ? or can you chisel out of the stones of Sinai one of the words written there, by reason of the imperfections of those who are seeking to obey them? Surely not! Christ still says, ‘Go ye into all the world!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I sometimes venture to think that the day will come when the condition of being received into, and retained in, the communion of a Christian church will be obedience to that commandment. Why, even bees have the sense at a given time of the year to turn the drones out of the hives, and sting them to death. I do not recommend the last part of the process, but I am not sure but that it would be a benefit to us all, both to those ejected and to those retained, that we should get rid of that added weight that clogs every organised community in this and other lands-the dead weight of idlers who say that they are Christ’s disciples. Whether it is a condition of church membership or not, sure I am that it is a condition of fellowship with Jesus Christ, and a condition, therefore, of health in the Christian life, that it should be a life of active obedience to this plain, imperative, permanent, and universal command.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Secondly, a word as to the penalty of silence. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Secondly, a word as to the penalty of silence.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Woe is me if I preach not the Gospel.’ I suppose Paul is thinking mainly of a future issue, but not exclusively of that. At all events, let me point you, in a word or two, to the plain penalties of silence here, and to the awful penalties of silence hereafter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Woe is me if I preach not the Gospel.’ If you are a dumb and idle professor of Christ’s truth, depend upon it that your dumb idleness will rob you of much communion with Jesus Christ. There are many Christians who would be ever so much happier, more joyous, and more assured Christians if they would go and talk about Christ to other people. Because they have locked up God’s word in their hearts it melts away unknown, and they lose more than they suspect of the sweetness and buoyancy and assured confidence that might mark them, for no other reason than because they seek to keep their morsel to themselves. Like that mist that lies white and dull over the ground on a winter’s morning, which will be blown away with the least puff of fresh air, there lie doleful dampnesses, in their sooty folds, over many a Christian heart, shutting out the sun from the earth, and a little whiff of wholesome activity in Christ’s cause would clear them all away, and the sun would shine down upon men again. If you want to be a happy Christian, work for Jesus Christ. I do not lay that down as a specific by itself. There are other things to be taken in conjunction with it, but yet it remains true that the woe of a languid Christianity attaches to the men who, being professing Christians, are silent when they should speak, and idle when they should work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is, further, the woe of the loss of sympathies, and the gain of all the discomforts and miseries of a self-absorbed life. And there is, further, the woe of the loss of one of the best ways of confirming one’s own faith in the truth-viz. that of seeking to impart it to others. If you want to learn a thing, teach it. If you want to grasp the principles of any science, try to explain it to somebody who does not understand it. If you want to know where, in these days of jangling and controversy, the true, vital centre of the Gospel is, and what is the essential part of the revelation of God, go and tell sinful men about Jesus Christ who died for them; and you will find out that it is the Cross, and Him who died thereon, as dying for the world, that is the power which can move men’s hearts. And so you will cleave with a closer grasp, in days of difficulty and unsettlement, to that which is able to bring light into darkness and to harmonise the discord of a troubled and sinful soul. And, further, there is the woe of having none that can look to you and say, ‘I owe myself to thee.’ Oh, brethren! there is no greater joy accessible to a man than that of feeling that through his poor words Christ has entered into a brother’s heart. And you are throwing away all this because you shut your mouths and neglect the plain commandment of your Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ay! but that is not all. There is a future to be taken into account, and I think that Christian people do far too little realise the solemn truth that it is not all the same ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "then",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whether a man has kept his Master’s commandments or neglected them. I believe that whilst a very imperfect faith saves a man, there is such a thing as being ‘saved, yet so as through fire,’ and that there is such a thing as having ‘an abundant entrance ministered unto us into the everlasting kingdom.’ He whose life has been very slightly influenced by Christian principle, and who has neglected plain, imperative duties, will not stand on the same level of blessedness as the man who has more completely yielded himself in life to the constraining power of Christ’s love, and has sought to keep all His commandments.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Heaven is not a dead level. Every man there will receive as much blessedness as he is capable of, but capacities will vary, and the principal factor in determining the capacity, which capacity determines the blessedness, will be the thoroughness of obedience to all the ordinances of Christ in the course of the life upon earth. So, though we know, and therefore dare say, little about that future, I do beseech you to take this to heart, that he who there can stand before God, and say, ‘Behold! I and the children whom God hath given me’ will wear a crown brighter than the starless ones of those who saved themselves, and have brought none with them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Some on boards, and some on broken pieces of the ship, they all came safe to land.’ But the place where they stand depends on their Christian life, and of that Christian life one main element is obedience to the commandment which makes them the apostles and missionaries of their Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, note the glad obedience which transcends the limits of obligation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, note the glad obedience which transcends the limits of obligation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘If I do this thing willingly I have a reward.’ Paul desired to bring a little more than was required, in token of his love to his Master, and of his thankful acceptance of the obligation. The artist who loves his work will put more work into his picture than is absolutely needed, and will linger over it, lavishing diligence and care upon it, because he is in love with his task. The servant who seeks to do as little as he can scrape through with without rebuke is actuated by no high motives. The trader who barely puts as much into the scale as will balance the weight in the other is grudging in his dealings; but he who, with liberal hand, gives ‘shaken down, pressed together, and running over’ measure, gives because he delights in the giving.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so it is in the Christian life. There are many of us whose question seems to be, ‘How little can I get off with? how much can I retain?’-many of us whose effort is to find out how much of the world is consistent with the profession of Christianity, and to find the minimum of effort, of love, of service, of gifts which may free us from obligation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And what does that mean? It means that we are slaves. It means that if we durst we would give nothing, and do nothing. And what does that mean? It means that we do not care for the Lord, and have no joy in our work. And what does that mean? It means that our work deserves no praise, and will get no reward. If we love Christ we shall be anxious, if it were possible, to do more than He commands us, in token of our loyalty to the King, and of our delight in the service. Of course, in the highest view, nothing can be more than necessary. Of course He has the right to all our work; but yet there are heights of Christian consecration and self-sacrifice which a man will not be blamed if he has not climbed, and will be praised if he has. What we want, if I might venture to say so, is extravagance of service. Judas may say, ‘To what purpose is this waste?’ but Jesus will say, He ‘hath wrought a good work on Me,’ and the fragrance of the ointment will smell sweet through the centuries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, dear brethren, the upshot of the whole thing is, Do not let us do our Christian work reluctantly, else it is only slave’s work, and there is no blessing in it, and no reward will come to us from it. Do not let us ask, ‘How little may I do?’ but ‘How much can I do?’ Thus, asking, we shall not offer as burnt offering to the Lord that which doth cost us nothing. On His part He has given the commandment as a sign of His love. The stewardship is a token that He trusts us, the duty is an honour, the burden is a grace. On our parts let us seek for the joy of service which is not contented with the bare amount of the tribute that is demanded, but gives something over, if it were possible, because of our love to Him. They who thus give to Jesus Christ their all of love and effort and service will receive it all back a hundredfold, for the Master is not going to be in debt to any of His servants, and He says to them all, ‘I will repay it, howbeit I say not unto thee how thou owest unto Me even thine own self besides.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:15-23 It is the glory of a minister to deny himself, that he may serve Christ and save souls. But when a minister gives up his right for the sake of the gospel, he does more than his charge and office demands. By preaching the gospel, freely, the apostle showed that he acted from principles of zeal and love, and thus enjoyed much comfort and hope in his soul. And though he looked on the ceremonial law as a yoke taken off by Christ, yet he submitted to it, that he might work upon the Jews, do away their prejudices, prevail with them to hear the gospel, and win them over to Christ. Though he would transgress no laws of Christ, to please any man, yet he would accommodate himself to all men, where he might do it lawfully, to gain some. Doing good was the study and business of his life; and, that he might reach this end, he did not stand on privileges. We must carefully watch against extremes, and against relying on any thing but trust in Christ alone. We must not allow errors or faults, so as to hurt others, or disgrace the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For though I preach the gospel ... - This, with the two following verses, is a very difficult passage, and has been very variously understood by interpreters. The general scope and purpose of the passage is to show what was the ground of his \"glorying,\" or of his hope of\" reward\" in preaching the gospel. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". he had intimated that he had cause of\" glorying,\" and that that cause was one which he was determined no one should take away. In this passage ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:16-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". he states what that was. He says, it was not simply that he preached; for there was a necessity laid on him, and he could not help it; his call was such, the command was such, that his life would be miserable if he did not do it, But all idea of \"glorying,\" or of \"reward,\" must be connected with some voluntary service - something which would show the inclination, disposition, desire of the soul. And as that in his case could not be well shown where a \"necessity\" was laid on him, it could be shown only in his submitting voluntarily to trials; in denying himself; in being willing to forego comforts which he might lawfully enjoy; and in thus furnishing a full and complete test of his readiness to do anything to promote the gospel. The essential idea here is, therefore, that there was such a necessity laid on him in his call to preach the gospel, that his compliance with that call could not be regarded as appropriately connected with reward; and that in his case the circumstance which showed that reward would be proper, was, his denying himself, and making the gospel without charge. This would show that \"his heart was in the thing;\" that he was was not urged on by necessity; that he loved the work; and that it would be consistent for the Lord to reward him for his self-denials and toils in his service.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have nothing to glory of - The force of this would be better seen by a more literal translation. \"It is not to me glorying;\" that is, this is not the cause of my glorying, or rejoicing οὐκ ἔστι μοι καύχημα  ouk esti moi kauchēma. In 1 Corinthians 9:15 he had said that he had a cause of glorying, or of joy (καύχημα  kauchēma). He here says that that joy or glorying did not consist in the simple fact that he preached the gospel; for necessity was laid on him; there was some other cause and source of his joy or glorying than that simple fact; 1 Corinthians 9:18. Others preached the gospel also in common with them, it might be a source of joy to him that he preached the gospel; but it was not the source of his special joy, for he had been called into the apostleship in such a manner as to render it inevitable that he should preach the gospel. his glorying was of another kind.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I have nothing to glory of - The force of this would be better seen by a more literal translation. \"It is not to me glorying;\" that is, this is not the cause of my glorying, or rejoicing οὐκ ἔστι μοι καύχημα  ouk esti moi kauchēma. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he had said that he had a cause of glorying, or of joy (καύχημα  kauchēma). He here says that that joy or glorying did not consist in the simple fact that he preached the gospel; for necessity was laid on him; there was some other cause and source of his joy or glorying than that simple fact; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Others preached the gospel also in common with them, it might be a source of joy to him that he preached the gospel; but it was not the source of his special joy, for he had been called into the apostleship in such a manner as to render it inevitable that he should preach the gospel. his glorying was of another kind.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For necessity is laid upon me. - My preaching is in a manner inevitable, and cannot therefore be regarded as that in which I especially glory. I was called into the ministry in a miraculous manner; I was addressed personally by the Lord Jesus; I was arrested when I was a persecutor; I was commanded to go and preach; I had a direct commission from heaven. There was no room for hesitancy or debate on the subject Galatians 1:16, and I gave myself at once and entirely to the work; Acts 9:6. I have been urged to this by a direct call from heaven; and to yield obedience to this call cannot be regarded as evincing such an inclination to give myself to this work as if the call had been in the usual mode, and with less decided manifestations. We are not to suppose that Paul was compelled to preach, or that he was not voluntary in his work, or that he did not prefer it to any other employment, but he speaks in a popular sense, as saying that he \"could not help it;\" or that the evidence of his call was irresistible, and left no room for hesitation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For necessity is laid upon me. - My preaching is in a manner inevitable, and cannot therefore be regarded as that in which I especially glory. I was called into the ministry in a miraculous manner; I was addressed personally by the Lord Jesus; I was arrested when I was a persecutor; I was commanded to go and preach; I had a direct commission from heaven. There was no room for hesitancy or debate on the subject ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and I gave myself at once and entirely to the work; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". I have been urged to this by a direct call from heaven; and to yield obedience to this call cannot be regarded as evincing such an inclination to give myself to this work as if the call had been in the usual mode, and with less decided manifestations. We are not to suppose that Paul was compelled to preach, or that he was not voluntary in his work, or that he did not prefer it to any other employment, but he speaks in a popular sense, as saying that he \"could not help it;\" or that the evidence of his call was irresistible, and left no room for hesitation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He was free; but there was not the slightest room for debate on the subject. The evidence of his call was so strong that he could not but yield. Probably none now have evidences of their call to the ministry as strong as this. But there are many, very many, who feel that a kind of necessity is laid on them to preach. Their consciences urge them to it. They would be miserable in any other employment. The course of Providence has shut them up to it. Like Saul of Tarsus, they may have been persecutors, or revilers, or \"injurious,\" or blasphemers 1 Timothy 1:13; or they may, like him, have commenced a career of ambition; or they may have been engaged in some scheme of money-making or of pleasure; and in an hour when they little expected it, they have been arrested by the truth of God, and their attention directed to the gospel ministry. Many a minister has, before entering the ministry, formed many other purposes of life; but the providence of God barred his way, hemmed in his goings, and constrained him to become an ambassador of the cross.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He was free; but there was not the slightest room for debate on the subject. The evidence of his call was so strong that he could not but yield. Probably none now have evidences of their call to the ministry as strong as this. But there are many, very many, who feel that a kind of necessity is laid on them to preach. Their consciences urge them to it. They would be miserable in any other employment. The course of Providence has shut them up to it. Like Saul of Tarsus, they may have been persecutors, or revilers, or \"injurious,\" or blasphemers ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or they may, like him, have commenced a career of ambition; or they may have been engaged in some scheme of money-making or of pleasure; and in an hour when they little expected it, they have been arrested by the truth of God, and their attention directed to the gospel ministry. Many a minister has, before entering the ministry, formed many other purposes of life; but the providence of God barred his way, hemmed in his goings, and constrained him to become an ambassador of the cross.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Yea, woe is unto me ... - I should be miserable and wretched if I did not preach. My preaching, therefore, in itself considered, cannot be a subject of glorying. I am shut up to it. I am urged to it in every way. I should be wretched were I not to do it, and were I to seek any other calling. My conscience would reproach me. My judgment would condemn me. My heart would pain me. I should have no comfort in any other calling; and God would frown upon me. Hence, learn:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That Paul had been converted. Once he had no love for the ministry, but persecuted the Saviour. With the feelings which he then had, he would have been wretched in the ministry; with those which he now had, he would have been wretched out of it. His heart, therefore, had been wholly changed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) all ministers who are duly called to the work can say the same thing. They would be wretched in any other calling. Their conscience would reproach them. They would have no interest in the plans of the world; in the schemes of wealth, and pleasure, and fame. Their heart is in This work, and in this alone. In this, though amidst circumstances of poverty, persecution, nakedness, cold, peril, sickness, they have comfort. In any other calling, though surrounded by affluence, friends, wealth, honors, pleasures, gaiety, fashion, they would be miserable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) a man whose heart is not in the ministry, and who would be as happy in any other calling, is not fit to be an ambassador of Jesus Christ. Unless his heart is there, and he prefers that to any other calling, he should never think of preaching the gospel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) people who leave the ministry, and voluntarily devote themselves to some other calling when they might preach, never had the proper spirit of an ambassador of Jesus. If for the sake of ease or gain; if to avoid the cares and anxieties of the life of a pastor; if to make money, or secure money when made; if to cultivate a farm, to teach a school, to write a book, to live upon an estate, or to \"enjoy life,\" they lay aside the ministry, it is proof that they never had a call to the work. So did not Paul; and so did not Paul's Master and ours. They loved the work, and they left it not till death. Neither for ease, honor, nor wealth; neither to avoid care, toil, pain, or poverty, did they cease in their work, until the one could say, \"I have fought a good fight, \"I have finished my course,\" I have kept the faith\" (2 Timothy 4:7; and the other, \"I have finished the work which thou gavest me to do;\" John 17:4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) people who leave the ministry, and voluntarily devote themselves to some other calling when they might preach, never had the proper spirit of an ambassador of Jesus. If for the sake of ease or gain; if to avoid the cares and anxieties of the life of a pastor; if to make money, or secure money when made; if to cultivate a farm, to teach a school, to write a book, to live upon an estate, or to \"enjoy life,\" they lay aside the ministry, it is proof that they never had a call to the work. So did not Paul; and so did not Paul's Master and ours. They loved the work, and they left it not till death. Neither for ease, honor, nor wealth; neither to avoid care, toil, pain, or poverty, did they cease in their work, until the one could say, \"I have fought a good fight, \"I have finished my course,\" I have kept the faith\" (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Timothy 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the other, \"I have finished the work which thou gavest me to do;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) we see the reason why people are sometimes \"miserable\" in other callings. They, should have entered the ministry. God called them to it; and they became hopefully pious. But they chose the law, or the practice of medicine, or chose to be farmers, merchants, teachers, professors, or statesmen. And God withers their piety, blights their happiness, follows them with the reproaches of conscience, makes them sad, melancholy, wretched. They do no good; and they have no comfort in life. Ever man should do the will of God, and then every man would be happy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(5) we see the reason why people are sometimes \"miserable\" in other callings. They, should have entered the ministry. God called them to it; and they became hopefully pious. But they chose the law, or the practice of medicine, or chose to be farmers, merchants, teachers, professors, or statesmen. And God withers their piety, blights their happiness, follows them with the reproaches of conscience, makes them sad, melancholy, wretched. They do no good; and they have no comfort in life. Ever man should do the will of God, and then every man would be happy. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. though I preach … I have nothing to glory of—that is, If I preach the Gospel, and do so not gratuitously, I have no matter for \"glorying.\" For the \"necessity\" that is laid on me to preach (compare Jer 20:9, and the case of Jonah) does away with ground for \"glorying.\" The sole ground for the latter that I have, is my preaching without charge (1Co 9:18): since there is no necessity laid on me as to the latter, it is my voluntary act for the Gospel's sake.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For though I preach the gospel, I have nothing to glory of; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though I do preach the gospel, yet I have no reason at all to glory; all that I have to glory in is, that I have preached it freely (which your false apostles and teachers do not); for the preaching of the gospel, considered without that circumstance, I have no reason to glory in that, for I am in it but a servant. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For necessity is laid upon me; yea, woe is unto me, if I preach not the gospel!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I am under the necessity of a Divine precept to do that, and exposed to dreadful penalties and woes if I do not do that; there is therefore no thanks I can claim upon that account; all that I can glory in is, that I do it without charge to those to whom I preach it. Some make a doubt, whether there lieth the same necessity upon ministers now to preach the gospel, and they be liable to the same dangers and penalties, if they do it not. I see no reason at all to doubt it; for what necessity lay upon Paul, or any of the apostles, but a necessity of precept, that is, they were obliged to obey the command of God in the case, and liable to such penalties in case of neglect, as men are subject to that obey not the command of God, in fulfilling the duties of their relations? The same necessity, the same danger, is yet incumbent upon every minister; or else we must say, that the precepts commanding ministers to preach concerned the apostles only, or that there is now no such order of men as ministers (both which are indeed said by Socinians). If there be such an ordinance of God as the ministry, ministers are under the precepts given to ministers, one of which is to preach: if they be under the same precepts, there is the same necessity upon them of obeying them, that was upon Paul, and they are, in case of disobedience, subjected to the same woes and penalties. Indeed, every minister is not bound to go up and down the world to preach, his relation is to a particular flock; that travelling to carry the gospel about the world was peculiar to the apostles, for the first plantation of the gospel; but so was not preaching; if it had: Timothy and Titus would have had no such charge as to that work. It is true, ministers are not bound to preach in others’ houses without their leave; therefore we read very little of the apostles preaching in the temple and synagogues, nor without the leave of the Jews. But Paul judged himself bound to preach ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the school of Tyrannus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Acts 19:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 19:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in his own hired house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at Rome, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 28:30,31",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 28:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the circumstance of numbers, to which they are bound to preach, the Holy Scripture hath no where determined, and ministers are left to be guided by their own prudence according to circumstances; but preach they must, if they be called of God; he hath sent them to it, fitted them for the work, and they have taken it upon them, and woe will be to every minister, so called and sent of God, if he doth not fulfil his ministry, as he hath opportunity and wisdom, considering circumstances, in order to the end which he is to aim at and to act for. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For though I preach the Gospel, I have nothing to glory of,.... The sense is not, that if he preached the Gospel in order for a livelihood, and to serve his private advantage, he should have no room for glorying; since, if this was the case, he should be obliged to do it, or perish for want: but his meaning is, that though he preached the Gospel ever so well, or ever so freely, and might glory before men, and against the false teachers, who insulted him in his character and office; yet not before God, from whom he received all his gifts, abilities, and qualifications, to preach the Gospel; all his light and knowledge in it; all his enlargements in meditation, and liberty in expression; all his faithfulness and integrity, courage and intrepidity, in the discharge and performance of his work, were by divine grace and assistance; and his success in it owing to the power and Spirit of God, so that he had nothing to glory of on any of these accounts: hence these words are a correction, or rather an explanation of the preceding: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for necessity is laid upon me; not of getting a livelihood by preaching, for he could have got, and did get this another way, even by labouring with his hands; nor of force and compulsion, for no one more readily engaged in it, or more cheerfully performed it; but of obligation from the divine call to this work, and from his own conscience, in which he knew it to be an heavenly one, and from the nature of the trust committed to him, and because of the good of immortal souls, and the honour of Christ; all which lay with weight upon him, and obliged him in duty, love, and gratitude, to attend to it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yea, woe is unto me, if I preach not the Gospel; which is to be understood, not of any temporal affliction, as reproach, persecution, famine, nakedness, sword, &c. for such sort of woes frequently attend those that do preach the Gospel; but of the wounding of his conscience, and exposing himself, through the neglect of his calling, and contempt of the divine will, to the wrath and curse of God for ever; not that the apostle feared this would be his case, or that it possibly could be; but he thus speaks, to show what he or any other minister of the Gospel would deserve, at the hand of God, who having abilities to preach, should not make use of them; or should preach, but not the Gospel; or only a part of it, and not the whole; or should entirely desist from it, through self-interest, or the fear of man, or through being ashamed of Christ and his Gospel, or as not able to bear the reproach and persecution attending it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "yea, woe is unto me, if I preach not the Gospel; which is to be understood, not of any temporal affliction, as reproach, persecution, famine, nakedness, sword, &c. for such sort of woes frequently attend those that do preach the Gospel; but of the wounding of his conscience, and exposing himself, through the neglect of his calling, and contempt of the divine will, to the wrath and curse of God for ever; not that the apostle feared this would be his case, or that it possibly could be; but he thus speaks, to show what he or any other minister of the Gospel would deserve, at the hand of God, who having abilities to preach, should not make use of them; or should preach, but not the Gospel; or only a part of it, and not the whole; or should entirely desist from it, through self-interest, or the fear of man, or through being ashamed of Christ and his Gospel, or as not able to bear the reproach and persecution attending it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For though I preach the gospel, I have nothing to glory of: for necessity is laid upon me; yea, woe is unto me, if I preach not the gospel!",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Why Paul has every reason (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γάρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to hold his ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καύχημα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thus fast. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the preaching of the gospel, taken by itself, does not put him in a position to boast himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All the less, therefore, can he afford to give up the only thing that does place him in such a position, namely, his preaching without recompense.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάγκη γάρ μοι ἐπίκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[1470] ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐαγγελίζεσθαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as is proved by what goes before. Comp Homer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Il.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " vi. 458: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κρατερὴ δʼ ἐπικεῖσετʼ ἀνάγκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the common phrase in the classics: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάγκην ἐπιθεῖναι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐαὶ γάρ μοι ἐστίν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Comp LXX. in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Woe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " betides him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God’s threatened judgment will fulfil itself upon him (in the coming day of judgment), if he shall not have preached the gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐαγγελίσωμαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see the critical remarks); from this is evident (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γάρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") how the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάγκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " arises, namely, that he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " preach; he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cannot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " give it up, without incurring eternal destruction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1470] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scilicet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:16-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Paul goes on to explain, by two contrasted suppositions (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "actual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "conceivable",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " matter), that this is a point of honour with him. Forced as he had been into the service of the Gospel, in a manner so diff[1353] from the other App., unless he might serve gratuitously his position would be too humiliating.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1353] difference, different, differently.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "necessity is laid upon me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Γὰρ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He now states, in what this glorying consists.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐαγγελίζωμαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [if], ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I preach",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This must be taken in the exclusive sense; if I preach, and do so not gratuitously; if I do nothing besides.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάγκη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "necessity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Owing [duty] takes away glorying.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐαὶ δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [yea] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "woe) but",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " intensive; not only have I nothing, whereof I may glory, but even ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "woe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [to me, if I do not], ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "Text_Heading",
        "text": "1 have nothing to glory of.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He is desirous to remove all appearance of haughtiness from his tone. There was, he says, no merit involved in his preaching the gospel. He did so from the sense of overwhelming moral compulsion, and he would have been miserable if he had tried to resist it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Necessity is laid upon me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"We cannot but speak\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 4:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). 1 Corinthians 9:16",
        "children": []
      }
    ]
  }
]