[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:4-8 Care and grief do us good, when they engage us to pray to God, as in earnest. David had always found God ready to answer his prayers. Nothing can fix a gulf between the communications of God's grace towards us, and the working of his grace in us; between his favour and our faith. He had always been very safe under the Divine protection. This is applicable to the common mercies of every night, for which we ought to give thanks every morning. Many lie down, and cannot sleep, through pain of body, or anguish of mind, or the continual alarms of fear in the night. But it seems here rather to be meant of the calmness of David's spirit, in the midst of his dangers. The Lord, by his grace and the consolations of his Spirit, made him easy. It is a great mercy, when we are in trouble, to have our minds stayed upon God. Behold the Son of David composing himself to his rest upon the cross, that bed of sorrows; commending his Spirit into the Father's hands in full confidence of a joyful resurrection. Behold this, O Christian: let faith teach thee how to sleep, and how to die; while it assures thee that as sleep is a short death, so death is only a longer sleep; the same God watches over thee, in thy bed and in thy grave. David's faith became triumphant. He began the psalm with complaints of the strength and malice of his enemies; but concludes with rejoicing in the power and grace of his God, and now sees more with him than against him. Salvation belongeth unto the Lord; he has power to save, be the danger ever so great. All that have the Lord for their God, are sure of salvation; for he who is their God, is the God of Salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I laid me down and slept - Notwithstanding these troubles and dangers I had such confidence that God hears prayer, and such calm trust in his protection, that I laid me down gently and slept securely. The psalmist mentions this as a remarkable proof of the divine protection and favor. He was driven from his capital, his throne, and his home. He was compelled to wander as a poor fugitive, accompanied by only a few friends. He was pursued by enemies, who were numbered by thousands. He was made an exile, and persecuted by his own son; and with this son there were men of age and of experience in war. The forces of his enemies might come upon him at any moment. In these circumstances, persecuted as he was, and under all the anxiety and distress which he felt in view of the ungrateful conduct of his own son, he regarded it as a singular proof of the divine favor, and as an illustration of the peace which confidence in God gives to those who put their trust in him, that on such a dreadful night he was permitted to lie calmly down and sleep. As such a proof and illustration it may be regarded here: a proof of the unspeakable value of the divine favor, and an illustration of the effect of confidence in God in giving calmness and peace of mind in time of trouble. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 127:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I awaked - Still safe and secure. He had not been suddenly attacked by his foes, and made to sleep the sleep of death; he had not been crushed by anguish of spirit. That we are \"awaked\" in the morning after a night's refreshing slumber; that we are raised up again to the enjoyments of life; that we are permitted again to greet our friends and to unite with them in the privileges of devotion, should always be regarded as a new proof of the goodness of God, and should lead to acts of praise. We have no power to awake ourselves; and when we remember how many are taken away from our world each night - how many there are who lie down to sleep to wake no more, we should never rise from a bed of repose without giving our first thoughts in gratitude to our Great Preserver.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the Lord sustained me - He kept me from danger; he preserved me from death. And it is as true now as it was then, that God is the supporter of life when men sleep. He guards us; he causes the action of the heart to be continued as it propels the blood through our frame; he secures the gentle heaving of the lungs, both when we slumber and when we wake. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For the Lord sustained me - He kept me from danger; he preserved me from death. And it is as true now as it was then, that God is the supporter of life when men sleep. He guards us; he causes the action of the heart to be continued as it propels the blood through our frame; he secures the gentle heaving of the lungs, both when we slumber and when we wake. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. the Lord sustained me—literally, \"will sustain me,\" as if his language or thought when he laid down, and the reason of his composure.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5 I laid me down and slept; I awaked; for the Lord sustained me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 I will not be afraid of ten thousands of people, that have set themselves against me round about.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "David's faith enabled him to lie down; anxiety would certainly have kept him on tiptoe, watching for an enemy. Yea, he was able to sleep, to sleep in the midst of trouble, surrounded by foes. \"So he giveth his beloved sleep.\" There is a sleep of presumption; God deliver us from it! There is a sleep of holy confidence; God help us so to close our eyes! But David says he awaked also. Some sleep the sleep of death; but he, though exposed to many enemies, reclined his head on the bosom of his God, slept happily beneath the wing of Providence in sweet security, and then awoke in safety. \"For the Lord sustained me.\" The sweet influence of the Pleiades of promise shone upon the sleeper, and he awoke conscious that the Lord had preserved him. An excellent divine has well remarked - \"This quietude of a man's heart by faith in God, is a higher sort of work than the natural resolution of manly courage, for it is the gracious operation of God's Holy Spirit upholding a man above nature, and therefore the Lord must have all the glory of it.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Buckling on his harness for the day's battle, our hero sings, \"I will not be afraid often thousands of people, that have set themselves against me round about.\" Observe that he does not attempt to under-estimate the number or wisdom of his enemies. He reckons them at tens of thousands, and he views them as cunning huntsmen chasing him with cruel skill. Yet he trembles not, but looking his foeman in the face he is ready for the battle. There may be no way of escape; they may hem me in as the deer are surrounded by a circle of hunters; they may surround me on every side, but in the name of God I will dash through them; or, if I remain in the midst of them, yet shall they not hurt me; I shall be free in my very prison.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But David is too wise to venture to the battle without prayer; he therefore betakes himself to his knees, and cries aloud to Jehovah. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I laid me down and slept, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, securely, casting all my cares and fears upon God, and relying upon his help. I awaked in due time and manner, after a sweet and undisturbed sleep. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Sustained me; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "supported me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as it were with his right hand, that I should not fall under my burden. He upheld my spirit, and person, and cause. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I laid me down and slept,.... After the battle was over between Absalom's men and his, says Aben Ezra; but rather this was in the midst of his trouble and distress, since he afterwards prays for salvation: and this sleep was either, as Jarchi observes, through his heart being overwhelmed with grief; for there have been instances of persons sleeping through sorrow, as Elijah, Jonah, and the disciples of Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or rather this is expressive of the calmness and serenity of his mind amidst his troubles; he laid himself down in peace, and slept quietly and comfortably; he did not lose a night's rest, his sleep was sweet unto him; which was a blessing of life from the Lord that everyone does not enjoy; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 127:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I awakened; in the morning, alive and cheerful, Some lay themselves down and never awake more, as Sisera the captain of Jabin's army, and Ishbosheth the son of Saul; and this might have been David's case, considering the circumstances he was in: and others, through perplexing thoughts and cares, or pains of body, or uneasy dreams, rise fatigued and distressed; but David arose in good health of body, and tranquillity of mind, and comfortably refreshed; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the Lord sustained me; the psalmist committed himself to the care and protection of God; he laid himself down in his arms, and there slept in safety; the Lord preserved him, who is Israel's keeper, that neither slumbers nor sleeps: and he rose in health and cheerfulness in the morning, supported by his right hand. This shows, that lying down to sleep, when in such circumstances, and awaking with cheerfulness, were not owing to rashness, stupidity, and insensibility, but to divine supports. These words may be interpreted, as they are by some of the ancients, of the death of Christ, and of his resurrection from the dead by the power of God; death is often expressed by sleep, and the resurrection of the dead by an awaking out of sleep, Daniel 12:2; and Christ's death being signified by lying down and sleeping, may denote both the voluntariness of it, that he laid down his life freely and willingly; and his short continuance under the power of death, it was but like a night's sleep; and his resurrection from the dead, being expressed by an awaking through the Lord's sustaining him, shows that it was by the power of God, even the exceeding greatness of his power: and the whole of this may be applied to the case and state of the saints and people of God, who at times have rest and peace amidst their enemies; though they have tribulation in the world, they have peace in Christ; and notwithstanding the temptations of Satan, and the corruptions of their own hearts, they have joy and comfort through believing in Christ; the Lord sustains them with precious promises, and supports them with the discoveries of his love, and upholds them with the right hand of his righteousness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the Lord sustained me; the psalmist committed himself to the care and protection of God; he laid himself down in his arms, and there slept in safety; the Lord preserved him, who is Israel's keeper, that neither slumbers nor sleeps: and he rose in health and cheerfulness in the morning, supported by his right hand. This shows, that lying down to sleep, when in such circumstances, and awaking with cheerfulness, were not owing to rashness, stupidity, and insensibility, but to divine supports. These words may be interpreted, as they are by some of the ancients, of the death of Christ, and of his resurrection from the dead by the power of God; death is often expressed by sleep, and the resurrection of the dead by an awaking out of sleep, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Christ's death being signified by lying down and sleeping, may denote both the voluntariness of it, that he laid down his life freely and willingly; and his short continuance under the power of death, it was but like a night's sleep; and his resurrection from the dead, being expressed by an awaking through the Lord's sustaining him, shows that it was by the power of God, even the exceeding greatness of his power: and the whole of this may be applied to the case and state of the saints and people of God, who at times have rest and peace amidst their enemies; though they have tribulation in the world, they have peace in Christ; and notwithstanding the temptations of Satan, and the corruptions of their own hearts, they have joy and comfort through believing in Christ; the Lord sustains them with precious promises, and supports them with the discoveries of his love, and upholds them with the right hand of his righteousness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I laid me down and slept; I awaked; for the LORD sustained me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The pronoun is emphatic:—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pursued by enemies, despaired of by friends:—and the words refer to the actual experience of the past night. The calmness which could thus repose in the face of danger was a practical proof of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sustained",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. sustaineth. The tense suggests the unceasing, ever active care by which he is upheld. The same word is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 145:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Contrast ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "5, 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Not only past but present experience justifies this confidence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I laid me down and slept",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as for me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I laid me down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. A contrast seems intended between the king and some of his companions. \"I, for my part,\" he says, \"confident in God, calmly laid me down and slept; I did not allow the danger which I was in to interfere with my repose at night.\" Others, probably, were less trustful. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I awaked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When morning came, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", I awoke, as usual, from quiet and refreshing slumbers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the Lord sustained me;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sustaineth me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Now and always I am sustained by the Almighty. Psalm 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 3:6-7) That this God will protect him, His protection during the past night is now a pledge to him in the early morning. It is a violation of the rules of grammar to translate ואישׁנה: I shall go to sleep, or: I am going to sleep. The 1 pers. fut. consec. which is indicated by the ו, is fond of taking an ah of direction, which gives subjective intensity to the idea of sequence: \"and thus I then fell asleep,\" cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and more especially so in the later style, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 9:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 13:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", vid., Ges. 49, 2, Bttcher, Neue Aehrenlese, No. 412. It is a retrospective glance at the past night. Awaking in health and safety, he feels grateful to Him to whom he owes it: יהוה יסמכני. It is the result of the fact that Jahve supports him, and that God's hand is his pillow.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Referred to the other David, Psalm 3:6 has become an Easter-morning call, vid., Val. Herberger's Paradies-Blmlein aus dem Lustgarten der Psalmen (Neue Ausg. 1857) S. 25.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Referred to the other David, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " has become an Easter-morning call, vid., Val. Herberger's Paradies-Blmlein aus dem Lustgarten der Psalmen (Neue Ausg. 1857) S. 25.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Because this loving, almighty hand is beneath his head (Sol 2:6) he is inaccessible and therefore also devoid of fear. שׁית (שׁוּת) carries its object in itself: to take up one's position, as in Isaiah 22:7, synon. חנה Psalm 28:3 and שׂים   1 Kings 20:12, cf. ἐπιτιθέναι τινί. David does not put a merely possible case. All Israel, that is to say ten thousands, myriads, were gone over to Absolom. Here, at the close of the third strophe, סלה is wanting because the לא אירא (I will not fear) is not uttered in a tone of triumph, but is only a quiet, meek expression of believing confidence. If the instruments struck up boldly and suddenly here, then a cry for help, urged forth by the difficulties that still continually surrounded him, would not be able to follow. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Because this loving, almighty hand is beneath his head (Sol 2:6) he is inaccessible and therefore also devoid of fear. שׁית (שׁוּת) carries its object in itself: to take up one's position, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", synon. חנה ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 28:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and שׂים   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 20:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ἐπιτιθέναι τινί. David does not put a merely possible case. All Israel, that is to say ten thousands, myriads, were gone over to Absolom. Here, at the close of the third strophe, סלה is wanting because the לא אירא (I will not fear) is not uttered in a tone of triumph, but is only a quiet, meek expression of believing confidence. If the instruments struck up boldly and suddenly here, then a cry for help, urged forth by the difficulties that still continually surrounded him, would not be able to follow. ",
            "children": []
          }
        ]
      }
    ]
  }
]