[{"header":"Prophecy: A Superior Gift"},{"num":14,"verse":"Pursue love and desire spiritual gifts, and above all that you may prophesy. "},{"num":2,"verse":"For the person who speaks in another language is not speaking to men but to God, since no one understands him; however, he speaks mysteries in the Spirit. "},{"num":3,"verse":"But the person who prophesies speaks to people for edification, encouragement, and consolation. "},{"num":4,"verse":"The person who speaks in another language builds himself up, but he who prophesies builds up the church. "},{"num":5,"verse":"I wish all of you spoke in other languages, but even more that you prophesied. The person who prophesies is greater than the person who speaks in languages, unless he interprets so that the church may be built up."},{"num":6,"verse":"But now, brothers, if I come to you speaking in other languages, how will I benefit you unless I speak to you with a revelation or knowledge or prophecy or teaching? "},{"num":7,"verse":"Even inanimate things that produce sounds—whether flute or harp—if they don’t make a distinction in the notes, how will what is played on the flute or harp be recognized? "},{"num":8,"verse":"In fact, if the trumpet makes an unclear sound, who will prepare for battle? "},{"num":9,"verse":"In the same way, unless you use your tongue for intelligible speech, how will what is spoken be known? For you will be speaking into the air. "},{"num":10,"verse":"There are doubtless many different kinds of languages in the world, and all have meaning. "},{"num":11,"verse":"Therefore, if I do not know the meaning of the language, I will be a foreigner to the speaker, and the speaker will be a foreigner to me. "},{"num":12,"verse":"So also you—since you are zealous for spiritual gifts, seek to excel in building up the church."},{"num":13,"verse":"Therefore the person who speaks in another language should pray that he can interpret. "},{"num":14,"verse":"For if I pray in another language, my spirit prays, but my understanding is unfruitful. "},{"num":15,"verse":"What then? I will pray with the spirit, and I will also pray with my understanding. I will sing with the spirit, and I will also sing with my understanding. "},{"num":16,"verse":"Otherwise, if you praise with the spirit, how will the uninformed person say “Amen” at your giving of thanks, since he does not know what you are saying? "},{"num":17,"verse":"For you may very well be giving thanks, but the other person is not being built up. "},{"num":18,"verse":"I thank God that I speak in other languages more than all of you; "},{"num":19,"verse":"yet in the church I would rather speak five words with my understanding, in order to teach others also, than 10,000 words in another language."},{"num":20,"verse":"Brothers, don’t be childish in your thinking, but be infants in regard to evil and adult in your thinking. "},{"num":21,"verse":"It is written in the law:"},{"num":22,"verse":"It follows that speaking in other languages is intended as a sign, not for believers but for unbelievers. But prophecy is not for unbelievers but for believers. "},{"num":23,"verse":"Therefore, if the whole church assembles together and all are speaking in other languages and people who are uninformed or unbelievers come in, will they not say that you are out of your minds? "},{"num":24,"verse":"But if all are prophesying and some unbeliever or uninformed person comes in, he is convicted by all and is judged by all. "},{"num":25,"verse":"The secrets of his heart will be revealed, and as a result he will fall facedown and worship God, proclaiming, “God is really among you.”"},{"header":"Order in Church Meetings"},{"num":26,"verse":"What then is the conclusion, brothers? Whenever you come together, each one has a psalm, a teaching, a revelation, another language, or an interpretation. All things must be done for edification. "},{"num":27,"verse":"If any person speaks in another language, there should be only two, or at the most three, each in turn, and someone must interpret. "},{"num":28,"verse":"But if there is no interpreter, that person should keep silent in the church and speak to himself and to God. "},{"num":29,"verse":"Two or three prophets should speak, and the others should evaluate. "},{"num":30,"verse":"But if something has been revealed to another person sitting there, the first prophet should be silent. "},{"num":31,"verse":"For you can all prophesy one by one, so that everyone may learn and everyone may be encouraged. "},{"num":32,"verse":"And the prophets’ spirits are under the control of the prophets, "},{"num":33,"verse":"since God is not a God of disorder but of peace."},{"num":34,"verse":"the women should be silent in the churches, for they are not permitted to speak, but should be submissive, as the law also says. "},{"num":35,"verse":"And if they want to learn something, they should ask their own husbands at home, for it is disgraceful for a woman to speak in the church meeting. "},{"num":36,"verse":"Did the word of God originate from you, or did it come to you only?"},{"num":37,"verse":"If anyone thinks he is a prophet or spiritual, he should recognize that what I write to you is the Lord’s command. "},{"num":38,"verse":"But if anyone ignores this, he will be ignored. "},{"num":39,"verse":"Therefore, my brothers, be eager to prophesy, and do not forbid speaking in other languages. "},{"num":40,"verse":"But everything must be done decently and in order."}]