[{"header":"Tongues are not the greatest gift"},{"num":1,"verse":"Follow, then, the way of love, while you set your heart on the gifts of the Spirit."},{"num":1,"verse":"The highest gift you can wish for is to be able to speak the messages of God. The man who speaks in a “tongue” addresses not men (for no one understands a word he says) but God: and only in his spirit is he speaking spiritual secrets. But he who preaches the word of God is using his speech for the building up of the faith of one man, the encouragement of another or the consolation of another. The speaker in a “tongue” builds up his own soul, but the preacher builds up the Church of God."},{"num":5,"verse":"I should indeed like you all to speak with “tongues”, but I would much rather that you all preached the word of God. For the preacher of the word does a greater work than the speaker with “tongues”, unless of course the latter interprets his word for the benefit of the Church."},{"header":"Unless “tongues” are interpreted do they help the Church?"},{"num":6,"verse":"For suppose I came to you, my brothers, speaking with “tongues!”, what good could I do unless I could give you some revelation of truth, some knowledge in spiritual things, some message from God, or some teaching about the Christian life?"},{"num":7,"verse":"Even in the case of inanimate objects which are capable of making sound, such as a flute or harp, if their notes all sound alike, who can tell what tune is being played? Unless the bugle-note is clear who will be called to arms? So, in your case, unless you make intelligible sounds with your “tongue” how can anyone know what you are talking about? You might just as well be addressing an empty room!"},{"num":10,"verse":"There are in the world a great variety of spoken sounds and each has a distinct meaning. But if the sounds of the speaker’s voice mean nothing to me I am a foreigner to him, and he is a foreigner to me."},{"num":12,"verse":"So, with yourselves, since you are so eager to possess spiritual gifts, concentrate your ambition upon receiving those which make for the real growth of your church. And that means if one of your number speaks with a “tongue”, he should pray that he may be able to interpret what he says."},{"num":14,"verse":"If I pray in a “tongue” my spirit is praying but my mind is inactive. I am therefore determined to pray with my spirit and my mind, and if I sing I will sing with both spirit and mind. Otherwise, if you are blessing God with your spirit, how can those who are ungifted say amen to your thanksgiving, since they do not know what you are talking about? You may be thanking God splendidly, but it doesn’t help the other man at all. I thank God that I have a greater gift of “tongues” than any of you, yet when I am in Church I would rather speak five words with my mind (which might teach something to other people) than ten thousand words in a “tongue” which nobody understands."},{"header":"You must use your minds in this matter of tongues"},{"num":20,"verse":"My brothers, don’t be like excitable children but use your intelligence! By all means be innocent as babes as far as evil is concerned, but where your minds are concerned be full-grown men! In the Law it is written: ‘With men of other tongues and other lips I will speak to this people; and yet, for all that, they will not hear me’."},{"num":22,"verse":"That means that tongues are a sign of God’s power, not for those who are unbelievers, but to those who already believe. Preaching the word of God, on the other hand, is a sign of God’s power to those who do not believe rather than to believers. So that, if at a full church meeting you are all speaking with tongues and men come in who are both uninstructed and without faith, will they not say that you are insane? But if you are preaching God’s word and such a man should come in to your meeting, he is convicted and challenged by your united speaking of the truth. His secrets are exposed and he will fall on his knees acknowledging God and saying that God is truly among you!"},{"header":"Some practical regulations for the exercise of spiritual gifts"},{"num":26,"verse":"Well then, my brothers, whenever you meet let everyone be ready to contribute a psalm, a piece of teaching, a spiritual truth, or a “tongue” with an interpreter. Everything should be done to make your church strong in the faith."},{"num":27,"verse":"If the question of speaking with a “tongue” arises, confine the speaking to two or three at the most and have someone to interpret what is said. If you have no interpreter then let the speaker with a “tongue” keep silent in the church and speak only to himself and God."},{"num":29,"verse":"Don’t have more than two or three preachers either, while the others think over what has been said. But should a message of truth come to one who is seated, then the original speaker should stop talking. For in this way you can all have opportunity to give a message, one after the other, and everyone will learn something and everyone will have his faith stimulated. The spirit of a true preacher is under that preacher’s control, for God is not a God of disorder but of harmony, as is plain in all the churches."},{"header":"The speaking of women in church is forbidden"},{"num":34,"verse":"Let women be silent in church; they are not to be allowed to speak. They must submit to this regulation, as the Law itself instructs. If they have questions to ask they must ask their husbands at home, for there is something indecorous about a woman’s speaking in church."},{"header":"You must accept the rules I have given by authority"},{"num":36,"verse":"Do I see you questioning my instructions? Are you beginning to imagine that the Word of God originated in your church, or that you have a monopoly of God’s truth? If any of your number thinks himself a true preacher and a spiritually-minded man, let him recognise that what I have written is by divine command! As for those who don’t know it, well, we may just leave them in ignorance."},{"num":39,"verse":"In conclusion then, my brothers, set your heart on preaching the word of God, while not forbidding the use of “tongues”. Let everything be done decently and in order."}]