[{"num":14,"verse":"Love is the thing you should want more than anything else. But you should also want other things the Spirit gives. You should want very much to be able to speak words from God."},{"num":2,"verse":"The person who talks in tongues of a different language does not talk to people, but to God. People do not understand what he says. But he is saying secret things by the Spirit."},{"num":3,"verse":"But the person who is a prophet speaks words from God to people plainly. He helps them to believe and to be strong, and he comforts them."},{"num":4,"verse":"The person who talks in a different tongue helps himself. But the one who tells forth God's word helps all the people in the church."},{"num":5,"verse":"I wish that you could all talk in different tongues. But I want even more that you should speak words from God for all to hear and understand. The person who speaks words from God is greater than the person who talks in tongues - unless he is able to tell the meaning of his words, so that he helps all the people in the church."},{"num":6,"verse":"My brothers, if I come to you and talk in tongues of a different language, how can I help you? I cannot help you if I do not tell you something God has shown to me, or something I know, or God's word, or some teaching."},{"num":7,"verse":"Such things as horns or harps have no life, but they make sounds. Now if they don't make the right noise, no one will know what the sound means."},{"num":8,"verse":"If the war drum gives a sound that has no meaning, then no one will get ready to fight."},{"num":9,"verse":"If you say words that people cannot understand, they will not know what you say. You talk for nothing!"},{"num":10,"verse":"There are no doubt many different languages in the world. And every one of them has a meaning."},{"num":11,"verse":"But if a person talks in a language and I do not know the meaning of it, I will be like a stranger to him and he will be like a stranger to me."},{"num":12,"verse":"So it is with you. You want the gifts of the Spirit. Then you should want the gift which will make you better able to help the church people."},{"num":13,"verse":"So then, the person who talks in a tongue of a different language, should ask God to help tell the meaning of the tongue."},{"num":14,"verse":"If I pray to God in a tongue of a different language, then I am talking with my spirit, but I do not use my mind."},{"num":15,"verse":"What then shall I do? I will talk to God with my spirit and I will talk to God with my mind. I will sing with my spirit and I will sing with my mind."},{"num":16,"verse":"If you thank God with your spirit only, an ordinary person cannot say, `Amen, it is so!' He does not know what you say."},{"num":17,"verse":"The way you thank God is good, but it does not help an ordinary person."},{"num":18,"verse":"I thank God that I can talk in tongues more than any of you."},{"num":19,"verse":"But in the church meeting it is better for me to say five words with my mind, so that I will teach other people also. This is better than to say ten thousand words in a tongue of a different language."},{"num":20,"verse":"My brothers, do not be like children in your thinking. When it comes to doing wrong things, be like small babies. But in your thinking be grown up people."},{"num":21,"verse":"The holy writings say, `I will talk to these people by strangers and by people who talk in strange tongues. And yet, they will not listen to me.' This is what the Lord says."},{"num":22,"verse":"So then, tongues are a sign to people who do not believe God. They are not a sign to those who believe him. But speaking words from God like a prophet is a sign to those who believe. It is not a sign to those who do not believe."},{"num":23,"verse":"Sometimes all the people of the church may be gathered together. If everyone talks in tongues, and if some people who do not know or believe come in, they will say that you are crazy."},{"num":24,"verse":"But what happens if everyone speaks words from God? If such people come in, then the words from God will prove to them that they have done wrong. They will all speak to the heart."},{"num":25,"verse":"Such a person sees everything that has been hidden in his heart. Then he will kneel down and worship God. He will say, `It is true. God is here among you.'"},{"num":26,"verse":"What shall we do about it, my brothers? When you meet together, every one of you has something to help the other. One has a song to sing. One has something to teach people. One has something which God has shown to him. One has something to say in a tongue. One can tell the meaning of a tongue. Do all of these things to help one another."},{"num":27,"verse":"If any people talk in a tongue, only two or not more than three should talk. They must talk one at a time and someone must tell the meaning."},{"num":28,"verse":"But if there is no one to tell the meaning, a person must not talk in a tongue of a different language in the church meeting. He should talk to himself and to God."},{"num":29,"verse":"Two or three prophets may speak words from God and the others should say what they think about it."},{"num":30,"verse":"But if another person is sitting by and God gives him something to say, then the first person should stop talking."},{"num":31,"verse":"One by one you may speak words from God. In that way, all will learn something and all will be stronger in faith."},{"num":32,"verse":"Those who speak words from God are able to keep their own spirits quiet."},{"num":33,"verse":"God does not want things to be out of order. He wants peace in the church meeting. In all the churches of God's people, the women should be quiet in the church meetings. They must not be allowed to talk. They must obey. The holy writings say this also."},{"num":35,"verse":"If the women want to know something, they should ask their own husbands at home. It is a shame for a woman to talk in a church meeting."},{"num":36,"verse":"Do you think that you were the first ones to tell the word of God? Or do you think that you are the only people who have it?"},{"num":37,"verse":"Perhaps someone thinks, `I am the one to speak words from God,' or, `I have the Spirit.' Then know this, the Lord has told me to write these things."},{"num":38,"verse":"If anyone does not know this, then God will not know him."},{"num":39,"verse":"So, my brothers, the thing you should want is to speak words from God. But at the same time, do not stop anyone from talking in tongues."},{"num":40,"verse":"But everything should be done in the right way and in good order."}]