[{"header":"Paul Arrives In Ephesus. He Baptizes Some Disciples of Apollos"},{"num":19,"verse":"And it came about during Apollos’s being in Corinth that Paul, having gone through the upper regions, came down to Ephesus and found some disciples. "},{"num":2,"verse":"And he said to them, “Did you receive the Holy Spirit, having believed?” And the ones said to him, “But we did not even hear if  the Holy Spirit is given”. "},{"num":3,"verse":"And he said, “Into what then were you baptized?” And the ones said, “Into John’s baptism”. "},{"num":4,"verse":"And Paul said, “John baptized a baptism of repentance, saying to the people that they should believe in the One coming after him, that is, in Jesus”. "},{"num":5,"verse":"And having heard it, they were baptized in the name of the Lord Jesus. "},{"num":6,"verse":"And Paul having laid his hands on them, the Holy Spirit came upon them, and they were speaking in tongues and prophesying. "},{"num":7,"verse":"And all the men were [totaling] about twelve."},{"header":"Paul Ministers In Ephesus For Over Two Years, Teaching And Doing Miracles"},{"num":8,"verse":"And having entered into the synagogue, he was speaking-boldly for three months, reasoning and persuading as to the things concerning the kingdom of God. "},{"num":9,"verse":"But when some were becoming-hardened, and were disobeying, speaking-evil-of the Way before the assembly— having departed from them, he separated the disciples, reasoning daily in the school of Tyrannus. "},{"num":10,"verse":"And this took place for two years, so that all the ones dwelling-in Asia heard the word of the Lord— both Jews and Greeks. "},{"num":11,"verse":"And God was doing not the ordinary miracles by the hands of Paul— "},{"num":12,"verse":"so that handkerchiefs or aprons were even being carried-forth from his skin to the ones being sick, and the diseases were being released from them, and the evil spirits were going out."},{"header":"Even Some Non-Believing Priests Tried To Utilize Paul’s Power"},{"num":13,"verse":"And even some of the Jewish exorcists going-around attempted to name the name of the Lord Jesus over the ones having the evil spirits, saying, “I make you swear by the Jesus Whom Paul is proclaiming”. "},{"num":14,"verse":"Now there were seven sons of a certain Sceva, a Jewish chief priest, doing this. "},{"num":15,"verse":"But having responded, the evil spirit said to them, “I know Jesus and know-about Paul, but who are you?” "},{"num":16,"verse":"And the man in whom was the evil spirit— having leaped on them, having subdued all of them— prevailed against them, so that they fled out of that house naked and having been wounded. "},{"num":17,"verse":"And this became known to all the ones dwelling-in Ephesus— both Jews and Greeks. And fear fell upon them all."},{"header":"Jesus Was Being Magnified And The Word of The Lord Was Prevailing"},{"num":18,"verse":"And the name of the Lord Jesus was being magnified. And many of the ones having believed were coming, confessing-out and declaring their [evil] practices. "},{"num":19,"verse":"And many of the ones having practiced sorceries, having brought-together their books, were burning them up in the presence of everyone. And they calculated-up the prices of them, and found it to be fifty thousand silver-coins. "},{"num":20,"verse":"Thus in accordance with the might of the Lord, the word was growing and prevailing."},{"header":"Paul Decides To Return To Jerusalem And Then Go To Rome. He Sends Timothy Ahead"},{"num":21,"verse":"Now when these things were completed, Paul put in his spirit that, having gone through Macedonia and Achaia, he should be going to Jerusalem, having said that “After I come-to-be there, I must also see Rome”. "},{"num":22,"verse":"And having sent-out two of the ones ministering with him to Macedonia— Timothy and Erastus— he himself held-on in Asia for a time."},{"header":"There Is a Big Uproar In Ephesus Over a Decline In The Sale of Idols Due To Paul"},{"num":23,"verse":"Now about that time, no small disturbance took place concerning the Way. "},{"num":24,"verse":"For a certain Demetrius by name, a silversmith making silver shrines of Artemis, was bringing-about no small business for the craftsmen— "},{"num":25,"verse":"whom having assembled-together, and the workers with respect to such things, he said, “Men, you know that prosperity for us is from this business. "},{"num":26,"verse":"And you are seeing and hearing that this Paul— having persuaded people not only from Ephesus, but from almost all Asia— turned-away a considerable crowd, saying that the gods being made with hands are not gods. "},{"num":27,"verse":"But not only is-there-a-danger for us that this part may come into disrepute, but also that the temple of the great goddess Artemis may be counted for nothing, and that she whom all Asia and the world worships may even be about to be torn-down from her majesty”."},{"header":"Amid The City-Wide Confusion, Friends of Paul Are Seized"},{"num":28,"verse":"And having heard it, and having become full of rage, they were crying-out, saying, “Great is Artemis of the Ephesians!” "},{"num":29,"verse":"And the city was filled with confusion. And they rushed with-one-accord into the theater, having seized Gaius and Aristarchus— Macedonian fellow-travelers of Paul. "},{"num":30,"verse":"And while Paul was wanting to enter into the public-assembly, the disciples were not letting him. "},{"num":31,"verse":"And even some of the Asian-officials— being friends with him, having sent to him— were urging him not to give himself to the theater. "},{"num":32,"verse":"Then indeed, other ones were crying-out another thing. For the assembly was confused, and the majority did not know for what reason they had come together. "},{"num":33,"verse":"And some from the crowd gave-instructions-to Alexander— the Jews having put him forward. And Alexander, having waved his hand, was intending to speak-a-defense to the public-assembly. "},{"num":34,"verse":"But having recognized that he was a Jew, one voice came from everyone— crying-out for about two hours, “Great is Artemis of the Ephesians!”"},{"header":"The Town Mayor Calms And Dismisses The Crowd"},{"num":35,"verse":"And the town-mayor, having calmed the crowd, says, “Men, Ephesians, who indeed is there of mankind who does not know the city of the Ephesians as being temple-keeper of the great Artemis, and of the image fallen-from-heaven? "},{"num":36,"verse":"These things then being undeniable, you must continue-being calmed and doing nothing reckless— "},{"num":37,"verse":"for you brought here these men being neither temple-robbers nor ones blaspheming our goddess. "},{"num":38,"verse":"So indeed if Demetrius and the craftsmen with him have a complaint against anyone, courts are being led, and there are proconsuls. Let them bring-a-charge against one another. "},{"num":39,"verse":"Now if you are seeking-for anything further, it will be settled in the lawful assembly. "},{"num":40,"verse":"For indeed we are in-danger-of being charged with a riot because of today— there being no cause for it— in relation to which we will not be able to render an account for this gathering”. "},{"num":41,"verse":"And having said these things, he dismissed the assembly."}]