[{"num":19,"verse":"While Apollos was at Corinth, Paul traveled through the upper region and came to Ephesus. He found some disciples "},{"num":2,"verse":"and said to them, “Did you receive the Ruach ha-Kodesh when you believed?”"},{"num":3,"verse":"He said, “Into what were you immersed?”"},{"num":4,"verse":"Paul said, “John immersed with an immersion of repentance, telling the people that they should believe in the One coming after him—that is, in Yeshua.”"},{"num":5,"verse":"When they heard this, they were immersed in the name of the Lord Yeshua. "},{"num":6,"verse":"And when Paul laid hands upon them, the Ruach ha-Kodesh came upon them, and they began speaking in tongues and prophesying. "},{"num":7,"verse":"In all, there were about twelve men."},{"header":"God’s Power Displayed in Ephesus"},{"num":8,"verse":"Paul went into the synagogue and for three months spoke boldly, debating and persuading them about the kingdom of God. "},{"num":9,"verse":"But when they were hardening and refusing to believe, speaking evil of the Way before the whole group, he withdrew from them, taking the disciples with him, debating daily in the hall of Tyrannus. "},{"num":10,"verse":"This continued for two years, so that all the residents of Asia heard the word of the Lord—Jewish as well as Greek people."},{"num":11,"verse":"God was doing extraordinary miracles by Paul’s hands, "},{"num":12,"verse":"so that even handkerchiefs and aprons that touched his skin were brought to the sick, and the diseases left them and the evil spirits went out of them."},{"num":13,"verse":"But some traveling Jewish exorcists also tried to invoke the name of the Lord Yeshua, saying, “I charge you by the Yeshua whom Paul preaches.” "},{"num":14,"verse":"Seven sons of a Jewish ruling kohen named Sceva were doing this. "},{"num":15,"verse":"But the evil spirit answered them, “I know Yeshua and I know about Paul, but who are you?”"},{"num":16,"verse":"Then the man with the evil spirit sprang at them, subduing and overpowering all of them, so that they fled out of that house naked and wounded. "},{"num":17,"verse":"This became known to all who lived in Ephesus, both Jewish and Greek people. Fear fell upon them all, and the name of the Lord Yeshua was being magnified."},{"num":18,"verse":"Many also of those who had believed came confessing and recounting their practices. "},{"num":19,"verse":"And many of those who practiced magic arts brought their books together in a heap, burning them before everyone. They totaled the value of the books and found it to be about fifty thousand pieces of silver. "},{"num":20,"verse":"So the word of the Lord was growing in power and prevailing."},{"header":"Idol-Makers Start a Riot"},{"num":21,"verse":"Now after these things were accomplished, Paul resolved in the Ruach to go to Jerusalem after passing through Macedonia and Achaia, saying, “After I have been there, I must also see Rome.” "},{"num":22,"verse":"So after sending two who were assisting him, Timothy and Erastus, he himself stayed in Asia for a while."},{"num":23,"verse":"Around that time, there arose no small uproar concerning the Way. "},{"num":24,"verse":"For a man named Demetrius—a silversmith, a maker of silver shrines of Artemis—was providing no small amount of business to the craftsmen. "},{"num":25,"verse":"He gathered these together, along with those of related occupations, and he said, “Men, you know that our wealth is from this business. "},{"num":26,"verse":"You see and hear that not only in Ephesus but also throughout all Asia, Paul has persuaded and perverted a considerable crowd, saying that handmade gods are not gods at all."},{"num":27,"verse":" Not only is there a danger that this trade of ours might come into disrepute, but also that the temple of the great goddess Artemis might be considered as nothing. She whom all Asia and the world worships might even be thrown down from her majesty.”"},{"num":28,"verse":"When they heard, they were filled with fury and began shouting, “Great is Artemis of the Ephesians!” "},{"num":29,"verse":"The city was filled with confusion. They rushed into the theater, dragging with them Gaius and Aristarchus, Macedonians who were travel companions of Paul. "},{"num":30,"verse":"Paul was wishing to enter among the crowd, but the disciples would not let him. "},{"num":31,"verse":"Some of the chiefs of Asia, being his friends, sent to him and begged him not to surrender himself in the theater."},{"num":32,"verse":"Now some cried out one thing, some another, for the assembly was in confusion. Most did not know why they had come together. "},{"num":33,"verse":"Some of the crowd solicited Alexander, whom the Jewish people put forward. Alexander motioned with his hand. He wished to offer a defense to the crowd. "},{"num":34,"verse":"But recognizing that he was Jewish, for about two hours they all with one voice cried out, “Great is Artemis of the Ephesians!”"},{"num":35,"verse":"After the town clerk quieted the crowd, he said, “Men of Ephesus, what man is there who doesn’t know that the city of the Ephesians is temple keeper of the great Artemis and of her image fallen from heaven? "},{"num":36,"verse":"Since these things are undeniable, you must be calm and do nothing reckless. "},{"num":37,"verse":"For you have brought these men here who are neither sacrilegious nor revilers of our goddess. "},{"num":38,"verse":"If Demetrius and the craftsmen with him have a complaint against anyone, the courts are open and there are proconsuls. Let them accuse them. "},{"num":39,"verse":"But if you seek anything further, it will be settled in the lawful assembly. "},{"num":40,"verse":"For we are in danger of being charged with rioting today, there being no reason which we are able to give to justify this mob.” Upon saying this, he dismissed the assembly."}]