[{"num":22,"verse":"1 Of theft. 5 Damage. 7 Lending. 14 Borrowing. 16 Enticing of maids. 18 Witchcraft.  20 Idolatry. 21 Support of strangers, widows, and fatherless. 25 Usury. 28 Reverence to Magistrates."},{"num":1,"verse":"If a man steal an ox or a sheep, and kill it or sell it, he shall restore five oxen for the ox, and four sheep for the sheep."},{"num":2,"verse":"¶ If a thief be found breaking up, and be smitten that he die, no blood shall be shed for him."},{"num":3,"verse":"But if it be in the daylight, blood shall be shed for him: for he should make full restitution: if he had not wherewith, then should he be sold for his theft."},{"num":4,"verse":"If the theft be found with him alive, (whether it be ox, ass, or sheep) he shall restore the double."},{"num":5,"verse":"¶ If a man do hurt field, or vineyard, and put in his beast to feed in another man’s field, he shall recompense of the best of his own field, and of the best of his own vineyard."},{"num":6,"verse":"¶ If fire break out, and catch in the thorns, and the stacks of corn, or the standing corn, or the field be consumed, he that kindled the fire shall make full restitution."},{"num":7,"verse":"¶ If a man deliver his neighbor money or stuff to keep, and it be stolen out of his house, if the thief be found, he shall pay the double."},{"num":8,"verse":"If the thief be not found, then the master of the house shall be brought unto the Judges to swear, whether he hath put his hand unto his neighbor’s good, or no."},{"num":9,"verse":"In all manner of trespass, whether it be for oxen, for ass, for sheep, for raiment, or for any manner of lost thing which another challengeth to be his, the cause of both parties shall come before the judges, and whom the Judges condemn, he shall pay the double unto the neighbor."},{"num":10,"verse":"If a man deliver unto his neighbor to keep ass, or ox, or sheep, or any beast, and it die, or be hurt, or taken away by enemies, and no man see it,"},{"num":11,"verse":"An oath of the Lord shall be between them twain, that he hath not put his hand unto his neighbor’s good, and the owner of it shall take the oath, and he shall not make it good:"},{"num":12,"verse":"But if it be stolen from him, he shall make restitution unto the owner thereof."},{"num":13,"verse":"If it be torn in pieces, he shall bring record, and shall not make that good, which is devoured."},{"num":14,"verse":"¶ And if a man borrow ought of his neighbor, and it be hurt, or else die, the owner thereof not being by, he shall surely make it good."},{"num":15,"verse":"If the owner thereof be by, he shall not make it good: for if it be an hired thing, it came for his hire."},{"num":16,"verse":"¶ And if a man entice a maid that is not betrothed, and lie with her, he shall endow her, and take her to his wife."},{"num":17,"verse":"If her father refuse to give her to him, he shall pay money according to the dowry of virgins."},{"num":18,"verse":"¶ Thou shalt not suffer a witch to live."},{"num":19,"verse":"Whosoever lieth with a beast, shall die the death."},{"num":20,"verse":"¶ He that offereth unto any gods, save unto the Lord only, shall be slain."},{"num":21,"verse":"¶ Moreover, thou shalt not do injury to a stranger, neither oppress him: for ye were strangers in the land of Egypt."},{"num":22,"verse":"¶ Ye shall not trouble any widow, nor fatherless child."},{"num":23,"verse":"If thou vex or trouble such, and so he call and cry unto me, I will surely hear his cry."},{"num":24,"verse":"Then shall my wrath be kindled, and I will kill you with the sword, and your wives shall be widows, and your children fatherless."},{"num":25,"verse":"¶ If thou lend money to my people, that is, to the poor with thee, thou shalt not be as an usurer unto him: ye shall not oppress him with usury."},{"num":26,"verse":"If thou take thy neighbor’s raiment to pledge, thou shalt restore it unto him before the sun go down."},{"num":27,"verse":"For that is his covering only, and this is his garment for his skin: wherein shall he sleep? therefore when he crieth unto me, I will hear him: for I am merciful."},{"num":28,"verse":"¶ Thou shalt not rail upon the Judges, neither speak evil of the ruler of thy people."},{"num":29,"verse":"¶ Thine abundance and thy liquor shalt thou not keep back. The firstborn of thy sons shalt thou give me."},{"num":30,"verse":"Likewise shalt thou do with thine oxen and with thy sheep: seven days it shall be with his dam, and the eighth day thou shalt give it me."},{"num":31,"verse":"¶ Ye shall be an holy people unto me, neither shall ye eat any flesh that is torn of beasts in the field: ye shall cast it to the dog."}]