[[],[{"type":"header","content":"Protection of Property"},{"type":"prose","content":"“If someone steals an ox or sheep and then kills or sells it, the thief must pay back five oxen for each ox stolen, and four sheep for each sheep stolen."}],[{"type":"prose","content":"“If a thief is caught in the act of breaking into a house and is struck and killed in the process, the person who killed the thief is not guilty of murder."}],[{"type":"prose","content":"But if it happens in daylight, the one who killed the thief is guilty of murder.“A thief who is caught must pay in full for everything he stole. If he cannot pay, he must be sold as a slave to pay for his theft."}],[{"type":"prose","content":"If someone steals an ox or a donkey or a sheep and it is found in the thief’s possession, then the thief must pay double the value of the stolen animal."}],[{"type":"prose","content":"“If an animal is grazing in a field or vineyard and the owner lets it stray into someone else’s field to graze, then the animal’s owner must pay compensation from the best of his own grain or grapes."}],[{"type":"prose","content":"“If you are burning thornbushes and the fire gets out of control and spreads into another person’s field, destroying the sheaves or the uncut grain or the whole crop, the one who started the fire must pay for the lost crop."}],[{"type":"prose","content":"“Suppose someone leaves money or goods with a neighbor for safekeeping, and they are stolen from the neighbor’s house. If the thief is caught, the compensation is double the value of what was stolen."}],[{"type":"prose","content":"But if the thief is not caught, the neighbor must appear before God, who will determine if he stole the property."}],[{"type":"prose","content":"“Suppose there is a dispute between two people who both claim to own a particular ox, donkey, sheep, article of clothing, or any lost property. Both parties must come before God, and the person whom God declares guilty must pay double compensation to the other."}],[{"type":"prose","content":"“Now suppose someone leaves a donkey, ox, sheep, or any other animal with a neighbor for safekeeping, but it dies or is injured or is taken away, and no one sees what happened."}],[{"type":"prose","content":"The neighbor must then take an oath in the presence of the . If the  confirms that the neighbor did not steal the property, the owner must accept the verdict, and no payment will be required."}],[{"type":"prose","content":"But if the animal was indeed stolen, the guilty person must pay compensation to the owner."}],[{"type":"prose","content":"If it was torn to pieces by a wild animal, the remains of the carcass must be shown as evidence, and no compensation will be required."}],[{"type":"prose","content":"“If someone borrows an animal from a neighbor and it is injured or dies when the owner is absent, the person who borrowed it must pay full compensation."}],[{"type":"prose","content":"But if the owner was present, no compensation is required. And no compensation is required if the animal was rented, for this loss is covered by the rental fee."},{"type":"header","content":"Social Responsibility"}],[{"type":"prose","content":"“If a man seduces a virgin who is not engaged to anyone and has sex with her, he must pay the customary bride price and marry her."}],[{"type":"prose","content":"But if her father refuses to let him marry her, the man must still pay him an amount equal to the bride price of a virgin."}],[{"type":"prose","content":"“You must not allow a sorceress to live."}],[{"type":"prose","content":"“Anyone who has sexual relations with an animal must certainly be put to death."}],[{"type":"prose","content":"“Anyone who sacrifices to any god other than the  must be destroyed."}],[{"type":"prose","content":"“You must not mistreat or oppress foreigners in any way. Remember, you yourselves were once foreigners in the land of Egypt."}],[{"type":"prose","content":"“You must not exploit a widow or an orphan."}],[{"type":"prose","content":"If you exploit them in any way and they cry out to me, then I will certainly hear their cry."}],[{"type":"prose","content":"My anger will blaze against you, and I will kill you with the sword. Then your wives will be widows and your children fatherless."}],[{"type":"prose","content":"“If you lend money to any of my people who are in need, do not charge interest as a money lender would."}],[{"type":"prose","content":"If you take your neighbor’s cloak as security for a loan, you must return it before sunset."}],[{"type":"prose","content":"This coat may be the only blanket your neighbor has. How can a person sleep without it? If you do not return it and your neighbor cries out to me for help, then I will hear, for I am merciful."}],[{"type":"prose","content":"“You must not dishonor God or curse any of your rulers."}],[{"type":"prose","content":"“You must not hold anything back when you give me offerings from your crops and your wine.“You must give me your firstborn sons."}],[{"type":"prose","content":"“You must also give me the firstborn of your cattle, sheep, and goats. But leave the newborn animal with its mother for seven days; then give it to me on the eighth day."}],[{"type":"prose","content":"“You must be my holy people. Therefore, do not eat any animal that has been torn up and killed by wild animals. Throw it to the dogs."}]]