[{"num":22,"verse":"“If a thief found breaking in is struck so that he dies, there is no bloodguilt for him. "},{"num":2,"verse":"But if the sun has risen, there is bloodguilt, and he is to make full restitution. If he has nothing, then he must be sold for his theft. "},{"num":3,"verse":"If the item is found in his hand alive—whether ox, donkey or sheep—he is to pay double."},{"num":4,"verse":"“If a man causes a field or vineyard to be eaten by letting his animal loose, and it feeds in another man’s field, then he is to make restitution from the best of his own field and the best of his own vineyard."},{"num":5,"verse":"“If fire breaks out and spreads among thorns, so that stalks of grain, standing grain or the fields themselves are consumed, then the one who lit the fire must make full restitution."},{"num":6,"verse":"“If a man entrusts his neighbor with money or items for safekeeping, and it is stolen out of the man’s house, when the thief is found, he must pay double. "},{"num":7,"verse":"If the thief is not found, then the master of the house is to present himself to God, to see whether he has laid his hand on his neighbor’s goods. "},{"num":8,"verse":"For any transgression—whether ox, donkey, sheep, clothing, or anything else lost—when someone says, ‘This is mine!’ the case of both parties is to be brought before God. The one whom God convicts is to pay double to his neighbor."},{"num":9,"verse":"“If a man entrusts his neighbor with a donkey, ox, sheep or any animal to care for, and it dies, is hurt or taken away with no one seeing, "},{"num":10,"verse":"then there must be an oath before Adonai between the two of them, to determine whether or not he has laid his hand on his neighbor’s goods. The owner is to accept it with no restitution. "},{"num":11,"verse":"But if indeed it was stolen from him, he is to make restitution to the owner. "},{"num":12,"verse":"If it is torn in pieces, let him bring it as evidence. He is not required to pay for what has been torn to pieces."},{"num":13,"verse":"“If a man borrows anything belonging to his neighbor, and it is harmed or dies in the absence of the owner, he must make full restitution. "},{"num":14,"verse":"But if the owner is present, he is not required to pay restitution. If it was rented, it is covered by the rental fee."},{"num":15,"verse":"“If a man seduces a virgin who is not engaged, and lies with her, he must pay a dowry for her to be his wife. "},{"num":16,"verse":"But if her father utterly refuses to give her to him, he must weigh out silver equal to the dowry for virgins."},{"num":17,"verse":"“You must not permit a sorceress to live."},{"num":18,"verse":"“Anyone who lies with an animal must surely be put to death."},{"num":19,"verse":"“Anyone who sacrifices to the gods, except to Adonai alone, is to be put under a ban of destruction."},{"num":20,"verse":"“You must not exploit or oppress an outsider, for you were outsiders in the land of Egypt."},{"num":21,"verse":"“You must not mistreat any widow or orphan. "},{"num":22,"verse":"If you mistreat them in any way, and they cry out to Me, I will surely hear their cry. "},{"num":23,"verse":"My wrath will burn hot, and I will kill you with the sword. So your wives will become widows and your children will become orphans."},{"num":24,"verse":"“If you lend money to any of My people, to the poor among you, you are not to act like a debt collector with him, and you are not to charge him interest. "},{"num":25,"verse":"If you ever take your neighbor’s cloak as a pledge, you are to return it to him before the sun goes down, "},{"num":26,"verse":"for that is his only covering, his cloak for his skin. What will he sleep in? When he cries out to Me I will hear, because I am gracious."},{"num":27,"verse":"“Do not despise God, or curse a ruler of your people."},{"num":28,"verse":"“Do not hold back the fullness of your crops or your vintage. You are to present the firstborn of your sons to Me. "},{"num":29,"verse":"“Do the same with your cattle and with your sheep. For seven days it is to be with its mother, and on the eighth day you are to give it to Me."},{"num":30,"verse":"“You are to be a holy people for Me. You must not eat any flesh torn by beasts in the field. You may throw it out to the dogs."}]