[{"num":109,"verse":"1 David being falsely accused by flatterers unto Saul, prayeth God to help him, and to destroy his enemies. 8 And under them he speaketh of Judas the traitor unto Jesus Christ, and of all the like enemies of the children of God:  27 And desireth so to be delivered, that his enemies may know the work to be of God. 30 Then doth he promise to give praise unto God."},{"num":1,"verse":"Hold not thy tongue, O God of my praise."},{"num":2,"verse":"For the mouth of the wicked, and the mouth full of deceit are opened upon me: they have spoken to me with a lying tongue."},{"num":3,"verse":"They compassed me about also with words of hatred, and fought against me without a cause."},{"num":4,"verse":"For my friendship they were my adversaries, but I gave myself to prayer."},{"num":5,"verse":"And they have rewarded me evil for good, and hatred for my friendship."},{"num":6,"verse":"Set thou the wicked over him, and let the adversary stand at his right hand."},{"num":7,"verse":"When he shall be judged, let him be condemned, and let his prayer be turned into sin."},{"num":8,"verse":"Let his days be few, and let another take his charge."},{"num":9,"verse":"Let his children be fatherless, and his wife a widow."},{"num":10,"verse":"Let his children be vagabonds, and beg and seek bread, coming out of their places destroyed."},{"num":11,"verse":"Let the extortioner catch all that he hath, and let the strangers spoil his labor."},{"num":12,"verse":"Let there be none to extend mercy unto him: neither let there be any to show mercy upon his fatherless children."},{"num":13,"verse":"Let his posterity be destroyed, and in the generation following, let their name be put out."},{"num":14,"verse":"Let the iniquity of his fathers be had in remembrance with the Lord: and let not the sin of his mother be done away."},{"num":15,"verse":"But let them always be before the Lord, that he may cut off their memorial from the earth."},{"num":16,"verse":"Because he remembered not to show mercy, but persecuted the afflicted and poor man, and the sorrowful hearted to slay him."},{"num":17,"verse":"As he loved cursing, so shall it come unto him, and as he loved not blessing, so shall it be far from him."},{"num":18,"verse":"As he clothed himself with cursing like a raiment, so shall it come into his bowels like water, and like oil into his bones."},{"num":19,"verse":"Let it be unto him as a garment to cover him, and for a girdle, wherewith he shall be always girded."},{"num":20,"verse":"Let this be the reward of mine adversary from the Lord, and of them that speak evil against my soul."},{"num":21,"verse":"But thou, O Lord my God, deal with me according unto thy Name: deliver me, (for thy mercy is good)"},{"num":22,"verse":"Because I am poor and needy, and mine heart is wounded within me."},{"num":23,"verse":"I depart like the shadow that declineth, and am shaken off as the grasshopper."},{"num":24,"verse":"My knees are weak through fasting, and my flesh hath lost all fatness."},{"num":25,"verse":"I became also a rebuke unto them: they that looked upon me, shaked their heads."},{"num":26,"verse":"Help me, O Lord my God: save me according to thy mercy."},{"num":27,"verse":"And they shall know that this is thine hand, and that thou, Lord, hast done it."},{"num":28,"verse":"Though they curse, yet thou wilt bless: they shall arise and be confounded, but thy servant shall rejoice."},{"num":29,"verse":"Let mine adversaries be clothed with shame, and let them cover themselves with their confusion as with a cloak."},{"num":30,"verse":"I will give thanks unto the Lord greatly with my mouth, and praise him among the multitude."},{"num":31,"verse":"For he will stand at the right hand of the poor, to save him from them that would condemn his soul."}]