[[],[{"type":"header","content":"The New Birth"},{"type":"prose","content":"Now there was a man of the Pharisees, named Nicodemus, a ruler of the Jews;"}],[{"type":"prose","content":"this man came to Jesus at night and said to Him, “Rabbi, we know that You have come from God  a teacher; for no one can do these signs that You do unless God is with him.”"}],[{"type":"prose","content":"Jesus responded and said to him, "}],[{"type":"prose","content":"Nicodemus *said to Him, “How can a person be born when he is old? He cannot enter his mother’s womb a second time and be born, can he?”"}],[{"type":"prose","content":"Jesus answered, "}],[{"type":"prose","content":"Nicodemus responded and said to Him, “How can these things be?”"}],[{"type":"prose","content":"Jesus answered and said to him, "},{"type":"header","content":"John the Baptist’s Last Testimony"}],[{"type":"prose","content":"After these things Jesus and His disciples came into the land of Judea; and there He was spending time with them and baptizing."}],[{"type":"prose","content":"Now John also was baptizing in Aenon, near Salim, because there was an abundance of water there; and  were coming and being baptized—"}],[{"type":"prose","content":"for John had not yet been thrown into prison."}],[{"type":"prose","content":"Then a matter of dispute developed on the part of John’s disciples with a Jew about purification."}],[{"type":"prose","content":"And they came to John and said to him, “Rabbi, He who was with you beyond the Jordan, to whom you have testified—behold, He is baptizing and all  are coming to Him.”"}],[{"type":"prose","content":"John replied, “A person can receive not even one thing unless it has been given to him from heaven."}],[{"type":"prose","content":"You yourselves are my witnesses that I said, ‘I am not the Christ,’ but, ‘I have been sent ahead of Him.’"}],[{"type":"prose","content":"He who has the bride is the groom; but the friend of the groom, who stands and listens to him, rejoices greatly because of the groom’s voice. So this joy of mine has been made full."}],[{"type":"prose","content":"He must increase, but I must decrease."}],[{"type":"prose","content":"“He who comes from above is above all; the one who is  from the earth is of the earth and speaks of the earth. He who comes from heaven is above all."}],[{"type":"prose","content":"What He has seen and heard, of this He testifies; and no one accepts His testimony."}],[{"type":"prose","content":"The one who has accepted His testimony has certified that God is true."}],[{"type":"prose","content":"For He whom God sent speaks the words of God; for He does not give the Spirit sparingly."}],[{"type":"prose","content":"The Father loves the Son and has entrusted all things to His hand."}],[{"type":"prose","content":"The one who believes in the Son has eternal life; but the one who does not obey the Son will not see life, but the wrath of God remains on him.”"}]]