[{"num":2,"verse":"When the holy day of Pentecost came 50 days after Passover, they were gathered together in one place."},{"num":2,"verse":"Picture yourself among the disciples:"},{"num":3,"verse":"Then a flame appears, dividing into smaller flames and spreading from one person to the next. "},{"num":4,"verse":"All the people present are filled with the Holy Spirit and begin speaking in languages they’ve never spoken, as the Spirit empowers them."},{"num":5,"verse":"Because of the holy festival, there are devout Jews staying as pilgrims in Jerusalem from every nation under the sun. "},{"num":6,"verse":"They hear the sound, and a crowd gathers. They are amazed because each of them can hear the group speaking in their native languages. "},{"num":7,"verse":"They are shocked and amazed by this."},{"num":12,"verse":"Their amazement becomes confusion as they wonder,"},{"num":14,"verse":"As the twelve stood together, Peter shouted to the crowd,"},{"num":37,"verse":"When the people heard this, their hearts were pierced; and they said to Peter and his fellow apostles,"},{"num":40,"verse":"Peter was pleading and offering many logical reasons to believe. "},{"num":41,"verse":"Whoever made a place for his message in their hearts received the baptism; in fact, that day alone, about 3,000 people joined the disciples."},{"num":42,"verse":"The community continually committed themselves to learning what the apostles taught them, gathering for fellowship, breaking bread, and praying. "},{"num":43,"verse":"Everyone felt a sense of awe because the apostles were doing many signs and wonders among them. "},{"num":44,"verse":"There was an intense sense of togetherness among all who believed; they shared all their material possessions in trust. "},{"num":45,"verse":"They sold any possessions and goods that did not benefit the community and used the money to help everyone in need. "},{"num":46,"verse":"They were unified as they worshiped at the temple day after day. In homes, they broke bread and shared meals with glad and generous hearts. "},{"num":47,"verse":"The new disciples praised God, and they enjoyed the goodwill of all the people of the city. Day after day the Lord added to their number everyone who was experiencing liberation."}]