[{"num":23,"verse":"David was told, “The P’lishtim are fighting Ke‘ilah and plundering the threshing-floors.” "},{"num":2,"verse":"David consulted Adonai, asking, “Should I go and attack these P’lishtim?” Adonai answered David, “Go, and attack the P’lishtim, and save Ke‘ilah.” "},{"num":3,"verse":"David’s men said to him, “Look, we’re already afraid here in Y’hudah. How much more, then, if we go to Ke‘ilah to fight the armies of the P’lishtim!” "},{"num":4,"verse":"David consulted Adonai again; and Adonai answered him, “Set out, and go down to Ke‘ilah, because I will hand the P’lishtim over to you.” "},{"num":5,"verse":"David and his men went to Ke‘ilah and fought the P’lishtim. They defeated them in a great slaughter and led away their livestock. Thus David saved the inhabitants of Ke‘ilah."},{"num":6,"verse":"When Avyatar the son of Achimelekh fled to David in Ke‘ilah, he had brought a ritual vest with him. "},{"num":7,"verse":"Now Sha’ul, on being informed that David had gone to Ke‘ilah, had said, “God has put him into my hands. He’s trapped himself by entering a town with gates and bars.” "},{"num":8,"verse":"So Sha’ul summoned all the people to war, to go down to Ke‘ilah and besiege David and his men. "},{"num":9,"verse":"David knew that Sha’ul was plotting something against him, so he told Avyatar the cohen, “Bring the ritual vest here.” "},{"num":10,"verse":"Then David said, “Adonai God of Isra’el, your servant has certainly heard that Sha’ul intends to come to Ke‘ilah and destroy the city just to get me. "},{"num":11,"verse":"Will the men of Ke‘ilah turn me over to him? Will Sha’ul come down, as your servant has heard? Adonai God of Isra’el, please tell your servant!” Adonai said, “He will come down.” "},{"num":12,"verse":"Then David asked, “Will the men of Ke‘ilah hand me and my men over to Sha’ul?” Adonai said, “They will hand you over.” "},{"num":13,"verse":"So David and his men, now around six hundred, got up, left Ke‘ilah and went wherever they could. It was told Sha’ul that David had escaped from Ke‘ilah, so he called off the expedition. "},{"num":14,"verse":"David stayed in the desert strongholds, remaining in the hills of the Zif Desert. Sha’ul kept trying to find him, but God did not hand him over to him."},{"num":15,"verse":"David saw that Sha’ul had mounted another expedition to seek his life. David was then at Horesh in the Zif Desert. "},{"num":16,"verse":"Y’honatan Sha’ul’s son set out and went to David at Horesh to encourage him in God. "},{"num":17,"verse":"He said to him, “Don’t be afraid, because my father’s forces will not find you; you will be king over Isra’el, and I will be second to you. Sha’ul my father knows this, too.” "},{"num":18,"verse":"Then the two of them made a covenant in the presence of Adonai, after which David stayed at Horesh and Y’honatan returned home."},{"num":19,"verse":"The people of Zif came to Sha’ul in Giv‘ah and said, “David is hiding himself with us in the strongholds at Horesh, on Hakhilah Hill, south of Yeshimon. "},{"num":20,"verse":"So now, king, since you’ve wanted so much to come down, come down! Our part will be to turn him over to you.” "},{"num":21,"verse":"Sha’ul said, “May Adonai bless you for showing me compassion! "},{"num":22,"verse":"Please go and make still more certain exactly where he is and who has seen him there, because I’ve been told that he’s very tricky. "},{"num":23,"verse":"So look closely, find out where all his hiding-places are, and come back when you’re sure. Then I will go with you, and if he is there in that territory, I’ll search till I find him among all the thousands of Y’hudah.”"},{"num":24,"verse":"They set out and went to Zif before Sha’ul. But David and his men had gone on to the Ma‘on Desert, in the ‘Aravah south of Yeshimon. "},{"num":25,"verse":"Sha’ul and his men went searching for him. David was told, so he came down to the rock and stayed in the Ma‘on Desert. When Sha’ul heard that, he pursued David in the Ma‘on Desert. "},{"num":26,"verse":"Sha’ul went along one side of the mountain, while David and his men went along the other. David was hurrying to get away from Sha’ul, while Sha’ul and his men were trying to surround David and his men in order to capture them. "},{"num":27,"verse":"But then a messenger came to Sha’ul, saying, “Hurry, come, because the P’lishtim are invading the country!” "},{"num":28,"verse":"So Sha’ul stopped chasing David and went to fight the P’lishtim. Therefore they called that place Sela-Hamachlekot [rock of divisions]."}]