[{"header":"Chapter 23"},{"num":1,"verse":"David Rescues Keilah. Some people then spoke to David saying, “Look, the Philistines are attacking Keilah and they are robbing the threshing floors.”"},{"num":2,"verse":"David inquired of the Lord saying, “Shall I go to attack these Philistines?” The Lord said to David, “Go attack the Philistines and rescue Keilah.”"},{"num":3,"verse":"David’s men said to him, “Look, we are afraid here in Judah. How much more would we be if we went to Keilah to fight against the armies of the Philistines?”"},{"num":4,"verse":"David inquired of the Lord once again, and the Lord said, “Rise, go down to Keilah, for I will deliver the Philistines into your hands.”"},{"num":5,"verse":"David and his men went to Keilah and they fought with the Philistines. They slaughtered many of them, and they brought away their livestock. Thus David saved the inhabitants of Keilah."},{"num":6,"verse":"When Abiathar, the son of Ahimelech, fled to David at Keilah, he went down with an ephod in his hand."},{"num":7,"verse":"Saul Chases David. Saul was told that David had gone to Keilah. Saul said, “God has delivered him into my hands for he has trapped himself behind gates and bars.”"},{"num":8,"verse":"Then Saul assembled all of the people for war, to go down to Keilah and lay siege to David and his men."},{"num":9,"verse":"David knew that Saul was plotting evil against him, so he said to Abiathar the priest, “Bring the ephod here.”"},{"num":10,"verse":"David said, “O Lord, the God of Israel, your servant has truly heard that Saul is seeking to come to Keilah to destroy the city on account of me."},{"num":11,"verse":"Will the men of Keilah deliver me into his hands? Will Saul come down here as your servant has heard? O Lord, the God of Israel, I beg you to tell your servant.” The Lord said, “He will come down.”"},{"num":12,"verse":"Then David said, “Will the men of Keilah deliver me and my men into the hands of Saul?” The Lord answered, “They will deliver you over.”"},{"num":13,"verse":"So David and his men (there were around six hundred of them) left Keilah and went wherever they could go. Saul heard that David had left Keilah, so he halted the pursuit."},{"num":14,"verse":"David stayed in the wilderness strongholds, and he remained in the hill country of the Desert of Ziph. Saul sought him every single day, but God did not deliver him into his hands."},{"num":15,"verse":"David realized that Saul was coming out to seek his life while he was in the Desert of Ziph at Horesh."},{"num":16,"verse":"Jonathan, Saul’s son, arose and went to David in Horesh and encouraged him in God."},{"num":17,"verse":"This is what he said to him, “Do not be afraid, for the hand of Saul, my father, is not going to find you. You will be the king over Israel, and I will be next to you. Even my father Saul knows that.”"},{"num":18,"verse":"The two of them made a covenant before the Lord. David stayed in the woods, and Jonathan returned home."},{"num":19,"verse":"The Ziphites then came up to Saul in Gibeah saying, “Is David not hiding with us in strongholds in the woods, on the hill of Hachilah which is to the south of Jeshimon?"},{"num":20,"verse":"Therefore, come down as you wish to, O king, come down, and for our part we will deliver him into the king’s hands.”"},{"num":21,"verse":"Saul said, “May you be blessed by the Lord, for you have had compassion on me."},{"num":22,"verse":"Go, please, and prepare yourselves. Investigate and reconnoiter where he is hidden and find out who has seen him there, for I have been told that he is very clever."},{"num":23,"verse":"See, therefore, and find out about all the places where he is hiding, then come back to me with certain information. Then I will go with you, and if he is in the land, I will search for him all throughout the thousands of Judah.”"},{"num":24,"verse":"Escape from Saul. They rose up and preceded Saul to Ziph. David and his men were in the Desert of Maon, in the Arabah to the south of Jeshimon."},{"num":25,"verse":"Saul and his men were searching, and when David was told about it, he went down to the rock and stayed in the Desert of Maon. Saul heard about this and pursued David in the Desert of Maon."},{"num":26,"verse":"Saul was on one side of the mountain, and David and his men were on the other side of the mountain. David, out of fear, hurried to get away. Saul and his men were trying to surround David and his men to capture them."},{"num":27,"verse":"A messenger came to Saul saying, “Come quickly, for the Philistines have invaded the land.”"},{"num":28,"verse":"Saul broke off his pursuit of David and he left to fight against the Philistines. This is why they called that place the Rock of Escape."}]