[{"num":11,"verse":"When Israel was a child, then I loved him and called My son out of Egypt."},{"num":2,"verse":"The more [the prophets] called to them, the more they went from them; they kept sacrificing to the Baals and burning incense to the graven images."},{"num":3,"verse":"Yet I taught Ephraim to walk, taking them by their arms or taking them up in My arms, but they did not know that I healed them."},{"num":4,"verse":"I drew them with cords of a man, with bands of love, and I was to them as one who lifts up and eases the yoke over their cheeks, and I bent down to them and gently laid food before them."},{"num":5,"verse":"They shall not [literally] return into [another bondage in] the land of Egypt, but the Assyrian shall be their king because they refused to return to Me."},{"num":6,"verse":"And the sword shall rage against and fall upon their cities and shall consume the bars of their gates and shall make an end [of their defenses], because of their own counsels and devices."},{"num":7,"verse":"My people are bent on backsliding from Me; though [the prophets] call them to Him Who is on high, none at all will exalt Him or lift himself up [to come to Him]."},{"num":8,"verse":"How can I give you up, O Ephraim! How can I surrender you and cast you off, O Israel! How can I make you as Admah or how can I treat you as Zeboiim [both destroyed with Sodom]! My heart recoils within Me; My compassions are kindled together."},{"num":9,"verse":"I will not execute the fierceness of My anger; I will not bring back Ephraim to nothing or again destroy him. For I am God and not man, the Holy One in the midst of you, and I will not come in wrath or enter into the city."},{"num":10,"verse":"They shall walk after the Lord, Who will roar like a lion; He Himself will roar and [His] sons shall come trembling and eagerly from the west."},{"num":11,"verse":"They shall come trembling but hurriedly like a bird out of Egypt and like a dove out of the land of Assyria, and I will cause them to dwell in their houses, says the Lord."},{"num":12,"verse":"Ephraim surrounds Me with lies and the house of Israel with deceit, and Judah is not yet steadfast with God, with the faithful Holy One."}]