[{"num":11,"verse":"For Israel was a child, and I loved him; and from Egypt I called my son. (When Israel was a boy, I loved him; and I called my son out of Egypt.)"},{"num":2,"verse":"They called them, so they went away from the face of them. They offered to Baalim, and made sacrifice to simulacra. (And I called to them, but they went further away from me. They offered to the Baalim, and made sacrifice to idols.)"},{"num":3,"verse":"And I as a nurse of Ephraim bare them in mine arms, and they knew not, that I kept them. (And I as the nurse of Ephraim carried them in my arms, but they did not know, that it was I who had kept them safe.)"},{"num":4,"verse":"I shall draw them in the ropes of Adam, in the bonds of charity. And I shall be to them as he that enhanceth the yoke on the cheeks of them; and I bowed down to him that he should eat. (I drew them to me with the ropes of man, or of people, yea, with the bonds of love. And I was to them like he who lifteth up a little child to his cheeks/like he who lifteth off their yoke; and I bent down to feed them.)"},{"num":5,"verse":"He shall not turn again into the land of Egypt. And Assur, he shall be king of him, for they would not turn (again to me). (And so they shall return to the land of Egypt. And the Assyrian, he shall be their king, because they would not return to me.)"},{"num":6,"verse":"A sword began in the cities thereof, and it shall waste the chosen men thereof, and shall eat the heads of them. (And a sword shall begin in their cities, and it shall destroy their chosen ones, and it shall eat their leaders.)"},{"num":7,"verse":"And my people shall hang, at my coming again. But a yoke shall be put to them (al)together, that shall not be taken away. (But my people shall persist in their rebellion. And a yoke shall be put upon them, and it shall not be taken away.)"},{"num":8,"verse":"How shall I give thee (up), Ephraim? shall I defend thee, Israel? how shall I give thee (up)? As Admah I shall set thee; as Zeboiim. Mine heart is turned within me; my repentance is disturbed together. (How can I give thee up, Ephraim? how can I abandon thee, Israel? how can I give thee up? Shall I make thee like Admah? or like Zeboiim? My heart is turned within me; my repentance is altogether kindled.)"},{"num":9,"verse":"I shall not do the strong vengeance of my wrath. I shall not turn (again), to lose Ephraim; for I am God, and not man. I am Holy in the midst of thee, and I shall not enter into a city. (I shall not do the strong vengeance of my anger. I shall not return, or turn back, to destroy Ephraim; for I am God, and not a man. I am the Holy One in thy midst, and I shall not enter into thy cities.)"},{"num":10,"verse":"They shall go after the Lord. He shall roar as a lion, for he shall roar, and the sons of the sea shall dread. (They shall follow after the Lord. And he shall roar like a lion, and when he shall roar, his sons shall come to him from the west.)"},{"num":11,"verse":"And they shall fly away as a bird from Egypt, and as a culver from the land of Assyrians. And I shall set them in their houses, saith the Lord. (And they shall fly away like a bird out of Egypt, and like a dove out of the land of Assyria. And I shall put them again in their own houses, saith the Lord.)"},{"num":12,"verse":"Ephraim compassed me in denying, the house of Israel in guile. But Judah a witness went down with God, and with faithful saints. (Ephraim surroundeth me with denial, or with treachery, yea, the house of Israel surroundeth me with deceitfulness. And Judah still rebelleth against me, the faithful and the holy God.)"}]