[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lest I mar . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The redemption of the land would involve the spending of money, drawn away from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Goel’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "own estate; but the land thus acquired would not belong to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Goel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "himself, but to the son he should have by Ruth, who would yet be, in the eyes of the law, the son of Mahlon. It would, therefore, be like mortgaging one’s own estate, and that for the benefit of another. Josephus and the Targum explain it by saying that he already had a wife, and feared the discord that might arise.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ruth 4:6. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest I mar mine own inheritance — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems he had a wife and children already, which made him afraid to marry a poor woman with a small parcel of land, which would not provide for the children he might have by her, lest he should thereby diminish the inheritance of which he was already possessed. The Chaldee paraphrase on the passage is, “I cannot redeem it on this condition,” namely, the condition of marrying Ruth; “because I have a wife already, and do not choose to bring another into my house, lest quarrels and divisions arise in it, and I hurt my own inheritance.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-8 This matter depended on the laws given by Moses about inheritances, and doubtless the whole was settled in the regular and legal manner. This kinsman, when he heard the conditions of the bargain, refused it. In like manner many are shy of the great redemption; they are not willing to espouse religion; they have heard well of it, and have nothing to say against it; they will give it their good word, but they are willing to part with it, and cannot be bound to it, for fear of marring their own inheritance in this world. The right was resigned to Boaz. Fair and open dealing in all matters of contract and trade, is what all must make conscience of, who would approve themselves true Israelites, without guile. Honesty will be found the best policy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I mar mine own inheritance - The meaning of these words is doubtful. Some explain them by saying that the גאל  gā'al had a wife and children already, and would not introduce strife into his family. Others think that there was a risk (which he would not incur) of the go'el's own name being blotted out from his inheritance ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ruth 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Others take the word translated as \"mar\" in a sense of wasting or spending. If he had to find the purchase-money, and support Naomi and Ruth, his own fortune would be broken down, if, as is likely, he was a man of slender means. Boaz, being \"a mighty man of wealth,\" could afford this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Redeem thou my right ... - Literally, redeem my redemption - perform that act of redemption which properly belongs to me, but which I cannot perform. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Redeem thou my right ... - Literally, redeem my redemption - perform that act of redemption which properly belongs to me, but which I cannot perform. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ru 4:6-8. He Refuses the Redemption.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6. The kinsman said, I cannot redeem it …, lest I mar mine own inheritance—This consequence would follow, either, first, from his having a son by Ruth, who, though heir to the property, would not bear his name; his name would be extinguished in that of her former husband; or, secondly, from its having to be subdivided among his other children, which he had probably by a previous marriage. This right, therefore, was renounced and assigned in favor of Boaz, in the way of whose marriage with Ruth the only existing obstacle was now removed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lest I mar mine own inheritance; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, first, Because having no children of his own, he might have one, and but one, son by Ruth, who, though he should carry away his inheritance, yet should not bear his name, but the name of Ruth’s husband; and so by preserving another man’s name, he should lose his own. Or, secondly, Because as his inheritance would be but very little increased by this marriage, so it might be much diminished by being divided amongst his many children, which he possibly had already, and might probably have more by Ruth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Redeem thou my right, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which I freely renounce and resign to thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the kinsman said, I cannot redeem it for myself,.... On such a condition, because he had a wife, as the Targum suggests; and to take another would, as that intimates, tend to introduce contention into his family, and make him uncomfortable; so Josephus says (h), he had a wife and children, for that reason it was not convenient for him to take the purchase on such a condition: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lest I mar my own inheritance; he considered, that as he had a wife and children already and as he might have more by marrying Ruth, his family expenses would be increased, and his estate diminished; and what would remain must be divided among many, and this estate in particular go to Ruth's firstborn, whereby his own inheritance would be scattered and crumbled, and come to little or nothing; add to all which, he might suppose that her ancient mother Naomi would be upon his hands to maintain also: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "redeem thou my right for thyself which I am ready to give up to thee, for thou hast no wife, as the Targum expresses it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for I can not redeem it; in the circumstances I am, and upon the condition annexed to the purchase. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Antiqu. l. 5. c. 9. sect. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Antiqu. l. 5. c. 9. sect. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the kinsman said, I cannot redeem it for myself, lest I mar mine own inheritance: redeem thou my right to thyself; for I cannot redeem it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lest I mar mine own inheritance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] When the Go’el learns that if he redeems the estate he is expected to marry the widow, he takes back his promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ruth 4:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 4:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). He declares that he cannot afford to be so generous. If he were to have a son by Ruth, the child would take the name and estate of the dead, and the Go’el would have only a temporary usufruct in the property, and in the end lose it altogether (Robertson Smith l.c.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "take thou my right of redemption on thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Since the Go’el declines, the right to redeem falls on Boaz as the next nearest kinsman.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the kinsman said, I am not able to perform, for myself, the kinsman's part, lest I should destroy my inheritance. Perform thou, for thyself, the kinsman's part devolving on me, for I am not able to perform it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The moment that Ruth was referred to, as the inseparable appurtenance of Elimelech's estate, a total change came over the feelings of the anonymous relative and the spirit of his dream. He \"could ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" so he strongly put it, perform the kinsman's part. The probability is that he already had a family, but was a widower. This being the state of the case, it followed that if he should acquire Ruth along with her father-in-law's property, there might be an addition, perhaps a numerous addition, to his family; and if so, then there would be more to provide for during his lifetime, and at his death an increased subdivision of his patrimony. This, as he strongly put it, would be to \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "destroy\"",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his patrimony, inasmuch as it might be frittered into insignificant fractions. There can be no reference, as the Chaldee Targumist imagined, to his fear of domestic dissensions. Or, if he did indeed think of such a casualty, he certainly did not give the idea expression to Boaz and the assessors. Cassel takes another view. \"It must be,\" he says, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Moabitish nationality that forms the ground, such as it is, of the kinsman's refusal. Elimelech's misfortunes had been popularly ascribed to his emigration to Moab; the death of Chillon and Machlon to their marriage with Moabitish women. This it was that had endangered their inheritance. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "goal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " fears a similar fate. He thinks that he ought not to take into his house a woman, marriage with whom has already been visited with the extinguishment of a family in Israel.\" But if this had been what he referred to when he spoke of the \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "destruc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "tion\" of his inheritance, it was not much in harmony with the benevolence which he owed to Boaz, and to which he so far gives expression in the courtesy of his address, that he should have gratuitously urged upon his relative what he declined as dangerous for himself. The expressions \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " myself\" and \"for thyself\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לִי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לְך",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are significant. The anonymous relative does not conceal the idea that it would be only on the ground of doing what would be ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for his own interest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that he could entertain for consideration the proposal of Naomi. He likewise assumed that if Boaz should be willing to act the kinsman's part, it would be simply because it could be turned to account ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for his own interest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He did not know that there was in Boaz's heart a love that truly \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "seeketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not her own,\" but in honor prefers the things of another. Ruth 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The redeemer admitted the justice of this demand, from which we may see that the thing passed as an existing right in the nation. But as he was not disposed to marry Ruth, he gave up the redemption of the field.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ruth 4:6-13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 4:6-13",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I cannot redeem it for myself, lest I mar mine own inheritance.\" The redemption would cost money, since the yearly produce of the field would have to be paid for up to the year of jubilee. Now, if he acquired the field by redemption as his own permanent property, he would have increased by so much his own possessions in land. But if he should marry Ruth, the field so redeemed would belong to the son whom he would beget through her, and he would therefore have parted with the money that he had paid for the redemption merely for the son of Ruth, so that he would have withdrawn a certain amount of capital from his own possession, and to that extent have detracted from its worth. \"Redeem thou for thyself my redemption,\" i.e., the field which I have the first right to redeem.",
        "children": []
      }
    ]
  }
]