[{"num":1,"verse":"Since [as is well known] many have undertaken to put in order and draw up a [thorough] narrative of the surely established deeds which have been accomplished and fulfilled  in and among us,"},{"num":2,"verse":"Exactly as they were handed down to us by those who from the [official] beginning [of Jesus’ ministry] were eyewitnesses and ministers of the Word [that is, of the doctrine concerning the attainment through Christ of salvation in the kingdom of God],"},{"num":3,"verse":"It seemed good and desirable to me, [and so I have determined] also after having searched out diligently and followed all things closely and traced accurately the course from the highest to the minutest detail from the very first, to write an orderly account for you, most excellent Theophilus,"},{"num":4,"verse":"[My purpose is] that you may know the full truth and understand with certainty and security against error the accounts (histories) and doctrines of the faith of which you have been informed and in which you have been orally instructed."},{"num":5,"verse":"In the days when Herod was king of Judea there was a certain priest whose name was Zachariah, of the daily service (the division) of Abia; and his wife was also a descendant of Aaron, and her name was Elizabeth."},{"num":6,"verse":"And they both were righteous in the sight of God, walking blamelessly in all the commandments and requirements of the Lord."},{"num":7,"verse":"But they had no child, for Elizabeth was barren; and both were far advanced in years."},{"num":8,"verse":"Now while on duty, serving as priest before God in the order of his division,"},{"num":9,"verse":"As was the custom of the priesthood, it fell to him by lot to enter [the sanctuary of] the temple of the Lord and burn incense."},{"num":10,"verse":"And all the throng of people were praying outside [in the court] at the hour of incense [burning]."},{"num":11,"verse":"And there appeared to him an angel of the Lord, standing at the right side of the altar of incense."},{"num":12,"verse":"And when Zachariah saw him, he was troubled, and fear took possession of him."},{"num":13,"verse":"But the angel said to him, Do not be afraid, Zachariah, because your petition was heard, and your wife Elizabeth will bear you a son, and you must call his name John [God is favorable]."},{"num":14,"verse":"And you shall have joy and exultant delight, and many will rejoice over his birth,"},{"num":15,"verse":"For he will be great and distinguished in the sight of the Lord. And he must drink no wine nor strong drink, and he will be filled with and controlled by the Holy Spirit even in and from his mother’s womb."},{"num":16,"verse":"And he will turn back and cause to return many of the sons of Israel to the Lord their God,"},{"num":17,"verse":"And he will [himself] go before Him in the spirit and power of Elijah, to turn back the hearts of the fathers to the children, and the disobedient and incredulous and unpersuadable to the wisdom of the upright [which is the knowledge and holy love of the will of God]—in order to make ready for the Lord a people [perfectly] prepared [in spirit, adjusted and disposed and placed in the right moral state]."},{"num":18,"verse":"And Zachariah said to the angel, By what shall I know and be sure of this? For I am an old man, and my wife is well advanced in years."},{"num":19,"verse":"And the angel replied to him, I am Gabriel. I stand in the [very] presence of God, and I have been sent to talk to you and to bring you this good news."},{"num":20,"verse":"Now behold, you will be and will continue to be silent and not able to speak till the day when these things take place, because you have not believed what I told you; but my words are of a kind which will be fulfilled in the appointed and proper time."},{"num":21,"verse":"Now the people kept waiting for Zachariah, and they wondered at his delaying [so long] in the sanctuary."},{"num":22,"verse":"But when he did come out, he was unable to speak to them; and they [clearly] perceived that he had seen a vision in the sanctuary; and he kept making signs to them, still he remained dumb."},{"num":23,"verse":"And when his time of performing priestly functions was ended, he returned to his [own] house."},{"num":24,"verse":"Now after this his wife Elizabeth became pregnant, and for five months she secluded herself entirely, saying, [I have hid myself]"},{"num":25,"verse":"Because thus the Lord has dealt with me in the days when He deigned to look on me to take away my reproach among men."},{"num":26,"verse":"Now in the sixth month [after that], the angel Gabriel was sent from God to a town of Galilee named Nazareth,"},{"num":27,"verse":"To a girl never having been married and a virgin engaged to be married to a man whose name was Joseph, a descendant of the house of David; and the virgin’s name was Mary."},{"num":28,"verse":"And he came to her and said, Hail, O favored one [endued with grace]! The Lord is with you! Blessed (favored of God) are you before all other women!"},{"num":29,"verse":"But when she saw him, she was greatly troubled and disturbed and confused at what he said and kept revolving in her mind what such a greeting might mean."},{"num":30,"verse":"And the angel said to her, Do not be afraid, Mary, for you have found grace (free, spontaneous, absolute favor and loving-kindness) with God."},{"num":31,"verse":"And listen! You will become pregnant and will give birth to a Son, and you shall call His name Jesus."},{"num":32,"verse":"He will be great (eminent) and will be called the Son of the Most High; and the Lord God will give to Him the throne of His forefather David,"},{"num":33,"verse":"And He will reign over the house of Jacob throughout the ages; and of His reign there will be no end."},{"num":34,"verse":"And Mary said to the angel, How can this be, since I have no [intimacy with any man as a] husband?"},{"num":35,"verse":"Then the angel said to her, The Holy Spirit will come upon you, and the power of the Most High will overshadow you [like a shining cloud]; and so the holy (pure, sinless) Thing (Offspring) which shall be born of you will be called the Son of God."},{"num":36,"verse":"And listen! Your relative Elizabeth in her old age has also conceived a son, and this is now the sixth month with her who was called barren."},{"num":37,"verse":"For with God nothing is ever impossible and no word from God shall be without power or impossible of fulfillment."},{"num":38,"verse":"Then Mary said, Behold, I am the handmaiden of the Lord; let it be done to me according to what you have said. And the angel left her."},{"num":39,"verse":"And at that time Mary arose and went with haste into the hill country to a town of Judah,"},{"num":40,"verse":"And she went to the house of Zachariah and, entering it, saluted Elizabeth."},{"num":41,"verse":"And it occurred that when Elizabeth heard Mary’s greeting, the baby leaped in her womb, and Elizabeth was filled with and controlled by the Holy Spirit."},{"num":42,"verse":"And she cried out with a loud cry, and then exclaimed, Blessed (favored of God) above all other women are you! And blessed (favored of God) is the Fruit of your womb!"},{"num":43,"verse":"And how [have I deserved that this honor should] be granted to me, that the mother of my Lord should come to me?"},{"num":44,"verse":"For behold, the instant the sound of your salutation reached my ears, the baby in my womb leaped for joy."},{"num":45,"verse":"And blessed (happy, to be envied) is she who believed that there would be a fulfillment of the things that were spoken to her from the Lord."},{"num":46,"verse":"And Mary said, My soul magnifies and extols the Lord,"},{"num":47,"verse":"And my spirit rejoices in God my Savior,"},{"num":48,"verse":"For He has looked upon the low station and humiliation of His handmaiden. For behold, from now on all generations [of all ages] will call me blessed and declare me happy and to be envied!"},{"num":49,"verse":"For He Who is almighty has done great things for me—and holy is His name [to be venerated in His purity, majesty and glory]!"},{"num":50,"verse":"And His mercy (His compassion and kindness toward the miserable and afflicted) is on those who fear Him with godly reverence, from generation to generation and age to age."},{"num":51,"verse":"He has shown strength and made might with His arm; He has scattered the proud and haughty in and by the imagination and purpose and designs of their hearts."},{"num":52,"verse":"He has put down the mighty from their thrones and exalted those of low degree."},{"num":53,"verse":"He has filled and satisfied the hungry with good things, and the rich He has sent away empty-handed [without a gift]."},{"num":54,"verse":"He has laid hold on His servant Israel [to help him, to espouse his cause], in remembrance of His mercy,"},{"num":55,"verse":"Even as He promised to our forefathers, to Abraham and to his descendants forever."},{"num":56,"verse":"And Mary remained with her [Elizabeth] for about three months and [then] returned to her [own] home."},{"num":57,"verse":"Now the time that Elizabeth should be delivered came, and she gave birth to a son."},{"num":58,"verse":"And her neighbors and relatives heard that the Lord had shown great mercy on her, and they rejoiced with her."},{"num":59,"verse":"And it occurred that on the eighth day, when they came to circumcise the child, they were intending to call him Zachariah after his father,"},{"num":60,"verse":"But his mother answered, Not so! But he shall be called John."},{"num":61,"verse":"And they said to her, None of your relatives is called by that name."},{"num":62,"verse":"And they inquired with signs to his father [as to] what he wanted to have him called."},{"num":63,"verse":"Then Zachariah asked for a writing tablet and wrote, His name is John. And they were all astonished."},{"num":64,"verse":"And at once his mouth was opened and his tongue loosed, and he began to speak, blessing and praising and thanking God."},{"num":65,"verse":"And awe and reverential fear came on all their neighbors; and all these things were discussed throughout the hill country of Judea."},{"num":66,"verse":"And all who heard them laid them up in their hearts, saying, Whatever will this little boy be then? For the hand of the Lord was [so evidently] with him [protecting and aiding him]."},{"num":67,"verse":"Now Zachariah his father was filled with and controlled by the Holy Spirit and prophesied, saying,"},{"num":68,"verse":"Blessed (praised and extolled and thanked) be the Lord, the God of Israel, because He has come and brought deliverance and redemption to His people!"},{"num":69,"verse":"And He has raised up a Horn of salvation [a mighty and valiant Helper, the Author of salvation] for us in the house of David His servant—"},{"num":70,"verse":"This is as He promised by the mouth of His holy prophets from the most ancient times [in the memory of man]—"},{"num":71,"verse":"That we should have deliverance and be saved from our enemies and from the hand of all who detest and pursue us with hatred;"},{"num":72,"verse":"To make true and show the mercy and compassion and kindness [promised] to our forefathers and to remember and carry out His holy covenant [to bless, which is all the more sacred because it is made by God Himself],"},{"num":73,"verse":"That covenant He sealed by oath to our forefather Abraham:"},{"num":74,"verse":"To grant us that we, being delivered from the hand of our foes, might serve Him fearlessly"},{"num":75,"verse":"In holiness (divine consecration) and righteousness [in accordance with the everlasting principles of right] within His presence all the days of our lives."},{"num":76,"verse":"And you, little one, shall be called a prophet of the Most High; for you shall go on before the face of the Lord to make ready His ways,"},{"num":77,"verse":"To bring and give the knowledge of salvation to His people in the forgiveness and remission of their sins."},{"num":78,"verse":"Because of and through the heart of tender mercy and loving-kindness of our God, a Light from on high will dawn upon us and visit [us]"},{"num":79,"verse":"To shine upon and give light to those who sit in darkness and in the shadow of death, to direct and guide our feet in a straight line into the way of peace."},{"num":80,"verse":"And the little boy grew and became strong in spirit; and he was in the deserts (wilderness) until the day of his appearing to Israel [the commencement of his public ministry]."}]