[[],[{"type":"header","content":"Naomi Instructs Ruth"},{"type":"prose","content":"At that time, Naomi, her mother-in-law, said to her, “My daughter, I must find a home for you so you will be secure. "}],[{"type":"prose","content":"Now Boaz, with whose female servants you worked, is our close relative. Look, tonight he is winnowing barley at the threshing floor. "}],[{"type":"prose","content":"So bathe yourself, rub on some perfumed oil, and get dressed up. Then go down to the threshing floor. But don’t let the man know you’re there until he finishes his meal. "}],[{"type":"prose","content":"When he gets ready to go to sleep, take careful notice of the place where he lies down. Then go, uncover his legs, and lie down beside him. He will tell you what you should do.” "}],[{"type":"prose","content":"Ruth replied to Naomi, “I will do everything you have told me to do.”"},{"type":"header","content":"Ruth Visits Boaz"}],[{"type":"prose","content":"So she went down to the threshing floor and did everything her mother-in-law had instructed her to do. "}],[{"type":"prose","content":"When Boaz had finished his meal and was feeling satisfied, he lay down to sleep at the far end of the grain heap. Then Ruth crept up quietly, uncovered his legs, and lay down beside him. "}],[{"type":"prose","content":"In the middle of the night he was startled and turned over. Now he saw a woman lying beside him! "}],[{"type":"prose","content":"He said, “Who are you?” She replied, “I am Ruth, your servant. Marry your servant, for you are a guardian of the family interests.” "}],[{"type":"prose","content":"He said, “May you be rewarded by the , my dear! This act of devotion is greater than what you did before. For you have not sought to marry one of the young men, whether rich or poor. "}],[{"type":"prose","content":"Now, my dear, don’t worry! I intend to do for you everything you propose, for everyone in the village knows that you are a worthy woman. "}],[{"type":"prose","content":"Now yes, it is true that I am a guardian, but there is another guardian who is a closer relative than I am. "}],[{"type":"prose","content":"Remain here tonight. Then in the morning, if he agrees to marry you, fine, let him do so. But if he does not want to do so, I promise, as surely as the  lives, to marry you. Sleep here until morning.” "}],[{"type":"prose","content":"So she slept beside him until morning. She woke up while it was still dark. Boaz thought, “No one must know that a woman visited the threshing floor.” "}],[{"type":"prose","content":"Then he said, “Hold out the shawl you are wearing and grip it tightly.” As she held it tightly, he measured out about sixty pounds of barley into the shawl and put it on her shoulders. Then he went into town, "}],[{"type":"prose","content":"and she returned to her mother-in-law."},{"type":"header","content":"Ruth Returns to Naomi"},{"type":"prose","content":"When Ruth returned to her mother-in-law, Naomi asked, “How did things turn out for you, my daughter?” Ruth told her about all the man had done for her. "}],[{"type":"prose","content":"She said, “He gave me these sixty pounds of barley, for he said to me, ‘Do not go to your mother-in-law empty-handed.’” "}],[{"type":"prose","content":"Then Naomi said, “Stay put, my daughter, until you know how the matter turns out. For the man will not rest until he has taken care of the matter today.”"}]]