[{"header":"Elihu Keeps On Speaking"},{"num":36,"verse":"Then Elihu spoke more and said, "},{"num":2,"verse":"“Wait for me a little longer, and I will show you that there is yet more to be said for God. "},{"num":3,"verse":"I bring my learning from far away, and will tell how right and good my Maker is. "},{"num":4,"verse":"For sure my words are not false. One who is perfect in much learning is with you."},{"num":5,"verse":"“See, God is powerful, but does not hate anyone. He is powerful in strength of understanding. "},{"num":6,"verse":"He does not keep the sinful alive, but gives what is right and fair to those who are troubled. "},{"num":7,"verse":"He does not turn His eyes away from those who are right with Him. He puts them on the throne with kings and they are honored forever. "},{"num":8,"verse":"If they are tied up in chains and caught in the ropes of trouble, "},{"num":9,"verse":"then He makes known to them their work and their sins, that they have shown pride. "},{"num":10,"verse":"He makes them listen to teaching, and tells them to turn away from sin. "},{"num":11,"verse":"If they hear and serve Him, the rest of their days will be filled with what they need and their years with peace. "},{"num":12,"verse":"But if they do not hear, they will die by the sword. They will die without learning."},{"num":13,"verse":"“But those who do not know God keep anger in their heart. They do not cry for help when He puts them in chains. "},{"num":14,"verse":"They die when they are young. And their life ends among those who sell the use of their bodies in the houses of the false gods. "},{"num":15,"verse":"He takes those who suffer out of their suffering. He speaks to them in times of trouble. "},{"num":16,"verse":"He led you from being close to trouble to a wide place where you were free with your table full of food."},{"num":17,"verse":"“But you wanted to punish the sinful. Punishment and being fair have taken hold of you. "},{"num":18,"verse":"Be careful or anger will tempt you to laugh at the truth. Do not take pay in secret for wrong-doing and be turned aside. "},{"num":19,"verse":"Will your riches or all your power keep you from trouble? "},{"num":20,"verse":"Do not desire the night, when people are taken from their place. "},{"num":21,"verse":"Be careful, do not turn to sin. For you have chosen this instead of suffering. "},{"num":22,"verse":"See, God is honored in His power. Who is a teacher like Him? "},{"num":23,"verse":"Who has told Him the way He should go? And who has said, ‘You have done wrong’?"},{"num":24,"verse":"“Remember that you should honor His work, of which men have sung. "},{"num":25,"verse":"All men have seen it. Man sees it from far away. "},{"num":26,"verse":"See, God is honored, and we do not know Him. We are not able to know the number of His years. "},{"num":27,"verse":"For He takes up the drops of water that become rain, "},{"num":28,"verse":"which the clouds pour down. Much rain falls on man. "},{"num":29,"verse":"Can anyone understand how the clouds are spread out, or how He thunders from His tent? "},{"num":30,"verse":"See, He spreads His lightning around Him and covers the bottom of the sea. "},{"num":31,"verse":"For by these He judges the people and He gives much food. "},{"num":32,"verse":"He covers His hands with the lightning, and tells it to hit the mark. "},{"num":33,"verse":"His thunder tells of a storm coming, and cattle also know it is coming."}]