[{"num":2,"verse":"1 The Apostles 4 filled with the holy Ghost 8 speak with divers tongues: 12 They are thought to be drunk, 15 but Peter disproveth that. 34 He teacheth that Christ is the Messiah: 37 And seeing the hearers astonied,  38 he exhorteth them to repentance."},{"num":1,"verse":"And when the day of Pentecost was come, they were all with one accord in one place."},{"num":2,"verse":"And suddenly there came a sound from heaven, as of a rushing and mighty wind, and it filled all the house where they sat."},{"num":3,"verse":"And there appeared unto them cloven tongues, like fire, and it sat upon each of them."},{"num":4,"verse":"And they were all filled with the holy Ghost, and began to speak with other tongues, as the Spirit gave them utterance."},{"num":5,"verse":"And there were dwelling at Jerusalem Jews, men that feared God, of every nation under heaven."},{"num":6,"verse":"Now when this was noised, the multitude came together and were astonied, because that every man heard them speak his own language."},{"num":7,"verse":"And they wondered all, and marveled, saying among themselves, Behold, are not all these which speak, of Galilee?"},{"num":8,"verse":"How then hear we every man our own language, wherein we were born?"},{"num":9,"verse":"Parthians, and Medes, and Elamites, and the inhabitants of Mesopotamia, and of Judea, and of Cappadocia, of Pontus, and Asia,"},{"num":10,"verse":"And of Phrygia, and Pamphylia, of Egypt, and of the parts of Libya, which is beside Cyrene, and strangers of Rome, and Jews, and Proselytes,"},{"num":11,"verse":"Cretes, and Arabians: we heard them speak in our own tongues the wonderful works of God."},{"num":12,"verse":"They were all then amazed, and doubted, saying one to another, What may this be?"},{"num":13,"verse":"And others mocked, and said, They are full of new wine."},{"num":14,"verse":"¶ But Peter standing with the eleven, lifted up his voice, and said unto them, Ye men of Judea, and ye all that inhabit Jerusalem, be this known unto you, and hearken unto my words."},{"num":15,"verse":"For these are not drunken, as ye suppose, since it is but the third hour of the day."},{"num":16,"verse":"But this is that, which was spoken by the Prophet Joel,"},{"num":17,"verse":"And it shall be in the last days, saith God, I will pour out of my Spirit upon all flesh, and your sons, and your daughters shall prophesy, and your young men shall see visions, and your old men shall dream dreams."},{"num":18,"verse":"And on my servants, and on mine handmaids I will pour out of my Spirit in those days, and they shall prophesy."},{"num":19,"verse":"And I will show wonders in heaven above, and tokens in the earth beneath, blood, and fire, and the vapors of smoke."},{"num":20,"verse":"The Sun shall be turned into darkness, and the moon into blood, before that great and notable day of the Lord come."},{"num":21,"verse":"And it shall be, that whosoever shall call on the Name of the Lord, shall be saved."},{"num":22,"verse":"Ye men of Israel, hear these words, JESUS of Nazareth, a man approved of God among you with great works, and wonders, and signs, which God did by him in the midst of you, as ye yourselves also know:"},{"num":23,"verse":"Him, I say, being delivered by the determinate counsel, and foreknowledge of God, after you had taken, with wicked hands you have crucified and slain."},{"num":24,"verse":"Whom God hath raised up, and loosed the sorrows of death, because it was impossible that he should be holden of it."},{"num":25,"verse":"For David saith concerning him, I beheld the Lord always before me: for he is at my right hand, that I should not be shaken."},{"num":26,"verse":"Therefore did mine heart rejoice, and my tongue was glad, and moreover also my flesh shall rest in hope,"},{"num":27,"verse":"Because thou wilt not leave my soul in grave, neither wilt suffer thine Holy one to see corruption."},{"num":28,"verse":"Thou hast showed me the ways of life, and shalt make me full of joy with thy countenance."},{"num":29,"verse":"Men and brethren, I may boldly speak unto you of the Patriarch David, that he is both dead and buried, and his sepulcher remaineth with us unto this day."},{"num":30,"verse":"Therefore, seeing he was a Prophet, and knew that God had sworn with an oath to him, that of the fruit of his loins he would raise up Christ concerning the flesh, to set him upon his throne."},{"num":31,"verse":"He knowing this before, spake of the resurrection of Christ, that his soul should not be left in grave, neither his flesh should see corruption."},{"num":32,"verse":"This Jesus hath God raised up, whereof we all are witnesses."},{"num":33,"verse":"Since then that he by the right hand of God hath been exalted, and hath received of his Father the promise of the holy Ghost, he hath shed forth this which ye now see and hear."},{"num":34,"verse":"For David is not ascended into heaven, but he saith, The Lord said to my Lord, Sit at my right hand,"},{"num":35,"verse":"Until I make thine enemies thy footstool."},{"num":36,"verse":"Therefore, let all the house of Israel know for a surety, that God hath made him both Lord, and Christ, this Jesus, I say, whom ye have crucified."},{"num":37,"verse":"Now when they heard it, they were pricked in their hearts, and said unto Peter and the other Apostles, Men and brethren, what shall we do?"},{"num":38,"verse":"Then Peter said unto them, Amend your lives, and be baptized every one of you in the Name of Jesus Christ for the remission of sins: and ye shall receive the gift of the holy Ghost."},{"num":39,"verse":"For the promise is made unto you, and to your children, and to all that are afar off, even as many as the Lord our God shall call."},{"num":40,"verse":"And with many other words he besought and exhorted them, saying, Save yourselves from this [froward] generation."},{"num":41,"verse":"Then they that gladly received his word, were baptized, and the same day there were added to the Church about three thousand souls."},{"num":42,"verse":"And they continued in the Apostles’ doctrine, and fellowship, and breaking of bread, and prayers."},{"num":43,"verse":"¶ And fear came upon every soul: and many wonders and signs were done by the Apostles."},{"num":44,"verse":"And all that believed, were in one place, and had all things common."},{"num":45,"verse":"And they sold their possessions, and goods, and parted them to all men, as everyone had need."},{"num":46,"verse":"And they continued daily with one accord in the Temple, and breaking bread at home, did eat their meat together with gladness and singleness of heart,"},{"num":47,"verse":"Praising God, and had favor with all the people: and the Lord added to the Church from day to day, such as should be saved."}]