[{"num":2,"verse":"Now when the day of Pentecost had come, they were all with one accord in one place. "},{"num":2,"verse":"Suddenly there came from the sky a sound like the rushing of a mighty wind, and it filled all the house where they were sitting. "},{"num":3,"verse":"Tongues like fire appeared and were distributed to them, and one sat on each of them. "},{"num":4,"verse":"They were all filled with the Holy Spirit, and began to speak with other languages, as the Spirit gave them the ability to speak. "},{"num":5,"verse":"Now there were dwelling in Jerusalem Jews, devout men, from every nation under the sky. "},{"num":6,"verse":"When this sound was heard, the multitude came together and were bewildered, because everyone heard them speaking in his own language. "},{"num":7,"verse":"They were all amazed and marveled, saying to one another, “Behold, aren’t all these who speak Galileans? "},{"num":8,"verse":"How do we hear, everyone in our own native language? "},{"num":9,"verse":"Parthians, Medes, Elamites, and people from Mesopotamia, Judea, Cappadocia, Pontus, Asia, "},{"num":10,"verse":"Phrygia, Pamphylia, Egypt, the parts of Libya around Cyrene, visitors from Rome, both Jews and proselytes, "},{"num":11,"verse":"Cretans and Arabians: we hear them speaking in our languages the mighty works of God!” "},{"num":12,"verse":"They were all amazed, and were perplexed, saying to one another, “What does this mean?” "},{"num":13,"verse":"Others, mocking, said, “They are filled with new wine.”"},{"num":14,"verse":"But Peter, standing up with the eleven, lifted up his voice and spoke out to them, “You men of Judea, and all you who dwell at Jerusalem, let this be known to you, and listen to my words. "},{"num":15,"verse":"For these aren’t drunken, as you suppose, seeing it is only the third hour of the day. "},{"num":16,"verse":"But this is what has been spoken through the prophet Joel:"},{"num":22,"verse":"“Men of Israel, hear these words! Jesus of Nazareth, a man approved by God to you by mighty works and wonders and signs which God did by him among you, even as you yourselves know, "},{"num":23,"verse":"him, being delivered up by the determined counsel and foreknowledge of God, you have taken by the hand of lawless men, crucified and killed; "},{"num":24,"verse":"whom God raised up, having freed him from the agony of death, because it was not possible that he should be held by it. "},{"num":25,"verse":"For David says concerning him,"},{"num":29,"verse":"“Brothers, I may tell you freely of the patriarch David, that he both died and was buried, and his tomb is with us to this day. "},{"num":30,"verse":"Therefore, being a prophet, and knowing that God had sworn with an oath to him that of the fruit of his body, according to the flesh, he would raise up the Christ to sit on his throne, "},{"num":31,"verse":"he foreseeing this spoke about the resurrection of the Christ, that his soul wasn’t left in Hades, and his flesh didn’t see decay. "},{"num":32,"verse":"This Jesus God raised up, to which we all are witnesses. "},{"num":33,"verse":"Being therefore exalted by the right hand of God, and having received from the Father the promise of the Holy Spirit, he has poured out this, which you now see and hear. "},{"num":34,"verse":"For David didn’t ascend into the heavens, but he says himself,"},{"num":36,"verse":"“Let all the house of Israel therefore know certainly that God has made him both Lord and Christ, this Jesus whom you crucified.”"},{"num":37,"verse":"Now when they heard this, they were cut to the heart, and said to Peter and the rest of the apostles, “Brothers, what shall we do?”"},{"num":38,"verse":"Peter said to them, “Repent, and be baptized, every one of you, in the name of Jesus Christ for the forgiveness of sins, and you will receive the gift of the Holy Spirit. "},{"num":39,"verse":"For the promise is to you, and to your children, and to all who are far off, even as many as the Lord our God will call to himself.” "},{"num":40,"verse":"With many other words he testified, and exhorted them, saying, “Save yourselves from this crooked generation!”"},{"num":41,"verse":"Then those who gladly received his word were baptized. There were added that day about three thousand souls. "},{"num":42,"verse":"They continued steadfastly in the apostles’ teaching and fellowship, in the breaking of bread, and prayer. "},{"num":43,"verse":"Fear came on every soul, and many wonders and signs were done through the apostles. "},{"num":44,"verse":"All who believed were together, and had all things in common. "},{"num":45,"verse":"They sold their possessions and goods, and distributed them to all, according as anyone had need. "},{"num":46,"verse":"Day by day, continuing steadfastly with one accord in the temple, and breaking bread at home, they took their food with gladness and singleness of heart, "},{"num":47,"verse":"praising God, and having favor with all the people. The Lord added to the assembly day by day those who were being saved."}]