[{"num":7,"verse":"This Malki-Tzedek, king of Shalem, a cohen of God Ha‘Elyon, met Avraham on his way back from the slaughter of the kings and blessed him; "},{"num":2,"verse":"also Avraham gave him a tenth of everything."},{"num":3,"verse":"There is no record of his father, mother, ancestry, birth or death; rather, like the Son of God, he continues as a cohen for all time."},{"num":4,"verse":"Just think how great he was! Even the Patriarch Avraham gave him a tenth of the choicest spoils. "},{"num":5,"verse":"Now the descendants of Levi who became cohanim have a commandment in the Torah to take a tenth of the income of the people, that is, from their own brothers, despite the fact that they too are descended from Avraham. "},{"num":6,"verse":"But Malki-Tzedek, even though he was not descended from Levi, took a tenth from Avraham."},{"num":7,"verse":"and it is beyond all dispute that the one who blesses has higher status than the one who receives the blessing."},{"num":8,"verse":"Moreover, in the case of the cohanim, the tenth is received by men who die; while in the case of Malki-Tzedek, it is received by someone who is testified to be still alive."},{"num":9,"verse":"One might go even further and say that Levi, who himself receives tenths, paid a tenth through Avraham; "},{"num":10,"verse":"inasmuch as he was still in his ancestor Avraham’s body when Malki-Tzedek met him."},{"num":11,"verse":"Therefore, if it had been possible to reach the goal through the system of cohanim derived from Levi (since in connection with it, the people were given the Torah), what need would there have been for another, different kind of cohen, the one spoken of as to be compared with Malki-Tzedek and not to be compared with Aharon? "},{"num":12,"verse":"For if the system of cohanim is transformed, there must of necessity occur a transformation of Torah. "},{"num":13,"verse":"The one about whom these things are said belongs to another tribe, from which no one has ever served at the altar; "},{"num":14,"verse":"for everyone knows that our Lord arose out of Y’hudah, and that Moshe said nothing about this tribe when he spoke about cohanim."},{"num":15,"verse":"It becomes even clearer if a “different kind of cohen,” one like Malki-Tzedek, arises, "},{"num":16,"verse":"one who became a cohen not by virtue of a rule in the Torah concerning physical descent, but by virtue of the power of an indestructible life. "},{"num":17,"verse":"For it is stated,"},{"num":18,"verse":"Thus, on the one hand, the earlier rule is set aside because of its weakness and inefficacy "},{"num":19,"verse":"(for the Torah did not bring anything to the goal); and, on the other hand, a hope of something better is introduced, through which we are drawing near to God."},{"num":20,"verse":"What is more, God swore an oath. For no oath was sworn in connection with those who become cohanim now; "},{"num":21,"verse":"but Yeshua became a cohen by the oath which God swore when he said to him,"},{"num":22,"verse":"Also this shows how much better is the covenant of which Yeshua has become guarantor."},{"num":23,"verse":"Moreover, the present cohanim are many in number, because they are prevented by death from continuing in office. "},{"num":24,"verse":"But because he lives forever, his position as cohen does not pass on to someone else; "},{"num":25,"verse":"and consequently, he is totally able to deliver those who approach God through him; since he is alive forever and thus forever able to intercede on their behalf."},{"num":26,"verse":"This is the kind of cohen gadol that meets our need — holy, without evil, without stain, set apart from sinners and raised higher than the heavens; "},{"num":27,"verse":"one who does not have the daily necessity, like the other cohanim g’dolim, of offering up sacrifices first for their own sins and only then for those of the people; because he offered one sacrifice, once and for all, by offering up himself. "},{"num":28,"verse":"For the Torah appoints as cohanim g’dolim men who have weakness; but the text which speaks about the swearing of the oath, a text written later than the Torah, appoints a Son who has been brought to the goal forever."}]