[{"header":"The Messiah is Superior to Melchizedek"},{"num":7,"verse":"Now this man Melchizedek, king of Salem and priest of the Most High God, met Abraham and blessed him when he was returning from defeating the kings. "},{"num":2,"verse":"Abraham gave Melchizedek a tenth of everything. In the first place, his name means “king of righteousness,” and then he is also king of Salem, that is, “king of peace.” "},{"num":3,"verse":"He has no father, mother, or genealogy, no birth date recorded for him, nor a date of death. Like the Son of God, he continues to be a priest forever."},{"num":4,"verse":"Just look at how great this man was! Even Abraham—the patriarch himself—gave him a tenth of what he had captured! "},{"num":5,"verse":"The descendants of Levi who accept the priesthood have a commandment in the Law to collect a tenth from the people, that is, from their own brothers, even though they are also descendants of Abraham. "},{"num":6,"verse":"But this man, whose descent is not traced from them, collected a tenth from Abraham and blessed the man who had received the promises. "},{"num":7,"verse":"It is beyond dispute that the less important person is blessed by the more important person. "},{"num":8,"verse":"Mortal men collect tithes, but we are informed by Scripture that Melchizedek keeps on living. "},{"num":9,"verse":"One might even say that Levi, who collects the tenth, paid the tenth through Abraham, "},{"num":10,"verse":"because Levi was still inside his ancestor when Melchizedek met him."},{"num":11,"verse":"Now if perfection could have been attained through the Levitical priesthood—for on this basis the people received the Law—what further need would there be to speak of appointing another kind of priest according to the order of Melchizedek, not one according to the order of Aaron? "},{"num":12,"verse":"When a change in the priesthood takes place, there must also be a change in the Law. "},{"num":13,"verse":"For the person we are talking about belonged to a different tribe, and no one from that tribe has ever served at the altar. "},{"num":14,"verse":"Furthermore, it is obvious that our Lord was a descendant of Judah, and Moses said nothing about priests coming from that tribe. "},{"num":15,"verse":"This point is even more obvious in that another priest who is like Melchizedek has appeared "},{"num":16,"verse":"who was appointed to be a priest, not on the basis of a genealogical registry, but rather on the power of an indestructible life. "},{"num":17,"verse":"For it is declared about him,"},{"num":18,"verse":"Indeed, because it was weak and ineffective, the former commandment has been annulled, "},{"num":19,"verse":"since the Law made nothing perfect, and a better hope is presented, by which we approach God."},{"num":20,"verse":"Now none of this happened without an oath. Others became priests without any oath, "},{"num":21,"verse":"but Jesus became a priest with an oath when God told him,"},{"num":22,"verse":"In this way, Jesus has become the guarantor of a better covenant."},{"num":23,"verse":"There have been many priests, since each one of them had to stop serving in office when he died. "},{"num":24,"verse":"But because Jesus lives forever, he has a permanent priesthood. "},{"num":25,"verse":"Therefore, because he always lives to intercede for them, he is able to save completely those who come to God through him."},{"num":26,"verse":"We need such a high priest—one who is holy, innocent, pure, set apart from sinners, exalted above the heavens. "},{"num":27,"verse":"He has no need to offer sacrifices every day like high priests do, first for his own sins and then for those of the people, since he did this once for all when he sacrificed himself. "},{"num":28,"verse":"For the Law appoints as high priests men who are weak, but the promised oath, which came after the Law, results in a Son who is eternally perfect."}]