[{"header":"Melchizedek the Priest"},{"num":7,"verse":"Melchizedek was the king of Salem. He was the priest of God Most High. He met Abraham, who was returning from winning a battle over some kings. Melchizedek blessed him. "},{"num":2,"verse":"Abraham gave him a tenth of everything. First, the name Melchizedek means “king of what is right.” Also, “king of Salem” means “king of peace.” "},{"num":3,"verse":"Melchizedek has no father or mother. He has no family line. His days have no beginning. His life has no end. He remains a priest forever. In this way, he is like the Son of God."},{"num":4,"verse":"Think how great Melchizedek was! Even our father Abraham gave him a tenth of what he had captured. "},{"num":5,"verse":"Now the law lays down a rule for the sons of Levi who become priests. They must collect a tenth from the people. They must collect it from the other Israelites. They must do this, even though all of them belong to the family line of Abraham. "},{"num":6,"verse":"Melchizedek did not trace his family line from Levi. But he collected a tenth from Abraham. Melchizedek blessed the one who had received the promises. "},{"num":7,"verse":"Without a doubt, the more important person blesses the less important one. "},{"num":8,"verse":"In the one case, the tenth is collected by people who die. But in the other case, it is collected by the one who is said to be living. "},{"num":9,"verse":"Levi collects the tenth. But we might say that Levi paid the tenth through Abraham. "},{"num":10,"verse":"That’s because when Melchizedek met Abraham, Levi was still in Abraham’s body."},{"header":"Jesus Is Like Melchizedek"},{"num":11,"verse":"The law that was given to the people called for the priestly system. That system began with Levi. Suppose the priestly system could have made people perfect. Then why was there still a need for another priest to come? And why did he need to be like Melchizedek? Why wasn’t he from Aaron’s family line? "},{"num":12,"verse":"A change of the priestly system requires a change of law. "},{"num":13,"verse":"We are talking about a priest who is from a different tribe. No one from that tribe has ever served at the altar. "},{"num":14,"verse":"It is clear that our Lord came from the family line of Judah. Moses said nothing about priests who were from the tribe of Judah. "},{"num":15,"verse":"But suppose another priest like Melchizedek appears. Then what we have said is even more clear. "},{"num":16,"verse":"He has not become a priest because of a rule about his family line. He has become a priest because of his powerful life. His life can never be destroyed. "},{"num":17,"verse":"Scripture says,"},{"num":18,"verse":"The old rule is set aside. It was weak and useless. "},{"num":19,"verse":"The law didn’t make anything perfect. Now a better hope has been given to us. That hope brings us near to God."},{"num":20,"verse":"The change of priestly system was made with a promise. Others became priests without any promise. "},{"num":21,"verse":"But Jesus became a priest with a promise. God said to him,"},{"num":22,"verse":"Because God gave his word, Jesus makes certain the promise of a better covenant."},{"num":23,"verse":"There were many priests in Levi’s family line. Death kept them from continuing in office. "},{"num":24,"verse":"But Jesus lives forever. So he always holds the office of priest. "},{"num":25,"verse":"People now come to God through him. And he is able to save them completely and for all time. Jesus lives forever. He prays for them."},{"num":26,"verse":"A high priest like that really meets our need. He is holy, pure and without blame. He isn’t like other people. He does not sin. He is lifted high above the heavens. "},{"num":27,"verse":"He isn’t like the other high priests. They need to offer sacrifices day after day. First they bring offerings for their own sins. Then they do it for the sins of the people. But Jesus gave one sacrifice for the sins of the people. He gave it once and for all time. He did it by offering himself. "},{"num":28,"verse":"The law appoints as high priests men who are weak. But God’s promise came after the law. By his promise the Son was appointed. The Son has been made perfect forever."}]