[{"num":7,"verse":"For this Melchizedek - King of Salem, priest of the Most High God, who met Abraham as he returned from the slaughter of the kings and blessed him,"},{"num":2,"verse":"and to whom Abraham also gave a tithe of all things - is by first interpretation “King of Righteousness”, and after that “King of Salem” (that is, “King of Peace”);"},{"num":3,"verse":"without father or mother or family, having neither beginning of days nor end of life. But he is likened to the Son of God and continues as a priest forever."},{"num":4,"verse":"Now consider how great this man was to whom even the patriarch Abraham gave a tithe of the spoils."},{"num":5,"verse":"For indeed those who are the children of Levi (who receive the office of the priesthood) have a commandment to take tithes from the people according to the Law (that is, from their brothers), though they came out of the loins of Abraham."},{"num":6,"verse":"But the one whose family is not counted among them received tithes from Abraham, and blessed him who had the promises."},{"num":7,"verse":"And without any dispute, the less is blessed by the greater."},{"num":8,"verse":"And here, men who die receive tithes. But there, he who lives (about whom it is witnessed)."},{"num":9,"verse":"And truth be told, Levi (who receives tithes) also paid tithes to Abraham."},{"num":10,"verse":"For he was still in the loins of his father when Melchizedek met him."},{"num":11,"verse":"Therefore, if perfection had been by the priesthood of the Levites (for under it the people received the Law) what further need was there for another priest to rise after the order of Melchizedek, and not to be called after the order of Aaron?"},{"num":12,"verse":"For if the priesthood is changed, then the Law must be changed."},{"num":13,"verse":"For He of Whom these things are spoken belongs to another tribe, from which no man served at the altar."},{"num":14,"verse":"For it is evident that our Lord sprung out of Judah, about which tribe Moses spoke nothing regarding the priesthood."},{"num":15,"verse":"And it is even more evident because there has risen up another priest in the likeness of Melchizedek,"},{"num":16,"verse":"who is made priest not after the Law of carnal commandment, but after the power of an endless life."},{"num":17,"verse":"For He testifies, “You are a priest forever, after the order of Melchizedek.”"},{"num":18,"verse":"For indeed the preceding commandment is annulled because of its weakness and uselessness."},{"num":19,"verse":"For the Law made nothing perfect, but rather the introduction of a better hope (by which we draw near to God)."},{"num":20,"verse":"And inasmuch as it is not without an oath (for these priests are made without an oath,"},{"num":21,"verse":"but this One was made with an oath by Him Who said to Him, “The Lord has sworn, and will not repent. You are a priest forever, after the order of Melchizedek.”)"},{"num":22,"verse":"By so much has Jesus made a surety of a better Testament."},{"num":23,"verse":"And among them many were made priests, because they were not allowed to endure by the reason of death."},{"num":24,"verse":"But this Man, because He endures forever, has an unchangeable priesthood."},{"num":25,"verse":"Therefore, He is also able to perfectly save those who come to God through Him (seeing He forever lives to make intercession for them)."},{"num":26,"verse":"For it was fitting for us to have such a High Priest: holy, harmless, undefiled, separate from sinners, and made higher than the heavens;"},{"num":27,"verse":"Who does not need to offer up daily sacrifices (first for His own sins, and then for the people’s) as those High Priests. For He did that once and for all when He offered up Himself."},{"num":28,"verse":"For the Law makes men (who have weakness) High Priests. But the word of the oath (which came after the Law) makes the Son, Who is consecrated for evermore."}]