[{"num":7,"verse":"Melchizedek was king of the city of Salem. He was a priest of God who is the greatest of all. Melchizedek met Abraham when Abraham came back from killing some bad kings. And Melchizedek blessed him."},{"num":2,"verse":"Abraham divided all that he took away from the kings into ten parts. He gave Melchizedek one part. First, the name Melchizedek means the king who is true and right with God. Then he was king of Salem. That means king of peace."},{"num":3,"verse":"He has no father or mother. The names of the family from which he comes are not written down. It is not written down that he was born or that he died. But, like the Son of God, he stays on being a priest for ever."},{"num":4,"verse":"Just think how great he was! Even Abraham, the father of our people, gave him a tenth, one part out of ten, of all he brought back."},{"num":5,"verse":"The sons of Levi, who are priests, have the right by law to take a tenth of what the people have. These people are their own brothers. They also are Abraham's children."},{"num":6,"verse":"But Melchizedek was not from Levi's family. Yet he took a tenth of what Abraham had. And he blessed Abraham, to whom God made the promise."},{"num":7,"verse":"Everyone knows this is true. The person who is blessed is not so great as the person who blesses him."},{"num":8,"verse":"Here, priests take their tenth, but they are people who will die one day. But Melchizedek, who took his tenth, never dies. The holy writings say it is so."},{"num":9,"verse":"And we say that Levi, the priest who takes the tenth from the people, gave his tenth through Abraham."},{"num":10,"verse":"He was not yet born when Melchizedek met Abraham."},{"num":11,"verse":"It was while the sons of Levi were priests that the law was made for the people. If those priests were good enough, why would another priest need to come who was like Melchizedek? Why would he not be like Aaron?"},{"num":12,"verse":"If the kind of priest is changed, then the law must be changed also."},{"num":13,"verse":"The one we are talking about belonged to another tribe. No man from his tribe ever made sacrifices in God's house."},{"num":14,"verse":"Everyone knows that our Lord Jesus came from the tribe of Judah. And Moses never said anything about priests coming from that tribe."},{"num":15,"verse":"You can understand it even better when another priest comes who is like Melchizedek."},{"num":16,"verse":"He was not made a priest by law. The law said that the priest must come from a certain tribe. But he was made a priest because he has power to live for ever."},{"num":17,"verse":"This is what the holy writings say about him, `You are a priest for ever, like Melchizedek.'"},{"num":18,"verse":"The old law given to Moses by God was put away. It was weak and no good."},{"num":19,"verse":"The law did not make anything right. But something better has been brought to us. It is God's promise. And by that promise we come near to God."},{"num":20,"verse":"Also Christ was not made a priest without God's strong promise. The others were made priests without God's strong promise."},{"num":21,"verse":"But this man was made priest by God's strong promise. God said to him, `The Lord has made a strong promise, and he will not change it. \"You are a priest for ever.\" '"},{"num":22,"verse":"Also because of this, Jesus makes a better agreement with God for people."},{"num":23,"verse":"The other priests were many, because they died and could not go on with their work."},{"num":24,"verse":"But because Jesus lives forever, he is a priest for ever and no one takes his place."},{"num":25,"verse":"Because of that, he is able to save people for ever, if they come to God by him. He lives for ever to talk to God for them."},{"num":26,"verse":"We needed such a high priest as he is. He is holy. He is good. He has never done any wrong. He has been taken away from among bad people, and taken up higher than the sky."},{"num":27,"verse":"He does not need to make sacrifices every day. The other high priests make sacrifices every day, first for the wrong things they have done, and then for the people. He did it once when he offered himself as the sacrifice."},{"num":28,"verse":"The law makes men high priests, and they are weak. But the word of God's promise came after the law. It makes his Son high priest for ever, and he is all right."}]