[{"header":"Controversy over authority"},{"num":20,"verse":"On one of the days when Jesus was teaching the people in the temple and proclaiming the good news, the chief priests, legal experts, and elders approached him."},{"num":2,"verse":"They said, “Tell us: What kind of authority do you have for doing these things? Who gave you this authority?”"},{"num":3,"verse":"He replied, “I have a question for you. Tell me:"},{"num":4,"verse":" Was John’s baptism of heavenly or of human origin?”"},{"num":5,"verse":"They discussed among themselves, “If we say, ‘It’s of heavenly origin,’ he’ll say, ‘Why didn’t you believe him?’"},{"num":6,"verse":"But if we say, ‘It’s of human origin,’ all the people will stone us to death because they are convinced that John was a prophet.”"},{"num":7,"verse":"They answered that they didn’t know where it came from."},{"num":8,"verse":"Then Jesus replied, “Neither will I tell you what kind of authority I have to do these things.”"},{"header":"Parable of the tenant farmers"},{"num":9,"verse":"Jesus told the people this parable: “A certain man planted a vineyard, rented it to tenant farmers, and went on a trip for a long time."},{"num":10,"verse":"When it was time, he sent a servant to collect from the tenants his share of the fruit of the vineyard. But the tenants sent him away, beaten and empty-handed."},{"num":11,"verse":"The man sent another servant. But they beat him, treated him disgracefully, and sent him away empty-handed as well."},{"num":12,"verse":"He sent a third servant. They wounded this servant and threw him out."},{"num":13,"verse":"The owner of the vineyard said, ‘What should I do? I’ll send my son, whom I love dearly. Perhaps they will respect him.’"},{"num":14,"verse":"But when they saw him, they said to each other, ‘This is the heir. Let’s kill him so the inheritance will be ours.’"},{"num":15,"verse":"They threw him out of the vineyard and killed him. What will the owner of the vineyard do to them?"},{"num":16,"verse":"He will come and destroy those tenants and give the vineyard to others.”"},{"num":17,"verse":"Staring at them, Jesus said, “Then what is the meaning of this text of scripture: The stone that the builders rejected has become the cornerstone?"},{"num":18,"verse":"Everyone who falls on that stone will be crushed. And the stone will crush the person it falls on.”"},{"num":19,"verse":"The legal experts and chief priests wanted to arrest him right then because they knew he had told this parable against them. But they feared the people."},{"header":"An attempt to trap Jesus"},{"num":20,"verse":"The legal experts and chief priests were watching Jesus closely and sent spies who pretended to be sincere. They wanted to trap him in his words so they could hand him over to the jurisdiction and authority of the governor."},{"num":21,"verse":"They asked him, “Teacher, we know that you are correct in what you say and teach. You don’t show favoritism but teach God’s way as it really is."},{"num":22,"verse":"Does the Law allow people to pay taxes to Caesar or not?”"},{"num":23,"verse":"Since Jesus recognized their deception, he said to them,"},{"num":24,"verse":"“Show me a coin. Whose image and inscription does it have on it?”"},{"num":25,"verse":"He said to them, “Give to Caesar what belongs to Caesar and to God what belongs to God.”"},{"num":26,"verse":"They couldn’t trap him in his words in front of the people. Astonished by his answer, they were speechless."},{"header":"Question about the resurrection"},{"num":27,"verse":"Some Sadducees, who deny that there’s a resurrection, came to Jesus and asked,"},{"num":28,"verse":"“Teacher, Moses wrote for us that if a man’s brother dies leaving a widow but no children, the brother must marry the widow and raise up children for his brother."},{"num":29,"verse":"Now there were seven brothers. The first man married a woman and then died childless."},{"num":30,"verse":"The second"},{"num":31,"verse":"and then the third brother married her. Eventually all seven married her, and they all died without leaving any children."},{"num":32,"verse":"Finally, the woman died too."},{"num":33,"verse":"In the resurrection, whose wife will she be? All seven were married to her.”"},{"num":34,"verse":"Jesus said to them, “People who belong to this age marry and are given in marriage."},{"num":35,"verse":"But those who are considered worthy to participate in that age, that is, in the age of the resurrection from the dead, won’t marry nor will they be given in marriage."},{"num":36,"verse":"They can no longer die, because they are like angels and are God’s children since they share in the resurrection."},{"num":37,"verse":"Even Moses demonstrated that the dead are raised—in the passage about the burning bush, when he speaks of the Lord as the God of Abraham, the God of Isaac, and the God of Jacob."},{"num":38,"verse":"He isn’t the God of the dead but of the living. To him they are all alive.”"},{"num":39,"verse":"Some of the legal experts responded, “Teacher, you have answered well.”"},{"num":40,"verse":"No one dared to ask him anything else."},{"num":41,"verse":"Jesus said to them, “Why do they say that the Christ is David’s son?"},{"num":42,"verse":"David himself says in the scroll of Psalms, The Lord said to my lord, ‘Sit at my right side"},{"num":43,"verse":"until I make your enemies a footstool for your feet.’"},{"num":44,"verse":"Since David calls him ‘Lord,’ how can he be David’s son?”"},{"header":"Jesus condemns the legal experts"},{"num":45,"verse":"In the presence of all the people, Jesus said to his disciples,"},{"num":46,"verse":"“Watch out for the legal experts. They like to walk around in long robes. They love being greeted with honor in the markets. They long for the places of honor in the synagogues and at banquets."},{"num":47,"verse":"They are the ones who cheat widows out of their homes, and to show off they say long prayers. They will be judged most harshly.”"}]