[{"num":20,"verse":"And it came to pass, that on one of the days, as he was teaching the people in the temple, and preaching the gospel, the chief priests and the scribes, with the ancients, met together,"},{"num":2,"verse":"And spoke to him, saying: Tell us, by what authority dost thou these things? or, Who is he that hath given thee this authority?"},{"num":3,"verse":"And Jesus answering, said to them: I will also ask you one thing. Answer me:"},{"num":4,"verse":"The baptism of John, was it from heaven, or of men?"},{"num":5,"verse":"But they thought within themselves, saying: If we shall say, From heaven: he will say: Why then did you not believe him?"},{"num":6,"verse":"But if we say, Of men, the whole people will stone us: for they are persuaded that John was a prophet."},{"num":7,"verse":"And they answered, that they knew not whence it was."},{"num":8,"verse":"And Jesus said to them: Neither do I tell thee by what authority I do these things."},{"num":9,"verse":"And he began to speak to the people this parable: A certain man planted a vineyard, and let it out to husbandmen: and he was abroad for a long time."},{"num":10,"verse":"And at the season he sent a servant to the husbandmen, that they should give him of the fruit of the vineyard. Who, beating him, sent him away empty."},{"num":11,"verse":"And again he sent another servant. But they beat him also, and treating him reproachfully, sent him away empty."},{"num":12,"verse":"And again he sent the third: and they wounded him also, and cast him out."},{"num":13,"verse":"Then the lord of the vineyard said: What shall I do? I will send my beloved son: it may be, when they see him, they will reverence him."},{"num":14,"verse":"Whom when the husbandmen saw, they thought within themselves, saying: This is the heir, let us kill him, that the inheritance may be ours."},{"num":15,"verse":"So casting him out of the vineyard, they killed him. What therefore will the lord of the vineyard do to them?"},{"num":16,"verse":"He will come, and will destroy these husbandmen, and will give the vineyard to others. Which they hearing, said to him: God forbid."},{"num":17,"verse":"But he looking on them, said: What is this then that is written, The stone, which the builders rejected, the same is become the head of the corner?"},{"num":18,"verse":"Whosoever shall fall upon that stone, shall be bruised: and upon whomsoever it shall fall, it will grind him to powder."},{"num":19,"verse":"And the chief priests and the scribes sought to lay hands on him the same hour: but they feared the people, for they knew that he spoke this parable to them."},{"num":20,"verse":"And being upon the watch, they sent spies, who should feign themselves just, that they might take hold of him in his words, that they might deliver him up to the authority and power of the governor."},{"num":21,"verse":"And they asked him, saying: Master, we know that thou speakest and teachest rightly: and thou dost not respect any person, but teachest the way of God in truth."},{"num":22,"verse":"Is it lawful for us to give tribute to Caesar, or no?"},{"num":23,"verse":"But he considering their guile, said to them: Why tempt you me?"},{"num":24,"verse":"shew me a penny. Whose image and inscription hath it? They answering, said to him, Caesar's."},{"num":25,"verse":"And he said to them: Render therefore to Caesar the things that are Caesar's: and to God the things that are God's."},{"num":26,"verse":"And they could not reprehend his word before the people: and wondering at his answer, they held their peace."},{"num":27,"verse":"And there came to him some of the Sadducees, who deny that there is any resurrection, and they asked him,"},{"num":28,"verse":"Saying: Master, Moses wrote unto us, If any man's brother die, having a wife, and he leave no children, that his brother should take her to wife, and raise up seed unto his brother."},{"num":29,"verse":"There were therefore seven brethren: and the first took a wife, and died without children."},{"num":30,"verse":"And the next took her to wife, and he also died childless."},{"num":31,"verse":"And the third took her. And in like manner all the seven, and they left no children, and died."},{"num":32,"verse":"Last of all the woman died also."},{"num":33,"verse":"In the resurrection therefore, whose wife of them shall she be? For all the seven had her to wife."},{"num":34,"verse":"And Jesus said to them: The children of this world marry, and are given in marriage:"},{"num":35,"verse":"But they that shall be accounted worthy of that world, and of the resurrection from the dead, shall neither be married, nor take wives."},{"num":36,"verse":"Neither can they die any more: for they are equal to the angels, and are the children of God, being the children of the resurrection."},{"num":37,"verse":"Now that the dead rise again, Moses also shewed, at the bush, when he called the Lord, The God of Abraham, and the God of Isaac, and the God of Jacob;"},{"num":38,"verse":"For he is not the God of the dead, but of the living: for all live to him."},{"num":39,"verse":"And some of the scribes answering, said to him: Master, thou hast said well."},{"num":40,"verse":"And after that they durst not ask him any more questions."},{"num":41,"verse":"But he said to them: How say they that Christ is the son of David?"},{"num":42,"verse":"And David himself saith in the book of Psalms: The Lord said to my Lord, sit thou on my right hand,"},{"num":43,"verse":"Till I make thy enemies thy footstool."},{"num":44,"verse":"David then calleth him Lord: and how is he his son?"},{"num":45,"verse":"And in the hearing of all the people, he said to his disciples:"},{"num":46,"verse":"Beware of the scribes, who desire to walk in long robes, and love salutations in the marketplace, and the first chairs in the synagogues, and the chief rooms at feasts:"},{"num":47,"verse":"Who devour the houses of widows, feigning long prayer. These shall receive greater damnation."}]