[{"header":"Jesus’ Authority Questioned"},{"num":20,"verse":"On one of the days while He was teaching the people in the temple and preaching the gospel, the chief priests and the scribes with the elders confronted Him,"},{"num":2,"verse":"and they spoke, saying to Him, “Tell us by what authority You are doing these things, or who is the one who gave You this authority?”"},{"num":3,"verse":"Jesus answered and said to them, “I will also ask you a question, and you tell Me:"},{"num":5,"verse":"They reasoned among themselves, saying, “If we say, ‘From heaven,’ He will say, ‘Why did you not believe him?’"},{"num":6,"verse":"But if we say, ‘From men,’ all the people will stone us to death, for they are convinced that John was a prophet.”"},{"num":7,"verse":"So they answered that they did not know where it came from."},{"num":8,"verse":"And Jesus said to them, “Nor will I tell you by what authority I do these things.”"},{"header":"Parable of the Vine-growers"},{"num":9,"verse":"And He began to tell the people this parable: “A man planted a vineyard and rented it out to vine-growers, and went on a journey for a long time."},{"num":17,"verse":"But Jesus looked at them and said, “What then is this that is written:"},{"header":"Tribute to Caesar"},{"num":19,"verse":"The scribes and the chief priests tried to lay hands on Him that very hour, and they feared the people; for they understood that He spoke this parable against them."},{"num":20,"verse":"So they watched Him, and sent spies who pretended to be righteous, in order that they might catch Him in some statement, so that they could deliver Him to the rule and the authority of the governor."},{"num":21,"verse":"They questioned Him, saying, “Teacher, we know that You speak and teach correctly, and You are not partial to any, but teach the way of God in truth."},{"num":22,"verse":"Is it lawful for us to pay taxes to Caesar, or not?”"},{"num":23,"verse":"But He detected their trickery and said to them,"},{"num":25,"verse":"And He said to them, “Then render to Caesar the things that are Caesar’s, and to God the things that are God’s.”"},{"num":26,"verse":"And they were unable to catch Him in a saying in the presence of the people; and being amazed at His answer, they became silent."},{"header":"Is There a Resurrection?"},{"num":27,"verse":"Now there came to Him some of the Sadducees (who say that there is no resurrection),"},{"num":28,"verse":"and they questioned Him, saying, “Teacher, Moses wrote for us that if a man’s brother dies, having a wife, and he is childless, his brother should marry the wife and raise up children to his brother."},{"num":29,"verse":"Now there were seven brothers; and the first took a wife and died childless;"},{"num":30,"verse":"and the second"},{"num":31,"verse":"and the third married her; and in the same way all seven died, leaving no children."},{"num":32,"verse":"Finally the woman died also."},{"num":33,"verse":"In the resurrection therefore, which one’s wife will she be? For all seven had married her.”"},{"num":34,"verse":"Jesus said to them, “The sons of this age marry and are given in marriage,"},{"num":39,"verse":"Some of the scribes answered and said, “Teacher, You have spoken well.”"},{"num":40,"verse":"For they did not have courage to question Him any longer about anything."},{"num":41,"verse":"Then He said to them, “How is it that they say the Christ is David’s son?"},{"num":45,"verse":"And while all the people were listening, He said to the disciples,"}]