[{"header":"The Authority of Jesus Questioned(A)"},{"num":20,"verse":"One day as Jesus was teaching the people in the temple courts and proclaiming the good news, the chief priests and the teachers of the law, together with the elders, came up to him."},{"num":2,"verse":"“Tell us by what authority you are doing these things,” they said. “Who gave you this authority?”"},{"num":3,"verse":"He replied, “I will also ask you a question. Tell me:"},{"num":5,"verse":"They discussed it among themselves and said, “If we say, ‘From heaven,’ he will ask, ‘Why didn’t you believe him?’"},{"num":6,"verse":"But if we say, ‘Of human origin,’ all the people will stone us, because they are persuaded that John was a prophet.”"},{"num":7,"verse":"So they answered, “We don’t know where it was from.”"},{"num":8,"verse":"Jesus said, “Neither will I tell you by what authority I am doing these things.”"},{"header":"The Parable of the Tenants(H)"},{"num":9,"verse":"He went on to tell the people this parable: “A man planted a vineyard, rented it to some farmers and went away for a long time."},{"num":17,"verse":"Jesus looked directly at them and asked, “Then what is the meaning of that which is written:"},{"num":19,"verse":"The teachers of the law and the chief priests looked for a way to arrest him immediately, because they knew he had spoken this parable against them. But they were afraid of the people."},{"header":"Paying Taxes to Caesar(Q)"},{"num":20,"verse":"Keeping a close watch on him, they sent spies, who pretended to be sincere. They hoped to catch Jesus in something he said, so that they might hand him over to the power and authority of the governor."},{"num":21,"verse":"So the spies questioned him: “Teacher, we know that you speak and teach what is right, and that you do not show partiality but teach the way of God in accordance with the truth."},{"num":22,"verse":"Is it right for us to pay taxes to Caesar or not?”"},{"num":23,"verse":"He saw through their duplicity and said to them,"},{"num":25,"verse":"He said to them, “Then give back to Caesar what is Caesar’s, and to God what is God’s.”"},{"num":26,"verse":"They were unable to trap him in what he had said there in public. And astonished by his answer, they became silent."},{"header":"The Resurrection and Marriage(V)"},{"num":27,"verse":"Some of the Sadducees, who say there is no resurrection, came to Jesus with a question."},{"num":28,"verse":"“Teacher,” they said, “Moses wrote for us that if a man’s brother dies and leaves a wife but no children, the man must marry the widow and raise up offspring for his brother."},{"num":29,"verse":"Now there were seven brothers. The first one married a woman and died childless."},{"num":30,"verse":"The second"},{"num":31,"verse":"and then the third married her, and in the same way the seven died, leaving no children."},{"num":32,"verse":"Finally, the woman died too."},{"num":33,"verse":"Now then, at the resurrection whose wife will she be, since the seven were married to her?”"},{"num":34,"verse":"Jesus replied, “The people of this age marry and are given in marriage."},{"num":39,"verse":"Some of the teachers of the law responded, “Well said, teacher!”"},{"num":40,"verse":"And no one dared to ask him any more questions."},{"header":"Whose Son Is the Messiah?(AD)"},{"num":41,"verse":"Then Jesus said to them, “Why is it said that the Messiah is the son of David?"},{"header":"Warning Against the Teachers of the Law"},{"num":45,"verse":"While all the people were listening, Jesus said to his disciples,"}]