[{"header":"They Ask Jesus Who Gave Him the Power to Do These Things (A)"},{"num":20,"verse":"As He was teaching and preaching the Good News, the religious leaders and the teachers of the Law and the elders came. "},{"num":2,"verse":"They said to Him, “Tell us, by what right and power are You doing these things? Who gave You the right and the power?” "},{"num":3,"verse":"Jesus said to them, “I will ask you one question also. You answer Me. "},{"num":5,"verse":"They said to themselves, “If we say, ‘From heaven,’ He will say, ‘Then why did you not believe him?’ "},{"num":6,"verse":"But if we say, ‘From men,’ then all the people will throw stones at us because they believe John was one who spoke for God.” "},{"num":7,"verse":"They said that they did not know where John’s baptism came from. "},{"num":8,"verse":"Jesus said to them, “And I will not tell you where I get the right and the power to do these things.”"},{"header":"The Picture-Story of the Grape-Field (B)"},{"num":9,"verse":"Jesus began to tell the people a picture-story, saying, “There was a man who planted a grape-field. He rented it to farmers. Then he went to a country far away for a long time. "},{"num":17,"verse":"Jesus looked at them and said, “What does this writing mean, ‘The Stone that was put aside by the workmen has become the most important Stone in the building’?  "},{"header":"They Try to Trap Jesus (E)"},{"num":19,"verse":"At this time the religious leaders and the teachers of the Law tried to take Jesus, but they were afraid of the people. These leaders knew Jesus had told this picture-story against them. "},{"num":20,"verse":"They watched Jesus and they sent men who pretended to be good people to watch Him. They wanted to trap Him in something He said. Then they could give Him over to the leader of the people who had the right and the power to say what to do with Him."},{"num":21,"verse":"These men who were sent asked Jesus, “Teacher, we know what You say and teach is right. We know You do not show more respect to one person than to another. We know You teach the truth about God. "},{"num":22,"verse":"Is it right for us to pay taxes to Caesar or not?” "},{"num":23,"verse":"Jesus knew they were trying to trap Him. He said, "},{"num":25,"verse":"Jesus said to them, “Pay to Caesar the things that belong to Caesar. Pay to God the things that belong to God.” "},{"num":26,"verse":"They could find nothing wrong with what He taught. They were surprised and wondered about what He told the people, so they said nothing more."},{"header":"They Ask about Being Raised from the Dead (F)"},{"num":27,"verse":"Some people from the religious group who believe no one will be raised from the dead came to Jesus. They asked Him, "},{"num":28,"verse":"“Teacher, Moses wrote to us in the Law, ‘If a man’s brother dies and leaves a wife but no children, then his brother must marry her. He should have children for his brother who died.’  "},{"num":29,"verse":"There were seven brothers. The first had a wife but died without children. "},{"num":30,"verse":"The second brother took her for his wife. He died without children. "},{"num":31,"verse":"The third brother took her for his wife. In the same way all seven took her for a wife. They all died without children. "},{"num":32,"verse":"Then the woman died also. "},{"num":33,"verse":"When people are raised from the dead, whose wife will she be? All seven brothers had her for a wife.”"},{"num":34,"verse":"Jesus said to them, “People of this earth marry and are given in marriage. "},{"num":39,"verse":"One of the teachers of the Law said, “Teacher, You have spoken well.” "},{"num":40,"verse":"After that they were afraid to ask Him anything."},{"header":"Jesus Asks the Teachers of the Law about the Christ (H)"},{"num":41,"verse":"Jesus said to them, “How do they say that Christ is the Son of David? "},{"header":"False Teachers (J)"},{"num":45,"verse":"All the people were listening. He said to His followers, "}]