[{"header":"Laws for Living"},{"num":21,"verse":"Then God said to Moses, “These are the laws for living that you will give to the Israelites:"},{"num":2,"verse":"“If you buy a Hebrew slave, he will serve you for six years. In the seventh year you are to set him free, and he will have to pay nothing. "},{"num":3,"verse":"If he is not married when he becomes your slave, he must leave without a wife. But if he is married when he becomes your slave, he may take his wife with him. "},{"num":4,"verse":"If the slave’s master gives him a wife, and she gives birth to sons or daughters, the woman and her children will belong to the master. When the slave is set free, only he may leave."},{"num":5,"verse":"“But if the slave says, ‘I love my master, my wife and my children, and I don’t want to go free,’ "},{"num":6,"verse":"then the slave’s master must take him to God. The master is to take him to a door or doorframe and punch a hole through the slave’s ear using a sharp tool. Then the slave will serve that master all his life."},{"num":7,"verse":"“If a man sells his daughter as a slave, the rules for setting her free are different from the rules for setting the male slaves free. "},{"num":8,"verse":"If the master wanted to marry her but then decided he was not pleased with her, he must let one of her close relatives buy her back. He has no right to sell her to foreigners, because he has treated her unfairly. "},{"num":9,"verse":"If the man who bought her promises to let the woman marry his son, he must treat her as a daughter. "},{"num":10,"verse":"If the man who bought her marries another woman, he must not keep his first wife from having food or clothing or sexual relations. "},{"num":11,"verse":"If he does not give her these three things, she may go free, and she owes him no money."},{"header":"Laws About Injuries"},{"num":12,"verse":"“Anyone who hits a person and kills him must be put to death. "},{"num":13,"verse":"But if a person kills someone accidentally, God allowed that to happen, so the person must go to a place I will choose. "},{"num":14,"verse":"But if someone plans and murders another person on purpose, put him to death, even if he has run to my altar for safety."},{"num":15,"verse":"“Anyone who hits his father or his mother must be put to death."},{"num":16,"verse":"“Anyone who kidnaps someone and either sells him as a slave or still has him when he is caught must be put to death."},{"num":17,"verse":"“Anyone who says cruel things to his father or mother must be put to death."},{"num":18,"verse":"“If two men argue, and one hits the other with a rock or with his fist, the one who is hurt but not killed might have to stay in bed. "},{"num":19,"verse":"Later if he is able to get up and walk around outside with his walking stick, the one who hit him is not to be punished. But he must pay the injured man for the loss of his time, and he must support the injured man until he is completely healed."},{"num":20,"verse":"“If a man beats his male or female slave with a stick, and the slave dies on the spot, the owner must be punished. "},{"num":21,"verse":"But if the slave gets well after a day or two, the owner will not be punished since the slave belongs to him."},{"num":22,"verse":"“Suppose two men are fighting and hit a pregnant woman, causing the baby to come out. If there is no further injury, the man who caused the accident must pay money—whatever amount the woman’s husband says and the court allows. "},{"num":23,"verse":"But if there is further injury, then the punishment that must be paid is life for life, "},{"num":24,"verse":"eye for eye, tooth for tooth, hand for hand, foot for foot, "},{"num":25,"verse":"burn for burn, wound for wound, and bruise for bruise."},{"num":26,"verse":"“If a man hits his male or female slave in the eye, and the eye is blinded, the man is to free the slave to pay for the eye. "},{"num":27,"verse":"If a master knocks out a tooth of his male or female slave, the man is to free the slave to pay for the tooth."},{"num":28,"verse":"“If a man’s bull kills a man or woman, you must kill that bull by throwing stones at it, and you should not eat the bull. But the owner of the bull is not guilty. "},{"num":29,"verse":"However, suppose the bull has hurt people in the past and the owner, though warned, did not keep it in a pen. Then if it kills a man or woman, the bull must be stoned to death, and the owner must also be put to death. "},{"num":30,"verse":"But if the family of the dead person accepts money, the one who owned the bull may buy back his life, but he must pay whatever is demanded. "},{"num":31,"verse":"Use this same law if the bull kills a person’s son or daughter. "},{"num":32,"verse":"If the bull kills a male or female slave, the owner must pay the master the price for a new slave, or twelve ounces of silver, and the bull must also be stoned to death."},{"num":33,"verse":"“If a man takes the cover off a pit, or digs a pit and does not cover it, and another man’s ox or donkey comes and falls into it, "},{"num":34,"verse":"the owner of the pit must pay the owner of the animal for the loss. The dead animal will belong to the one who pays."},{"num":35,"verse":"“If a man’s bull kills another man’s bull, they must sell the bull that is alive. Both men will get half of the money and half of the bull that was killed. "},{"num":36,"verse":"But if a person’s bull has hurt other animals in the past and the owner did not keep it in a pen, that owner must pay bull for bull, and the dead animal is his."}]