[[],[{"type":"header","content":"Dirge for Tyre"},{"type":"prose","content":"The word of the  came to me again, saying, "}],[{"type":"prose","content":"“Now you, son of man, take up a dirge (funeral poem to be sung) for Tyre, "}],[{"type":"prose","content":"and say to Tyre, who lives at the entrance to the sea, merchant of the peoples to many coastlands, ‘Thus says the Lord ,"}],[{"type":"prose","content":"“Persia and Lud and Put (Libya) were in your army as your men of war. They hung the shield and the helmet on you; they gave you splendor. "}],[{"type":"prose","content":"The men of Arvad with your army were upon your walls, all around, and the Gammadim (men of valor) were in your towers. They hung their shields on your walls, all around; they perfected your beauty."}],[{"type":"prose","content":"“Tarshish [in Spain] was your customer  traded with you because of the abundance of your riches of all kinds; with silver, iron, tin, and lead they paid for your wares. "}],[{"type":"prose","content":"Javan (Greece), Tubal and Meshech (Asia Minor) traded with you; with the lives of men [taken as slaves] and vessels of bronze they paid for your merchandise. "}],[{"type":"prose","content":"Those from Beth-togarmah (Armenia) traded for your wares with [chariot] horses, war horses, and mules. "}],[{"type":"prose","content":"The men of Dedan were your traders. Many coastlands were your markets; ivory tusks and ebony they brought to you in payment  as gifts. "}],[{"type":"prose","content":"Aram traded with you because of the abundance of the goods you made. They paid for your merchandise with emeralds, purple, embroidered work, fine linen, coral, and rubies. "}],[{"type":"prose","content":"Judah and the land of Israel, they were your traders; with the wheat of Minnith [in Ammon], cakes, honey, oil, and balm they paid for your goods. "}],[{"type":"prose","content":"Damascus traded with you because of the abundance of your handiworks and the immense wealth of every kind, with the wine of Helbon [Aleppo] and the white wool [of Sachar in Syria]. "}],[{"type":"prose","content":"Vedan and Javan traded with yarn from Uzal [in Arabia] for your wares; wrought iron, cassia, and sweet cane were among your merchandise. "}],[{"type":"prose","content":"Dedan traded with you in saddle blankets for riding. "}],[{"type":"prose","content":"Arabia and all the princes of Kedar, they were your customers for lambs, rams, and goats [favored by you]; for these they were your customers. "}],[{"type":"prose","content":"The merchants of Sheba and Raamah [in Arabia], they traded with you; they paid for your wares with the choicest of all kinds of spices and all kinds of precious stones and gold. "}],[{"type":"prose","content":"Haran and Canneh and Eden [in Mesopotamia], the merchants of Sheba [on the Euphrates], Asshur and Chilmad traded with you. "}],[{"type":"prose","content":"They traded with you in choice fabrics  garments, in clothes of blue  violet and embroidered work, and in [treasures of] multi-colored damask  knotted carpets bound with tightly wound cords,  among your merchandise. "}],[{"type":"prose","content":"The ships of Tarshish were the caravans for your merchandise,"}]]