[{"header":"Tyre, the Door to the Seas"},{"num":27,"verse":"The word of the Lord came to me again. He said,"},{"num":2,"verse":"“Son of man, sing this sad song about Tyre."},{"num":3,"verse":"Say this about Tyre: ‘Tyre, you are the door to the seas. You are the merchant for many nations. You travel to many countries along the coast. This is what the Lord God says:"},{"num":10,"verse":"“‘Men from Persia, Lud, and Put were in your army. They were your men of war who hung their shields and helmets on your walls. They brought honor and glory to your city."},{"num":11,"verse":"Men from Arvad and Cilicia were guards standing on the wall around your city. Men from Gammad were in your towers. They hung their shields on the walls around your city and made your beauty complete."},{"num":12,"verse":"“‘Tarshish was one of your best customers. They traded silver, iron, tin, and lead for all the wonderful things you sold."},{"num":13,"verse":"People in Greece, Turkey, and the area around the Black Sea traded with you. They traded slaves and bronze for the things you sold."},{"num":14,"verse":"People from the nation of Togarmah traded horses, war horses, and mules for the things you sold."},{"num":15,"verse":"The people of Rhodes traded with you. You sold your things in many places. People brought ivory tusks and ebony wood to pay you."},{"num":16,"verse":"Aram traded with you because you had so many good things. They traded emeralds, purple cloth, fine needlework, fine linen, coral, and rubies for the things you sold."},{"num":17,"verse":"“‘The people in Judah and Israel traded with you. They paid for the things you sold with the wheat, olives, early figs, honey, oil, and balm."},{"num":18,"verse":"Damascus was a good customer. They traded with you for the many wonderful things you had. They traded wine from Helbon and white wool for those things."},{"num":19,"verse":"Damascus traded wine from Uzal for the things you sold. They paid with wrought iron, cassia, and sugar cane."},{"num":20,"verse":"Dedan provided good business and traded with you for saddle blankets and riding horses."},{"num":21,"verse":"Arabia and all the leaders of Kedar traded lambs, rams, and goats for your goods."},{"num":22,"verse":"The merchants of Sheba and Raamah traded with you. They traded all the best spices and every kind of precious stone and gold for your goods."},{"num":23,"verse":"Haran, Canneh, Eden, the merchants of Sheba, Asshur, and Kilmad traded with you."},{"num":24,"verse":"They paid with the finest clothing, blue cloth, cloth with fine needlework, rugs of many colors, and the strongest ropes. These were the things they traded with you."},{"num":25,"verse":"The ships from Tarshish carried the things you sold."},{"num":32,"verse":"“‘And in their loud crying they will sing this sad song about you:"}]