[{"header":"Lamentation over Tyre"},{"num":27,"verse":"The word of the Lord came to me: "},{"num":2,"verse":"Now you, mortal, raise a lamentation over Tyre, "},{"num":3,"verse":"and say to Tyre, which sits at the entrance to the sea, merchant of the peoples on many coastlands, Thus says the Lord God:"},{"num":12,"verse":"Tarshish did business with you out of the abundance of your great wealth; silver, iron, tin, and lead they exchanged for your wares. "},{"num":13,"verse":"Javan, Tubal, and Meshech traded with you; they exchanged human beings and vessels of bronze for your merchandise. "},{"num":14,"verse":"Beth-togarmah exchanged for your wares horses, war-horses, and mules. "},{"num":15,"verse":"The Rhodians traded with you; many coastlands were your own special markets; they brought you in payment ivory tusks and ebony. "},{"num":16,"verse":"Edom did business with you because of your abundant goods; they exchanged for your wares turquoise, purple, embroidered work, fine linen, coral, and rubies. "},{"num":17,"verse":"Judah and the land of Israel traded with you; they exchanged for your merchandise wheat from Minnith, millet, honey, oil, and balm. "},{"num":18,"verse":"Damascus traded with you for your abundant goods—because of your great wealth of every kind—wine of Helbon, and white wool. "},{"num":19,"verse":"Vedan and Javan from Uzal entered into trade for your wares; wrought iron, cassia, and sweet cane were bartered for your merchandise. "},{"num":20,"verse":"Dedan traded with you in saddlecloths for riding. "},{"num":21,"verse":"Arabia and all the princes of Kedar were your favoured dealers in lambs, rams, and goats; in these they did business with you. "},{"num":22,"verse":"The merchants of Sheba and Raamah traded with you; they exchanged for your wares the best of all kinds of spices, and all precious stones, and gold. "},{"num":23,"verse":"Haran, Canneh, Eden, the merchants of Sheba, Asshur, and Chilmad traded with you. "},{"num":24,"verse":"These traded with you in choice garments, in clothes of blue and embroidered work, and in carpets of coloured material, bound with cords and made secure; in these they traded with you. "},{"num":25,"verse":"The ships of Tarshish travelled for you in your trade."}]