[{"num":27,"verse":"The word of Adonai came to me saying: "},{"num":2,"verse":"“You, son of man, lift up a lament for Tyre."},{"num":12,"verse":"“‘Tarshish was your trading partner because of the abundance of all riches. With silver, iron, tin, and lead, they traded for your merchandise. "},{"num":13,"verse":"Javan, Tubal and Meshech were your traffickers—they gave lives of people and vessels of bronze for your wares. "},{"num":14,"verse":"Those from the house of Togarmah traded for your merchandise with horses, steeds and mules. "},{"num":15,"verse":"The men of Dedan traded with you; many coastlands were your customers; they brought you horns of ivory and ebony as your payment. "},{"num":16,"verse":"Aram was your customer because of your abundant goods—they traded for your merchandise with emerald, purple and embroidered cloth, fine linen, coral and rubies. "},{"num":17,"verse":"Judah and the land of Israel were your customers; they traded for your wares with wheat of Minnith, confections, honey, oil and balm. "},{"num":18,"verse":"Damascus was your customer because of the abundance of your goods and all your great wealth, with the wine of Helbon and wool of white. "},{"num":19,"verse":"Vedan and Javan from Uzal traded for your wares—ironwork, cinnamon and spices were bartered for your merchandise. "},{"num":20,"verse":"Dedan was your dealer in saddlecloth for riding. "},{"num":21,"verse":"Arabia and all the princes of Kedar were your favored trading partners in lambs, rams and goats; in these they were your customers. "},{"num":22,"verse":"The merchants of Sheba and Raamah were your vendors—they traded for your wares with the finest spices, all precious stones and gold. "},{"num":23,"verse":"Haran and Canneh and Eden, the merchants of Sheba, Asshur and Chilmad traded with you. "},{"num":24,"verse":"They traded for your merchandise with gorgeous fabrics, garments of blue and richly woven work, carpets of multi-colored material, with cords twisted and tightly knotted. "},{"num":25,"verse":"The ships of Tarshish serve as carriers for your wares."}]