[[],[{"type":"prose","content":"And there is a word of Jehovah unto me, saying:"}],[{"type":"prose","content":"`And thou, son of man, lift up concerning Tyre a lamentation, and thou hast said to Tyre:"}],[{"type":"prose","content":"O dweller on the entrances of the sea, Merchant of the peoples unto many isles, Thus said the Lord Jehovah: O Tyre, thou -- thou hast said: I [am] the perfection of beauty."}],[{"type":"prose","content":"In the heart of the seas [are] thy borders, Thy builders have perfected thy beauty."}],[{"type":"prose","content":"Of firs of Senir they have built to thee all thy double-boarded ships, Of cedars of Lebanon they have taken to make a mast for thee,"}],[{"type":"prose","content":"Of oaks of Bashan they made thine oars, Thy bench they have made of ivory, A branch of Ashurim from isles of Chittim."}],[{"type":"prose","content":"Of fine linen with embroidery from Egypt hath been thy sail, To be to thee for an ensign, Of blue and purple from isles of Elishah hath been thy covering."}],[{"type":"prose","content":"Inhabitants of Zidon and Arvad have been rowers to thee, Thy wise men, O Tyre, have been in thee, They [are] thy pilots."}],[{"type":"prose","content":"Elders of Gebal and its wise men have been in thee, Strengthening thy breach; All ships of the sea and their mariners, Have been in thee, to trade [with] thy merchandise."}],[{"type":"prose","content":"Persian and Lud and Phut Have been in thy forces -- thy men of war. Shield and helmet they hung up in thee, They -- they have given out thine honour."}],[{"type":"prose","content":"The sons of Arvad, and thy force, [Are] on thy walls round about, And short swordsmen in thy towers have been, Their shields they have hung up on thy walls round about, They -- they have perfected thy beauty."}],[{"type":"prose","content":"Tarshish [is] thy merchant, Because of the abundance of all wealth, For silver, iron, tin, and lead, They have given out thy remnants."}],[{"type":"prose","content":"Javan, Tubal, and Meshech -- they [are] thy merchants, For persons of men, and vessels of brass, They have given out thy merchandise."}],[{"type":"prose","content":"They of the house of Togarmah, [For] horses, and riding steeds, and mules, They have given out thy remnants."}],[{"type":"prose","content":"Sons of Dedan [are] thy merchants, Many isles [are] the mart of thy hand, Horns of ivory and ebony they sent back thy reward."}],[{"type":"prose","content":"Aram [is] thy merchant, Because of the abundance of thy works, For emerald, purple, and embroidery, And fine linen, and coral, and agate, They have given out thy remnants."}],[{"type":"prose","content":"Judah and the land of Israel -- they [are] thy merchants, For wheat of Minnith, and Pannag, And honey, and oil, and balm, They have given out thy merchandise."}],[{"type":"prose","content":"Damascus [is] thy merchant, For the abundance of thy works, Because of the abundance of all wealth, For wine of Helbon, and white wool."}],[{"type":"prose","content":"Vedan and Javan go about with thy remnants, They have given shining iron, cassia, and cane, In thy merchandise it hath been."}],[{"type":"prose","content":"Dedan [is] thy merchant, For clothes of freedom for riding."}],[{"type":"prose","content":"Arabia, and all princes of Kedar, They [are] the traders of thy hand, For lambs, and rams, and he-goats, In these thy merchants."}],[{"type":"prose","content":"Merchants of Sheba and Raamah -- they [are] thy merchants, For the chief of all spices, And for every precious stone, and gold, They have given out thy remnants."}],[{"type":"prose","content":"Haran, and Canneh, and Eden, merchants of Sheba, Asshur -- Chilmad -- [are] thy merchants,"}],[{"type":"prose","content":"They [are] thy merchants for perfect things, For wrappings of blue, and embroidery, And for treasuries of rich apparel, With cords bound and girded, for thy merchandise,"}],[{"type":"prose","content":"Ships of Tarshish [are] thy double walls of thy merchandise, And thou art filled and honoured greatly, In the heart of the seas."}],[{"type":"prose","content":"Into great waters have they brought thee, Those rowing thee, The east wind hath broken thee in the heart of the seas."}],[{"type":"prose","content":"Thy wealth and thy remnants, Thy merchandise, thy mariners, And thy pilots, strengtheners of thy breach, And the traders of thy merchandise, And all thy men of war, who [are] in thee, And in all thine assembly that [is] in thy midst, Fall into the heart of the seas in the day of thy fall,"}],[{"type":"prose","content":"At the voice of the cry of thy pilots shake do the suburbs."}],[{"type":"prose","content":"And come down from their ships have all handling an oar, Mariners, all the pilots of the sea, on the land they stand,"}],[{"type":"prose","content":"And have sounded for thee with their voice, And cry bitterly, and cause dust to go up on their heads, In ashes they do roll themselves."}],[{"type":"prose","content":"And they have made for thee baldness, And they have girded on sackcloth, And they have wept for thee, In bitterness of soul -- a bitter mourning."}],[{"type":"prose","content":"And lifted up for thee have their sons a lamentation, And they have lamented over thee, who [is] as Tyre? As the cut-off one in the midst of the sea?"}],[{"type":"prose","content":"With the outgoing of thy remnants from the seas, Thou hast filled many peoples, With the abundance of thy riches, and thy merchandise, Thou hast made rich things of earth."}],[{"type":"prose","content":"The time of [thy] being broken by the seas in the depths of the waters, Thy merchandise and all thy assembly in thy midst have fallen."}],[{"type":"prose","content":"All inhabitants of the isles have been astonished at thee, And their kings have been sore afraid, They have been troubled in countenance."}],[{"type":"prose","content":"Merchants among the peoples have shrieked for thee, Wastes thou hast been, and thou art not -- to the age!'"}]]