[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "81:8-16 We cannot look for too little from the creature, nor too much from the Creator. We may have enough from God, if we pray for it in faith. All the wickedness of the world is owing to man's wilfulness. People are not religious, because they will not be so. God is not the Author of their sin, he leaves them to the lusts of their own hearts, and the counsels of their own heads; if they do not well, the blame must be upon themselves. The Lord is unwilling that any should perish. What enemies sinners are to themselves! It is sin that makes our troubles long, and our salvation slow. Upon the same conditions of faith and obedience, do Christians hold those spiritual and eternal good things, which the pleasant fields and fertile hills of Canaan showed forth. Christ is the Bread of life; he is the Rock of salvation, and his promises are as honey to pious minds. But those who reject him as their Lord and Master, must also lose him as their Saviour and their reward.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I am the Lord thy God ... - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is, \"I am Yahweh, that God; the God to be worshipped and honored by thee; I only am thy God, and no other god is to be recognized or acknowledged by thee.\" The foundation of the claim to exclusive service and devotion is here laid in the fact that he had brought them out of the land of Egypt. Literally, had caused them to ascend, or go up from that land. The claim thus asserted seems to be twofold:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) that in doing this, he had shown that he was God, or that he had performed a work which none but God could perform, and had thus shown his existence and power; and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) that by this he had brought them under special obligations to himself, inasmuch as they owed all that they had - their national existence and liberty - entirely to him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Open thy mouth wide, and I will fill it - Possibly an allusion to young birds, when fed by the parent-bird. The meaning here is, \"I can amply supply all your needs. You need not go to other gods - the gods of other lands - as if there were any deficiency in my power or resources; as if I were not able to meet your necessities. All your needs I can meet. Ask what you need - what you will; come to me and make any request with reference to yourselves as individuals or as a nation - to this life or the life to come - and you will find in me all abundant supply for all your needs, and a willingness to bless you commensurate with my resources.\" What is here said of the Hebrews may be said of the people of God at all times. There is not a want of our nature - of our bodies or our souls; a want pertaining to this life or the life to come - to ourselves, to our families, to our friends, to the church, or to our country - which God is not able to meet; and there is not a real necessity in any of these respects which he is not willing to meet. Why, then, should his people ever turn for happiness to the \"weak and beggarly elements of the world\" (compare the notes at Galatians 4:9), as if God could not satisfy them? Why should they seek for happiness in vain amusements, or in sensual pleasures, as if God could not, or would not, supply the real needs of their souls? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Open thy mouth wide, and I will fill it - Possibly an allusion to young birds, when fed by the parent-bird. The meaning here is, \"I can amply supply all your needs. You need not go to other gods - the gods of other lands - as if there were any deficiency in my power or resources; as if I were not able to meet your necessities. All your needs I can meet. Ask what you need - what you will; come to me and make any request with reference to yourselves as individuals or as a nation - to this life or the life to come - and you will find in me all abundant supply for all your needs, and a willingness to bless you commensurate with my resources.\" What is here said of the Hebrews may be said of the people of God at all times. There is not a want of our nature - of our bodies or our souls; a want pertaining to this life or the life to come - to ourselves, to our families, to our friends, to the church, or to our country - which God is not able to meet; and there is not a real necessity in any of these respects which he is not willing to meet. Why, then, should his people ever turn for happiness to the \"weak and beggarly elements of the world\" (compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as if God could not satisfy them? Why should they seek for happiness in vain amusements, or in sensual pleasures, as if God could not, or would not, supply the real needs of their souls? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. (Compare Ps 50:7). The reproof follows to Ps 81:12.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if thou wilt hearken—He then propounds the terms of His covenant: they should worship Him alone, who (Ps 81:10) had delivered them, and would still confer all needed blessings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Open thy mouth wide; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. To pray for mercies. Ask freely, and abundantly, and boldly, (as this phrase oft signifies,) whatsoever you need, or in reason can desire. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. To receive the mercies which I am ready to give you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will fill it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will give or grant them all, upon condition of your obedience. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I am the Lord thy God,.... The true Jehovah, the Being of beings, in whom all live and move and have their beings, the covenant God of his people; and is a reason why they should hear him, and worship him, and no other: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which brought thee out of the land of Egypt; this, with what goes before, is the preface to the ten commands, the first and principal of which is urged in the preceding verse; and this is another reason why the Lord God should be had and worshipped, and not a strange god; and redemption from worse than Egyptian bondage, from the bondage of sin, Satan, and the law, and a deliverance from worse than Egyptian darkness, and from a state of wickedness and impiety, should lay under greater obligations still to serve the Lord, and worship him only; who adds, as a further reason for it, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "open thy mouth wide, and I will fill it; which may be understood of opening the mouth either in prayer or in praise: to open the mouth wide in prayer is to pray with great freedom, to pour out the soul to God, lay open its whole case, and tell him all his mind and wants; to pray with great boldness, and with much importunity and fervency, and in full assurance of faith, pleading with great strength the promises of God, and asking in faith for much, according to them; and God may be said to fill this wide mouth of faith in prayer, when he grants the desires of the heart, gives his people what they will, even very largely and abundantly, yea, more than they can ask or think: to open the mouth wide in praise is to be abundantly thankful for mercies received; and when persons are so, the Lord fills them with more abundant matter for praise and thanksgiving; see Psalm 71:8, or this may be interpreted of opening the mouth wide in expressions of desire after spiritual food, hungering and thirsting after spiritual things, when the Lord fills or satisfies the mouths of his people with good things, Psalm 103:5, with the sincere milk of the word which they desire, and with the ordinances, the breasts of consolation they long for, and so satisfies them with the goodness and fatness of his house, Psalm 64:4, the metaphor seems to be taken from the young of birds, which open their mouths, and are filled by the old ones: the Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "open thy mouth wide, and I will fill it; which may be understood of opening the mouth either in prayer or in praise: to open the mouth wide in prayer is to pray with great freedom, to pour out the soul to God, lay open its whole case, and tell him all his mind and wants; to pray with great boldness, and with much importunity and fervency, and in full assurance of faith, pleading with great strength the promises of God, and asking in faith for much, according to them; and God may be said to fill this wide mouth of faith in prayer, when he grants the desires of the heart, gives his people what they will, even very largely and abundantly, yea, more than they can ask or think: to open the mouth wide in praise is to be abundantly thankful for mercies received; and when persons are so, the Lord fills them with more abundant matter for praise and thanksgiving; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 71:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or this may be interpreted of opening the mouth wide in expressions of desire after spiritual food, hungering and thirsting after spiritual things, when the Lord fills or satisfies the mouths of his people with good things, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with the sincere milk of the word which they desire, and with the ordinances, the breasts of consolation they long for, and so satisfies them with the goodness and fatness of his house, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 64:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the metaphor seems to be taken from the young of birds, which open their mouths, and are filled by the old ones: the Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"open thy mouth to the words of the law, and I will fill it with every good thing.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"open thy mouth to the words of the law, and I will fill it with every good thing.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I am the LORD thy God, which brought thee out of the land of Egypt: {i} open thy mouth wide, and I will fill it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD thy God, which brought thee out of the land of Egypt: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " open thy mouth wide, and I will fill it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) God accuses their incredulity, because they did not open their mouths to receive God's benefits in such abundance as he pours them out.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I am Jehovah thy God,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Which brought thee up out of the land of Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To Jehovah Israel owed its existence. The fact that He redeemed it from Egypt constituted His claim upon its allegiance. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "open",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] God is ready liberally to satisfy all their needs. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I am the Lord thy God, which brought thee out of the land of Egypt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reminder was continually needed (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Open thy mouth wide, and I will fill it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 13:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). God's gifts, both temporal and spiritual, are proportioned to our eager longing for them. As Christ could not do his miracles in one place because of their unbelief (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:5, 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so God cannot give lavishly unless we desire largely. Psalm 81:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is a gentle but profoundly earnest festival discourse which God the Redeemer addresses to His redeemed people. It begins, as one would expect in a Passover speech, with a reference to the סבלות of Egypt (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:11-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), and to the duwd, the task-basket for the transport of the clay and of the bricks (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In the Papyrus Leydensis i. 346 the Israelites are called the \"Aperiu (עברים), who dragged along the stones for the great watch-tower of the city of Rameses,\" and in the Pap. Leyd. i. 349, according to Lauth, the \"Aperiu, who dragged along the stones for the storehouse of the city of Rameses.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Out of such distress did He free the poor people who cried for deliverance (Exodus 2:23-25); He answered them בּסתר רעם, i.e., not (according to Psalm 22:22; Isaiah 32:2): affording them protection against the storm, but (according to Psalm 18:12; Psalm 77:17.): out of the thunder-clouds in which He at the same time revealed and veiled Himself, casting down the enemies of Israel with His lightnings, which is intended to refer pre-eminently to the passage through the Red Sea (vid., Psalm 77:19); and He proved them (אבחנך, with ŏ contracted from ō, cf. on Job 35:6) at the waters of Merbah, viz., whether they would trust Him further on after such glorious tokens of His power and loving-kindness. The name \"Waters of Merı̂bah,\" which properly is borne only by Merı̂bath Kadesh, the place of the giving of water in the fortieth year (Numbers 20:13; Numbers 27:14; Deuteronomy 32:51; Deuteronomy 33:8), is here transferred to the place of the giving of water in the first year, which was named Massah u-Merı̂bah (Exodus 17:7), as the remembrances of these two miracles, which took place under similar circumstances, in general blend together (vid., on Psalm 95:8.). It is not now said that Israel did not act in response to the expectation of God, who had son wondrously verified Himself; the music, as Seal imports, here rises, and makes a long and forcible pause in what is being said. What now follows further, are, as the further progress of Psalm 81:12 shows, the words of God addressed to the Israel of the desert, which at the same time with its faithfulness are brought to the remembrance of the Israel of the present. העיד בּ, as in Psalm 50:7; Deuteronomy 8:19, to bear testimony that concerns him against any one. אם (according to the sense, o si, as in Psalm 95:7, which is in many ways akin to this Psalm) properly opens a searching question which wishes that the thing asked may come about (whether thou wilt indeed give me a willing hearing?!). In Psalm 81:10 the key-note of the revelation of the Law from Sinai is struck: the fundamental command which opens the decalogue demanded fidelity to Jahve and forbade idol-worship as the sin of sins. אל זר is an idol in opposition to the God of Israel as the true God; and אל נכר, a strange god in opposition to the true God as the God of Israel. To this one God Israel ought to yield itself all the more undividedly and heartily as it was more manifestly indebted entirely to Him, who in His condescension had chosen it, and in His wonder-working might had redeemed it (המּעלך, part. Hiph. with the eh elided, like הפּדך, Deuteronomy 13:6, and אכלך, from כּלּה, Exodus 33:3); and how easy this submission ought to have been to it, since He desired nothing in return for the rich abundance of His good gifts, which satisfy and quicken body and soul, but only a wide-opened mouth, i.e., a believing longing, hungering for mercy and eager for salvation (Psalm 119:131)!  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Out of such distress did He free the poor people who cried for deliverance (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:23-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); He answered them בּסתר רעם, i.e., not (according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 32:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): affording them protection against the storm, but (according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".): out of the thunder-clouds in which He at the same time revealed and veiled Himself, casting down the enemies of Israel with His lightnings, which is intended to refer pre-eminently to the passage through the Red Sea (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and He proved them (אבחנך, with ŏ contracted from ō, cf. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") at the waters of Merbah, viz., whether they would trust Him further on after such glorious tokens of His power and loving-kindness. The name \"Waters of Merı̂bah,\" which properly is borne only by Merı̂bath Kadesh, the place of the giving of water in the fortieth year (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 27:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is here transferred to the place of the giving of water in the first year, which was named Massah u-Merı̂bah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as the remembrances of these two miracles, which took place under similar circumstances, in general blend together (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 95:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). It is not now said that Israel did not act in response to the expectation of God, who had son wondrously verified Himself; the music, as Seal imports, here rises, and makes a long and forcible pause in what is being said. What now follows further, are, as the further progress of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shows, the words of God addressed to the Israel of the desert, which at the same time with its faithfulness are brought to the remembrance of the Israel of the present. העיד בּ, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 50:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 8:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to bear testimony that concerns him against any one. אם (according to the sense, o si, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 95:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which is in many ways akin to this Psalm) properly opens a searching question which wishes that the thing asked may come about (whether thou wilt indeed give me a willing hearing?!). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the key-note of the revelation of the Law from Sinai is struck: the fundamental command which opens the decalogue demanded fidelity to Jahve and forbade idol-worship as the sin of sins. אל זר is an idol in opposition to the God of Israel as the true God; and אל נכר, a strange god in opposition to the true God as the God of Israel. To this one God Israel ought to yield itself all the more undividedly and heartily as it was more manifestly indebted entirely to Him, who in His condescension had chosen it, and in His wonder-working might had redeemed it (המּעלך, part. Hiph. with the eh elided, like הפּדך, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and אכלך, from כּלּה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and how easy this submission ought to have been to it, since He desired nothing in return for the rich abundance of His good gifts, which satisfy and quicken body and soul, but only a wide-opened mouth, i.e., a believing longing, hungering for mercy and eager for salvation (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:131",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")!  ",
            "children": []
          }
        ]
      }
    ]
  }
]