[{"header":"God Speaks through Jeremiah about Ammon"},{"num":49,"verse":"About the sons of Ammon, the Lord says, “Does Israel have no sons? Does she have no one to receive what she leaves? Why then has Malcam taken Gad as his own? Why do his people live in its cities? "},{"num":2,"verse":"But the days are coming,” says the Lord, “when I will blow a horn giving the sound of war against Rabbah of the sons of Ammon. And it will become a waste. Its towns will be set on fire. Then Israel will take the land from those who had taken it from her,” says the Lord."},{"num":3,"verse":"“Cry out, O Heshbon, for Ai has been destroyed! Cry out, O people of Rabbah. Put on clothes made from hair and cry in sorrow. And run this way and that way inside the walls. For Malcam will go to a strange land, together with his religious leaders and his important men. "},{"num":4,"verse":"How you speak in pride about the valleys! Your valley is flowing away, O daughter without faith who trusts in her riches, saying, ‘Who will come against me?’ "},{"num":5,"verse":"I will bring much trouble upon you,” says the Lord God of All. “It will come from all around you, and each of you will be driven away. There will be no one to gather together those who run for their lives. "},{"num":6,"verse":"But after this I will return the sons of Ammon to their land,” says the Lord."},{"header":"God Speaks through Jeremiah about Edom"},{"num":7,"verse":"About Edom, the Lord of All says, “Is there no longer any wisdom in Teman? Have wise words been lost from the wise? Is their wisdom all gone? "},{"num":8,"verse":"Run away! Turn back and live in the deep places, O people of Dedan. For I will bring the trouble of Esau upon him when I punish him. "},{"num":9,"verse":"If those who gather grapes came to you, would they not leave some grapes behind? If robbers came during the night, would they not take only what was enough for them? "},{"num":10,"verse":"But I have taken all that Esau has. I have taken the covering from his hiding places so that he will not be able to hide himself. His children, his brothers, and his neighbors are destroyed. And he is no more. "},{"num":11,"verse":"Leave your children behind, who have lost their parents, and I will keep them alive. And let your women whose husbands have died trust in Me.” "},{"num":12,"verse":"For the Lord says, “If those who were not to drink the cup must drink it, will you go without being punished? You will not go without being punished, but you must drink it. "},{"num":13,"verse":"For I have promised by Myself,” says the Lord, “that Bozrah will become an object of trouble, a shame, a waste, and a curse. All its cities will be destroyed forever.”"},{"num":14,"verse":"I have heard word from the Lord. A man with news is sent among the nations, saying, “Gather together and come against her! Rise up for battle! "},{"num":15,"verse":"For I have made you small among the nations, hated among men. "},{"num":16,"verse":"As for the fear you have caused, the pride of your heart has fooled you, O you who live in the holes of rocks, who live on the top of the hill. Even if you make your nest as high as an eagle’s, I will bring you down from there,” says the Lord. "},{"num":17,"verse":"‘Edom will become an object of trouble. Everyone who passes by will be surprised and will make fun of all its suffering. "},{"num":18,"verse":"As when Sodom and Gomorrah and their neighbors were destroyed, no one will live there,” says the Lord. “No man will live there. "},{"num":19,"verse":"One will come up like a lion from the trees by the Jordan to rich grass fields. All at once I will make him run away from Edom. And I will make whoever I choose rule over it. For who is like Me? Who will call Me into court? What shepherd can stand against Me?”"},{"num":20,"verse":"So hear the plan the Lord has made against Edom. Listen to His plans which He has made against the people of Teman. Even the little ones of the flock will be pulled away. For sure He will make their fields an empty waste because of them. "},{"num":21,"verse":"The earth will shake at the sound of their fall. The sound of their cry will be heard at the Red Sea. "},{"num":22,"verse":"See, one will come and fly down in a hurry like an eagle. He will spread out his wings against Bozrah. In that day the hearts of the strong men of Edom will be like the heart of a woman giving birth."},{"header":"God Speaks through Jeremiah about Damascus"},{"num":23,"verse":"About Damascus, He says, “Hamath and Arpad are troubled, for they have heard bad news. Their hearts have become weak. They are troubled like the sea which cannot be quiet. "},{"num":24,"verse":"Damascus has become weak. She has turned to run away. Fear has taken hold of her. Pain and sorrows have taken hold of her like a woman giving birth. "},{"num":25,"verse":"Why does the city of praise, the town of My joy, still have people in it? "},{"num":26,"verse":"For sure her young men will fall in her streets. And all the men of war will be destroyed in that day,” says the Lord of All. "},{"num":27,"verse":"“I will set fire to the wall of Damascus. And it will burn up the strong towers of Ben-hadad.”"},{"header":"God Speaks through Jeremiah about Kedar and Hazor"},{"num":28,"verse":"About Kedar and the nations of Hazor, which were beaten in battle by Nebuchadnezzar king of Babylon, the Lord says, “Get up and go to Kedar, and destroy the men of the east. "},{"num":29,"verse":"Their tents and their flocks will be taken. Their tent curtains, and all their good things, and their camels will be carried away for themselves. And men will call out to them, ‘Trouble is on every side!’ "},{"num":30,"verse":"Run! Run far away! Live in the deep places, O people of Hazor,” says the Lord. “For Nebuchadnezzar king of Babylon has made a plan against you. He has thought of a way to hurt you. "},{"num":31,"verse":"Get up and go to fight against a nation which is at rest and lives without fear,” says the Lord. “It has no gates with pieces of iron. And its people live alone. "},{"num":32,"verse":"Their camels and their many cattle will become a prize of war. I will send everywhere to the winds those who are in the farthest places. I will bring trouble to them from every side,” says the Lord. "},{"num":33,"verse":"“Hazor will become a place where wild dogs live, a waste place forever. No man will live there, and no man will stay there.”"},{"header":"God Speaks through Jeremiah about Elam"},{"num":34,"verse":"This is the Word of the Lord which came to Jeremiah the man of God about Elam, at the beginning of the rule of King Zedekiah of Judah, saying, "},{"num":35,"verse":"“The Lord of All says, ‘I will break the bow of Elam, the best of their strength. "},{"num":36,"verse":"I will bring the four winds to Elam from the four ends of heaven. And I will have these winds send them everywhere. There will not be a nation to which the people sent out of Elam will not go. "},{"num":37,"verse":"I will fill Elam with fear in front of those who hate them and want to kill them. I will bring much trouble upon them, even My burning anger,’ says the Lord. ‘I will send the sword after them until I have destroyed them. "},{"num":38,"verse":"Then I will set My throne in Elam, and will destroy their kings and leaders,’ says the Lord. "},{"num":39,"verse":"‘But in the last days I will return the people of Elam to their land,’” says the Lord."}]