[{"header":"Judgment on the Ammonites"},{"num":49,"verse":"Concerning the Ammonites."},{"num":6,"verse":"But afterward I will restore the fortunes of the Ammonites, says the Lord."},{"header":"Judgment on Edom"},{"num":7,"verse":"Concerning Edom."},{"num":12,"verse":"For thus says the Lord: If those who do not deserve to drink the cup still have to drink it, shall you be the one to go unpunished? You shall not go unpunished; you must drink it. "},{"num":13,"verse":"For by myself I have sworn, says the Lord, that Bozrah shall become an object of horror and ridicule, a waste, and an object of cursing; and all her towns shall be perpetual wastes."},{"num":17,"verse":"Edom shall become an object of horror; everyone who passes by it will be horrified and will hiss because of all its disasters. "},{"num":18,"verse":"As when Sodom and Gomorrah and their neighbors were overthrown, says the Lord, no one shall live there, nor shall anyone settle in it. "},{"num":19,"verse":"Like a lion coming up from the thickets of the Jordan against a perennial pasture, I will suddenly chase Edom away from it; and I will appoint over it whomever I choose. For who is like me? Who can summon me? Who is the shepherd who can stand before me? "},{"num":20,"verse":"Therefore hear the plan that the Lord has made against Edom and the purposes that he has formed against the inhabitants of Teman: Surely the little ones of the flock shall be dragged away; surely their fold shall be appalled at their fate. "},{"num":21,"verse":"At the sound of their fall the earth shall tremble; the sound of their cry shall be heard at the Red Sea. "},{"num":22,"verse":"Look, he shall mount up and swoop down like an eagle, and spread his wings against Bozrah, and the heart of the warriors of Edom in that day shall be like the heart of a woman in labor."},{"header":"Judgment on Damascus"},{"num":23,"verse":"Concerning Damascus."},{"header":"Judgment on Kedar and Hazor"},{"num":28,"verse":"Concerning Kedar and the kingdoms of Hazor that King Nebuchadrezzar of Babylon defeated."},{"header":"Judgment on Elam"},{"num":34,"verse":"The word of the Lord that came to the prophet Jeremiah concerning Elam, at the beginning of the reign of King Zedekiah of Judah."},{"num":35,"verse":"Thus says the Lord of hosts: I am going to break the bow of Elam, the mainstay of their might; "},{"num":36,"verse":"and I will bring upon Elam the four winds from the four quarters of heaven; and I will scatter them to all these winds, and there shall be no nation to which the exiles from Elam shall not come. "},{"num":37,"verse":"I will terrify Elam before their enemies, and before those who seek their life; I will bring disaster upon them, my fierce anger, says the Lord. I will send the sword after them, until I have consumed them; "},{"num":38,"verse":"and I will set my throne in Elam, and destroy their king and officials, says the Lord."},{"num":39,"verse":"But in the latter days I will restore the fortunes of Elam, says the Lord."}]