[{"num":34,"verse":"¶ Furthermore, Elihu answered and said,"},{"num":2,"verse":"Hear my words, O ye wise men; and give ear unto me, ye that have knowledge."},{"num":3,"verse":"For the ear tries words, as the mouth tastes food."},{"num":4,"verse":"Let us choose our judgment; let us know among ourselves what is good."},{"num":5,"verse":"For Job has said, I am righteous; and God has taken away my right."},{"num":6,"verse":"In my judgment he was a liar, my arrow wound is grievous without my having committed a transgression."},{"num":7,"verse":"What man is like Job, who drinks up the scorn like water?"},{"num":8,"verse":"Who goes in company with the workers of iniquity, and walks with wicked men."},{"num":9,"verse":"For he said, It shall profit a man nothing that he should conform his will with God."},{"num":10,"verse":"¶ Therefore, hearken unto me, ye men of understanding: far be it from God, that he should do wickedness; and from the Almighty, that he should commit iniquity."},{"num":11,"verse":"For he shall pay man according to his work and cause every man to find according to his ways."},{"num":12,"verse":"Yea, surely God will not do wickedly, neither will the Almighty pervert judgment."},{"num":13,"verse":"Who visited the earth for him? And who set the whole world in order?"},{"num":14,"verse":"If he were to set his heart upon man and gather unto himself his spirit and his breath,"},{"num":15,"verse":"all flesh would perish together, and man would turn again unto dust."},{"num":16,"verse":"¶ If now thou hast understanding, hear this: hearken to the voice of my words."},{"num":17,"verse":"Shall even he that hates judgment govern? And wilt thou condemn the Mighty One that is righteous?"},{"num":18,"verse":"Is it fit to say to the king, Thou art of Belial and to the princes, Ye are ungodly?"},{"num":19,"verse":"How much less to him who is not a respecter of the persons of princes, nor respects the rich more than the poor; for they all are the work of his hands."},{"num":20,"verse":"In a moment they shall die, and the peoples shall be troubled at midnight and shall pass away; and the mighty shall be taken away without hand."},{"num":21,"verse":"For his eyes are upon the ways of man, and he sees all his steps."},{"num":22,"verse":"There is no darkness nor shadow of death, where the workers of iniquity may hide themselves."},{"num":23,"verse":"For he will not lay upon man more than that which is just; that he should enter into judgment with God."},{"num":24,"verse":"He shall break in pieces mighty men without number and set others in their stead."},{"num":25,"verse":"Therefore, he shall cause their works to be notorious, when he shall overturn them in the night, so that they are destroyed."},{"num":26,"verse":"He shall strike them as wicked men in the open sight of others"},{"num":27,"verse":"because thus they turned back from him and would not consider any of his ways"},{"num":28,"verse":"so that they cause the cry of the poor to come unto him, and he hears the cry of the afflicted."},{"num":29,"verse":"When he gives rest, who then can make trouble? If he hides his face, who then can behold him? This applies to a nation and the same to a man,"},{"num":30,"verse":"that the hypocrite not reign, lest the people be ensnared."},{"num":31,"verse":"¶ For it is of God to say, I have forgiven, I will no longer destroy."},{"num":32,"verse":"Teach me that which I do not see; if I have done iniquity, I will do it no more."},{"num":33,"verse":"Will he perchance finish his work by thee; whether thou refuse, or whether thou choose, or by me? Speak what thou knowest."},{"num":34,"verse":"The men of understanding will say as I say, and the wise man will hearken unto me."},{"num":35,"verse":"Job has spoken without knowledge, and his words were without prudence."},{"num":36,"verse":"My desire is that Job may be tried unto the end, that there may be answers against wicked men."},{"num":37,"verse":"For he added rebellion unto his sin, he claps his hands among us and multiplies his words against God."}]