[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 22:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thick clouds are a covering to him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He is surrounded, thou imaginest, with such thick clouds that they conceal us from his sight. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he walketh in the circuit of the heaven — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His delight is in heaven, which is worthy of his care, but he will not burden himself with the care of earth; which was the opinion of many heathen philosophers, and, as his friends fancied, was Job’s opinion also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:5-14 Eliphaz brought heavy charges against Job, without reason for his accusations, except that Job was visited as he supposed God always visited every wicked man. He charges him with oppression, and that he did harm with his wealth and power in the time of his prosperity.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thick clouds are a covering to him - This is to be understood as expressing what Eliphaz regarded as the sentiment of Job - that so thick clouds intervened between him and man that he could not take cognizance of what was going forward on earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he walketh in the circuit of heaven - Upon the arch of heaven, as it seems to be bent over our heads. He walks above that cerulean, so high, that he cannot see what occurs on earth, and to punish mortals. This was not an uncommon sentiment among the ancients, though it is here, with the greatest injustice, attributed to Job. A similar sentiment is expressed by Lucretius, as quoted by Rosenmuller and Noyes:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Omnis enim per se Divum natura necesse est",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Immortali aevo summa cum pace fruatur,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Semota a nostris rebus, sejunctaque longe.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nam privata dolore omni, privata periclis,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ipsa suis pollens opibus, nihil in liga nostri,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nec bene promeritus capitur, nec tangitur ira.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare Isaiah 29:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. in the circuit of heaven—only, not taking any part in earthly affairs. Job is alleged as holding this Epicurean sentiment (La 3:44; Isa 29:15; 40:27; Jer 23:24; Eze 8:12; Ps 139:12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " His conversation and business and delight is in the higher and heavenly world, which is worthy of his care, but he will not disparage nor burden himself with the care of this contemptible spot of earth; which was the opinion of many heathen philosophers, and, as they fancied, was Job’s opinion also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thick clouds are a covering to him, that he seeth not,.... Thus Job is made to speak, or to reason as atheistical persons, or such who are inclined to atheism would, who take God to be altogether such an one as themselves; as that because thick clouds hide objects, as the sun, and moon, and stars, from their sight, therefore they must hide men and their actions from the sight of God; whereas there is nothing between God and man to hide them from him, let them be what they will, clouds as thick and as dark as can be imagined, yet his eyes are upon the ways of man, and see all his goings, nor is there any darkness that can hide from him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 34:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he walketh in the circuit of heaven; within which he keeps himself, and never looks down upon the earth, or takes any notice of what is done there; quite contrary to Psalm 14:3; as if he only took his walks through the spacious orb of heaven, and delighted himself in viewing the celestial mansions, and the furniture of them, but had no regard to anything below them; whereas, though he walks in the circuit of heaven, he also sits upon the circle of the earth, Isaiah 41:22; Eliphaz seems here to ascribe the sentiments perhaps of the Zabians in former times to Job, and since adopted by some philosophers; that God only regards the heavenly bodies, and supports them in their beings, and regulates and directs their motions, and leaves all things below to be governed and influenced by them, as judging it unworthy of him to be concerned with things on earth. Indeed the earth and the inhabitants of it are unworthy of his notice and care, and of his providential visits, but he does humble himself to look upon things on earth as well as in heaven, Psalm 8:4; to make Job reason after this Epicurean manner was doing great injustice to his character, who most firmly believed both the being and providence of God, and that as extending to all things here below, see Job 12:13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he walketh in the circuit of heaven; within which he keeps himself, and never looks down upon the earth, or takes any notice of what is done there; quite contrary to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; as if he only took his walks through the spacious orb of heaven, and delighted himself in viewing the celestial mansions, and the furniture of them, but had no regard to anything below them; whereas, though he walks in the circuit of heaven, he also sits upon the circle of the earth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Eliphaz seems here to ascribe the sentiments perhaps of the Zabians in former times to Job, and since adopted by some philosophers; that God only regards the heavenly bodies, and supports them in their beings, and regulates and directs their motions, and leaves all things below to be governed and influenced by them, as judging it unworthy of him to be concerned with things on earth. Indeed the earth and the inhabitants of it are unworthy of his notice and care, and of his providential visits, but he does humble himself to look upon things on earth as well as in heaven, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; to make Job reason after this Epicurean manner was doing great injustice to his character, who most firmly believed both the being and providence of God, and that as extending to all things here below, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thick clouds are a covering to him, that he seeth not; and he walketh in the circuit of heaven.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the circuit of heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "on the circle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i. e. the arch of heaven that overspans the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thick clouds are a covering to him, that he seeth not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the comment on the preceding verse); and he walketh in the circuit of heaven; or, on ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the circumference of the heavens.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The heavens are regarded as a solid vault, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "outside",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is the place where God dwells. Job 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12  Is not Eloah high as the heavens?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See but the head of the stars, how exalted!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13  So then thou thinkest: \"What doth God know?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Can He judge through the thick cloud?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  Clouds veil Him that He seeth not,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And in the vault of heaven He walketh at His pleasure.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because Job has denied the distribution of worldly fortune, of outward prosperity and adversity, according to the law of the justice that recompenses like for like, Eliphaz charges him with that unbelief often mentioned in the Psalms (Psalm 73:11; Psalm 94:7; comp. Isaiah 29:15; Ezekiel 8:12), which denies to the God in heaven, as Epicurus did to the gods who lead a blessed life in the spaces between the worlds, a knowledge of earthly things, and therefore the preliminary condition for a right comprehension of them. The mode of expression here is altogether peculiar. גּבהּ שׁמים is not acc. loci, as the like accusatives in combination with the verb שׁכן, Isaiah 57:15, may be taken: the substantival clause would lead one to expect בּגבהּ, or better בּגבהי (Job 11:8); it is rather (similar to Job 11:8) nomin. praedicati: Eloah is the height of the heavens  equals  heaven-high, as high as the heavens, therefore certainly highly, and indeed very highly, exalted above this earth. In this sense it is continued with Waw explic.: and behold ( equals  behold then) the head of the stars, that, or how (כּי as in Genesis 49:15; 1 Samuel 14:29, quod  equals  quam) exalted they are. וּראה has Asla (Kadma) in correct texts, and רמו is written רמּוּ (râmmu) with a so-called Dag. affectuosum (Olsh. 83, b). It may be received as certain that ראשׁ, the head (vertex), beside ראה (not ספר), does not signify the sum (Aben-Ezra). But it is questionable whether the genitive that follows ראשׁ is gen. partitivus: the highest among the stars (Ew., Hirz., Schlottm.), or gen. epexegeticus: the head, i.e., (in relation to the rest of the universe) the height, which is formed by the stars, or even which they occupy (Ges. coelum stellatum); the partitive rendering is to be preferred, for the Semitic perception recognises, as the plural שׁמים implies, nearer and more distant celestial spheres. The expression \"head of the stars\" is therefore somewhat like fastigium coeli (the extreme height, i.e., the middle of the vault of heaven), or culmen aereum (of the aether separating the strata of air above); the summit of the stars rising up into the extremest spheres is intended (we should say: the fixed stars, or to use a still more modern expression, the milky way), as also the רמו naturally refers to ראשׁ כוכבים as one notion (summitas astrorum  equals  summa astra).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Because Job has denied the distribution of worldly fortune, of outward prosperity and adversity, according to the law of the justice that recompenses like for like, Eliphaz charges him with that unbelief often mentioned in the Psalms (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which denies to the God in heaven, as Epicurus did to the gods who lead a blessed life in the spaces between the worlds, a knowledge of earthly things, and therefore the preliminary condition for a right comprehension of them. The mode of expression here is altogether peculiar. גּבהּ שׁמים is not acc. loci, as the like accusatives in combination with the verb שׁכן, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 57:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", may be taken: the substantival clause would lead one to expect בּגבהּ, or better בּגבהי (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); it is rather (similar to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") nomin. praedicati: Eloah is the height of the heavens  equals  heaven-high, as high as the heavens, therefore certainly highly, and indeed very highly, exalted above this earth. In this sense it is continued with Waw explic.: and behold ( equals  behold then) the head of the stars, that, or how (כּי as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", quod  equals  quam) exalted they are. וּראה has Asla (Kadma) in correct texts, and רמו is written רמּוּ (râmmu) with a so-called Dag. affectuosum (Olsh. 83, b). It may be received as certain that ראשׁ, the head (vertex), beside ראה (not ספר), does not signify the sum (Aben-Ezra). But it is questionable whether the genitive that follows ראשׁ is gen. partitivus: the highest among the stars (Ew., Hirz., Schlottm.), or gen. epexegeticus: the head, i.e., (in relation to the rest of the universe) the height, which is formed by the stars, or even which they occupy (Ges. coelum stellatum); the partitive rendering is to be preferred, for the Semitic perception recognises, as the plural שׁמים implies, nearer and more distant celestial spheres. The expression \"head of the stars\" is therefore somewhat like fastigium coeli (the extreme height, i.e., the middle of the vault of heaven), or culmen aereum (of the aether separating the strata of air above); the summit of the stars rising up into the extremest spheres is intended (we should say: the fixed stars, or to use a still more modern expression, the milky way), as also the רמו naturally refers to ראשׁ כוכבים as one notion (summitas astrorum  equals  summa astra).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The connection of what follows with Waw is not adversative (Hirz., Ew., and others: and yet thou speakest), it is rather consecutive (Hahn: and since thou speakest; better: and in consequence of this thou speakest; or: thus speakest thou, thinkest thou then). The undeniable truth that God is exalted, and indeed absolute in His exaltation, is misapplied by Job to the false conclusion: what does God know, or (since the perf. in interrogative sentences frequently corresponds to the Latin conjunctive, vid., on Psalm 11:3) how should God know, or take knowledge, i.e., of anything that happens on earth? In Job 22:13 the potential takes the place of this modal perfect: can He rule judicially behind the dark clouds, i.e., over the world below from which He is shut out? בּעד (of like verbal origin with the Arab. b‛da, post, prop. distance, separation, succession, but of wider use) signifies here, as in Job 1:10; Job 9:7, behind, pone, with the secondary notion of being encompassed or covered by that which shuts off. Far from having an unlimited view of everything earthly from His absolute height, it is veiled from His by the clouds, so that He sees not what occurs here below, and unconcerned about it He walks the circle of the heavens (that which vaults the earth, the inhabitants of which seem to Him, according to Isaiah 40:22, as grasshoppers); התלּך is here, after the analogy of Kal, joined with the accus. of the way over which He walks at His pleasure: orbem coelum obambulat. By such unworthy views of the Deity, Job puts himself on a par with the godless race that was swept away by the flood in ancient days, without allowing himself to be warned by this example of punishment. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The connection of what follows with Waw is not adversative (Hirz., Ew., and others: and yet thou speakest), it is rather consecutive (Hahn: and since thou speakest; better: and in consequence of this thou speakest; or: thus speakest thou, thinkest thou then). The undeniable truth that God is exalted, and indeed absolute in His exaltation, is misapplied by Job to the false conclusion: what does God know, or (since the perf. in interrogative sentences frequently corresponds to the Latin conjunctive, vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") how should God know, or take knowledge, i.e., of anything that happens on earth? In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the potential takes the place of this modal perfect: can He rule judicially behind the dark clouds, i.e., over the world below from which He is shut out? בּעד (of like verbal origin with the Arab. b‛da, post, prop. distance, separation, succession, but of wider use) signifies here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", behind, pone, with the secondary notion of being encompassed or covered by that which shuts off. Far from having an unlimited view of everything earthly from His absolute height, it is veiled from His by the clouds, so that He sees not what occurs here below, and unconcerned about it He walks the circle of the heavens (that which vaults the earth, the inhabitants of which seem to Him, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as grasshoppers); התלּך is here, after the analogy of Kal, joined with the accus. of the way over which He walks at His pleasure: orbem coelum obambulat. By such unworthy views of the Deity, Job puts himself on a par with the godless race that was swept away by the flood in ancient days, without allowing himself to be warned by this example of punishment. ",
            "children": []
          }
        ]
      }
    ]
  }
]