[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The law from his mouth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It would be highly interesting to know whether by this ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "law ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(Torah), the Law, the Torah, was in any way alluded to. One is naturally disposed to think that since Job seems to be the one Gentile book of the Old Testament, the one book in which the literature of Israel touches the world at large, it must, therefore, be prior to the Law, or else have been written in independence and ignorance of it. The former seems by far the more reasonable supposition, and certainly the life depicted appears to be that of the patriarchal times before the giving of the Law. And yet, on the other hand, it is hard to know what could be meant by “His words” prior to the Mosaic Revelation, unless, indeed, the expression is a witness to the consciousness of that inner revelation of the voice of God in the conscience which the holy in all ages have never wanted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 22:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Receive the law from his mouth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Take the rule, whereby thou mayest govern thy thoughts, and words, and whole life, not from idolaters and profane heathen, whose opinion concerning God’s providence thou appearest to have embraced, nor from thy own imaginations or violent passions, which have led thee into thy present errors; but from God, and from his law, which is written in thy own mind, and from the doctrines and instructions of the wise and holy men of God, who are all of our mind in this matter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And lay up his words in thy heart — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only hear them with thine ears, but let them sink into thy heart, being received there with hearty affection, and fixed by the serious, frequent, and practical consideration of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:21-30 The answer of Eliphaz wrongly implied that Job had hitherto not known God, and that prosperity in this life would follow his sincere conversion. The counsel Eliphaz here gives is good, though, as to Job, it was built upon a false supposition that he was a stranger and enemy to God. Let us beware of slandering our brethren; and if it be our lot to suffer in this manner, let us remember how Job was treated; yea, how Jesus was reviled, that we may be patient. Let us examine whether there may not be some colour for the slander, and walk watchfully, so as to be clear of all appearances of evil.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Receive, I pray thee, the law from his mouth - Listen to his commands, and obey his precepts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And lay up his words in thine heart - Embrace his truth, and do not forget it. Let it abide with you, and let it influence your secret feelings and the purposes of the soul. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And lay up his words in thine heart - Embrace his truth, and do not forget it. Let it abide with you, and let it influence your secret feelings and the purposes of the soul. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22. lay up—(Ps 119:11).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Take the law and rule whereby thou governest thy thoughts, and words, and whole life, not from profane heathens, whose opinion concerning God’s providence thou hast embraced, nor from thy own vain imaginations or violent passions, which have led thee into thy present errors and miscarriages, but from God, and from his word, and from his law, which is written in thy own mind, and from the doctrines and instructions of the holy men of God, who are all of our mind in this matter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lay up his words in thine heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. do not only hear them with thine ears, but let them sink into thy heart being received there by hearty affection, and fixed by serious, and frequent, and practical consideration of them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 119:11 Matthew 13:9 Luke 2:19,51",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Receive, I pray thee, the law from his mouth,.... Not the law of Moses; for it is a question whether that was as yet, or could come to the knowledge of Job; rather any doctrine, as the word signifies, any revelation of the mind and will of God, made unto the patriarchs in former times, and which was handed down from one to another, and was to be received as coming from the mouth of God, not as the word of man, but as the word of God; and as such to be received with meekness and reverence, with readiness, cheerfulness, and gladness; and not only to be attended to but obeyed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and lay up his words in thine heart: as a rich treasure, very valuable, and preferable to gold, silver, and precious stones, laid up in chests and cabinets because of their value, and that they might not be lost, but be preserved safe and sure, and that they might be come at, and made use of on proper occasions; as the words of God and doctrines of the Scriptures may be, against the temptations of Satan, the lusts of the flesh, and for the instruction of ourselves and others; and therefore should be retained in our minds, hid in our hearts, and dwell richly in us; and, unless they are in the heart, and have a place there, they will be of little avail to have them in the head or on the tongue; but if they come with power into the heart, and have a place there, they work effectually, and influence the life and conversation: these Job had, and had a great value for them; see Job 6:10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and lay up his words in thine heart: as a rich treasure, very valuable, and preferable to gold, silver, and precious stones, laid up in chests and cabinets because of their value, and that they might not be lost, but be preserved safe and sure, and that they might be come at, and made use of on proper occasions; as the words of God and doctrines of the Scriptures may be, against the temptations of Satan, the lusts of the flesh, and for the instruction of ourselves and others; and therefore should be retained in our minds, hid in our hearts, and dwell richly in us; and, unless they are in the heart, and have a place there, they will be of little avail to have them in the head or on the tongue; but if they come with power into the heart, and have a place there, they work effectually, and influence the life and conversation: these Job had, and had a great value for them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Receive, I pray thee, the law from his mouth, and lay up his words in thine heart.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "instruction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word is a general expression for “every word that proceedeth out of the mouth of God,” as the parallel “his words” in the next clause indicates. Comp. Job’s reply to this advice, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Receive, I pray thee, the law from his mouth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "receive now instruction from his mouth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The supposition of some commentators, that the \"Law of Moses\" is intended, is negatived by the entire absence from the Book of any allusion to the details of the Mosaic legislation, as well as by the primitive character of the life depicted in the book, and the certainty that no one of the interlocutors is an Israelite. The Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "תּורה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without the article prefixed, is properly \"instruction,\" and is only to be assumed as meaning \"the Law\" when the context shows this meaning to be probable. The \"instruction\" to which Eliphaz here points, and which he regards as instruction from God's mouth, is probably the teaching of religious men, such as himself, which he considered to have come from God originally, though, perhaps, he could not have explained how. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And lay up his words in thine heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is a mere variant of the preceding clause, and adds no fresh idea. Job 22:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21  Make friends now with Him, so hast thou peace;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thereby good will come unto thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22  Receive now teaching from His mouth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And place His utterances in thy heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23  If thou returnest to the Almighty, thou shalt be built up again;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If thou puttest away iniquity far from thy tents.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24  And lay by in the dust the gold ore,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And under the pebbles of the brooks the gold of Ophir.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25  So shall the Almighty be to thee gold ore in abundance,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And silver to thee of the brightest lustre.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The relationship of the verbs סכן, שׁכן, and Arab. sakana, has been already discussed on Job 22:2 : the Hiph. signifies to be on friendly terms with any one; to enter into, or to stand in, an intimate relationship to any one (Psalm 139:3); then also (as the Greek φιλεῖν) to get accustomed to, to be used to (Numbers 22:30). The second imper. is consecutive, as e.g., Proverbs 3:4 : and have as the result of it peace (Arab. fa'âslam)  equals  so shalt thou have peace, Ges. 130, 2. In Job 22:21 the first thing to be done is to clear up the form תּבואתך or (according to another reading which is likewise well attested) תּבואתך. Olshausen (in Hirz. and in his Gramm.) and Rdiger (in Thes. p. 11, suppl.) explain this form the same as the other forms which come under consideration in connection with it, viz., תּבואתה (veniat), Deuteronomy 33:16, and ותּבאתי, Keri ותּבאת (et venisses, addressed to Abigail), 1 Samuel 25:34, as errors in writing; whereas Ew., 191, c, sees in תּבואתך the erroneous form תּבואה  equals  תּבוא with a superfluous feminine termination, in תּבואתה an extension of the double feminine by the unaccented ah of intention, and in תּבאתי a transfer of the inflexion of the perf. to the fut. Confining ourselves to the form which occurs here, we refer to what was said above: תבואתך is not a forma mixta from תּבואך and בּאתך, but the mistaken double feminine תּבואה with suff., the ah of which, although the tone is on the penult., is not He voluntativum, as Isaiah 5:19, but He femin. The exception of such double feminines is made as certain in Hebrew by the regular form נגלתה (  equals  נגלת with a second feminine termination), and by examples like Proverbs 1:20; Ezekiel 23:20, and also Joshua 6:17; 2 Samuel 1:26; Amos 4:3 (comp. even Olsh. in his Gramm. S. 449), as the double plural and its further formation by a feminine termination in Arabic. It is therefore unnecessary, with Olsh. and Rd., after the precedent of the ancient versions, to read תּבוּאתך (which is found in 19 Codd. in de Rossi): proventus tuus bonus erit. The suff. in בּהם, as Isaiah 64:4; Ezekiel 23:18, comp. עליהם, Isaiah 38:16, is intended as neuter, as the fem. is used elsewhere (e.g., Isaiah 38:16, בּהן): by it, i.e., by such conduct, good (prosperity) shall come to thee, and indeed, as the בוא construed with the acc. implies, in a sudden change of thy previous lot, coming about without any further effort on thy part. In the certainty that it is God's word which he presents to his friend (the very certainty which Eliphaz also expresses elsewhere, e.g., Job 15:11), he further admonishes him (Job 22:22) to receive instruction from God's mouth (מפּיו as Proverbs 2:6), and to allow His (God's) utterances a place in his heart, not to let them die away without effect, but to imprint them deeply on his mind.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The relationship of the verbs סכן, שׁכן, and Arab. sakana, has been already discussed on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : the Hiph. signifies to be on friendly terms with any one; to enter into, or to stand in, an intimate relationship to any one (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); then also (as the Greek φιλεῖν) to get accustomed to, to be used to (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 22:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The second imper. is consecutive, as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : and have as the result of it peace (Arab. fa'âslam)  equals  so shalt thou have peace, Ges. 130, 2. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the first thing to be done is to clear up the form תּבואתך or (according to another reading which is likewise well attested) תּבואתך. Olshausen (in Hirz. and in his Gramm.) and Rdiger (in Thes. p. 11, suppl.) explain this form the same as the other forms which come under consideration in connection with it, viz., תּבואתה (veniat), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ותּבאתי, Keri ותּבאת (et venisses, addressed to Abigail), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as errors in writing; whereas Ew., 191, c, sees in תּבואתך the erroneous form תּבואה  equals  תּבוא with a superfluous feminine termination, in תּבואתה an extension of the double feminine by the unaccented ah of intention, and in תּבאתי a transfer of the inflexion of the perf. to the fut. Confining ourselves to the form which occurs here, we refer to what was said above: תבואתך is not a forma mixta from תּבואך and בּאתך, but the mistaken double feminine תּבואה with suff., the ah of which, although the tone is on the penult., is not He voluntativum, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but He femin. The exception of such double feminines is made as certain in Hebrew by the regular form נגלתה (  equals  נגלת with a second feminine termination), and by examples like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 6:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (comp. even Olsh. in his Gramm. S. 449), as the double plural and its further formation by a feminine termination in Arabic. It is therefore unnecessary, with Olsh. and Rd., after the precedent of the ancient versions, to read תּבוּאתך (which is found in 19 Codd. in de Rossi): proventus tuus bonus erit. The suff. in בּהם, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 64:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. עליהם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is intended as neuter, as the fem. is used elsewhere (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", בּהן): by it, i.e., by such conduct, good (prosperity) shall come to thee, and indeed, as the בוא construed with the acc. implies, in a sudden change of thy previous lot, coming about without any further effort on thy part. In the certainty that it is God's word which he presents to his friend (the very certainty which Eliphaz also expresses elsewhere, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), he further admonishes him (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") to receive instruction from God's mouth (מפּיו as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and to allow His (God's) utterances a place in his heart, not to let them die away without effect, but to imprint them deeply on his mind.",
            "children": []
          }
        ]
      }
    ]
  }
]