[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 22:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is it any pleasure to the Almighty that thou art righteous? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, any such pleasure as he needs in order to his happiness? Heath renders it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "any advantage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God, we know, approves of and accepts the good actions of his people, and is often said in Scripture to delight in them; but certainly cannot be advantaged by them. He needs not us or our services. We are undone, for ever undone, without him: but he is happy, for ever happy, without us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22:1-4 Eliphaz considers that, because Job complained so much of his afflictions, he thought God was unjust in afflicting him; but Job was far from thinking so. What Eliphaz says, is unjustly applied to Job, but it is very true, that when God does us good it is not because he is indebted to us. Man's piety is no profit to God, no gain. The gains of religion to men are infinitely greater than the losses of it. God is a Sovereign, who gives no account of his conduct; but he is perfectly wise, just, faithful, good, and merciful. He approves the likeness of his own holiness, and delights in the fruits of his Spirit; he accepts the thankful services of the humble believer, while he rejects the proud claim of the self-confident.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Is it any pleasure to the Almighty that thou art righteous? - This is the same sentiment which was advanced in the previous verse. The meaning is, that it can be no advantage to God that a man is righteous. He is not dependent on man for happiness, and cannot be deterred from dealing justly with him because he is in danger of losing anything. In this sense, it is true. God \"has\" pleasure in holiness wherever it is, and is pleased when people are righteous; but it is not true that he is dependent on the character of his creatures for his own happiness, or that people can lay him under obligation by their own righteousness. Eliphaz applies this general truth to Job, probably, because he understood him as complaining of the dealings of God with him, as if he had laid God under obligation by his upright life. He supposes that it was implied in the remarks of Job, that he had been so upright, and had been of so much consequence, that God \"ought\" to have continued him in a state of prosperity. This supposition, if Job ever had it, Eliphaz correctly meets, and shows him that he was not so profitable to God that he could not do without him. Yet, do people not often feel thus? Do ministers of the gospel not sometimes feel thus? Do we not sometimes feel thus in relation to some man eminent for piety, wisdom, or learning? Do we not feel as if God could not do without him, and that there was a sort of necessity that he should keep him alive? Yet, how often are such people cut down, in the very midst of their usefulness, to show",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) that God is not dependent on them; and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) to keep them from pride, as if they were necessary to the execution of the divine plans; and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) to teach his people their dependence on \"Him,\" and not on frail, erring mortals. When the church places its reliance on a human arm, God very often suddenly knocks the prop away. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) to teach his people their dependence on \"Him,\" and not on frail, erring mortals. When the church places its reliance on a human arm, God very often suddenly knocks the prop away. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. pleasure—accession of happiness; God has pleasure in man's righteousness (Ps 45:7), but He is not dependent on man's character for His happiness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Any pleasure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. such a pleasure as he needs for his own ease and contentment, without which he could not be happy, as appears by the foregoing and following words; for otherwise God is oft said to delight in the good actions of his people, to wit, so far as to approve and accept them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That thou makest thy ways perfect; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that thy life is free from blemish, as thou pretendest, but falsely, as I shall show. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Is it any pleasure to the Almighty that thou art righteous?.... It is not; the Lord indeed takes pleasure in his people, not as sinners, but as righteous; and as they are considered such in Christ, he is well pleased for his righteousness' sake, and with it, being agreeable to his nature, will, and law; and with his people in Christ, in whom they are accepted, having imputed the righteousness of his Son unto them, and so they stand before him unblamable and irreprovable, and he takes pleasure in the work of his own hands upon them, called the good pleasure of his will, in the new man formed after his image in righteousness and true holiness, in the graces of his Spirit, and in the exercise of them, faith, hope, love, humility, fear of God, &c. it is a pleasure to him to hear their prayers and praises, and to observe their ready and cheerful obedience to his will; but then all this gives him no new pleasure, or adds anything to the complacency of his mind; he would have had as much delight and pleasure within himself, if there had never been an holy angel in heaven, or a righteous man on earth; he has no such pleasure in either as to be made more happy thereby, or so as to receive any \"gain\" or profit from it, as the next clause explains it. Some render it, \"that thou justifiest thyself\" (k), or \"that thou art just\", or \"seemest to be righteous to thyself\" (l); a self-righteous person is not pleasing to God; it is no pleasure to him when a man seeks for justification by his own works, or reckons them his righteousness; the publican that confessed his sin was rather justified with God than the Pharisee that applauded his own righteousness; such that are conceited of their own righteousness, and despise others, are an offence to God, a \"smoke in his nose\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the righteousness of such is not real righteousness in the account of God, and according to his law; it has only the shadow and appearance of one, but is not truly so; and besides, to seek righteousness this way is going contrary to the revealed will of God, to the Gospel scheme of justification by faith in Christ's righteousness, without the works of the law, and is a setting aside his righteousness, and frustrating and making null and void the death of Christ, and therefore can never be pleasing in the sight of God: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or is it gain to him that thou makest thy ways perfect? no man's ways are perfect before God, even the best of men have detects in their works, and failings in their walk and conversations: some men's ways are indeed clean in their own eyes, and perfect in their own conceit; and if Eliphaz thought Job such an one, he was mistaken, see Job 9:20; there are others, who are in a sense unblamable in their walk and conversation; that is, are not guilty of any notorious crime, but exercise a conscience void of offence towards God and man, walk in all the commandments and ordinances of the Lord blameless; and yet this is no \"gain\" to God; for what does such a man give to him? or what does he receive of his hands? see Job 35:7. This was indeed Job's case and character. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or is it gain to him that thou makest thy ways perfect? no man's ways are perfect before God, even the best of men have detects in their works, and failings in their walk and conversations: some men's ways are indeed clean in their own eyes, and perfect in their own conceit; and if Eliphaz thought Job such an one, he was mistaken, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; there are others, who are in a sense unblamable in their walk and conversation; that is, are not guilty of any notorious crime, but exercise a conscience void of offence towards God and man, walk in all the commandments and ordinances of the Lord blameless; and yet this is no \"gain\" to God; for what does such a man give to him? or what does he receive of his hands? see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This was indeed Job's case and character. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k)  \"quod justifices te\", Junius & Tremellius. (l) \"Quum Justus es apud teipsum\", Schmidt; \"quod tibi justus esse videris\", Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k)  \"quod justifices te\", Junius & Tremellius. (l) \"Quum Justus es apud teipsum\", Schmidt; \"quod tibi justus esse videris\", Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Is it any pleasure to the Almighty, that thou art righteous? or is it gain to him, that thou makest thy ways perfect?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is it any pleasure",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "advantage",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", concern; see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 21:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea that men’s actions cannot affect God is common in the Book, see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 35:5-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " go together, and express this single conception that God’s treatment of men is not due to any respect He has to Himself, but is strictly according to the character of men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Is it any pleasure to the Almighty, that thou art righteous?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As \"our goodness extendeth not to God,\" and as his all-perfect happiness knows neither increase nor diminution, we cannot he said to advantage him by our goodness. Still \"good works, which are the fruits of faith, and follow after justification, are ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pleasing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and acceptable to God in Christ;\" and God himself condescends to say that he \"takes ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pleasure",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in his people,\" \"in them that fear him\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 147:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 149:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Or is it gain to him that thou makest thy ways perfect?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Of course, the \"gain\" is to the man himself, and not to God. He saves his soul alive. God has one more worshipper in the courts of heaven, one more voice added to the choir  which hymns his praise for evermore, But what is one drop added to an ocean? Job 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  1  Then began Eliphaz the Temanite, and said:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  2  Is a man profitable unto God?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "No, indeed! the intelligent man is profitable to himself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  Hath the Almighty any profit if thou art righteous,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or gain if thou strivest to walk uprightly?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  4  Will He reprove thee for thy fear of God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Will He go with thee into judgment?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  5  Is not thy wickedness great,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thine iniquities infinite?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The verb סכן, in the signification to be profitable, is peculiar to the book of Job (although also סכן and סכנת elsewhere, according to its primary signification, does not differ from מועיל, מועילה, by which it is explained by Kimchi); the correct development of the notion of this verb is to be perceived from the Hiph., which occurs in Job 21:21 in this speech of Eliphaz (vid., Ges. Thes.): it signifies originally, like שׁכן, Arab. skn, to rest, dwell, especially to dwell beside one another, then to become accustomed to one another (comp. שׁכן, a neighbour, and Arab. sakanun, a friend, confidant), and to assist one another, to be serviceable, to be profitable; we can say both סכנתּי, I have profit, Job 34:9, and סכן, it is profitable, Job 15:3; Job 35:3, here twice with a personal subj., and first followed by ל, then with the על usual also elsewhere in later prose (e.g., טוב על,   1 Chronicles 13:2, comp. supra, Job 10:3, to be pleasant) and poetry, which gladly adopts Aramaisms (as here and Psalm 16:6, שׁפר על, well-pleased), instead of ל, whence here עלימו, as Job 20:23, pathetic for עליו. The question, which is intended as a negative, is followed by the negative answer (which establishes its negative meaning) with כּי; משׂכּיל is, like Psalm 14:2, the intelligent, who wills and does what is good, with an insight into the nature of the extremes in morality, as in Proverbs 1:3 independent morality which rests not merely on blind custom is called מוסר השׂכל. היה חפץ ל, it is to the interest of any one (different from 1 Samuel 15:22, vid., on Job 21:21), and היה בצע ל, it is to the gain of any one (prop. the act of cutting, cutting off, i.e., what one tears in pieces), follow as synonyms of סכן. On the Aramaizing doubling of the first radical in the Hiph. תתּם (instead of תתם), vid., Ges. 67, rem. 8, comp. 3. It is translated an lucrum (ei) si integras facias vias tuas. The meaning of the whole strophe is mainly determined according to the rendering of המיּראתך (like המבינתך, Job 39:26, with Dech, and as an exception with Munach, not removed to the place of the Metheg; vid., Psalter, ii. 491, Anm. 1). If the suff. is taken objectively (from fear of thee), e.g., Hirz., we have the following line of thought: God is neither benefited by human virtue nor injured by human sin, so that when He corrects the sinner He is turning danger from himself; He neither rewards the godly because He is benefited by his piety, nor punishes the sinner because by his sinning he threatens Him with injury. Since, therefore, if God chastises a man, the reason of it is not to be found in any selfish purpose of God, it must be in the sin of the man, which is on its own account worthy of punishment. But the logical relation in which Job 22:5 stands to Job 22:4 does not suit this: perhaps from fear of thee ... ? no, rather because of thy many and great sins! Hahn is more just to this relation when he explains: \"God has no personal profit to expect from man, so that, somewhat from fear, to prevent him from being injurious, He should have any occasion to torment him with sufferings unjustly.\" But if the personal profit, which is denied, is one that grows out of the piety of the man, the personal harm, which is denied as one which God by punishment will keep far from Himself, is to be thought of as growing out of the sin of the man; and the logical relation of Job 22:5 to Job 22:4 is not suited to this, for. Job 22:5 assigns the reason of the chastisement to the sin, and denies, as it runs, not merely any motive whatever in connection with the sin, but that the reason can lie in the opposite of sin, as it appears according to Job's assertion that, although guiltless, he is still suffering from the wrath of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The verb סכן, in the signification to be profitable, is peculiar to the book of Job (although also סכן and סכנת elsewhere, according to its primary signification, does not differ from מועיל, מועילה, by which it is explained by Kimchi); the correct development of the notion of this verb is to be perceived from the Hiph., which occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in this speech of Eliphaz (vid., Ges. Thes.): it signifies originally, like שׁכן, Arab. skn, to rest, dwell, especially to dwell beside one another, then to become accustomed to one another (comp. שׁכן, a neighbour, and Arab. sakanun, a friend, confidant), and to assist one another, to be serviceable, to be profitable; we can say both סכנתּי, I have profit, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and סכן, it is profitable, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", here twice with a personal subj., and first followed by ל, then with the על usual also elsewhere in later prose (e.g., טוב על,   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. supra, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to be pleasant) and poetry, which gladly adopts Aramaisms (as here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", שׁפר על, well-pleased), instead of ל, whence here עלימו, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", pathetic for עליו. The question, which is intended as a negative, is followed by the negative answer (which establishes its negative meaning) with כּי; משׂכּיל is, like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the intelligent, who wills and does what is good, with an insight into the nature of the extremes in morality, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " independent morality which rests not merely on blind custom is called מוסר השׂכל. היה חפץ ל, it is to the interest of any one (different from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and היה בצע ל, it is to the gain of any one (prop. the act of cutting, cutting off, i.e., what one tears in pieces), follow as synonyms of סכן. On the Aramaizing doubling of the first radical in the Hiph. תתּם (instead of תתם), vid., Ges. 67, rem. 8, comp. 3. It is translated an lucrum (ei) si integras facias vias tuas. The meaning of the whole strophe is mainly determined according to the rendering of המיּראתך (like המבינתך, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with Dech, and as an exception with Munach, not removed to the place of the Metheg; vid., Psalter, ii. 491, Anm. 1). If the suff. is taken objectively (from fear of thee), e.g., Hirz., we have the following line of thought: God is neither benefited by human virtue nor injured by human sin, so that when He corrects the sinner He is turning danger from himself; He neither rewards the godly because He is benefited by his piety, nor punishes the sinner because by his sinning he threatens Him with injury. Since, therefore, if God chastises a man, the reason of it is not to be found in any selfish purpose of God, it must be in the sin of the man, which is on its own account worthy of punishment. But the logical relation in which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stands to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not suit this: perhaps from fear of thee ... ? no, rather because of thy many and great sins! Hahn is more just to this relation when he explains: \"God has no personal profit to expect from man, so that, somewhat from fear, to prevent him from being injurious, He should have any occasion to torment him with sufferings unjustly.\" But if the personal profit, which is denied, is one that grows out of the piety of the man, the personal harm, which is denied as one which God by punishment will keep far from Himself, is to be thought of as growing out of the sin of the man; and the logical relation of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not suited to this, for. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " assigns the reason of the chastisement to the sin, and denies, as it runs, not merely any motive whatever in connection with the sin, but that the reason can lie in the opposite of sin, as it appears according to Job's assertion that, although guiltless, he is still suffering from the wrath of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus, then, the suff. of המיראתך is to be taken subjectively: on account of thy fear of God, as Eliphaz has used יראתך twice already, Job 4:6; Job 15:4. By this subjective rendering Job 22:4 and Job 22:5 form a true antithesis: Does God perhaps punish thee on account of thy fear of God? Does He go (on that account) with thee into judgment? No (it would be absurd to suppose that); therefore thy wickedness must be great (in proportion to the greatness of thy suffering), and thy misdeeds infinitely many. If we now look at what precedes, we shall have to put aside the thought drawn into Job 22:2 and Job 22:3 by Ewald (and also by Hahn): whether God, perhaps with the purpose of gaining greater advantage from piety, seeks to raise it by unjustly decreed suffering; for this thought has nothing to indicate it, and is indeed certainly false, but on account of the force of truth which lies in it (there is a decreeing of suffering for the godly to raise their piety) is only perplexing.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus, then, the suff. of המיראתך is to be taken subjectively: on account of thy fear of God, as Eliphaz has used יראתך twice already, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". By this subjective rendering ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " form a true antithesis: Does God perhaps punish thee on account of thy fear of God? Does He go (on that account) with thee into judgment? No (it would be absurd to suppose that); therefore thy wickedness must be great (in proportion to the greatness of thy suffering), and thy misdeeds infinitely many. If we now look at what precedes, we shall have to put aside the thought drawn into ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by Ewald (and also by Hahn): whether God, perhaps with the purpose of gaining greater advantage from piety, seeks to raise it by unjustly decreed suffering; for this thought has nothing to indicate it, and is indeed certainly false, but on account of the force of truth which lies in it (there is a decreeing of suffering for the godly to raise their piety) is only perplexing.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "First of all, we must inquire how it is that Eliphaz begins his speech thus. All the exhortations to penitence in which the three exhaust themselves, rebound from Job without affecting him. Even Eliphaz, the oldest among them, full of a lofty, almost prophetic consciousness, has with the utmost solicitude allured and terrified him, but in vain. And it is the cause of God which he brings against him, or rather his own well-being that he seeks, without making an impression upon him. Then he reminds him that God is in Himself the all-sufficient One; that no advantage accrues to Him from human uprightness, since His nature, existing before and transcending all created things, can suffer neither diminution nor increase from the creature; that Job therefore, since he remains inaccessible to that well-meant call to penitent humiliation, has refused not to benefit Him, but himself; or, what is the reverse side of this thought (which is not, however, expressed), that he does no injury to Him, only to himself. And yet in what except in Job's sin should this decree of suffering have its ground? If it is a self-contradiction that God should chastise a man because he fears Him, there must be sin on the side of Job; and indeed, since the nature of the sin is to be measured according to the nature of the suffering, great and measureless sin. This logical necessity Eliphaz now regards as real, without further investigation, by opening out this bundle of sins in the next strophe, and reproaching Job directly with that which Zophar, Job 20:19-21, aiming at Job, has said of the רשׁע. In the next strophe he continues, with כי explic.: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "First of all, we must inquire how it is that Eliphaz begins his speech thus. All the exhortations to penitence in which the three exhaust themselves, rebound from Job without affecting him. Even Eliphaz, the oldest among them, full of a lofty, almost prophetic consciousness, has with the utmost solicitude allured and terrified him, but in vain. And it is the cause of God which he brings against him, or rather his own well-being that he seeks, without making an impression upon him. Then he reminds him that God is in Himself the all-sufficient One; that no advantage accrues to Him from human uprightness, since His nature, existing before and transcending all created things, can suffer neither diminution nor increase from the creature; that Job therefore, since he remains inaccessible to that well-meant call to penitent humiliation, has refused not to benefit Him, but himself; or, what is the reverse side of this thought (which is not, however, expressed), that he does no injury to Him, only to himself. And yet in what except in Job's sin should this decree of suffering have its ground? If it is a self-contradiction that God should chastise a man because he fears Him, there must be sin on the side of Job; and indeed, since the nature of the sin is to be measured according to the nature of the suffering, great and measureless sin. This logical necessity Eliphaz now regards as real, without further investigation, by opening out this bundle of sins in the next strophe, and reproaching Job directly with that which Zophar, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:19-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", aiming at Job, has said of the רשׁע. In the next strophe he continues, with כי explic.: ",
            "children": []
          }
        ]
      }
    ]
  }
]