[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who passing through the valley of Baca.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—All the ancient versions have “valley of weeping,” which, through the Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vallis lacrymosa, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "has passed into the religious language of Europe as a synonym for life. And ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Baca ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bākha",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") seems to have this signification, whatever origin we give the word. The valley has been variously identified—with the valley of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Achor ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the valley of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rephaim ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 5:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—a valley found by Burckhardt in the neighbourhood of Sinai; and one, more recently, by Renan, the last station of the present caravan route from the north to Jerusalem. Of these, the valley of Rephaim is most probably in the poet’s mind, since it is described (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as sterile, and as the text stands, we think of some place devoid of water, but which the courage and faith of the pilgrims treats as if it were well supplied with that indispensable requisite, thus turning adversity itself into a blessing. He either plays on the sound of the word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Baca, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "becaîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") or the exudations of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "balsam ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "shrub gave the valley its name.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The rain also filleth the pools.—That rain is the right rendering of the Hebrew word here appears from Joel 2:23. The rendering pools follows the reading, berechóth; but the text has berachóth, “blessings,” as read by the LXX. and generally adopted now. Render yea, as the autumn rain covers (it) with blessings, i.e., just as the benign showers turn a wilderness into a garden, so resolution and faith turn disadvantage to profit. (Comp. Isaiah 35:6-8; Isaiah 43:18 seq.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The rain also filleth the pools.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—That ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "rain ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is the right rendering of the Hebrew word here appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The rendering ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "pools ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "follows the reading, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "berechóth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but the text has ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "berachóth, “",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "blessings,” as read by the LXX. and generally adopted now. Render ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "yea, as the autumn rain covers ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": " with blessings, i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "just as the benign showers turn a wilderness into a garden, so resolution and faith turn disadvantage to profit. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:6-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "seq.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 84:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who passing — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being used to pass; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for he seems not to speak of one particular act, but of a common course or custom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "through the valley of Baca — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A place so called, which some Jewish and other writers affirm to have been a very dry place, and therefore incommodious for travellers in those hot countries, and in hot seasons. Which place may be here mentioned, not exclusively of other ways; for this highway being but one, and on one side of Jerusalem, could not be a general way for all the Israelites thither; but synecdochically for all places of like nature, which made their journey to Jerusalem unpleasant or inconvenient. But their zeal for God’s service did easily overcome this and other difficulties. Or the clause may be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the valley of tears, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as this valley might be called, for the trouble or vexation which travellers found there by reason of drought, or other inconveniences. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Make it a well — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wells; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, they dig divers little pits or wells in it for their relief. This trouble they willingly undertook, rather than to neglect the opportunity of going up to Jerusalem at their solemn times. And possibly they did this, not only for themselves, but for the benefit of other travellers who came after them; whereby they showed both their piety and charity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The rain also filleth the pools — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God recompenseth their diligence in making pits, or cisterns, with his blessing, sending rain wherewith they may be filled, and the thirsty travellers refreshed. It may be proper to inform the reader, that the words may be rendered more agreeably to the Hebrew text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "also pools, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cisterns; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, they make pools or cisterns, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which the rain filleth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may fill; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which may receive and keep the rain that God sendeth for the refreshment of these travellers, whose great numbers made the provision of water more necessary. But it is not necessary to understand this, and the foregoing clause, of what these passengers did for their own use, as they travelled through this, or such like places; but it may be meant of what pious persons had done before that time; who, having their hearts set upon God’s house, and the ways leading to it, and being desirous to advance the worship of God, and to encourage the people to come to Jerusalem, endeavoured to make those ways easy and convenient; and particularly because those eastern countries were hot and dry, and springs of water were scarce there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "84:1-7 The ordinances of God are the believer's solace in this evil world; in them he enjoys the presence of the living God: this causes him to regret his absence from them. They are to his soul as the nest to the bird. Yet they are only an earnest of the happiness of heaven; but how can men desire to enter that holy habitation, who complain of Divine ordinances as wearisome? Those are truly happy, who go forth, and go on in the exercise of religion, in the strength of the grace of Jesus Christ, from whom all our sufficiency is. The pilgrims to the heavenly city may have to pass through many a valley of weeping, and many a thirsty desert; but wells of salvation shall be opened for them, and consolations sent for their support. Those that press forward in their Christian course, shall find God add grace to their graces. And those who grow in grace, shall be perfect in glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who passing through the valley of Baca - This is one of the most difficult verses in the Book of Psalms, and has been, of course, very variously interpreted. The Septuagint and the Latin Vulgate, Luther, and Professor Alexander, render it a valley of tears. The word \"Baca\" (בכא  bâkâ') means properly weeping, lamentation; and then it is given to a certain tree - not probably a mulberry tree, but some species of balsam - from its weeping; that is, because it seemed to distil tears, or drops of balsam resembling tears in size and appearance. It is translated mulberry trees in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:23-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 14:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and so in the margin here, \"mulberry trees make him a well.\" There is no reason, however, to think that it has that meaning here. The true rendering is, \"valley of lamentation,\" or weeping; and it may have reference to some lonely valley in Palestine - where there was no water - a gloomy way - through which those commonly passed who went up to the place of worship. It would be vain, however, to attempt now to determine the locality of the valley referred to, as the name, if ever given to it, seems long since to have passed away. It may, however, be used as emblematic of human life - \"a vale of tears;\" and the passage may be employed as an illustration of the effect of religion in diffusing happiness and comfort where there was trouble and sorrow - as if fountains should be made to flow in a sterile and desolate valley.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Make it a well - Or, a fountain. That is, It becomes to the pilgrims as a sacred fountain. They \"make\" such a gloomy valley like a fountain, or like a road where fountains - full, free, refreshing - break forth everywhere to invigorate the traveler. Religious worship - the going up to the house of God - turns that in the journey of life which would otherwise be gloomy and sad into joy; makes a world of tears a world of comfort; has an effect like that of changing a gloomy path into one of pleasantness and beauty. The idea here is the same which occurs in Isaiah 35:7, \"And the parched ground shall become a pool\" (see the notes at that passage); and in Job 35:10, \"Who giveth songs in the night\" (see the notes at that passage); an idea which was so beautifully illustrated in the case of Paul and Silas in the jail at Philippi, when, at midnight they \"sang praises to God\" Acts 16:25, and which is so often illustrated in the midst of affliction and trouble. By the power of religion, by the presence of the Saviour, by the influence of the Holy Spirit, the Comforter, such times become seasons of purest joy - times remembered ever afterward with most fervent gratitude, as among the happiest periods of life. For religion can diffuse smiles over faces darkened by care; can light up the eye sunk in despondency; can change tears of sorrow into tears of joy; can impart peace in scenes of deepest sorrow; and make the most gloomy vales of life like green pastures illuminated by the brightness of noonday.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Make it a well - Or, a fountain. That is, It becomes to the pilgrims as a sacred fountain. They \"make\" such a gloomy valley like a fountain, or like a road where fountains - full, free, refreshing - break forth everywhere to invigorate the traveler. Religious worship - the going up to the house of God - turns that in the journey of life which would otherwise be gloomy and sad into joy; makes a world of tears a world of comfort; has an effect like that of changing a gloomy path into one of pleasantness and beauty. The idea here is the same which occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"And the parched ground shall become a pool\" (see the notes at that passage); and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Who giveth songs in the night\" (see the notes at that passage); an idea which was so beautifully illustrated in the case of Paul and Silas in the jail at Philippi, when, at midnight they \"sang praises to God\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 16:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and which is so often illustrated in the midst of affliction and trouble. By the power of religion, by the presence of the Saviour, by the influence of the Holy Spirit, the Comforter, such times become seasons of purest joy - times remembered ever afterward with most fervent gratitude, as among the happiest periods of life. For religion can diffuse smiles over faces darkened by care; can light up the eye sunk in despondency; can change tears of sorrow into tears of joy; can impart peace in scenes of deepest sorrow; and make the most gloomy vales of life like green pastures illuminated by the brightness of noonday.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The rain also filleth the pools - Margin, \"covereth.\" This is a still more difficult expression than the former. The Septuagint and the Vulgate render it, \"The teacher - the lawgiver - ὁ νομοθετῶν  ho nomothetōn - \"legislator\" - gives blessings.\" Luther, \"The teachers shall be adorned with many blessings.\" Gesenius, \"Yea, with blessings the autumnal rain doth cover it.\" DeWette, \"And with blessing the harvest-rain covers it,\" which he explains as meaning,\" Where they come, though it would be sorrow and tears, yet they are attended with prosperity and blessing.\" Professor Alexander, \"Also with blessings is the teacher clothed.\" The word rendered \"rain\" - מורה  môreh - is from ירה  yârâh, to throw, to cast, to place, to sprinkle, and may denote",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) an archer;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) the early rain",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) teaching, Isaiah 9:15; 2 Kings 17:28; or a teacher, Isaiah 30:20; Job 36:22.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) teaching, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or a teacher, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It is rendered rain, in the place before us; and former rain twice in Joel 2:23 (margin, a teacher). The word rendered \"filleth\" means properly to cover, and would be fitly so translated here. Compare Leviticus 13:45; Ezekiel 24:17, Ezekiel 24:22. The word has not naturally the idea of filling. The word rendered \"pools\" - ברכות  berâkôth - if pointed in one manner - ברכה  berêkâh (in the singular) - denotes a pond, pool, or basin of water; if pointed in another manner - ברכה  berâkâh - it means blessing, benediction, and is often so used in the Scriptures, Genesis 27:12; Genesis 28:4; Genesis 33:11; Proverbs 11:11,...The rendering of Gesenius, as above, \"Yea, with blessings the autumnal rain doth cover it,\" (that is, the valley so desolate in the heat of summer - the valley of weeping), would perhaps be the most natural, though it is not easy to see the connection according to this interpretation, or according to any other proposed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is rendered rain, in the place before us; and former rain twice in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (margin, a teacher). The word rendered \"filleth\" means properly to cover, and would be fitly so translated here. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 13:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 24:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 24:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word has not naturally the idea of filling. The word rendered \"pools\" - ברכות  berâkôth - if pointed in one manner - ברכה  berêkâh (in the singular) - denotes a pond, pool, or basin of water; if pointed in another manner - ברכה  berâkâh - it means blessing, benediction, and is often so used in the Scriptures, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",...The rendering of Gesenius, as above, \"Yea, with blessings the autumnal rain doth cover it,\" (that is, the valley so desolate in the heat of summer - the valley of weeping), would perhaps be the most natural, though it is not easy to see the connection according to this interpretation, or according to any other proposed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Least of all is it easy to see the connection according to the translation of the Septuagint, the Vulgate, Luther, and Prof. Alexander. Perhaps the connection in the mind of the author of the psalm may have been this. He sees the sterile and desolate valley through which the pilgrims are passing made joyous by the cheerfulness - the happiness - the songs - of those who are on their way to the house of God. This fact - this image - suggests to him the idea that this is similar to the effect which is produced in that valley when copious rains descend upon it, and when, though commonly desolate, it is covered with grass and flowers, or is \"blessed\" by the rain. This latter image is to his mind an illustration of the happy scene now before him in the cheerful and exulting movements of the pilgrims on their way to the house of God. The one suggests the other; and the psalmist has a combined image before his mind, the one illustrating the other, and both showing how a vale naturally desolate and sterile may be made cheerful and joyous. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Least of all is it easy to see the connection according to the translation of the Septuagint, the Vulgate, Luther, and Prof. Alexander. Perhaps the connection in the mind of the author of the psalm may have been this. He sees the sterile and desolate valley through which the pilgrims are passing made joyous by the cheerfulness - the happiness - the songs - of those who are on their way to the house of God. This fact - this image - suggests to him the idea that this is similar to the effect which is produced in that valley when copious rains descend upon it, and when, though commonly desolate, it is covered with grass and flowers, or is \"blessed\" by the rain. This latter image is to his mind an illustration of the happy scene now before him in the cheerful and exulting movements of the pilgrims on their way to the house of God. The one suggests the other; and the psalmist has a combined image before his mind, the one illustrating the other, and both showing how a vale naturally desolate and sterile may be made cheerful and joyous. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. valley of Baca—or, \"weeping.\" Through such, by reason of their dry and barren condition, the worshippers often had to pass to Jerusalem. As they might become wells, or fountains, or pools, supplied by refreshing rain, so the grace of God, by the exercises of His worship, refreshes and revives the hearts of His people, so that for sorrows they have \"rivers of delight\" (Ps 36:8; 46:4).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Passing; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being used to pass",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for he seems not to speak of one particular act, but of a common course or custom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Baca; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a place, so called, which some Jewish and other writers affirm to have been a very dry place, and therefore incommodious for travellers in those hot countries, and in hot seasons; which place may be here mentioned not exclusively to other ways and passages, for this highway being but one, and on one side of Jerusalem, could not be a general way for all the Israelites thither, but synecdochically for all places of like nature, which made their journey to Jerusalem unpleasant or inconvenient. But their zeal for God’s service did easily overcome this and other difficulties. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the valley of tears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as this valley might be called, for the trouble or vexation which travellers found there by reason of drought, or otherwise. A well, or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wells",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. they dig divers little pits or wells in it for their relief. This trouble they willingly undertook rather than to neglect the opportunity of going up to Jerusalem at their solemn times. And possibly they did this, not only for themselves, but for the benefit of other travellers who came after them; whereby they showed both their piety and charity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The rain also filleth the pools; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God recompenseth their diligence in making pits, or little pools, or cisterns with his blessing, sending rain wherewith they may be filled, and the thirsty travellers refreshed. Possibly the words may be thus rendered, which is more agreeable to the order of the Hebrew text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "also",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (and so the Hebrew particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hath that emphasis which, as some learned interpreters observe, is not given to it in other translations; they do not only make little pits or wells, as it was now said, but also,)",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " pools",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cisterns",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (for this Hebrew word is by the learned rendered both ways) which (so the relative particle is to be understood, as it is very frequently in many texts of Scripture) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the rain filleth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may fill",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. which may receive and keep the rain which God sendeth for the refreshment of these travellers, whose great numbers made the provision of water more necessary. But it is not necessary to understand this and the foregoing clause of what these passengers did for their own use, as they travelled through this or such, like places; but it may be meant of what pious persons did before that time, who, having their hearts set upon God’s house, and the pathways leading to it, as was said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 84:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and being desirous to advance the worship of God, and to encourage the people to come to Jerusalem, endeavoured to make those ways (some parts whereof were very incommodious) easy and convenient; and particularly, because those Eastern countries were hot and dry, and springs of water were scarce there, as we may learn from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 26:15 Judges 1:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 1:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and many other passages of sacred Scripture and other authors, which was a great annoyance to travellers, they made these pits and pools or cisterns in such places where they were most necessary, and through which great numbers of people passed in their journey to the house of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who passing through the valley of Baca,.... Kimchi interprets it a valley of springs, or fountains, taking the word to be of the same signification as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 38:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and mention being made of a well and pools in it, or of mulberry trees, which grow, as he says, in a place where there is no water, and such a place was this; and therefore pools or ditches were dug in it, and built of stone, to catch rain water for the supply of travellers; and so Aben Ezra says, it is the name of a place or valley where were trees, called mulberries; and is by some thought to be the same with the valley of Rephaim, where we read of mulberry trees, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Septuagint render it \"the valley of weeping\", and the Vulgate Latin version \"the valley of tears\"; which have led some interpreters to think of Bochim, a place so called from the children of Israel weeping there, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it does not seem to design any particular place, through which all the males could not pass from the different parts of the land of Israel, as they came to Zion at the three grand festivals; but any difficult and troublesome place, any rough valley, or dry and thirsty land, where there was no water: so saints are passengers, travellers, or pilgrims, in this world, and often pass through a valley; are in a low valley, through the weakness of grace; a rough one, through affliction; and a dark one, through desertion and temptation; and a valley of weeping and tears, on account both of outward and inward trials. The way to Zion, or to the house and ordinances of God below, lies through the valley of weeping; none come rightly thither but who come weeping over their sins and unworthiness; or by repentance towards God, and by looking by faith to Christ whom they have pierced, and mourning for it; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the way to Zion above lies through a vale of tears, shed in plenty by reason of sin, a man's own, original and actual, the sins of professors and profane, by reason of Satan's temptations, the hidings of God's face, and the distresses, divisions, and declensions of Zion; yet relief is afforded, help is given, refreshment is had, in this valley, for such passengers: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they make it a well; either the valley a well with their tears, an hyperbolical expression, like that in Lamentations 2:18 or they account it as such, a dry valley, as if it was a well watered place; look upon all their toil and labour in going to the house of God as a pleasure; and esteem all reproach, afflictions, and persecutions, they meet with from the world, or relations, for the sake of religion, as riches and honours; or they find a supply, which is kindly and graciously given, even rivers in high places, and fountains in the midst of valleys, streams of divine love, and precious promises in a wilderness, Isaiah 41:18 \"or make him a well\" (a): that is, God himself; they account of him as such; they find him to be so, and make use of him as one, who is a well of living waters; such are his love, his covenant, and his grace; such are his Son and his fulness, his Spirit, the gifts and graces of it; all which yield a rich supply: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they make it a well; either the valley a well with their tears, an hyperbolical expression, like that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or they account it as such, a dry valley, as if it was a well watered place; look upon all their toil and labour in going to the house of God as a pleasure; and esteem all reproach, afflictions, and persecutions, they meet with from the world, or relations, for the sake of religion, as riches and honours; or they find a supply, which is kindly and graciously given, even rivers in high places, and fountains in the midst of valleys, streams of divine love, and precious promises in a wilderness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"or make him a well\" (a): that is, God himself; they account of him as such; they find him to be so, and make use of him as one, who is a well of living waters; such are his love, his covenant, and his grace; such are his Son and his fulness, his Spirit, the gifts and graces of it; all which yield a rich supply: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the rain also filleth the pools; of the word and ordinances: \"or the rain covereth with blessings\" (b); the rain of divine love covers the passengers with spiritual blessings, which flow from it; Christ, whose coming is compared to the rain, brings a train of blessings with him to his people; and the Gospel, which drops as the rain, and distils as the dew, is full of the blessings of Christ; is a glorious revelation of them, and is the means of conveying them to the saints; or the \"teacher covereth\", or \"is covered with blessings\" (c); the great Teacher of all, God, Father, Son, and Spirit; the Father teaches all his children to great profit and advantage, and covers or blesses them with all spiritual blessings; the Son is a teacher come from God, and is covered or loaded with the blessings of goodness, and communicates them to his disciples and followers; and the Spirit teacheth all things, and takes of the things of Christ, the blessings of his grace, and covers his people with them; and all under teachers, ministers of the Gospel, are clothed with salvation, and come forth in the fulness of the blessing of the Gospel of Christ. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a)  \"fontem constituunt eum\", Junius & Tremellius, Piscator, Ainsworth; \"Deum ipsum\", Piscator, Gejerus, Michaelis. (b)   \"quam in benedictionibus operit pluvia\", Cocceius. (c) \"Benedictionibus operietur docens\", Montanus; \"benedictiones induit doctor\", Gejerus, Michaelis; so Gussetius, p. 725. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a)  \"fontem constituunt eum\", Junius & Tremellius, Piscator, Ainsworth; \"Deum ipsum\", Piscator, Gejerus, Michaelis. (b)   \"quam in benedictionibus operit pluvia\", Cocceius. (c) \"Benedictionibus operietur docens\", Montanus; \"benedictiones induit doctor\", Gejerus, Michaelis; so Gussetius, p. 725. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who passing through the valley of {c} Baca make it a well; the rain also filleth the pools.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "Who",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " passing through the valley of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Baca make it a well; the rain also filleth the pools.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) So that the poor birds have more freedom than I.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Passing through the vale of Baca they make it a place of springs,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Yea, the early rain clotheth it with blessings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Baca",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is derived from the root which means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to weep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but it nowhere means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "weeping",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for which words of a different form are used. Here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it probably denotes some kind of balsam-tree, so called from the ‘tears’ of gum which it exudes. The vale of Baca or the balsam-trees was some vale which, like the vale of Elah or the terebinth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the vale of Shittim or acacias, took its name from the trees which grew there. Balsam-trees are said to love dry situations, growing plentifully for example in the arid valley of Mecca; and this is clearly the point of the reference. The vale of Baca was some waterless and barren valley through which pilgrims passed on their way to Jerusalem; but faith turns it into a place of springs, finding refreshment under the most untoward circumstances, while God refreshes them with showers of blessing from above, as the autumnal rains clothe the dry plains with grass and flowers. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; and see Tristram’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Natural Hist. of the Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 30, 455, for a graphic description of the marvellous way in which the rains in Palestine transform the country from a brown and dusty desert to a lovely garden. Once more we have to note the singularly bold use of metaphor which is characteristic of this poet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The familiar phrase ‘the vale of tears’ comes from the Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vallis lacrimarum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and it is possible that such an allusion to the derivation of the word is intended. It is natural to regard the pilgrim’s experience as a parable of the pilgrimage of life, but this secondary application must not be allowed to supersede the original meaning.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This verse has suffered a strange fate in translation. The English Versions follow Jewish authorities in taking ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "berâchôth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the plural of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "berçchâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘a pool,’ not, as it must be, of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "berâchâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘blessing.’ The LXX renders. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The lawgiver shall give blessings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", taking ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "môreh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to be connected with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tôrâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", law: and similarly Jerome, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The teacher shall be clothed with blessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a rendering followed by Luther.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who passing through the valley of Baca make it a wall;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "through the valley of weeping",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τὴν κοιλάδα τοῦ κλαυθμῶνος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", LXX.). So Hupfeld. Hengstenberg, Kay, and the Revised Version; compare Hosea's \"valley of Achor,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"of Grief.\" When the righteous pass through a time of suffering or calamity, they turn it into a time of refreshment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The rain also filleth the pools;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "early",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rain (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "covereth it with blessings.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The rain of God's grace mantles all the valley with a luxuriant vegetation; in other words, the blessing of God rests on those who act as above described, and causes them ever to increase in righteousness and true holiness. Psalm 84:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This second half takes up the \"blessed\" of the distichic epode (epoodo's) of the first, and consequently joins member to member chain-like on to it. Many hindrances must be cleared away if the poet is to get back to Zion, his true home; but his longing carries the surety within itself of its fulfilment: blessed, yea in himself blessed, is the man, who has his strength (עוז only here plene) in God, so that, consequently, the strength of Him to whom all things are possible is mighty in his weakness. What is said in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is less adapted to be the object of the being called blessed than the result of that blessed relationship to God. What follows shows that the \"high-roads\" are not to be understood according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., or any other passage, as an ethical, notional figure (Venema, Hengstenberg, Hitzig, and others), but according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with Aben-Ezra, Vatablus, and the majority of expositors, of the roads leading towards Zion; not, however, as referring to the return from the Exile, but to the going up to a festival: the pilgrim-high-roads with their separate halting-places (stations) were constantly present to the mind of such persons. And though they may be driven never so far away from them, they will nevertheless reach the goal of their longing. The most gloomy present becomes bright to them: passing through even a terrible wilderness, they turn it (ישׁיתהו) into a place of springs, their joyous hope and the infinite beauty of the goal, which is worth any amount of toil and trouble, afford them enlivening comfort, refreshing strengthening in the midst of the arid steppe. עמק הבּכא does not signify the \"Valley of weeping,\" as Hupfeld at last renders it (lxx κοιλάδα τοῦ κλαυθμῶνος), although Burckhardt found a [Arab.] wâdı̂ 'l-bk' (Valley of weeping) in the neighbourhood of Sinai. In Hebrew \"weeping\" is בּכי, בּכה, בּכוּת, not בּכא, Rnan, in the fourth chapter of his Vie de Jsus, understands the expression to mean the last station of those who journey from northern Palestine on this side of the Jordan towards Jerusalem, viz., Ain el-Haramı̂je, in a narrow and gloomy valley where a black stream of water flows out of the rocks in which graves are dug, so that consequently עמק הככא signifies Valley of tears or of trickling waters. But such trickling out of the rock is also called בּכי, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 28:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and not בּכא. This latter is the singular to בּכאים in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. נכאים, צבאים, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the name of a tree, and, according to the old Jewish lexicographers, of the mulberry-tree (Talmudic תּוּת, Arab. tût); but according to the designation, of a tree from which some kind of fluid flows, and such a tree is the Arab. baka'un, resembling the balsam-tree, which is very common in the arid valley of Mecca, and therefore might also have given its name to some arid valley of the Holy Land (vid., Winer's Realwrterbuch, s.v. Bacha), and, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:22-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to one belonging, as it would appear, to the line of valley which leads from the coasts of the Philistines to Jerusalem. What is spoken of in passages like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as being wrought by the omnipotence of God, who brings His people home to Zion, appears here as the result of the power of faith in those who, keeping the same end of their journeyings in view, pass through the unfruitful sterile valley. That other side, however, also does not remain unexpressed. Not only does their faith bring forth water out of the sand and rock of the desert, but God also on His part lovingly anticipates their love, and rewardingly anticipates their faithfulness: a gentle rain, like that which refreshes the sown fields in the autumn, descends from above and enwraps it (viz., the Valley of Baca) in a fulness of blessing (יעטּה, Hiphil with two accusatives, of which one is to be supplied: cf. on the figure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 65:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The arid steppe becomes resplendent with a flowery festive garment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), not to outward appearance, but to them spiritually, in a manner none the less true and real. And whereas under ordinary circumstances the strength of the traveller diminishes in proportion as he has traversed more and more of his toilsome road, with them it is the very reverse; they go from strength to strength (cf. on the expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., they receive strength for strength (cf. on the subject-matter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that an ever increasing strength, the nearer they come to the desired goal, which also they cannot fail to reach. The pilgrim-band (this is the subject to יראה), going on from strength to (אל) strength, at last reaches, attains to (אל instead of the אל־פּני used in other instances) Elohim in Zion. Having reached this final goal, the pilgrim-band pours forth its heart in the language of prayer such as we have in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the music here strikes up and blends its sympathetic tones with this converse of the church with its God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The poet, however, who in spirit accompanies them on their pilgrimage, is now all the more painfully conscious of being at the present time far removed from this goal, and in the next strophe prays for relief. He calls God מגנּנוּ (as in Psalm 59:12), for without His protection David's cause is lost. May He then behold (ראה, used just as absolutely as in 2 Chronicles 24:22, cf. Lamentations 3:50), and look upon the face of His anointed, which looks up to Him out of the depth of its reproach. The position of the words shows that מגנּנוּ is not to be regarded as the object to ראה, according to Psalm 89:19 (cf. Psalm 47:10) and in opposition to the accentuation, for why should it not then have been אלהים ראה מגננו? The confirmation (Psalm 84:11) puts the fact that we have before us a Psalm belonging to the time of David's persecution by Absalom beyond all doubt. Manifestly, when his king prevails, the poet will at the same time (cf. David's language, 2 Samuel 15:25) be restored to the sanctuary. A single day of his life in the courts of God is accounted by him as better than a thousand other days (מאלף with Olewejored and preceded by Rebia parvum). He would rather lie down on the threshold (concerning the significance of this הסתּופף in the mouth of a Korahite, vid., supra, p. 311) in the house of his God than dwell within in the tents of ungodliness (not \"palaces,\" as one might have expected, if the house of God had at that time been a palace). For how worthless is the pleasure and concealment to be had there, when compared with the salvation and protection which Jahve Elohim affords to His saints! This is the only instance in which God is directly called a sun (שׁמשׁ) in the sacred writings (cf. Sir. 42:16). He is called a shield as protecting those who flee to Him and rendering them inaccessible to their foes, and a sun as the Being who dwells in an unapproachable light, which, going forth from Him in love towards men, is particularized as חן and כבוד, as the gentle and overpowering light of the grace and glory (χάρις and δόξα) of the Father of Lights. The highest good is self-communicative (communicativum sui). The God of salvation does not refuse any good thing to those who walk בּתמים (בּדרך תמים, Psalm 101:6; cf. on Psalm 15:2). Upon all receptive ones, i.e., all those who are desirous and capable of receiving His blessings, He freely bestows them out of the abundance of His good things. Strophe and anti-strophe are doubled in this second half of the song. The epode closely resembles that which follows the first half. And this closing ashrê is not followed by any Sela. The music is hushed. The song dies away with an iambic cadence into a waiting expectant stillness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The poet, however, who in spirit accompanies them on their pilgrimage, is now all the more painfully conscious of being at the present time far removed from this goal, and in the next strophe prays for relief. He calls God מגנּנוּ (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for without His protection David's cause is lost. May He then behold (ראה, used just as absolutely as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 24:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 3:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and look upon the face of His anointed, which looks up to Him out of the depth of its reproach. The position of the words shows that מגנּנוּ is not to be regarded as the object to ראה, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 47:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and in opposition to the accentuation, for why should it not then have been אלהים ראה מגננו? The confirmation (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") puts the fact that we have before us a Psalm belonging to the time of David's persecution by Absalom beyond all doubt. Manifestly, when his king prevails, the poet will at the same time (cf. David's language, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") be restored to the sanctuary. A single day of his life in the courts of God is accounted by him as better than a thousand other days (מאלף with Olewejored and preceded by Rebia parvum). He would rather lie down on the threshold (concerning the significance of this הסתּופף in the mouth of a Korahite, vid., supra, p. 311) in the house of his God than dwell within in the tents of ungodliness (not \"palaces,\" as one might have expected, if the house of God had at that time been a palace). For how worthless is the pleasure and concealment to be had there, when compared with the salvation and protection which Jahve Elohim affords to His saints! This is the only instance in which God is directly called a sun (שׁמשׁ) in the sacred writings (cf. Sir. 42:16). He is called a shield as protecting those who flee to Him and rendering them inaccessible to their foes, and a sun as the Being who dwells in an unapproachable light, which, going forth from Him in love towards men, is particularized as חן and כבוד, as the gentle and overpowering light of the grace and glory (χάρις and δόξα) of the Father of Lights. The highest good is self-communicative (communicativum sui). The God of salvation does not refuse any good thing to those who walk בּתמים (בּדרך תמים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 101:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Upon all receptive ones, i.e., all those who are desirous and capable of receiving His blessings, He freely bestows them out of the abundance of His good things. Strophe and anti-strophe are doubled in this second half of the song. The epode closely resembles that which follows the first half. And this closing ashrê is not followed by any Sela. The music is hushed. The song dies away with an iambic cadence into a waiting expectant stillness. ",
            "children": []
          }
        ]
      }
    ]
  }
]