[{"num":18,"verse":"¶ The priests the Levites and all the tribe of Levi shall have no part nor shall they inherit with Israel; they shall eat of the offerings on fire unto the LORD and of his inheritance."},{"num":2,"verse":"Therefore, shall they have no inheritance among their brethren; the LORD is their inheritance, as he has said unto them."},{"num":3,"verse":"And this shall be the right of the priest from the people, from those that offer a sacrifice, whether it be ox or sheep; they shall give unto the priest the shoulder and the two cheeks and the maw."},{"num":4,"verse":"The firstfruits also of thy grain, of thy wine, and of thine oil, and the firstfruits of the fleece of thy sheep, shalt thou give him;"},{"num":5,"verse":"for the LORD thy God has chosen him out of all thy tribes to stand to minister unto the name of the LORD, him and his sons all the days."},{"num":6,"verse":"And when a Levite comes from any of thy gates out of all Israel, where he sojourned, and comes with all the desire of his soul unto the place which the LORD shall choose,"},{"num":7,"verse":"then he shall minister unto the name of the LORD his God, as all his brethren the Levites do who stand there before the LORD."},{"num":8,"verse":"They shall have like portions to eat besides that which comes of the sale of his patrimony."},{"num":9,"verse":"¶ When thou shall have come into the land which the LORD thy God gives thee, thou shalt not learn to do after the abominations of those Gentiles."},{"num":10,"verse":"There shall not be found among you any one that makes his son or his daughter to pass through the fire or that uses divination or an observer of times or an enchanter or a witch"},{"num":11,"verse":"or a charmer or a spiritist or a diviner or a necromancer."},{"num":12,"verse":"For anyone that does these things is an abomination unto the LORD, and because of these abominations the LORD thy God drove them out from before thee."},{"num":13,"verse":"Thou shalt be perfect with the LORD thy God."},{"num":14,"verse":"For these Gentiles, whom thou shalt inherit, hearkened unto observers of times and unto diviners, but as for thee, the LORD thy God has not allowed thee to do so."},{"num":15,"verse":"¶ The LORD thy God will raise up unto thee a Prophet from the midst of thee, of thy brethren, like unto me; unto him ye shall hearken,"},{"num":16,"verse":"according to all that thou didst desire of the LORD thy God in Horeb in the day of the assembly, saying, Let me not hear again the voice of the LORD my God, neither let me see this great fire any more, lest I die."},{"num":17,"verse":"And the LORD said unto me, They have well spoken that which they have spoken."},{"num":18,"verse":"I will raise them up a Prophet from among their brethren, like unto thee, and will put my words in his mouth; and he shall speak unto them all that I shall command him."},{"num":19,"verse":"And it shall come to pass that whoever will not hearken unto my words which he shall speak in my name, I will require it of him."},{"num":20,"verse":"But the prophet which shall presume to speak a word in my name which I have not commanded him to speak or that shall speak in the name of other gods, even that prophet shall die."},{"num":21,"verse":"And if thou say in thine heart, How shall we know the word which the LORD has not spoken?"},{"num":22,"verse":"When a prophet speaks in the name of the LORD, if the thing does not follow nor come to pass, it is a word which the LORD has not spoken, but the prophet has spoken it presumptuously; thou shalt not be afraid of him."}]