[{"header":"The fly in the ointment—the infidelity of my own race"},{"num":1,"verse":"Before Christ and my own conscience I assure you that I am speaking the plain truth when I say that there is something that makes me feel very depressed, like a pain that never leaves me. It is the condition of my brothers and fellow-Israelites, and I have actually reached the pitch of wishing myself cut off from Christ if it meant that they could be won for God."},{"num":4,"verse":"Just think what the Israelites have had given to them. The privilege of being adopted as sons of God, the experience of seeing something of the glory of God, the receiving of the agreements made with God, the gift of the Law, true ways of worship, God’s own promises—all these are theirs, and so too, as far as human descent goes, is Christ himself, Christ who is God over all, blessed for ever."},{"header":"God’s purpose is not utterly defeated by this infidelity"},{"num":6,"verse":"Now this does not mean that God’s word to Israel has failed. For you cannot count all “Israelites” as the true Israel of God. Nor can all Abraham’s descendants be considered truly children of Abraham. The promise was that ‘in Isaac your seed shall be called’."},{"num":8,"verse":"That means that it is not the natural descendants who automatically inherit the promise, but, on the contrary, that the children of the promise (i.e. sons of God) are to be considered truly Abraham’s children. For it was a promise when God said: ‘At this time I will come and Sarah shall have a son’. (Everybody, remember, thought it quite impossible for Sarah to have a child.) And then, again, a word of promise came to Rebecca, at the time when she was pregnant with two children by the one man, Isaac our forefather. It came before the children were born or had done anything good or bad, plainly showing that God’s act of choice has nothing to do with achievements, good or bad, but is entirely a matter of his will. The promise was: ‘The older shall serve the younger’."},{"num":13,"verse":"And we get a later endorsement of this divine choice in the words:  ‘Jacob I have loved, but Esau I have hated’."},{"header":"We must not jump to conclusions about God"},{"num":14,"verse":"Now do we conclude that God is monstrously unfair? Never! God said long ago to Moses: ‘I will have mercy on whomever I will have mercy, and I will have compassion on whomever I will have compassion’."},{"num":16,"verse":"It is obviously not a question of human will or human effort, but of divine mercy. The scripture says to Pharaoh: ‘Even for this same purpose I have raised you up, that I might show my power in you, and that my name shall be declared in all the earth’."},{"num":18,"verse":"It seems plain, then, that God chooses on whom he will have mercy, and whom he will harden in their sin."},{"num":19,"verse":"Of course I can almost hear your retort: “If this is so, and God’s will is irresistible, why does God blame men for what they do?” But the question really is this: “Who are you, a man, to make any such reply to God?” When a craftsman makes anything he doesn’t expect it to turn round and say,  ‘Why did you make me like this?’"},{"num":21,"verse":"The potter, for instance, is always assumed to have complete control over the clay, making with one part of the lump a lovely vase, and with another a pipe for sewage. Can we not assume that God has the same control over human clay? May it not be that God, though he must sooner or later expose his wrath against sin and show his controlling hand, has yet most patiently endured the presence in his world of things that cry out to be destroyed? Can we not see, in this, his purpose in demonstrating the boundless resources of his glory upon those whom he considers fit to receive his mercy, and whom he long ago planned to raise to glorious life? And by these chosen people I mean you and me, whom he has called out from both Jews and Gentiles. He says in Hosea:  ‘I will call them my people, who were not my people, and her beloved, who was not beloved’. ‘And it shall come to pass in the place where it was said to them, You are not my people, there they will be called sons of the living God’."},{"num":27,"verse":"And Isaiah, speaking about Israel, proclaims: ‘though the number of the children of Israel be as the sand of the sea, the remnant will be saved. For he will finish the work and cut it short in righteousness, because the Lord will make a short work upon the earth’."},{"num":29,"verse":"And previously, Isaiah said: ‘Unless the Lord of Sabaoth had left us a seed, we would have become like Sodom and we would have been made like Gomorrah’."},{"header":"At present the gentiles have gone further than the Jews"},{"num":30,"verse":"Now, how far have we got? That the Gentiles who never had the Law’s standard of righteousness to guide them, have attained righteousness, righteousness-by-faith. but Israel, following the Law of righteousness, failed to reach the goal of righteousness. And why? Because their minds were fixed on what they achieved instead of on what they believed. They tripped over that very stone the scripture mentions: ‘Behold, I lay in Zion a stumbling stone and rock of offence, and whoever believes on him will not be put to shame’."}]