[{"num":20,"verse":"Now on the Yom Rishon, Miryam of Magdala comes early, while it was still dark, to the kever (tomb) and sees the stone having been taken away from the kever."},{"num":2,"verse":"Miryam of Magdala runs therefore and comes to Shimon Kefa and to the talmid ha’ahuv and says to them, They have taken Adoneinu from the kever (tomb) and we do not have da’as where they placed him."},{"num":3,"verse":"Therefore, Shimon Kefa went forth and the other talmid, and they were coming to the kever (tomb),"},{"num":4,"verse":"And were running, the two together and the other talmid ran ahead faster than Kefa, and came first to the kever,"},{"num":5,"verse":"And having stooped down, the other talmid [talmid ha’ahuv] sees the tachrichin linen clothes lying there. However, he did not enter the kever."},{"num":6,"verse":"Then comes also Shimon Kefa following him and Shimon Kefa entered into the kever (tomb), and sees the tachrichin linen clothes lying there."},{"num":7,"verse":"And also the mitznefet (head wrapping), which had been upon the rosh of Rebbe, Melech HaMoshiach, the mitznefet not lying with the tachrichin, but apart, having been folded up in one place."},{"num":8,"verse":"Then, therefore, entered also the other talmid, the one having come first to the kever (tomb), and he saw and had emunah (faith)."},{"num":9,"verse":"For they did not yet have da’as of the Kitvei Hakodesh that it is necessary for Rebbe, Melech HaMoshiach to have his Techiyas HaMoshiach. [TEHILLIM 16:9; YESHAYAH 53:10]"},{"num":10,"verse":"Then the talmidim went away again to their own homes."},{"num":11,"verse":"Now Miryam had stood at the kever (tomb) outside weeping. Then, as she was weeping, she bent down into the kever (tomb)"},{"num":12,"verse":"And sees two malachim (angels) in white, sitting, one at the head and one at the feet, where the Guf of Yehoshua had previously been lying."},{"num":13,"verse":"And those ones say to her, Isha, why do you weep? She says to them, They took Adoni, and I don’t have da’as of where they placed him."},{"num":14,"verse":"When she had said these things, she turned back around, and she sees Yehoshua standing there, and she did not have da’as that it was Yehoshua."},{"num":15,"verse":"Rebbe, Melech HaMoshiach says to her, Isha, why do you weep? Whom do you seek? Miryam, supposing that he was the shomer hagahn (the keeper of the garden), says to him, Adon, if you carried him away, tell me where you placed him, and I’ll take him."},{"num":16,"verse":"He says to her, Miryam. She turns and she says to him in Ivrit, Rabboni. (This means mori [my teacher].)"},{"num":17,"verse":"He says to her, Do not hold on to me, for I have not yet made the aliyah ascent to HaAv; but go to my Achim and tell them, I make the aliyah ascent to Avi and to Avichem, to Elohai and Eloheichem. [TEHILLIM 22:23]"},{"num":18,"verse":"Miryam from Magdala comes announcing to the talmidim, I have seen HaAdon [MALACHI 3:1]. And she told them that He had said to her these things."},{"num":19,"verse":"On that Yom Rishon, when it was erev, and the delatot (doors) having been shut where the talmidim were, because of fear of those of Yehudah, then came Rebbe, Melech HaMoshiach and stood in the midst and says to them, Shalom Aleichem!"},{"num":20,"verse":"And having said this, He showed his hands and his side to them. Therefore, the talmidim were filled with simcha at having seen HaAdon (MALACHI 3:1)."},{"num":21,"verse":"Therefore He said to them again, Shalom Aleichem! As HaAv has sent Me, so also I send you. [BERESHIS 2:7; YECHEZKEL 37:9]"},{"num":22,"verse":"And having said this, Moshiach breathed on them and says to them, Receive the Ruach Hakodesh."},{"num":23,"verse":"If you grant selicha to the averos of any, they have selicha; if there be any whose averos you retain, they are retained. [Mt 16:19; 18:18; Ac 8:17-24]"},{"num":24,"verse":"But T’oma, one of the Sheneym Asar, the one being called Didymus, was not with them when He came."},{"num":25,"verse":"Therefore the other talmidim were saying to him, Ra’i’nu es Rebbe, Melech HaMoshiach Adoneinu (We have seen Rebbe, Melech HaMoshiach Adoneinu!) But T’oma said to them, Unless I see in his hands the mark of the nails and I put my finger into the place of the nails and also put my hand into his side, I will never have emunah (faith)."},{"num":26,"verse":"And after shmonah yamim (eight days) again the talmidim of Rebbe, Melech HaMoshiach were inside, and T’oma with them. Although the delatot were shut, He comes and stood in the midst and said, Shalom Aleichem."},{"num":27,"verse":"Then He says to T’oma, Bring your finger here and see My hands, and bring your hand and put it into My side, and do not be without emunah but be a ma’amin (Messianic believer)."},{"num":28,"verse":"In reply, T’oma said to Rebbe, Melech HaMoshiach, Adoni and Elohai! [TEHILLIM 35:23]"},{"num":29,"verse":"And Rebbe, Melech HaMoshiach says to him, Because you have seen Me, you have emunah (faith)? Ashrey (Happy) are the ones not having seen and having emunah."},{"num":30,"verse":"Therefore, many other otot (miraculous signs) Rebbe, Melech HaMoshiach also did before the talmidim, which have not been written in this sefer."},{"num":31,"verse":"But these things have been written that you might have emunah that Yehoshua is the Rebbe, Melech HaMoshiach, the Ben HaElohim, and that, believing with emunah, you may have Chayyim (Life) b’Shem of Him."}]