[{"num":20,"verse":"Before the sun had risen on Sunday morning, Mary Magdalene made a trip to the tomb where His body was laid to rest. In the darkness, she discovered the covering had been rolled away. "},{"num":2,"verse":"She darted out of the garden to find Simon Peter and the dearly loved disciple to deliver this startling news."},{"num":3,"verse":"Together, they all departed for the tomb to see for themselves. "},{"num":4,"verse":"They began to run, and Peter could not keep up. The beloved disciple arrived first "},{"num":5,"verse":"but did not go in. There was no corpse in the tomb, only the linens and cloths He was wrapped in. "},{"num":6,"verse":"When Simon Peter finally arrived, he went into the tomb and observed the same: "},{"num":7,"verse":"the cloth that covered His face appeared to have been folded carefully and placed, not with the linen cloths, but to the side. "},{"num":8,"verse":"After Peter pointed this out, the other disciple (who had arrived long before Peter) also entered the tomb; and based on what he saw, faith began to well up inside him! "},{"num":9,"verse":"Before this moment, none of them understood the Scriptures and why He must be raised from the dead. "},{"num":10,"verse":"Then they all went to their homes."},{"num":11,"verse":"Mary, however, stood outside the tomb sobbing, crying, and kneeling at its entrance. "},{"num":12,"verse":"As she cried, two heavenly messengers appeared before her sitting where Jesus’ head and feet had been laid."},{"num":14,"verse":"After uttering these words, she turned around to see Jesus standing before her, but she did not recognize Him."},{"num":18,"verse":"Mary Magdalene obeyed and went directly to His disciples."},{"num":19,"verse":"On that same evening (Resurrection Sunday), the followers gathered together behind locked doors in fear that some of the Jewish leaders in Jerusalem were still searching for them. Out of nowhere, Jesus appeared in the center of the room."},{"num":20,"verse":"As He was speaking, He revealed the wounds in His hands and side. The disciples began to celebrate as it sank in that they were really seeing the Lord."},{"num":22,"verse":"Now He drew close enough to each of them that they could feel His breath. He breathed on them:"},{"num":24,"verse":"All of the eleven were present with the exception of Thomas. "},{"num":25,"verse":"He heard the accounts of each brother’s interaction with the Lord."},{"num":26,"verse":"Eight days later, they gathered again behind locked doors; and Jesus reappeared. This time Thomas was with them."},{"num":27,"verse":"He drew close to Thomas."},{"num":30,"verse":"Jesus performed many other wondrous signs that are not written in this book. "},{"num":31,"verse":"These accounts are recorded so that you, too, might believe that Jesus is the Anointed, the Liberating King, the Son of God, because believing grants you the life He came to share."}]