[{"num":40,"verse":"And the Lord said to Moses,"},{"num":2,"verse":"On the first day of the first month you shall set up the tabernacle of the Tent of Meeting [of God with you]."},{"num":3,"verse":"And you shall put in it the ark of the Testimony and screen the ark [of God’s Presence] with the veil."},{"num":4,"verse":"You shall bring in the [showbread] table and set in order the things that are to be upon it; and you shall bring in the lampstand and set up and light its lamps."},{"num":5,"verse":"You shall set the golden altar for the incense before the ark of the Testimony [outside the veil] and put the hanging or screen at the tabernacle door."},{"num":6,"verse":"You shall set the altar of the burnt offering before the door of the tabernacle of the Tent of Meeting."},{"num":7,"verse":"And you shall set the laver between the Tent of Meeting and the altar and put water in it."},{"num":8,"verse":"And you shall set up the court [curtains] round about and hang up the hanging or screen at the court gate."},{"num":9,"verse":"You shall take the anointing oil and anoint the tabernacle and all that is in it, and shall consecrate it and all its furniture, and it shall be holy."},{"num":10,"verse":"You shall anoint the altar of burnt offering and all its utensils; and consecrate (set apart for God) the altar, and the altar shall be most holy."},{"num":11,"verse":"And you shall anoint the laver and its base and consecrate it."},{"num":12,"verse":"You shall bring Aaron and his sons to the door of the Tent of Meeting and wash them with water."},{"num":13,"verse":"You shall put on Aaron the holy garments, and anoint and consecrate him, so he may serve Me as priest."},{"num":14,"verse":"And you shall bring his sons and put long and sleeved tunics on them,"},{"num":15,"verse":"And you shall anoint them as you anointed their father, that they may minister to Me as priests; for their anointing shall be to them for an everlasting priesthood throughout their generations."},{"num":16,"verse":"Thus did Moses; according to all that the Lord commanded him, so he did."},{"num":17,"verse":"And on the first day of the first month in the second year the tabernacle was erected."},{"num":18,"verse":"Moses set up the tabernacle, laid its sockets, set up its boards, put in its bars, and erected its pillars."},{"num":19,"verse":"[Moses] spread the tent over the tabernacle and put the covering of the tent over it, as the Lord had commanded him."},{"num":20,"verse":"He took the Testimony [the Ten Commandments] and put it into the ark, and set the poles [in the rings] on the ark, and put the mercy seat on top of the ark."},{"num":21,"verse":"[Moses] brought the ark into the tabernacle and set up the veil of the screen and screened the ark of the Testimony, as the Lord had commanded him."},{"num":22,"verse":"Moses put the table [of showbread] in the Tent of Meeting on the north side of the tabernacle outside the veil;"},{"num":23,"verse":"He set the bread [of the Presence] in order on it before the Lord, as the Lord had commanded him."},{"num":24,"verse":"And he put the lampstand in the Tent of Meeting opposite the table on the south side of the tabernacle."},{"num":25,"verse":"Moses set up and lighted the lamps before the Lord, as the Lord commanded him."},{"num":26,"verse":"He put the golden altar [of incense] in the Tent of Meeting before the veil;"},{"num":27,"verse":"He burned sweet incense [symbol of prayer] upon it, as the Lord commanded him."},{"num":28,"verse":"And he set up the hanging or screen at the door of the tabernacle."},{"num":29,"verse":"[Moses] put the altar of burnt offering at the door of the tabernacle of the Tent of Meeting and offered on it the burnt offering and the cereal offering, as the Lord commanded him."},{"num":30,"verse":"And Moses set the laver between the Tent of Meeting and the altar and put water in it for washing."},{"num":31,"verse":"And Moses and Aaron and his sons washed their hands and their feet there."},{"num":32,"verse":"When they went into the Tent of Meeting or came near the altar, they washed, as the Lord commanded Moses."},{"num":33,"verse":"And he erected the court round about the tabernacle and the altar and set up the hanging or screen at the court gate. So Moses finished the work."},{"num":34,"verse":"Then the cloud [the Shekinah, God’s visible presence] covered the Tent of Meeting, and the glory of the Lord filled the tabernacle!"},{"num":35,"verse":"And Moses was not able to enter the Tent of Meeting because the cloud remained upon it, and the glory of the Lord filled the tabernacle."},{"num":36,"verse":"In all their journeys, whenever the cloud was taken up from over the tabernacle, the Israelites went onward;"},{"num":37,"verse":"But if the cloud was not taken up, they did not journey on till the day that it was taken up."},{"num":38,"verse":"For throughout all their journeys the cloud of the Lord was upon the tabernacle by day, and fire was in it by night, in the sight of all the house of Israel."}]