[[],[{"type":"header","content":"The Tabernacle Erected and Arranged"},{"type":"prose","content":"Then the  spoke to Moses, saying: "}],[{"type":"prose","content":"“On the first day of the first month you shall set up the tabernacle of the tent of meeting. "}],[{"type":"prose","content":"You shall put in it the ark of the Testimony, and partition off the ark with the veil. "}],[{"type":"prose","content":"You shall bring in the table and arrange the things that are to be set in order on it; and you shall bring in the lampstand and light its lamps. "}],[{"type":"prose","content":"You shall also set the altar of gold for the incense before the ark of the Testimony, and put up the screen for the door of the tabernacle. "}],[{"type":"prose","content":"Then you shall set the altar of the burnt offering before the door of the tabernacle of the tent of meeting. "}],[{"type":"prose","content":"And you shall set the laver between the tabernacle of meeting and the altar, and put water in it. "}],[{"type":"prose","content":"You shall set up the court all around, and hang up the screen at the court gate."}],[{"type":"prose","content":"“And you shall take the anointing oil, and anoint the tabernacle and all that  in it; and you shall hallow it and all its utensils, and it shall be holy. "}],[{"type":"prose","content":"You shall anoint the altar of the burnt offering and all its utensils, and consecrate the altar. The altar shall be most holy. "}],[{"type":"prose","content":"And you shall anoint the laver and its base, and consecrate it."}],[{"type":"prose","content":"“Then you shall bring Aaron and his sons to the door of the tabernacle of meeting and wash them with water. "}],[{"type":"prose","content":"You shall put the holy garments on Aaron, and anoint him and consecrate him, that he may minister to Me as priest. "}],[{"type":"prose","content":"And you shall bring his sons and clothe them with tunics. "}],[{"type":"prose","content":"You shall anoint them, as you anointed their father, that they may minister to Me as priests; for their anointing shall surely be an everlasting priesthood throughout their generations.”"}],[{"type":"prose","content":"Thus Moses did; according to all that the  had commanded him, so he did."}],[{"type":"prose","content":"And it came to pass in the first month of the second year, on the first  of the month,  the tabernacle was raised up. "}],[{"type":"prose","content":"So Moses raised up the tabernacle, fastened its sockets, set up its boards, put in its bars, and raised up its pillars. "}],[{"type":"prose","content":"And he spread out the tent over the tabernacle and put the covering of the tent on top of it, as the  had commanded Moses. "}],[{"type":"prose","content":"He took the Testimony and put  into the ark, inserted the poles through the rings of the ark, and put the mercy seat on top of the ark. "}],[{"type":"prose","content":"And he brought the ark into the tabernacle, hung up the veil of the covering, and partitioned off the ark of the Testimony, as the  had commanded Moses."}],[{"type":"prose","content":"He put the table in the tabernacle of meeting, on the north side of the tabernacle, outside the veil; "}],[{"type":"prose","content":"and he set the bread in order upon it before the , as the  had commanded Moses. "}],[{"type":"prose","content":"He put the lampstand in the tabernacle of meeting, across from the table, on the south side of the tabernacle; "}],[{"type":"prose","content":"and he lit the lamps before the , as the  had commanded Moses. "}],[{"type":"prose","content":"He put the gold altar in the tabernacle of meeting in front of the veil; "}],[{"type":"prose","content":"and he burned sweet incense on it, as the  had commanded Moses. "}],[{"type":"prose","content":"He hung up the screen  the door of the tabernacle. "}],[{"type":"prose","content":"And he put the altar of burnt offering  the door of the tabernacle of the tent of meeting, and offered upon it the burnt offering and the grain offering, as the  had commanded Moses. "}],[{"type":"prose","content":"He set the laver between the tabernacle of meeting and the altar, and put water there for washing; "}],[{"type":"prose","content":"and Moses, Aaron, and his sons would wash their hands and their feet  from it. "}],[{"type":"prose","content":"Whenever they went into the tabernacle of meeting, and when they came near the altar, they washed, as the  had commanded Moses. "}],[{"type":"prose","content":"And he raised up the court all around the tabernacle and the altar, and hung up the screen of the court gate. So Moses finished the work."},{"type":"header","content":"The Cloud and the Glory(AI)"}],[{"type":"prose","content":"Then the cloud covered the tabernacle of meeting, and the glory of the  filled the tabernacle. "}],[{"type":"prose","content":"And Moses was not able to enter the tabernacle of meeting, because the cloud rested above it, and the glory of the  filled the tabernacle. "}],[{"type":"prose","content":"Whenever the cloud was taken up from above the tabernacle, the children of Israel would go onward in all their journeys. "}],[{"type":"prose","content":"But if the cloud was not taken up, then they did not journey till the day that it was taken up. "}],[{"type":"prose","content":"For the cloud of the   above the tabernacle by day, and fire was over it by night, in the sight of all the house of Israel, throughout all their journeys."}]]