[{"header":"Putting Up the Meeting Tent and Setting It Apart"},{"num":40,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Set up the holy tent, the meeting tent, on the first day of the first month. "},{"num":3,"verse":"Put the special box of the Law there. And hang the curtain in front of it. "},{"num":4,"verse":"Bring in the table and set its objects on it. Bring in the lamp-stand and light its lamps. "},{"num":5,"verse":"Set the gold altar of special perfume in front of the box of the Law. Hang the curtain for the door of the meeting tent. "},{"num":6,"verse":"Set the altar of burnt gifts in front of the door of the holy tent, the meeting tent. "},{"num":7,"verse":"Set the washing pot between the meeting tent and the altar and put water in it. "},{"num":8,"verse":"Hang the curtains all around the open space and hang the curtain at the gate of the open space. "},{"num":9,"verse":"Then take the oil and pour it upon the meeting tent and all that is in it. Set it apart with all its objects, and it will be holy. "},{"num":10,"verse":"Pour the oil upon the altar of burnt gifts and all its objects. Set the altar apart, and it will be most holy. "},{"num":11,"verse":"Pour the oil upon the washing pot and its stand, to set it apart."},{"num":12,"verse":"“Then bring Aaron and his sons to the door of the meeting tent. And wash them with water. "},{"num":13,"verse":"Put the holy clothing on Aaron. Then pour oil upon him and set him apart to work for Me as a religious leader. "},{"num":14,"verse":"Bring his sons and put long coats on them. "},{"num":15,"verse":"Then pour oil upon them as you have done to their father, so they may serve Me as religious leaders. Pouring oil upon them will make them ready to be religious leaders, they and all their children-to-come.”"},{"num":16,"verse":"Moses did all that the Lord told him to do. "},{"num":17,"verse":"On the first day of the first month of the second year, the meeting tent was set up. "},{"num":18,"verse":"Moses set up the meeting tent, laid the bases, set up its pieces of wood, put in its cross-pieces and set up its pillars. "},{"num":19,"verse":"He spread the covering over the meeting tent. And he put the top covering over it, just as the Lord had told Moses. "},{"num":20,"verse":"Then he took the Law and put it into the special box. He put the long pieces of wood on the special box of the agreement. And he put the mercy-seat on top of the special box. "},{"num":21,"verse":"He brought the special box into the meeting tent and hung the curtain. He put the curtain in front of the special box of the agreement, just as the Lord had told Moses. "},{"num":22,"verse":"Then he put the table in the meeting tent, on the north side of the tent, outside the curtain. "},{"num":23,"verse":"He set the bread in its place on the table before the Lord, just as the Lord had told Moses. "},{"num":24,"verse":"Then he put the lamp-stand in the meeting tent, away from the table, on the south side of the tent. "},{"num":25,"verse":"He set up the lamps before the Lord, just as the Lord had told Moses. "},{"num":26,"verse":"He put the gold altar in the tent of meeting, in front of the curtain. "},{"num":27,"verse":"And he burned sweet-smelling perfume on it, just as the Lord had told Moses. "},{"num":28,"verse":"Then he hung the curtain at the door of the meeting tent. "},{"num":29,"verse":"He set the altar of burnt gifts in front of the door of the meeting tent. And he gave the burnt gift and the grain gift on it, just as the Lord had told Moses. "},{"num":30,"verse":"He put the washing pot between the tent of meeting and the altar, with water in it for washing. "},{"num":31,"verse":"Moses and Aaron and his sons washed their hands and feet there. "},{"num":32,"verse":"They washed when they came into the tent of meeting and when they came near the altar, just as the Lord had told Moses. "},{"num":33,"verse":"He made the open space all around the meeting tent and the altar. And he hung the curtain for the gate of the open space. So Moses finished the work."},{"header":"The Cloud over the Meeting Tent"},{"num":34,"verse":"Then the cloud covered the meeting tent. The shining-greatness of the Lord filled the holy tent."},{"num":35,"verse":"Moses was not able to go into the meeting tent because the cloud had rested upon it and the shining-greatness of the Lord filled the holy tent. "},{"num":36,"verse":"When the cloud was lifted from the meeting tent, the people of Israel would go on their way through all their traveling days. "},{"num":37,"verse":"But when the cloud was not lifted, they did not move on until the day when it was lifted. "},{"num":38,"verse":"For the cloud of the Lord rested on the meeting tent during the day. And fire was in the cloud during the night. It was seen by all the people of Israel as they traveled."}]