[{"header":"Setting up the Tabernacle"},{"num":40,"verse":"Then Adonai spoke to Moses saying, "},{"num":2,"verse":"“On the first day of the first month, you will set up the Tabernacle of the Tent of Meeting. "},{"num":3,"verse":"You are to put the Ark of the Testimony there, and screen off the Ark with the curtain. "},{"num":4,"verse":"Then bring in the table, and set in order the bread that is on it. Bring in the menorah and light its lamps. "},{"num":5,"verse":"Set the golden incense altar in front of the Ark of the Testimony, and hang the curtain over the entrance of the Tabernacle."},{"num":6,"verse":"“Set the altar of burnt offering before the entrance of the Tabernacle, the Tent of Meeting. "},{"num":7,"verse":"Set up the basin between the Tent of Meeting and the altar, and put water in it. "},{"num":8,"verse":"Set up the courtyard all around, and hang the curtain of the gate of the courtyard."},{"num":9,"verse":"“Take the anointing oil and anoint the Tabernacle, and everything within it, and consecrate it, along with all of its furnishings, and it will be holy. "},{"num":10,"verse":"Also you are to anoint the altar of burnt offering with all of its utensils and consecrate the altar. The altar will be most holy. "},{"num":11,"verse":"Then you are to anoint the basin along with its base and sanctify it."},{"num":12,"verse":"“Bring Aaron and his sons to the entrance of the Tent of Meeting, and wash them with water. "},{"num":13,"verse":"Put the holy garments on Aaron, anoint him and consecrate him, so that he may minister to Me as a kohen. "},{"num":14,"verse":"Also bring his sons and put tunics upon them. "},{"num":15,"verse":"You are to anoint them, as you did their father, so that they too may minister to Me as kohanim. Their anointing will be for an everlasting priesthood throughout their generations.” "},{"num":16,"verse":"Moses did so, just as Adonai had commanded him."},{"num":17,"verse":"Now it happened during the first month of the second year, on the first day of the month, the Tabernacle was raised up. "},{"num":18,"verse":"Moses raised the Tabernacle, and laid its bases, set up the framework of boards, put in the crossbars and set up its pillars. "},{"num":19,"verse":"Then he spread the tent over the Tabernacle and put the covering of the tent on it, just as Adonai had commanded Moses."},{"num":20,"verse":"He placed the Testimony into the Ark, set the poles on the Ark, and put the atonement cover on top of the Ark. "},{"num":21,"verse":"He brought the Ark into the Tabernacle, set up the curtain as a screen, and screened off the Ark of the Testimony, just as Adonai had commanded Moses."},{"num":22,"verse":"Then he set up the table inside the Tent of Meeting, on the side of the Tabernacle northward, outside the curtain. "},{"num":23,"verse":"He set a row of bread in order upon it before Adonai, just as Adonai had commanded Moses. "},{"num":24,"verse":"Then he placed the menorah in the Tent of Meeting, over against the table, on the south side of the Tabernacle. "},{"num":25,"verse":"Then he lit the lamps before Adonai, just as Adonai had commanded Moses."},{"num":26,"verse":"Next he placed the golden altar in the Tent of Meeting before the curtain, "},{"num":27,"verse":"and he burned sweet spices of incense there, just as Adonai had commanded Moses. "},{"num":28,"verse":"He hung the curtain over the entrance of the Tabernacle. "},{"num":29,"verse":"Then he set the altar of burnt offering at the entrance of the Tabernacle, the Tent of Meeting, and offered upon it the burnt offering and the grain offering, just as Adonai had commanded Moses."},{"num":30,"verse":"Next he set up the basin between the Tent of Meeting and the altar and put water in it for washing, "},{"num":31,"verse":"so that Moses, Aaron and his sons could wash their hands and their feet there. "},{"num":32,"verse":"When they went into the Tent of Meeting and when they came near to the altar, they washed, just as Adonai had commanded Moses."},{"num":33,"verse":"He set up the courtyard around the Tabernacle and the altar and set up the screen at the gate of the courtyard. So Moses finished the work."},{"header":"Glory Fills the Tabernacle"},{"num":34,"verse":"Then the cloud covered the Tent of Meeting, and the glory of Adonai filled the Tabernacle. "},{"num":35,"verse":"Moses was unable to enter into the Tent of Meeting, because the cloud resided there and the glory of Adonai filled the Tabernacle."},{"num":36,"verse":"Now whenever the cloud was taken up from over the Tabernacle, Bnei-Yisrael went onward, throughout all their journeys. "},{"num":37,"verse":"But if the cloud was not taken up, then they did not move out until the day that it was. "},{"num":38,"verse":"For the cloud of Adonai was on the Tabernacle by day and a fire was there by night, in the sight of all the house of Israel throughout all their journeys."}]