[{"num":40,"verse":"And the Lord spake to Moses, saying,"},{"num":2,"verse":"In the first month, in the first day of the month, thou shalt raise the tabernacle of witnessing. (In the first month, on the first day of the month, thou shalt raise up the Tabernacle of the Witnessing.)"},{"num":3,"verse":"And thou shalt set the ark therein, and thou shalt leave a veil before it. (And thou shalt put the Ark in it, and thou shalt put the Veil in front of the Ark.)"},{"num":4,"verse":"And when the board is borne in, thou shalt set thereon those things that be commanded justly, either by the law. The candlestick shall stand with his lanterns, (And when the table is brought in, thou shalt put on it those things that be commanded by the law. And thou shalt bring in the lamp-stand, and its lanterns,)"},{"num":5,"verse":"and the golden altar, wherein the incense is burnt before the ark of witnessing. Thou shalt set a curtain in the entering of the tabernacle; (and the gold altar, on which the incense is burned before the Ark of the Witnessing. And thou shalt hang the curtain at the entrance to the Tabernacle;)"},{"num":6,"verse":"and before it thou shalt set the altar of burnt sacrifice, (and in front of it, thou shalt put the altar of burnt sacrifice,)"},{"num":7,"verse":"(and) thou shalt set the washing vessel betwixt the altar and the tabernacle, which washing vessel thou shalt fill with water."},{"num":8,"verse":"And thou shalt (en)compass the great porch, and the entering thereof, with curtains. (And thou shalt set up the courtyard all around it, and hang up the curtain at its entrance.)"},{"num":9,"verse":"And when thou hast taken the oil of anointing, thou shalt anoint the tabernacle, with his vessels (thou shalt anoint the Tabernacle, and all its vessels), (so) that those be hallowed;"},{"num":10,"verse":"the altar of burnt sacrifice, and all the vessels thereof;"},{"num":11,"verse":"the washing vessel, with his foundament. Thou shalt anoint all things with the oil of anointing, that they be holy of holy things. (and the washing vessel, and its foundation, or its base. Thou shalt anoint all these things with the anointing oil, so that they be consecrated, and most holy.)"},{"num":12,"verse":"And thou shalt present Aaron and his sons to the door of the tabernacle of witnessing (And thou shalt bring Aaron and his sons to the entrance of the Tabernacle of the Witnessing); and, when they be washed with water,"},{"num":13,"verse":"thou shalt clothe them in (the) holy clothes, that they minister to me (so that they can serve as my priests),"},{"num":14,"verse":"(See verse 13 above.)"},{"num":15,"verse":"and (so) that the anointing of them profit into (an) everlasting priesthood."},{"num":16,"verse":"And Moses did all things that the Lord commanded."},{"num":17,"verse":"Therefore in the first month of the second year, in the first day of the month, the tabernacle was set. (And so in the first month of the second year, on the first day of the month, the Tabernacle was set up.)"},{"num":18,"verse":"And Moses areared it, and he set (up) the boards, and bases, and bars, and he ordained [the] pillars;"},{"num":19,"verse":"and he stretched out the roof upon the tabernacle, and he put a covering above (it), as the Lord commanded. (and he stretched out the tent over the Tabernacle, and he put the coverings over the tent, as the Lord commanded.)"},{"num":20,"verse":"He put also the witnessing, that is, the tables of the law, in the ark, and he set the bars within (the rings), and God’s answering place above (the ark). (And he put the Witnessing, that is, the tablets of the Law, into the Ark, that is, the Box for the tablets, and he set the bars within the rings, and he put the propitiatory, that is, the mercy seat, or the lid, on the Box.)"},{"num":21,"verse":"And when he had brought the ark into the tabernacle, he hanged a veil before it, that he should fulfill the commandment of the Lord. (And when he had brought the Ark into the Tabernacle, he hung up the Veil in front of it, as the Lord commanded him.)"},{"num":22,"verse":"He setted also the board in the tabernacle of witnessing, at the north coast, without the veil, (And he put the table in the Tabernacle of the Witnessing, on the north side of the Tabernacle, in front of the Veil,)"},{"num":23,"verse":"and he ordained the loaves of setting forth (on the table,) before (the Lord), as the Lord commanded to Moses. (and he placed the loaves of proposition, or the showbread, on the table, before the Lord, as the Lord commanded to Moses.)"},{"num":24,"verse":"He set also the candlestick in the tabernacle of witnessing, even against the board, in the south side, (And he set the lamp-stand in the Tabernacle of the Witnessing, opposite the table, on the south side of the Tabernacle,)"},{"num":25,"verse":"and he set the lanterns by order, by the commandment of the Lord. (and he set up the lanterns before the Lord, as the Lord commanded him.)"},{"num":26,"verse":"He putted also the golden altar under the roof of witnessing, that is, of the tabernacle, against the veil, (And he put the gold altar in the Tent of the Witnessing, that is, in the Tabernacle, in front of the Veil,)"},{"num":27,"verse":"and he burnt thereon incense of sweet smelling spiceries, as the Lord commanded to Moses."},{"num":28,"verse":"He set also a curtain in the entering of the tabernacle, (And he hung up the curtain at the entrance to the Tabernacle,)"},{"num":29,"verse":"and (set) the altar of burnt sacrifice in the porch (of the tabernacle) of witnessing, and he offered there(on) burnt sacrifice, and sacrifices, as the Lord commanded. (and put the altar of burnt sacrifice by the entrance to the Tabernacle of the Witnessing, and then he offered on it the burnt sacrifice, and the sacrifices, as the Lord commanded him.)"},{"num":30,"verse":"Also he ordained the washing vessel, betwixt the tabernacle of witnessing and the altar, and filled it with water. (And he put the washing vessel between the Tabernacle of the Witnessing and the altar, and filled it with water.)"},{"num":31,"verse":"And Moses, and Aaron, and his sons, washed their hands and their feet therein,"},{"num":32,"verse":"when they entered into the tabernacle of the bond of peace, and nighed to the altar, as the Lord commanded to Moses. (whenever they entered into the Tabernacle of the Covenant, that is, the Tabernacle of the Witnessing, or when they approached the altar, as the Lord commanded to Moses.)"},{"num":33,"verse":"He areared also the great porch, by compass of the tabernacle and of the altar, and setted a curtain in the entering thereof. (And he set up the courtyard, that is, the pillars and the curtains that enclosed the courtyard, all around the Tabernacle and the altar, and hung up a curtain at its entrance.)"},{"num":34,"verse":"After that all things were perfectly made, a cloud covered the tabernacle of witnessing, and the glory of the Lord filled it; (And when all things were completed, a cloud covered the Tabernacle of the Witnessing, and the glory of the Lord filled it;)"},{"num":35,"verse":"neither Moses might enter into the tabernacle of the bond of peace (and Moses could not go into the Tabernacle of the Covenant, that is, the Tabernacle of the Witnessing), while the cloud covered all things, and the majesty of the Lord shined, for the cloud covered all things."},{"num":36,"verse":"If any time the cloud left the tabernacle, the sons of Israel went forth by their companies; (And any time that the cloud left the Tabernacle, the Israelites went forth on their journey;)"},{"num":37,"verse":"(but) if the cloud hanged thereabove, they dwelled in the same place;"},{"num":38,"verse":"for the cloud of the Lord rested on the tabernacle by day, and fire (was on it) in the night, in the sight of the people of Israel, by all their dwellings. (for the cloud of the Lord rested on the Tabernacle by day, and a fire was over it in the night, before the people of Israel, during all of their journey.)"}]