[{"header":"Prophecy against Moab"},{"num":48,"verse":"Concerning Moab."},{"num":12,"verse":"Therefore behold, the days are coming,” says the Lord, “when I will send to Moab those who will tip him over and who will empty his vessels and break his [earthenware] jars in pieces. "},{"num":13,"verse":"And Moab shall be ashamed of Chemosh [his worthless, disgusting god], as the house of Israel was ashamed of Bethel, their [misplaced] confidence."},{"num":21,"verse":"“Judgment has come on [the land of] the plain—upon Holon, Jahzah, and against Mephaath, "},{"num":22,"verse":"against Dibon, Nebo, and Beth-diblathaim, "},{"num":23,"verse":"against Kiriathaim, Beth-gamul, and Beth-meon, "},{"num":24,"verse":"against Kerioth, Bozrah and all the cities of the land of Moab, far and near. "},{"num":25,"verse":"The horn (strength) of Moab has been cut off and his arm [of authority] is shattered,” says the Lord. "},{"num":26,"verse":"“Make him drunk, for he has become arrogant and magnified himself against the Lord [by denying Reuben’s occupation of the land the Lord had assigned him]. Moab also will wallow in his vomit, and he too shall become a laughingstock. "},{"num":27,"verse":"For was not Israel a laughingstock to you? Was he caught among thieves? For whenever you speak of him you shake your head in scorn."},{"num":34,"verse":"From the outcry at Heshbon even to Elealeh, even to Jahaz they have raised their voice, from Zoar even to Horonaim and Eglath-shelishiyah; for even the waters of Nimrim will become desolations. "},{"num":35,"verse":"Moreover, I will cause to cease in Moab,” says the Lord, “the one who ascends and offers sacrifice in the high place and the one who burns incense to his gods."},{"num":36,"verse":"“Therefore My heart moans and sighs for Moab like flutes, and My heart moans and sighs like flutes for the men of Kir-heres (Kir-hareseth); therefore [the remnant of] the abundant riches they gained has perished. "},{"num":37,"verse":"For every head is [shaven] bald and every beard cut off; there are cuts (slashes) on all the hands and sackcloth on the loins [all expressions of mourning]. "},{"num":38,"verse":"On all the housetops of Moab and in its streets there is lamentation (expressions of grief for the dead) everywhere, for I have broken Moab like a vessel in which there is no pleasure,” says the Lord. "},{"num":39,"verse":"“How it is broken down! How they have wailed! How Moab has turned his back in shame! So Moab will become a laughingstock and a [horrifying] terror to all who are around him.”"},{"num":40,"verse":"For thus says the Lord:"}]