[{"header":"Chapter 5"},{"num":1,"verse":"Esther’s Request to the King. [On the third day, Esther donned her royal garments and positioned herself in the inner courtyard in front of the king’s hall. The king was seated on his royal throne in the hall, facing the entrance."},{"num":2,"verse":"When he spotted Queen Esther standing in the courtyard, he made her welcome by holding out the golden scepter that was in his hand. So Esther came near and touched the top of the scepter.]"},{"num":3,"verse":"Then the king asked, “What is it, Queen Esther? What is your request? Even if it should be half of my kingdom, it will be given to you.”"},{"num":4,"verse":"“If it pleases the king,” Esther replied, “I would like you and Haman to be my guests today at a banquet that I have prepared for you.”"},{"num":5,"verse":"Thereupon the king exclaimed, “Hurry, bring Haman here so that we may do what Esther wishes.” With that, the king and Haman went to Esther’s banquet."},{"num":6,"verse":"As they were drinking wine, the king again asked Esther, “Now, what is your petition? It will be given you. And what is your request? Even if it is up to half of my kingdom, it will be granted.”"},{"num":7,"verse":"Esther replied, “My petition and my request is this:"},{"num":8,"verse":"If I have found favor with the king and if it pleases the king to grant my petition and fulfill my request, let the king and Haman come tomorrow to another banquet that I will prepare for them. Then I will answer the king’s question.”"},{"num":9,"verse":"Haman’s Rage against Mordecai. When Haman left that day he was happy and in a good mood. But when he caught sight of Mordecai at the king’s gate and noted that he neither rose nor showed fear in his presence, he was consumed with rage toward Mordecai."},{"num":10,"verse":"Nonetheless, he was able to control himself and go home."},{"num":14,"verse":"Then his wife, Zeresh, and all his friends suggested, “Why not have a gibbet set up, fifty cubits high, and in the morning ask the king to have Mordecai hanged on it. Then go to the banquet with the king and enjoy yourself.” Haman liked the idea, and he had the gibbet built."}]