[{"header":"Esther’s Banquet"},{"num":5,"verse":"On the third day Esther put on her royal robes and stood in the inner court of the king’s palace, opposite the king’s hall. The king was sitting on his royal throne inside the palace opposite the entrance to the palace. "},{"num":2,"verse":"As soon as the king saw Queen Esther standing in the court, she won his favour and he held out to her the golden sceptre that was in his hand. Then Esther approached and touched the top of the sceptre. "},{"num":3,"verse":"The king said to her, ‘What is it, Queen Esther? What is your request? It shall be given you, even to the half of my kingdom.’ "},{"num":4,"verse":"Then Esther said, ‘If it pleases the king, let the king and Haman come today to a banquet that I have prepared for the king.’ "},{"num":5,"verse":"Then the king said, ‘Bring Haman quickly, so that we may do as Esther desires.’ So the king and Haman came to the banquet that Esther had prepared. "},{"num":6,"verse":"While they were drinking wine, the king said to Esther, ‘What is your petition? It shall be granted you. And what is your request? Even to the half of my kingdom, it shall be fulfilled.’ "},{"num":7,"verse":"Then Esther said, ‘This is my petition and request: "},{"num":8,"verse":"If I have won the king’s favour, and if it pleases the king to grant my petition and fulfil my request, let the king and Haman come tomorrow to the banquet that I will prepare for them, and then I will do as the king has said.’"},{"header":"Haman Plans to Have Mordecai Hanged"},{"num":9,"verse":"Haman went out that day happy and in good spirits. But when Haman saw Mordecai in the king’s gate, and observed that he neither rose nor trembled before him, he was infuriated with Mordecai; "},{"num":10,"verse":"nevertheless, Haman restrained himself and went home. Then he sent and called for his friends and his wife Zeresh, "},{"num":11,"verse":"and Haman recounted to them the splendour of his riches, the number of his sons, all the promotions with which the king had honoured him, and how he had advanced him above the officials and the ministers of the king. "},{"num":12,"verse":"Haman added, ‘Even Queen Esther let no one but myself come with the king to the banquet that she prepared. Tomorrow also I am invited by her, together with the king. "},{"num":13,"verse":"Yet all this does me no good so long as I see the Jew Mordecai sitting at the king’s gate.’ "},{"num":14,"verse":"Then his wife Zeresh and all his friends said to him, ‘Let a gallows fifty cubits high be made, and in the morning tell the king to have Mordecai hanged on it; then go with the king to the banquet in good spirits.’ This advice pleased Haman, and he had the gallows made."}]