[{"num":5,"verse":"Now it came to pass on the yom hashelishi, that Ester put on her royal apparel, and stood in the pnimiyus [khatzer] of the Beis HaMelech in front of the Beis HaMelech; and HaMelech sat upon his kisse malkhut (royal throne) in the Beis Hamalkhut, facing the Petach HaBeis (Entrance of HaBeis)."},{"num":2,"verse":"And it was so, when HaMelech saw Ester HaMalkah standing in the Khatzer (Court), that she took up chen (favor, grace) in his sight, and HaMelech held out to Ester the sharvit hazahav (golden sceptre) that was in his hand. So Ester drew near, and touched the top of the sharvit (sceptre)."},{"num":3,"verse":"Then said HaMelech unto her, What wilt thou, Ester HaMalkah? And what is thy bakash (request)? It shall be given thee even to the chatzi HaMalchut (half of the kingdom)."},{"num":4,"verse":"And Ester answered, If it seem tov unto HaMelech, let HaMelech and Haman come today unto the mishteh that I have prepared for him."},{"num":5,"verse":"Then HaMelech said, Cause Haman to make haste, that he may do as Ester hath said. So HaMelech and Haman came to the mishteh that Ester had prepared."},{"num":6,"verse":"And HaMelech said unto Ester at the mishteh hayayin (feast), What is thy she’elah (petition)? And it shall be granted thee. And what is thy bakash (request)? Even to chatzi HaMalchut it shall be granted."},{"num":7,"verse":"Then answered Ester, and said, My she’elah and my bakash is:"},{"num":8,"verse":"If I have found chen (favor, grace) in the sight of HaMelech, and if it is tov to HaMelech to grant my she’elah, and to perform my bakash, let HaMelech and Haman come to the mishteh that I shall prepare for them, and I will do makhar (tomorrow) as HaMelech hath said."},{"num":9,"verse":"Then went Haman forth that day sameiach (joyful, happy) and with a tov lev; but when Haman saw Mordechai in the Sha’ar HaMelech, that he stood not up, nor trembled because of him, he was full of chemah (indignation, rage) against Mordechai."},{"num":10,"verse":"Nevertheless Haman restrained himself, and when he came home, he sent and called for his ohavim (friends), and Zeresh his isha."},{"num":11,"verse":"And Haman told them of the kavod of his osher, and the multitude of his children, and all the things wherein HaMelech had promoted him, and how he had advanced him above the sarim (princes) and avadim of HaMelech."},{"num":12,"verse":"Haman said moreover, Yea, Ester HaMalkah did let no man come in with HaMelech unto the mishteh that she had prepared but myself; and makhar (tomorrow) am I invited unto her also with HaMelech."},{"num":13,"verse":"Yet all this availeth me nothing, so long as I see Mordechai HaYehudi sitting at the Sha’ar HaMelech."},{"num":14,"verse":"Then said Zeresh his isha and all his ohavim (friends) unto him, Let an etz (hanging tree) be made of fifty cubits high, and baboker (in the morning) speak thou unto HaMelech that Mordechai may be hanged thereon [see Lk 23:21 OJBC]; then go thou samei’ach (joyfully) with HaMelech unto the mishteh. And the thing was tov to Haman; and he caused HaEtz to be built."}]