[{"num":5,"verse":"Forsooth in the third day, Esther was clothed in royal clothes, and she stood in the porch of the king’s house, that was withinforth over against the king’s hall; and the king sat upon his throne, in the consistory of his palace, (over) against the door of the house. (And on the third day, Esther was clothed in royal robes, and she went and stood in the inner courtyard of the king’s palace, facing the palace; and the king sat on his throne, in the consistory of his palace, facing the entrance to the palace.)"},{"num":2,"verse":"And when he had seen Esther, the queen, standing there, she pleased his eyes, and he held forth against her the golden rod, that he held in his hand; and she nighed, and kissed the highness of his rod. (And when he had seen Queen Esther standing there, she pleased his eyes, and he held forth toward her the gold sceptre, which he held in his hand; and she came over, and touched the top of the sceptre.)"},{"num":3,"verse":"And the king said to her, Esther, the queen, what wilt thou? what is thine asking? Yea, though thou ask the half part of my realm, it shall be given to thee. (And the king said to her, Queen Esther, what wilt thou have? what is thy asking? Yea, if thou ask for half my kingdom, it shall be given to thee!)"},{"num":4,"verse":"And she answered, If it pleaseth the king, I beseech, that thou come to me today, and Haman with thee, to the feast, that I have made ready. (And she answered, If it please the king, I beseech thee, that thou, and Haman with thee, come today to the feast, that I have prepared for thee.)"},{"num":5,"verse":"And anon the king said, Call ye anon Haman, that he obey to the will of Esther. And then the king and Haman came to the feast, which the queen had made ready to them. (And at once the king said, Call ye Haman at once, so that he obey the will of Esther. And so the king and Haman went to the feast, which the queen had prepared for them.)"},{"num":6,"verse":"And the king said to Esther, after that he had drunk (the) wine plenteously, What thing askest thou of me, that it be given to thee, and for what thing askest thou? Yea, though thou ask the half part of my realm, thou shalt get it (Yea, if thou ask for half my kingdom, thou shalt get it)."},{"num":7,"verse":"To whom Esther answered, My asking and [my] prayers be these."},{"num":8,"verse":"If I have found grace in the sight of the king, and if it pleaseth the king, that he give to me that thing, that I ask, and that he fulfill mine asking, the king and Haman come they tomorrow to the feast, that I have made ready to them; and tomorrow, I shall open my will to the king. (If I have found favour before the king, and if it please the king, that he give me what I ask for, and that he grant my request, then may the king and Haman come to the feast that I shall prepare for them tomorrow; and then tomorrow, I shall tell my desire to the king.)"},{"num":9,"verse":"Therefore Haman went out glad and swift in that day. And when he had seen Mordecai sitting before the gates of the palace, and not only to have not risen up to him, but soothly neither moved from the place of his sitting, he was full wroth; (And so Haman went out that day happy and well pleased with himself. But when he saw Mordecai in attendance at the royal court, and he did not rise up before him to show respect, or even move from the place where he was sitting, he was enraged;)"},{"num":10,"verse":"and Haman feigned him(self) as not wroth therefore, and turned again into his house, and he called together his friends, and Zeresh, his wife; (but Haman feigned himself as not being angry because of that, and returned to his house, and he called together his friends, and his wife Zeresh;)"},{"num":11,"verse":"and he told to them (of) the greatness of his riches, and the company of his children, and with how great glory the king had enhanced him above all his princes and servants. (and he told them of his great riches, and of the multitude, or the great number, of his children, and how the king had promoted him to great glory above all his other leaders and servants.)"},{"num":12,"verse":"And he said after these things, Also the queen Esther called none other man with the king to the feast, except me, with whom I shall eat also tomorrow with the king. (And after these things he said, And Queen Esther called no other man to the feast with the king, except me, and tomorrow I shall also eat with her and the king.)"},{"num":13,"verse":"And though I have all these things, I guess that I have nothing, as long as I see Mordecai, the Jew, sitting before the king’s gates. (And yet, even though I have all these things, I feel like I have nothing, as long as I see that Jew Mordecai, in attendance at the royal court.)"},{"num":14,"verse":"And Zeresh, his wife, and his friends answered to him, Command thou an high beam, or a gallows tree, to be made ready, having fifty cubits of height; and speak thou tomorrow early to the king, and ask of him, that Mordecai be hanged thereon; and so thou shalt go glad with the king to the queen’s feast. And the counsel of them pleased him, and he commanded an high cross, that is a gibbet, to be made ready. (And his wife Zeresh, and his friends, answered to him, Command thou that a gallows be prepared, that is fifty cubits in height; and then early tomorrow speak thou to the king, and ask him to have Mordecai hanged on it; and then thou shalt go with the king to the queen’s feast in high spirits. And their counsel pleased him, and he commanded that the gallows be prepared.)"}]