[{"header":"Isaac marries Rebekah"},{"num":24,"verse":"As the days went by and Abraham became older, the Lord blessed Abraham in every way."},{"num":2,"verse":"Abraham said to the oldest servant of his household, who was in charge of everything he owned, “Put your hand under my thigh."},{"num":3,"verse":"By the Lord, God of heaven and earth, give me your word that you won’t choose a wife for my son from the Canaanite women among whom I live."},{"num":4,"verse":"Go to my land and my family and find a wife for my son Isaac there.”"},{"num":5,"verse":"The servant said to him, “What if the woman doesn’t agree to come back with me to this land? Shouldn’t I take your son back to the land you left?”"},{"num":6,"verse":"Abraham said to him, “Be sure you don’t take my son back there."},{"num":7,"verse":"The Lord, God of heaven—who took me from my father’s household and from my family’s land, who spoke with me and who gave me his word, saying, ‘I will give this land to your descendants’—he will send his messenger in front of you, and you will find a wife for my son there."},{"num":8,"verse":"If the woman won’t agree to come back with you, you will be free from this obligation to me. Only don’t take my son back there.”"},{"num":9,"verse":"So the servant put his hand under his master Abraham’s thigh and gave him his word about this mission."},{"num":10,"verse":"The servant took ten of his master’s camels and all of his master’s best provisions, set out, and traveled to Nahor’s city in Aram-naharaim."},{"num":11,"verse":"He had the camels kneel down outside the city at the well in the evening, when women come out to draw water."},{"num":12,"verse":"He said, “Lord, God of my master Abraham, make something good happen for me today and be loyal to my master Abraham."},{"num":13,"verse":"I will stand here by the spring while the daughters of the men of the city come out to draw water."},{"num":14,"verse":"When I say to a young woman, ‘Hand me your water jar so I can drink,’ and she says to me, ‘Drink, and I will give your camels water too,’ may she be the one you’ve selected for your servant Isaac. In this way I will know that you’ve been loyal to my master.”"},{"num":15,"verse":"Even before he finished speaking, Rebekah—daughter of Bethuel the son of Milcah wife of Nahor, Abraham’s brother—was coming out with a water jar on her shoulder."},{"num":16,"verse":"The young woman was very beautiful, old enough to be married, and hadn’t known a man intimately. She went down to the spring, filled her water jar, and came back up."},{"num":17,"verse":"The servant ran to meet her and said, “Give me a little sip of water from your jar.”"},{"num":18,"verse":"She said, “Drink, sir.” Then she quickly lowered the water jar with her hands and gave him some water to drink."},{"num":19,"verse":"When she finished giving him a drink, she said, “I’ll draw some water for your camels too, till they’ve had enough to drink.”"},{"num":20,"verse":"She emptied her water jar quickly into the watering trough, ran to the well again to draw water, and drew water for all of the camels."},{"num":21,"verse":"The man stood gazing at her, wondering silently if the Lord had made his trip successful or not."},{"num":22,"verse":"As soon as the camels had finished drinking, the man took out a gold ring, weighing a half shekel, and two gold bracelets for her arms, weighing ten shekels."},{"num":23,"verse":"He said, “Please tell me whose daughter you are. Is there room in your father’s house for us to spend the night?”"},{"num":24,"verse":"She responded, “I’m the daughter of Bethuel, who is the son of Milcah and Nahor.”"},{"num":25,"verse":"She continued, “We have plenty of straw and feed for the camels, and a place to spend the night.”"},{"num":26,"verse":"The man bowed down and praised the Lord:"},{"num":27,"verse":"“Bless the Lord, God of my master Abraham, who hasn’t given up his loyalty and his faithfulness to my master. The Lord has shown me the way to the household of my master’s brother.”"},{"num":28,"verse":"The young woman ran and told her mother’s household everything that had happened."},{"num":29,"verse":"Rebekah had a brother named Laban, and Laban ran to the man outside by the spring."},{"num":30,"verse":"When he had seen the ring and the bracelets on his sister’s arms, and when he had heard his sister Rebekah say, “This is what the man said to me,” he went to the man, who was still standing by the spring with his camels."},{"num":31,"verse":"Laban said, “Come in, favored one of the Lord! Why are you standing outside? I’ve prepared the house and a place for the camels.”"},{"num":32,"verse":"So the man entered the house. Then Laban unbridled the camels, provided straw and feed for them and water to wash his feet and the feet of the men with him,"},{"num":33,"verse":"and set out a meal for him."},{"num":34,"verse":"The man said, “I am Abraham’s servant."},{"num":35,"verse":"The Lord has richly blessed my master, has made him a great man, and has given him flocks, cattle, silver, gold, men servants, women servants, camels, and donkeys."},{"num":36,"verse":"My master’s wife Sarah gave birth to a son for my master in her old age, and he’s given him everything he owns."},{"num":37,"verse":"My master made me give him my word: ‘Don’t choose a wife for my son from the Canaanite women, in whose land I’m living."},{"num":38,"verse":"No, instead, go to my father’s household and to my relatives and choose a wife for my son.’"},{"num":39,"verse":"I said to my master, ‘What if the woman won’t come back with me?’"},{"num":40,"verse":"He said to me, ‘The Lord, whom I’ve traveled with everywhere, will send his messenger with you and make your trip successful; and you will choose a wife for my son from my relatives and from my father’s household."},{"num":41,"verse":"If you go to my relatives, you will be free from your obligation to me. Even if they provide no one for you, you will be free from your obligation to me.’"},{"num":42,"verse":"“Today I arrived at the spring, and I said, ‘Lord, God of my master Abraham, if you wish to make the trip I’m taking successful,"},{"num":43,"verse":"when I’m standing by the spring and the young woman who comes out to draw water and to whom I say, “Please give me a little drink of water from your jar,”"},{"num":44,"verse":"and she responds to me, “Drink, and I will draw water for your camels too,” may she be the woman the Lord has selected for my master’s son.’"},{"num":45,"verse":"Before I finished saying this to myself, Rebekah came out with her water jar on her shoulder and went down to the spring to draw water. And I said to her, ‘Please give me something to drink.’"},{"num":46,"verse":"She immediately lowered her water jar and said, ‘Drink, and I will give your camels something to drink too.’ So I drank and she also gave water to the camels."},{"num":47,"verse":"Then I asked her, ‘Whose daughter are you?’ And she said, ‘The daughter of Bethuel, Nahor’s son whom Milcah bore him.’ I put a ring in her nose and bracelets on her arms."},{"num":48,"verse":"I bowed and worshipped the Lord and blessed the Lord, the God of my master Abraham, who led me in the right direction to choose the granddaughter of my master’s brother for his son."},{"num":49,"verse":"Now if you’re loyal and faithful to my master, tell me. If not, tell me so I will know where I stand either way.”"},{"num":50,"verse":"Laban and Bethuel both responded, “This is all the Lord’s doing. We have nothing to say about it."},{"num":51,"verse":"Here is Rebekah, right in front of you. Take her and go. She will be the wife of your master’s son, just as the Lord said.”"},{"num":52,"verse":"When Abraham’s servant heard what they said, he bowed low before the Lord."},{"num":53,"verse":"The servant brought out gold and silver jewelry and clothing and gave them to Rebekah. To her brother and to her mother he gave the finest gifts."},{"num":54,"verse":"He and the men with him ate and drank and spent the night."},{"num":55,"verse":"Her brother and mother said, “Let the young woman stay with us not more than ten days, and after that she may go.”"},{"num":56,"verse":"But he said to them, “Don’t delay me. The Lord has made my trip successful. See me off so that I can go to my master.”"},{"num":57,"verse":"They said, “Summon the young woman, and let’s ask her opinion.”"},{"num":58,"verse":"They called Rebekah and said to her, “Will you go with this man?”"},{"num":59,"verse":"So they sent off their sister Rebekah, her nurse, Abraham’s servant, and his men."},{"num":60,"verse":"And they blessed Rebekah, saying to her,"},{"num":61,"verse":"Rebekah and her young women got up, mounted the camels, and followed the man. So the servant took Rebekah and left."},{"num":62,"verse":"Now Isaac had come from the region of Beer-lahai-roi and had settled in the arid southern plain."},{"num":63,"verse":"One evening, Isaac went out to inspect the pasture, and while staring he saw camels approaching."},{"num":64,"verse":"Rebekah stared at Isaac. She got down from the camel"},{"num":65,"verse":"and said to the servant, “Who is this man walking through the pasture to meet us?”"},{"num":66,"verse":"The servant told Isaac everything that had happened."},{"num":67,"verse":"Isaac brought Rebekah into his mother Sarah’s tent. He received Rebekah as his wife and loved her. So Isaac found comfort after his mother’s death."}]