[{"num":1,"verse":"How sitteth alone the city (that once was so) full of people? the lady of folks is made as a widow; the princess of provinces is made under tribute. (How the city now sitteth alone, or empty, that once was so full of people! the lady of nations is made like a widow; the princess of provinces is put under tribute/is made to suffer forced labour.)"},{"num":2,"verse":"It1 weeping wept in the night, and the tears thereof be in the cheeks thereof (and its tears be on its cheeks); there is none of all the dearworthy thereof, that comforteth it; all the friends thereof forsook it, and be made enemies to it."},{"num":3,"verse":"Judah passed from torment and multitude of servage, it dwelled among heathen men, and found no rest; all the pursuers thereof took it among anguishes. (Judah went into the torment of captivity and a multitude of servitude, or of slavery, it lived among the heathen, and found no rest; all of its pursuers brought it much anguish.)"},{"num":4,"verse":"The ways of Zion mourn, for no men come to the solemnity; all the gates thereof be destroyed, the priests thereof wail; the virgins thereof be defouled, and it is oppressed with bitterness. (The ways of Zion mourn, for no people come to its solemn feasts; all its gates be destroyed, its priests wail; its virgins be defiled, and it is oppressed with bitterness.)"},{"num":5,"verse":"The enemies thereof be made in the head, and the enemies thereof be made rich, for the Lord spake on it. For the multitude of wickednesses thereof the little children thereof be led into captivity, before the face of the troubler. (Its enemies be put at its head, that is, they rule over it, and they be made rich, for the Lord spoke against it. For the multitude of its wickednesses its little children be led into captivity, by the enemy.)"},{"num":6,"verse":"And all the fairness of the daughter of Zion went out from the daughter of Zion; the princes thereof be made as rams not finding pastures; and went forth without strength before the face of the follower. (And all the beauty of the daughter of Zion went away from the daughter of Zion; its princes be made like rams not finding pasture; and they went forth without strength before their pursuer.)"},{"num":7,"verse":"And Jerusalem bethought on the days of her affliction and of trespassing, and on all her desirable things which it had from [the] eld days; when the people thereof fell down in the hand of enemies, and none helper was; [the] enemies saw it, and scorned the sabbaths thereof. (And Jerusalem remembered the days of its affliction and of its trespassing, and on all the desirable things which it had in the old days; when its people fell into the hands of its enemies, and there was no one to help them; its enemies saw it, and mocked its sabbaths.)"},{"num":8,"verse":"Jerusalem sinned a sin, therefore it was made unsteadfast; all that glorified it forsook it, for they saw the shame thereof (all who honoured it, deserted it, for they saw its shame); forsooth it wailed, and was turned aback."},{"num":9,"verse":"The filths thereof be in the feet thereof, and it had no mind of her end; it was put down greatly, and had no comforter; Lord, see thou my torment, for the enemy is raised [up]. (Its filths be upon its feet, and it had no thought of its end; it was greatly put down, and it had no comforter; it said, Lord, see thou my torment, for the enemy is raised up against me.)"},{"num":10,"verse":"The enemy put his hand to all the desirable things thereof; for it saw heathen men entered into thy saintuary, of which thou haddest commanded, that they should not enter into thy church. (The enemy put his hands onto all its desirable things; and it saw the heathen go into thy Temple, of whom thou haddest commanded, that they should never enter into thy congregation.)"},{"num":11,"verse":"All the people thereof was wailing and seeking bread, they gave all precious things for meat, to strengthen the soul; (and the city saith,) See thou, Lord, and behold, for I am made vile. (All its people were wailing and seeking bread, they gave all precious things for food, to strengthen, or to feed, themselves; and the city saith, See thou, Lord, and behold, for I am made vile.)"},{"num":12,"verse":"A! all ye that pass by the way, perceive, and see, if any sorrow is as my sorrow; for he gathered away (my) grapes from me, as the Lord spake in the day of wrath of his strong vengeance. (O! all ye who go on the way, look, and see, if there is any sorrow like my sorrow; for he hath afflicted me, like the Lord said that he would, on the day of the wrath of his strong vengeance.)"},{"num":13,"verse":"From on high he sent fire in(to) my bones, and taught me; he spreaded abroad a net to my feet, he turned me aback; he setted me desolate, meddled together all day with mourning (he left me desolate, mixed together with mourning, all day long)."},{"num":14,"verse":"The yoke of my wickednesses watched in the hand of him, those be folded together, and put on my neck; my strength is made feeble; the Lord gave me in(to) the hand, from which I shall not be able to rise. (He watched my wickednesses, and he folded them together like a yoke, and put them about my neck; my strength is made feeble, or weak; the Lord gave me into their hands, from whom I shall not be able to escape.)"},{"num":15,"verse":"The Lord took away all my worshipful men from the midst of me; he called time against me, that he should all-foul my chosen men; the Lord stamped a presser to the virgin, the daughter of Judah. (The Lord took away all my honourable men from my midst; he called out time against me, so that he could defile all my chosen people; the Lord stamped the virgin, the daughter of Judah, like grapes in a winepress.)"},{"num":16,"verse":"Therefore I am weeping, and mine eye is leading down water; for a comforter, converting my soul, is made far from me; my sons be made lost, for the enemy had the mastery. (And so I am weeping, and my eyes be leading down water; for a comforter, to refresh my soul, is made far from me; my sons and daughters be made lost, or left desolate, for the enemy had the mastery.)"},{"num":17,"verse":"Zion spreaded abroad his hands, none is that comforteth it; the Lord sent against Jacob enemies thereof, in the compass thereof; Jerusalem is made as defouled with unclean blood among them. (Zion spread abroad its hands, there is no one to comfort it; the Lord sent against Jacob its enemies, all around it; Jerusalem is defiled with unclean blood among them.)"},{"num":18,"verse":"(And the city saith,) The Lord is just (The Lord is in the right), for I stirred his mouth to wrathfulness; all peoples, I beseech, hear ye, and see my sorrow; my virgins and my young men went forth into captivity."},{"num":19,"verse":"I called my friends, and they deceived me; my priests and mine eld men in the city be wasted; for they sought meat to themselves, to comfort their life/to strengthen their life (for they sought food for themselves, to refresh their souls)."},{"num":20,"verse":"See thou, Lord, for I am troubled, my womb is troubled; mine heart is destroyed in myself, for I am full of bitterness; [the] sword slayeth withoutforth, and like death is at home (the sword killeth people outside, and there is death at home)."},{"num":21,"verse":"They heard, that I make inward wailing, and none is that comforteth me; all mine enemies heard (of) mine evil, they be glad, for thou hast done (it); thou hast brought a day of comfort, and they shall be made like me (but thou shalt bring the day that thou hast promised, and then they shall be made like me)."},{"num":22,"verse":"All the evil of them enter before thee, and gather thou grapes away from them, as thou hast gathered grapes away from me, for my wickednesses; for my wailings be many, and mine heart is mourning. (Let all their evil enter before thee, and take away the grapes from them, as thou hast taken away the grapes from me, for my wickednesses; for my wailings be many, and my heart is in mourning.)"}]