[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-12 With self-preference, Job declared that he needed not to be taught by them. Those who dispute are tempted to magnify themselves, and lower their brethren, more than is fit. When dismayed or distressed with the fear of wrath, the force of temptation, or the weight of affliction, we should apply to the Physician of our souls, who never rejects any, never prescribes amiss, and never leaves any case uncured. To Him we may speak at all times. To broken hearts and wounded consciences, all creatures, without Christ, are physicians of no value. Job evidently speaks with a very angry spirit against his friends. They had advanced some truths which nearly concerned Job, but the heart unhumbled before God, never meekly receives the reproofs of men.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Will ye accept his person? - That is, will you be partial to him? The language is such as is used in relation to courts of justice, where a judge shows favor to one of the parties on account of birth, rank, wealth, or personal friendship. The idea here is, \"will you, from partiality to God, maintain unjust principles, and defend positions which are really untenable?\" There was a controversy between Job and God. Job maintained that he was punished too severely; that the divine dealings were unequal and disproportioned to his offences. His friends, he alleges, have not done justice to the arguments which he had urged, but had taken sides with God against him, no matter what he urged or what he said. So little disposed were they to do justice to him and to listen to his vindication, that no matter what he said, they set it all down to impatience, rebellion, and insubmission.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They assumed that he was wrong, and that God was wholly right in all flyings. Of this position that God was right, no one could reasonably complain, and in his sober reflections Job himself would not be disposed to object to it; but his complaint is, that though the considerations which he urged were of the greatest weight, they would not allow their force, simply because they were determined to vindicate God. Their position was, that God dealt with people strictly according to their character; and that no matter what they suffered, their sufferings were the exact measure of their ill desert. Against this position, they would hear nothing that Job could say; and they maintained it by every kind of argument which was at their command - whether sound or unsound, sophistical or solid. Job says that this was showing partiality for God, and he felt that he had a right to complain. We need never show \"partiality\" even for God. He can be vindicated by just and equal arguments; and we need never injure others while we vindicate him. Our arguments for him should indeed be reverent, and we should desire to vindicate his character and government; but the considerations which we urge need not be those of mere partiality and favor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Will ye contend for God? - Language taken from a court of justice, and referring to an argument in favor of a party or cause. Job asks whether they would undertake to maintain the cause of God, and he may mean to intimate that they were wholly disqualified for such an undertaking. He not only reproves them for a lack of candor and impartiality, as in the previous expressions, but he means to say that they were unfitted in all respects to be the advocates of God. They did not understand the principles of his administration. Their views were narrow, their information limited, and their arguments either common-place or unsound. According to this interpretation, the emphasis will be on the word \"ye\" - \"will YE contend for God?\" The whole verse may mean, \"God is not to be defended by mere partiality, or favor. Solid arguments only should be employed in his cause. Such you have not used, and you have shown yourselves to be entirely unfitted for this great argument.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The practical inference which we should draw from this is, that our arguments in defense of the divine administration, should be solid and sound. They should not be mere declamation, or mere assertion. They should be such as will become the great theme, and such as will stand the test of any proper trial that can be applied to reasoning. There are arguments which will \"vindicate all God's ways to men;\" and to search them out should be one of the great employments of our lives. If ministers of the gospel would always abide by these principles, they would often do much more than they do now to commend religion to the sober views of mankind. No people are under greater temptations to use weak or unsound arguments than they are. They feel it to be their duty at all hazards to defend the divine administration. They are in circumstances where their arguments will not be subjected to the searching process which an argument at the bar will be, where a keen and interested opponent is on the alert, and will certainly sift every argument which is urged.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Either by inability to explain the difficulties of the divine government, or by indolence in searching out arguments, or by presuming on the ignorance and dullness of their hearers, or by a pride which will not allow them to confess their ignorance on any subject, they are in danger of attempting to hide a difficulty which they cannot explain, or of using arguments and resorting to reasoning, which would be regarded as unsound or worthless any where else. A minister should always remember that sound reasoning is as necessary in religion as in other things, and that there are always some people who can detect a fallacy or see through sophistry. With what diligent study then should the ministers of the gospel prepare for their work! How careful should they be, as the advocates of God and his cause in a world opposed to him, to find out solid arguments, to meet with candor every objection, and to convince people by sound reasoning, that God is right! Their work is to convince, not to denounce; and if there is any office of unspeakable responsibility on earth, it is that of undertaking to be the advocates of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Either by inability to explain the difficulties of the divine government, or by indolence in searching out arguments, or by presuming on the ignorance and dullness of their hearers, or by a pride which will not allow them to confess their ignorance on any subject, they are in danger of attempting to hide a difficulty which they cannot explain, or of using arguments and resorting to reasoning, which would be regarded as unsound or worthless any where else. A minister should always remember that sound reasoning is as necessary in religion as in other things, and that there are always some people who can detect a fallacy or see through sophistry. With what diligent study then should the ministers of the gospel prepare for their work! How careful should they be, as the advocates of God and his cause in a world opposed to him, to find out solid arguments, to meet with candor every objection, and to convince people by sound reasoning, that God is right! Their work is to convince, not to denounce; and if there is any office of unspeakable responsibility on earth, it is that of undertaking to be the advocates of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. accept his person—God's; that is, be partial for Him, as when a judge favors one party in a trial, because of personal considerations.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "contend for God—namely, with fallacies and prepossessions against Job before judgment (Jud 6:31). Partiality can never please the impartial God, nor the goodness of the cause excuse the unfairness of the arguments.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Will ye accept his person?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not judging according to the right of the cause, but the quality of the person, as corrupt judges do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Will ye contend, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. wrangle and quarrel with me, and cavil at my speeches, and pervert my meaning? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. that you may gratify him, or defend his rights. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Will ye accept his person?.... Accepting persons ought not to be done in judgment by earthly judges; which is done when they give a cause to one through favour and affection to his person, because rich, or their friend, and against another, because otherwise; and something like this Job intimates his friends did in the present case; they only considered what God was, holy, just, wise, and good in all he did, and so far they were right, and too much respect cannot be given him; but the fault was, that they only attended to this, and did not look into the cause of Job itself, but wholly neglected it, and gave it against him, he being poor, abject, and miserable, on the above consideration of the perfections of God; which looked like what is called among men acceptation, or respect of persons: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "will ye contend for God? it is right to contend for God, for the being of God against atheists, for the perfections of God, his sovereignty, his omniscience, omnipresence, &c. against those that deny them, for his truths and doctrines, word, worship, and ordinances, against the corrupters of them; but then he and those are not to be contended for in a foolish and imprudent manner, or with a zeal, not according to knowledge, much less with an hypocritical one, as was Jehu's, 2 Kings 10:28; God needs no such advocates, he can plead his own cause, or make use of persons that can do it in a better manner, and to better purpose. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "will ye contend for God? it is right to contend for God, for the being of God against atheists, for the perfections of God, his sovereignty, his omniscience, omnipresence, &c. against those that deny them, for his truths and doctrines, word, worship, and ordinances, against the corrupters of them; but then he and those are not to be contended for in a foolish and imprudent manner, or with a zeal, not according to knowledge, much less with an hypocritical one, as was Jehu's, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 10:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; God needs no such advocates, he can plead his own cause, or make use of persons that can do it in a better manner, and to better purpose. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Will ye accept his person? will ye contend for God?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The same charge put more explicitly. To accept the person of one is to be partial on his side, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 13:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "contend for God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i. e. will ye play the advocate for God? The charge made against his friends by Job is that they had no knowledge of his guilt, and merely took part for God against him out of servility to God. This servility was nothing but a superficial religiousness, allied to superstition, which did not form its conception of God from the broad facts of the universe.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will ye accept his person?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "will ye contend for God?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Job intends to accuse his opponents of leaning unduly to God's side, and being prepared to justify him in the teeth of reason and justice. This is like the conduct of a judge who should allow his decision to be biassed by favour towards one or the other party in a suit. Job 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  7  Will ye speak what is wrong for God, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And speak what is deceitful for Him?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  8  Will ye be partial for Him,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or will ye play the part of God's advocates?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  9  Would it be pleasant if He should search you out,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or can ye jest with Him, as one jesteth with men?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  He will surely expose you",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If ye secretly act with partiality.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11  Will not His majesty confound you,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And His fear fall upon you?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Their advocacy of God - this is the thought of this strophe - is an injustice to Job, and an evil service rendered to God, which cannot escape undisguised punishment from Him. They set themselves up as God's advocates (לאל ריב, like לבּעל ריב, Judges 6:31), and at the same time accept His person, accipiunt (as in acceptus  equals  gratus), or lift it up, i.e., favour, or give preference to, His person, viz., at the expense of the truth: they are partial in His favour, as they are twice reminded and given to understand by the fut. energicum תּשּׂאוּן. The addition of בּסּתר (Job 13:10) implies that they conceal their better knowledge by the assumption of an earnest tone and bearing, expressive of the strongest conviction that they are in the right. They know that Job is not a flagrant sinner; nevertheless they deceive themselves with the idea that he is, and by reason of this delusion they take up the cause of God against him. Such perversion of the truth in majorem Dei gloriam is an abomination to God. When He searches them, His advocates, out (חקר, as Prov.Job 28:11), they will become conscious of it; or will God be mocked, as one mocketh mortal men? Comp. Galatians 6:7 for a similar thought. חתל is inf. absol. after the form תּללּ, and תּהתלּוּ is also to be derived from תּללּ, and is fut. Hiph., the preformative not being syncopated, for תּתלּוּ (Ges. 53, rem. 7); not Piel, from התל (as 1 Kings 18:27), with the doubling of the middle radical resolved (Olsh. in his Lehrb. S. 577). God is not pleased with λατρεία (John 16:2) which gives the honour to Him, but not to truth, such ζῆλος Θεοῦ ἀλλ ̓ ου ̓ κατ ̓ ἐπίγνωσιν (Romans 10:2), such advocacy contrary to one's better knowledge and conscience, in which the end is thought to sanctify the means. Such advocacy must be put to shame and confounded when He who needs no concealment of the truth for His justification is manifest in His שׂאת, i.e., not: in the kindling of His wrath (after Judges 20:38; Isaiah 30:27), but: in His exaltation (correctly by Ralbag: התנשׂאותו ורוממותו), and by His direct influence brings all untruth to light. It is the boldest thought imaginable, that one dare not have respect even to the person of God when one is obliged to lie to one's self. And still it is also self-evident. For God and truth can never be antagonistic. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Their advocacy of God - this is the thought of this strophe - is an injustice to Job, and an evil service rendered to God, which cannot escape undisguised punishment from Him. They set themselves up as God's advocates (לאל ריב, like לבּעל ריב, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and at the same time accept His person, accipiunt (as in acceptus  equals  gratus), or lift it up, i.e., favour, or give preference to, His person, viz., at the expense of the truth: they are partial in His favour, as they are twice reminded and given to understand by the fut. energicum תּשּׂאוּן. The addition of בּסּתר (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") implies that they conceal their better knowledge by the assumption of an earnest tone and bearing, expressive of the strongest conviction that they are in the right. They know that Job is not a flagrant sinner; nevertheless they deceive themselves with the idea that he is, and by reason of this delusion they take up the cause of God against him. Such perversion of the truth in majorem Dei gloriam is an abomination to God. When He searches them, His advocates, out (חקר, as Prov.Job 28:11), they will become conscious of it; or will God be mocked, as one mocketh mortal men? Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 6:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for a similar thought. חתל is inf. absol. after the form תּללּ, and תּהתלּוּ is also to be derived from תּללּ, and is fut. Hiph., the preformative not being syncopated, for תּתלּוּ (Ges. 53, rem. 7); not Piel, from התל (as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), with the doubling of the middle radical resolved (Olsh. in his Lehrb. S. 577). God is not pleased with λατρεία (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 16:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") which gives the honour to Him, but not to truth, such ζῆλος Θεοῦ ἀλλ ̓ ου ̓ κατ ̓ ἐπίγνωσιν (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), such advocacy contrary to one's better knowledge and conscience, in which the end is thought to sanctify the means. Such advocacy must be put to shame and confounded when He who needs no concealment of the truth for His justification is manifest in His שׂאת, i.e., not: in the kindling of His wrath (after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 20:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but: in His exaltation (correctly by Ralbag: התנשׂאותו ורוממותו), and by His direct influence brings all untruth to light. It is the boldest thought imaginable, that one dare not have respect even to the person of God when one is obliged to lie to one's self. And still it is also self-evident. For God and truth can never be antagonistic. ",
            "children": []
          }
        ]
      }
    ]
  }
]