[{"header":"Greetings"},{"num":1,"verse":"Paul, a prisoner of King Jesus, and Timothy our brother: to our beloved Philemon, our colleague and partner, "},{"num":2,"verse":"to Apphia our sister, and to Archippus our comrade-in-arms, and to God’s people who meet in their house. "},{"num":3,"verse":"May grace and peace be upon you, from God our father and King Jesus the Lord."},{"num":4,"verse":"I always thank my God when your name comes up in my prayers, "},{"num":5,"verse":"because I’ve heard of your love and faithful loyalty towards the Lord Jesus and to all God’s people. "},{"num":6,"verse":"My prayer is this: that the partnership which goes with your faith may have its powerful effect, in realizing every good thing that is at work in us to lead us into the King. "},{"num":7,"verse":"You see, my dear brother, your love gives me so much joy and comfort! You have refreshed the hearts of God’s people."},{"header":"Paul’s Appeal"},{"num":8,"verse":"Because of all this I could be very bold in the King, and order you to do the right thing. "},{"num":9,"verse":"But, because of love, I’d much rather appeal to you – yes, it’s me, Paul, speaking, an old man as I am and now a prisoner of King Jesus! "},{"num":10,"verse":"I am appealing to you about my child, the one I have fathered here in prison: Onesimus, ‘Mr Useful’. "},{"num":11,"verse":"There was a time when he was useless to you; but now he’s very useful, to you and to me."},{"num":12,"verse":"I’m sending him to you for your decision – yes, sending the man himself; and this means sending my own heart. "},{"num":13,"verse":"I would have liked to keep him here with me, so that he could have been your representative in serving me in the chains of the gospel. "},{"num":14,"verse":"But I didn’t want to do anything without you knowing about it. That way, when you did the splendid thing that the situation requires, it wouldn’t be under compulsion, but of your own free will."},{"header":"Paul’s Perspective"},{"num":15,"verse":"Look at it like this. Maybe this is the reason he was separated from you for a while, so that you could have him back for ever – "},{"num":16,"verse":"no longer as a slave, but much more than a slave, as a beloved brother, beloved especially to me, but how much more to you, both as part of your household and in the Lord. "},{"num":17,"verse":"So, anyway, if you reckon me a partner in your work, receive him as though he was me. "},{"num":18,"verse":"And if he’s wronged you in any way, or owes you anything, put that down on my account. "},{"num":19,"verse":"This is me, Paul, writing with my own hand: I’ll pay you back (and far be it from me to remind you that you owe me your own very self!). "},{"num":20,"verse":"Yes, my brother, I want some benefit from you in the Lord! Refresh my heart in the King."},{"num":21,"verse":"As I write this I’m confident that you’ll do what I say. In fact, I know you’ll do more than I say. "},{"num":22,"verse":"But, at the same time, get a guest room ready for me. I’m hoping, you see, that through your prayers I will be granted to you."},{"num":23,"verse":"Epaphras, my fellow prisoner in King Jesus, sends you greetings. "},{"num":24,"verse":"So do Mark, Aristarchus, Demas and Luke, my colleagues here."},{"num":25,"verse":"The grace of the Lord, King Jesus, be with your spirit."}]