[{"num":1,"verse":"Sha’ul, a prisoner of Rebbe, Melech HaMoshiach Yehoshua and Timotiyos acheinu [(our) brother]. To Philemon ha’ahuv (the beloved) and our fellow po’el (worker)"},{"num":2,"verse":"And to Apphia achoteinu (our sister) and to Archippus our chaver leneshek (comrade arms) and to the Kehillah in your bais."},{"num":3,"verse":"Chen v’Chesed Hashem and Shalom Hashem to you from Elohim Avinu and from Rebbe, Melech HaMoshiach Adoneinu Yehoshua."},{"num":4,"verse":"I always offer a bracha to my G-d when I mention you in my tefillos (prayers),"},{"num":5,"verse":"Because I hear of your ahavah (agapé) and emunah, which you have for Rebbe, Melech HaMoshiach Adoneinu Yehoshua and for all the Kadoshim."},{"num":6,"verse":"[I pray] that your emunah (faith) being shared in Moshiach’s kiruv rechokim (bringing near the far away ones) may become effective in the da’as of every mitzvah we may do for Moshiach."},{"num":7,"verse":"For I had simcha gedolah (much joy) and chizzuk (encouragement) because of your ahavah, for the levavot of the Kadoshim have been refreshed through you, Ach b’Moshiach."},{"num":8,"verse":"Therefore, though I have much boldness in Rebbe, Melech HaMoshiach that I could in fact order you to do your chovah musarit (moral duty) of avodas hakodesh (holy service),"},{"num":9,"verse":"Yet I would rather make an appeal on the mekor (basis) of ahavah (agapé)‖I, [Rav] Sha’ul, the Zaken (Elder) but also a prisoner of Rebbe, Melech HaMoshiach Yehoshua."},{"num":10,"verse":"I appeal to you concerning beni, having \"fathered\" him (to a new birth) while in bais hasohar (prison)‖that is, Onesimus (T.N. the slave boy Onesimus’ name means \"Useful\")"},{"num":11,"verse":"The one once \"Useless\" to you, but, now, both to you and to me \"Useful\" (Onesimus)."},{"num":12,"verse":"I am sending him who is my very lev (heart) back to you."},{"num":13,"verse":"I was wanting to detain him with me, in order that he might function as a keli kodesh (minister), ministering to me in your place, as your murshe (proxy), while I’m detained in the imprisonment of the Besuras HaGeulah."},{"num":14,"verse":"But I wanted to do nothing without your haskamah (consent, approval), in order that the mitzvah you do might not be meshabed (caused to be obligated) or forced, but voluntary."},{"num":15,"verse":"Eppis (for some reason) perhaps he was separated from you for a while in order that you might have him back for Yamim HaOlam,"},{"num":16,"verse":"No longer as a bond servant, but, more than a bond servant, an ach ahuv (a beloved brother [in Moshiach]), especially to me, and how much more to you, both as a man and in Adoneinu."},{"num":17,"verse":"So if you consider me partnered to you as a chaver in our [common orthodox Jewish emunah], receive him as you would me."},{"num":18,"verse":"But if in anything he wronged you or owes you, charge this to my cheshbon (account, bill)."},{"num":19,"verse":"I, [Rav] Sha’ul, am writing this with my own hand: I will repay. This is not to meorer (point out) the fact that on your cheshbon you owe me your very neshamah."},{"num":20,"verse":"Yes, Ach b’Moshiach, I would have some \"usefulness\" from you in Adoneinu. Refresh my lev in Rebbe, Melech HaMoshiach."},{"num":21,"verse":"Confident of you as one who is shomer mitzvot, I am writing to you, knowing that you will do even above what I say."},{"num":22,"verse":"Also, this too, prepare a heimishe mekom linah (guest room, lodging place) for me, for I have the tikvah (hope) that through your tefillos I will be restored to you."},{"num":23,"verse":"Drishat Shalom to you from Epaphras, my coprisoner in Rebbe, Melech HaMoshiach Yehoshua."},{"num":24,"verse":"Drishat Shalom, also, from Markos, Aristarchus, Demas, and Lukas, my fellow po’alim (workers)."},{"num":25,"verse":"The Chen v’Chesed Hashem of Rebbe, Melech HaMoshiach Yehoshua be with your neshamah."}]