[{"header":"Salutation"},{"num":1,"verse":"Paul, a prisoner for Christ Jesus, and Timothy our brother,"},{"num":2,"verse":"and Apph′ia our sister and Archip′pus our fellow soldier, and the church in your house:"},{"num":3,"verse":"Grace to you and peace from God our Father and the Lord Jesus Christ."},{"header":"Philemon’s Love and Faith"},{"num":4,"verse":"I thank my God always when I remember you in my prayers, "},{"num":5,"verse":"because I hear of your love and of the faith which you have toward the Lord Jesus and all the saints, "},{"num":6,"verse":"and I pray that the sharing of your faith may promote the knowledge of all the good that is ours in Christ. "},{"num":7,"verse":"For I have derived much joy and comfort from your love, my brother, because the hearts of the saints have been refreshed through you."},{"header":"Paul’s Plea for Onesimus"},{"num":8,"verse":"Accordingly, though I am bold enough in Christ to command you to do what is required, "},{"num":9,"verse":"yet for love’s sake I prefer to appeal to you—I, Paul, an ambassador and now a prisoner also for Christ Jesus— "},{"num":10,"verse":"I appeal to you for my child, One′simus, whose father I have become in my imprisonment. "},{"num":11,"verse":"(Formerly he was useless to you, but now he is indeed useful to you and to me.) "},{"num":12,"verse":"I am sending him back to you, sending my very heart. "},{"num":13,"verse":"I would have been glad to keep him with me, in order that he might serve me on your behalf during my imprisonment for the gospel; "},{"num":14,"verse":"but I preferred to do nothing without your consent in order that your goodness might not be by compulsion but of your own free will."},{"num":15,"verse":"Perhaps this is why he was parted from you for a while, that you might have him back for ever, "},{"num":16,"verse":"no longer as a slave but more than a slave, as a beloved brother, especially to me but how much more to you, both in the flesh and in the Lord. "},{"num":17,"verse":"So if you consider me your partner, receive him as you would receive me. "},{"num":18,"verse":"If he has wronged you at all, or owes you anything, charge that to my account. "},{"num":19,"verse":"I, Paul, write this with my own hand, I will repay it—to say nothing of your owing me even your own self. "},{"num":20,"verse":"Yes, brother, I want some benefit from you in the Lord. Refresh my heart in Christ."},{"num":21,"verse":"Confident of your obedience, I write to you, knowing that you will do even more than I say. "},{"num":22,"verse":"At the same time, prepare a guest room for me, for I am hoping through your prayers to be granted to you."},{"header":"Final Greetings and Benediction"},{"num":23,"verse":"Ep′aphras, my fellow prisoner in Christ Jesus, sends greetings to you, "},{"num":24,"verse":"and so do Mark, Aristar′chus, Demas, and Luke, my fellow workers."},{"num":25,"verse":"The grace of the Lord Jesus Christ be with your spirit."}]