[[],[{"type":"header","content":"The Resurrection"},{"type":"prose","content":"But on the first day of the week, at early dawn, the women went to the tomb bringing the spices which they had prepared [to finish anointing the body]. "}],[{"type":"prose","content":"And they found the [large, circular] stone rolled back from the tomb, "}],[{"type":"prose","content":"but when they went inside, they did not find the body of the Lord Jesus. "}],[{"type":"prose","content":"While they were perplexed  wondering about this, suddenly, two men in dazzling clothing stood near them; "}],[{"type":"prose","content":"and as the women were terrified and were bowing their faces to the ground, the men said to them, “Why are you looking for the living One among the dead? "}],[{"type":"prose","content":"He is not here, but has risen. Remember how He told you, while He was still in Galilee, "}],[{"type":"prose","content":"saying that the Son of Man must be handed over to sinful men, and be crucified, and on the third day rise [from death to life].” "}],[{"type":"prose","content":"And they remembered His words, "}],[{"type":"prose","content":"and after returning from the tomb, they reported all these things to the eleven [apostles] and to all the rest. "}],[{"type":"prose","content":"Now they were Mary Magdalene and Joanna [the wife of Chuza, Herod’s steward] and Mary the  of James; also the other women with them were telling these things to the apostles. "}],[{"type":"prose","content":"But their report seemed to them like idle talk  nonsense, and they would not believe them. "}],[{"type":"prose","content":"But Peter got up and ran to the tomb. Stooping [at the small entrance] and looking in, he saw only the linen wrappings; and he went away, wondering about what had happened."},{"type":"header","content":"The Road to Emmaus"}],[{"type":"prose","content":"And then, that very day two of them were going to a village called Emmaus, which was about seven miles from Jerusalem. "}],[{"type":"prose","content":"And they were talking with each other about all these things which had taken place. "}],[{"type":"prose","content":"While they were talking and discussing it, Jesus Himself came up and  walking with them. "}],[{"type":"prose","content":"But their eyes were [miraculously] prevented from recognizing Him. "}],[{"type":"prose","content":"Then Jesus asked them,  And they stood still, looking brokenhearted. "}],[{"type":"prose","content":"One , named Cleopas, answered Him, “Are you the only stranger visiting Jerusalem who is unaware of the things which have happened here in these [recent] days?” "}],[{"type":"prose","content":"He asked,  And they replied, “The things about Jesus of Nazareth, who was a prophet powerful in deed and word in the sight of God and all the people, "}],[{"type":"prose","content":"and how the chief priests and our rulers handed Him over to be sentenced to death, and crucified Him. "}],[{"type":"prose","content":"But we were hoping that it was He who was going to redeem Israel  set our nation free. Indeed, besides all this, it is the third day since these things happened. "}],[{"type":"prose","content":"And also some of the women among us shocked us. They were at the tomb early in the morning, "}],[{"type":"prose","content":"and they did not find His body. Then they came back, saying that they had even seen a vision of angels who said that He was alive! "}],[{"type":"prose","content":"Some of those who were with us went to the tomb and found it just exactly as the women had said, but they did not see Him.” "}],[{"type":"prose","content":"Then Jesus said to them,   [only then to]  "}],[{"type":"prose","content":"Then beginning with Moses and [throughout] all the [writings of the] prophets, He explained  interpreted for them the things referring to Himself [found] in all the Scriptures."}],[{"type":"prose","content":"Then they approached the village where they were going, and He acted as if He were going farther. "}],[{"type":"prose","content":"But they urged Him [not to go on], saying, “Stay with us, because it is almost evening, and the day has just about ended.” So He went inside to stay with them. "}],[{"type":"prose","content":"And it happened that as He reclined  with them, He took the bread and blessed it, and breaking it, He  giving it to them. "}],[{"type":"prose","content":"Then their eyes were [suddenly] opened [by God] and they [clearly] recognized Him; and He vanished from their sight. "}],[{"type":"prose","content":"They said to one another, “Were not our hearts burning within us while He was talking with us on the road and opening the Scriptures to us?” "}],[{"type":"prose","content":"They got up that very hour and went back to Jerusalem, and found the eleven [apostles] gathered together and those who were with them, "}],[{"type":"prose","content":"saying, “The Lord has really risen and has appeared to Simon [Peter]!” "}],[{"type":"prose","content":"They  describing in detail what had happened on the road, and how Jesus was recognized by them when He broke the bread."},{"type":"header","content":"Other Appearances"}],[{"type":"prose","content":"While they were talking about this, Jesus Himself [suddenly] stood among them and said to them,  "}],[{"type":"prose","content":"But they were startled and terrified and thought that they were seeing a spirit. "}],[{"type":"prose","content":"And He said,   [the marks in]  [and see]  "}],[{"type":"prose","content":"After saying this, He showed them His hands and His feet. "}],[{"type":"prose","content":"While they still did not believe it because of their joy and amazement, He asked them,  "}],[{"type":"prose","content":"They gave Him a piece of broiled fish, "}],[{"type":"prose","content":"and He took it and ate it in front of them."}],[{"type":"prose","content":"Then He said to them,  [writings of the]  "}],[{"type":"prose","content":"Then He opened their minds to [help them] understand the Scriptures, "}],[{"type":"prose","content":"and said,   [necessary]    [the Holy Spirit]  [of Jerusalem] "},{"type":"header","content":"The Ascension"}],[{"type":"prose","content":"Then He led them out as far as Bethany, and lifted up His hands and blessed them. "}],[{"type":"prose","content":"While He was blessing them, He left them and was taken up into heaven. "}],[{"type":"prose","content":"And they worshiped Him and returned to Jerusalem with great joy [fully understanding that He lives and that He is the Son of God]; "}],[{"type":"prose","content":"and they were continually in the temple blessing  praising God."}]]