[{"num":1,"verse":"but on the first day of the week at deep dawn, they went to the tomb bringing the spices which they prepared. "},{"num":2,"verse":"And they found the stone having been rolled-away from the tomb. "},{"num":3,"verse":"But having gone in, they did not find the body of the Lord Jesus. "},{"num":4,"verse":"And it came about during their being perplexed about this, that behold— two men stood-near them in gleaming clothing. "},{"num":5,"verse":"And they having become terrified and bowing their faces to the ground, they said to them, “Why are you seeking the Living One among the dead? "},{"num":6,"verse":"He is not here, but He arose. Remember how He spoke to you while still being in Galilee, "},{"num":7,"verse":"saying as to the Son of Man that He must be handed-over into the hands of sinful men, and be crucified, and rise-up on the third day”. "},{"num":8,"verse":"And they remembered His words."},{"header":"The Women Report To The Others. Peter Runs To See"},{"num":9,"verse":"And having returned from the tomb, they reported all these things to the eleven and to all the rest. "},{"num":10,"verse":"Now the women were the Magdalene Mary, and Joanna, and Mary the mother of James, and the other women with them. They were saying these things to the apostles. "},{"num":11,"verse":"And these words appeared in their sight as if nonsense, and they were not-believing them. "},{"num":12,"verse":"But Peter, having arisen, ran to the tomb. And having stooped-to-look, he sees the linen-cloths only. And he went away marveling to himself as to the thing having taken place."},{"header":"Jesus Meets Two Disciples On The Way To Emmaus And Explains The Scriptures"},{"num":13,"verse":"And behold— two of them were going on the very day to a village being sixty stades distant from Jerusalem, for which the name was Emmaus. "},{"num":14,"verse":"And they were conversing with one another about all these things having happened. "},{"num":15,"verse":"And it came about during their conversing and discussing, that Jesus Himself, having drawn-near, was going with them. "},{"num":16,"verse":"But their eyes were being held-back that they might not recognize Him. "},{"num":17,"verse":"And He said to them, “What are these words which you are exchanging with one another while walking?” And they stood [still], sad-faced. "},{"num":18,"verse":"And having responded, one— Cleopas by name— said to Him, “Are You alone staying in Jerusalem and did not know the things having taken place in it in these days?” "},{"num":19,"verse":"And He said to them, “What things?” And the ones said to Him, “The things concerning Jesus from-Nazareth, Who became a man who was a prophet, powerful in deed and word before God and all the people; "},{"num":20,"verse":"and how the chief priests and our rulers handed Him over for condemnation to death, and they crucified Him. "},{"num":21,"verse":"But we were hoping that He was the One going to redeem Israel. Yet indeed also in-addition-to all these things, it is the third day from which time these things took place. "},{"num":22,"verse":"Yet some women from-among us also astonished us. Having come-to-be at the tomb very-early, "},{"num":23,"verse":"and not having found His body, they came saying also to have seen a vision of angels who say that He is alive. "},{"num":24,"verse":"And some of the ones with us went to the tomb and found it so— just as the women indeed said. But they did not see Him”. "},{"num":25,"verse":"And He said to them, “O foolish ones, and slow in the heart to be putting-faith upon all that the prophets spoke! "},{"num":26,"verse":"Did not the Christ have-to suffer these things, and enter into His glory?” "},{"num":27,"verse":"And beginning from Moses and from all the prophets, He interpreted to them the things concerning Himself in all the Scriptures. "},{"num":28,"verse":"And they drew-near to the village where they were going. And He made-as-if to be proceeding farther. "},{"num":29,"verse":"And they strongly-urged Him, saying “Stay with us, because it is toward evening, and the day has already declined”. And He went in that He might stay with them. "},{"num":30,"verse":"And it came about at His lying down [to eat] with them that having taken the bread, He blessed it . And having broken it, He was giving it to them. "},{"num":31,"verse":"And their eyes were opened, and they recognized Him. And He became invisible from them. "},{"num":32,"verse":"And they said to one another, “Was not our heart burning within us as He was speaking to us on the road, as He was opening the Scriptures to us?”"},{"header":"Jesus Appears To The Eleven And Helps Them Understand The Scriptures"},{"num":33,"verse":"And having arisen at the very hour, they returned to Jerusalem. And they found the eleven and the ones with them having been assembled, "},{"num":34,"verse":"saying that “The Lord really arose! And He appeared to Simon”. "},{"num":35,"verse":"And they were describing the things on the road, and how He was recognized by them in the breaking of the bread. "},{"num":36,"verse":"And while they were speaking these things, He Himself stood in the midst of them. And He says to them, “Peace to you”. "},{"num":37,"verse":"But having been frightened and having become terrified, they were thinking that they were seeing a spirit. "},{"num":38,"verse":"And He said to them, “Why are you troubled? And for what reason are doubts coming-up in your heart? "},{"num":39,"verse":"Look at My hands and My feet, that I am Myself. Touch Me and see, because a spirit does not have flesh and bones as you observe Me having”. "},{"num":40,"verse":"And having said this, He showed them His hands and His feet. "},{"num":41,"verse":"But while they were still not-believing it because of the joy, and marveling, He said to them, “Do you have something edible here?” "},{"num":42,"verse":"And the ones gave Him a part of a broiled fish. "},{"num":43,"verse":"And having taken it, He ate it in their presence. "},{"num":44,"verse":"And He said to them, “These are My words which I spoke to you while still being with you— that all the things having been written about Me in the Law of Moses and the Prophets and the Psalms must be fulfilled”. "},{"num":45,"verse":"Then He opened their mind that they might understand the Scriptures."},{"header":"The Christ Had To Suffer And Rise Up, And The Message Go Forth. You Are Witnesses"},{"num":46,"verse":"And He said to them that “Thus it has been written— that the Christ suffers and rises-up from the dead on the third day, "},{"num":47,"verse":"and that repentance for the forgiveness of sins is proclaimed on the basis of His name to all the nations, beginning from Jerusalem. "},{"num":48,"verse":"You are witnesses of these things. "},{"num":49,"verse":"And behold— I am sending-forth the promise of My Father upon you. But you sit in the city until which time you put-on power from on-high”."},{"header":"Jesus Ascends Into Heaven"},{"num":50,"verse":"And He led them outside until near Bethany. And having lifted-up His hands, He blessed them. "},{"num":51,"verse":"And it came about during His blessing them that He separated from them, and was being carried-up into heaven. "},{"num":52,"verse":"And they, having worshiped Him, returned to Jerusalem with great joy. "},{"num":53,"verse":"And they were continually in the temple blessing God."}]