[{"header":"Jesus Comes Back to Life(A)"},{"num":24,"verse":"Very early on Sunday morning the women went to the tomb. They were carrying the spices that they had prepared. "},{"num":2,"verse":"They found that the stone had been rolled away from the tomb. "},{"num":3,"verse":"When they went in, they did not find the body of the Lord Yeshua. "},{"num":4,"verse":"While they were puzzled about this, two men in clothes that were as bright as lightning suddenly stood beside them. "},{"num":5,"verse":"The women were terrified and bowed to the ground."},{"num":6,"verse":"He’s not here. He has been brought back to life! Remember what he told you while he was still in Galilee. "},{"num":7,"verse":"He said, ‘The Son of Man must be handed over to sinful people, be crucified, and come back to life on the third day.’” "},{"num":8,"verse":"Then the women remembered what Yeshua had told them."},{"num":9,"verse":"The women left the tomb and went back to the city. They told everything to the eleven apostles and all the others. "},{"num":10,"verse":"The women were Mary from Magdala, Joanna, and Mary (the mother of James). There were also other women with them. They told the apostles everything."},{"num":11,"verse":"The apostles thought that the women’s story didn’t make any sense, and they didn’t believe them."},{"num":12,"verse":"But Peter got up and ran to the tomb. He bent down to look inside and saw only the strips of linen. Then he went away, wondering what had happened."},{"header":"Jesus Appears to Disciples on a Road to Emmaus"},{"num":13,"verse":"On the same day, two of Yeshua’s disciples were going to a village called Emmaus. It was about seven miles from Jerusalem. "},{"num":14,"verse":"They were talking to each other about everything that had happened."},{"num":15,"verse":"While they were talking, Yeshua approached them and began walking with them. "},{"num":16,"verse":"Although they saw him, they didn’t recognize him."},{"num":17,"verse":"He asked them, “What are you discussing?”"},{"num":18,"verse":"One of them, Cleopas, replied, “Are you the only one in Jerusalem who doesn’t know what has happened recently?”"},{"num":19,"verse":"“What happened?” he asked."},{"num":20,"verse":"Our chief priests and rulers had him condemned to death and crucified. "},{"num":21,"verse":"We were hoping that he was the one who would free Israel. What’s more, this is now the third day since everything happened. "},{"num":22,"verse":"Some of the women from our group startled us. They went to the tomb early this morning "},{"num":23,"verse":"and didn’t find his body. They told us that they had seen angels who said that he’s alive. "},{"num":24,"verse":"Some of our men went to the tomb and found it empty, as the women had said, but they didn’t see him.”"},{"num":25,"verse":"Then Yeshua said to them, “How foolish you are! You’re so slow to believe everything the prophets said! "},{"num":26,"verse":"Didn’t the Messiah have to suffer these things and enter into his glory?” "},{"num":27,"verse":"Then he began with Moses’ Teachings and the Prophets to explain to them what was said about him throughout the Scriptures."},{"num":28,"verse":"When they came near the village where they were going, Yeshua acted as if he were going farther. "},{"num":29,"verse":"They urged him, “Stay with us! It’s getting late, and the day is almost over.” So he went to stay with them."},{"num":30,"verse":"While he was at the table with them, he took bread and blessed it. He broke the bread and gave it to them. "},{"num":31,"verse":"Then their eyes were opened, and they recognized him. But he vanished from their sight."},{"num":32,"verse":"They said to each other, “Weren’t we excited when he talked with us on the road and opened up the meaning of the Scriptures for us?”"},{"num":33,"verse":"That same hour they went back to Jerusalem. They found the eleven apostles and those who were with them gathered together. "},{"num":34,"verse":"They were saying, “The Lord has really come back to life and has appeared to Simon.”"},{"num":35,"verse":"Then the two disciples told what had happened on the road and how they had recognized Yeshua when he broke the bread."},{"header":"Jesus Appears to the Apostles(B)"},{"num":36,"verse":"While they were talking about what had happened, Yeshua stood among them. He said to them, “Peace be with you!” "},{"num":37,"verse":"They were terrified, and thought they were seeing a ghost."},{"num":38,"verse":"He asked them, “Why are you afraid? Why do you have doubts? "},{"num":39,"verse":"Look at my hands and feet, and see that it’s really me. Touch me, and see for yourselves. Ghosts don’t have flesh and bones, but you can see that I do.” "},{"num":40,"verse":"As he said this, he showed them his hands and feet."},{"num":41,"verse":"The disciples were overcome with joy and amazement because this seemed too good to be true. Then Yeshua asked them, “Do you have anything to eat?” "},{"num":42,"verse":"They gave him a piece of broiled fish. "},{"num":43,"verse":"He took it and ate it while they watched him."},{"num":44,"verse":"Then he said to them, “These are the words I spoke to you while I was still with you. I told you that everything written about me in Moses’ Teachings, the Prophets, and the Psalms had to come true.” "},{"num":45,"verse":"Then he opened their minds to understand the Scriptures. "},{"num":46,"verse":"He said to them, “Scripture says that the Messiah would suffer and that he would come back to life on the third day. "},{"num":47,"verse":"Scripture also says that by the authority of Yeshua people would be told to turn to God and change the way they think and act so that their sins will be forgiven. This would be told to people from all nations, beginning in the city of Jerusalem."},{"num":48,"verse":"You are witnesses to these things."},{"num":49,"verse":"“I’m sending you what my Father promised. Wait here in the city until you receive power from heaven.”"},{"num":50,"verse":"Then Yeshua took them to a place near Bethany. There he raised his hands and blessed them. "},{"num":51,"verse":"While he was blessing them, he left them and was taken to heaven."},{"num":52,"verse":"The disciples worshiped him and were overjoyed as they went back to Jerusalem. "},{"num":53,"verse":"They were always in the temple, where they praised God."}]