[{"num":24,"verse":"Early on Sunday morning, even before the sun had fully risen, these women made their way back to the tomb with the spices and ointments they had prepared. "},{"num":2,"verse":"When they arrived, they found the stone was rolled away from the tomb entrance, "},{"num":3,"verse":"and when they looked inside, the body of the Lord Jesus was nowhere to be seen. "},{"num":4,"verse":"They didn’t know what to think. As they stood there in confusion, two men suddenly appeared standing beside them. These men seemed to glow with light. "},{"num":5,"verse":"The women were so terrified that they fell to the ground facedown."},{"num":8,"verse":"The women did remember Jesus’ words about this, "},{"num":9,"verse":"so they returned from the tomb and found the eleven and recounted for them—and others with them—everything they had experienced. "},{"num":10,"verse":"The Lord’s emissaries heard their stories as fiction, a lie; they didn’t believe a word of it. (By the way, this group of women included Mary Magdalene, Joanna, and Mary the mother of James, along with a number of others.) "},{"num":12,"verse":"Peter, however, got up and ran to the tomb. When he reached the opening, he bent down, looked inside, and saw the linen burial cloths lying there. But the body was gone. He walked away, full of wonder about what had happened."},{"num":13,"verse":"Picture this:"},{"num":14,"verse":"As they walk along, they talk back and forth about all that has transpired during recent days. "},{"num":15,"verse":"While they’re talking, discussing, and conversing, Jesus catches up to them and begins walking with them, "},{"num":16,"verse":"but for some reason they don’t recognize Him."},{"num":18,"verse":"One of them—Cleopas is his name—speaks up."},{"num":27,"verse":"Then He begins with Moses and continues, prophet by prophet, explaining the meaning of the Hebrew Scriptures, showing how they were talking about the very things that had happened to Jesus."},{"num":28,"verse":"About this time, they are nearing their destination. Jesus keeps walking ahead as if He has no plans to stop there, "},{"num":29,"verse":"but they convince Him to join them."},{"num":30,"verse":"When they sit down at the table for dinner, He takes the bread in His hands, He gives thanks for it, and then He breaks it and hands it to them. "},{"num":31,"verse":"At that instant, two things happen simultaneously: their eyes are suddenly opened so they recognize Him, and He instantly vanishes—just disappears before their eyes."},{"num":33,"verse":"So they get up immediately and rush back to Jerusalem—all seven miles—where they find the eleven gathered together—the eleven plus a number of others. "},{"num":34,"verse":"Before Cleopas and his companion can tell their story, the others have their own story to tell."},{"num":35,"verse":"Then the two men report their own experience—their conversation along the road, their moment of realization and recognition as He broke the bread. "},{"num":36,"verse":"At that very instant, as they’re still telling the story, Jesus is there, standing among them!"},{"num":37,"verse":"They’re startled and terrified; they think they’re seeing a ghost."},{"num":40,"verse":"[Then He shows them His hands and His feet.]"},{"num":41,"verse":"Now their fear gives way to joy; but it seems too good to be true, and they’re still unsure."},{"num":42,"verse":"They hand Him a piece of broiled fish, "},{"num":43,"verse":"and He takes it and eats it in front of them."},{"num":45,"verse":"Then He opens their minds so they can comprehend the meaning of the Hebrew Scriptures."},{"num":50,"verse":"Then He leads them out to Bethany. He lifts up His hands and blesses them, "},{"num":51,"verse":"and at that moment, with His hands raised in blessing, He leaves them and is carried up into heaven. "},{"num":52,"verse":"They worship Him, then they return to Jerusalem, filled with intense joy, "},{"num":53,"verse":"and they return again and again to the temple to celebrate God."}]