[{"header":"The First Beast"},{"num":13,"verse":"And I saw a beast rising out of the sea, with ten horns and seven heads, with ten diadems upon its horns and a blasphemous name upon its heads. "},{"num":2,"verse":"And the beast that I saw was like a leopard, its feet were like a bear’s, and its mouth was like a lion’s mouth. And to it the dragon gave his power and his throne and great authority. "},{"num":3,"verse":"One of its heads seemed to have a mortal wound, but its mortal wound was healed, and the whole earth followed the beast with wonder. "},{"num":4,"verse":"Men worshiped the dragon, for he had given his authority to the beast, and they worshiped the beast, saying, “Who is like the beast, and who can fight against it?”"},{"num":5,"verse":"And the beast was given a mouth uttering haughty and blasphemous words, and it was allowed to exercise authority for forty-two months; "},{"num":6,"verse":"it opened its mouth to utter blasphemies against God, blaspheming his name and his dwelling, that is, those who dwell in heaven. "},{"num":7,"verse":"Also it was allowed to make war on the saints and to conquer them. And authority was given it over every tribe and people and tongue and nation, "},{"num":8,"verse":"and all who dwell on earth will worship it, every one whose name has not been written before the foundation of the world in the book of life of the Lamb that was slain. "},{"num":9,"verse":"If any one has an ear, let him hear:"},{"header":"The Second Beast"},{"num":11,"verse":"Then I saw another beast which rose out of the earth; it had two horns like a lamb and it spoke like a dragon. "},{"num":12,"verse":"It exercises all the authority of the first beast in its presence, and makes the earth and its inhabitants worship the first beast, whose mortal wound was healed. "},{"num":13,"verse":"It works great signs, even making fire come down from heaven to earth in the sight of men; "},{"num":14,"verse":"and by the signs which it is allowed to work in the presence of the beast, it deceives those who dwell on earth, bidding them make an image for the beast which was wounded by the sword and yet lived; "},{"num":15,"verse":"and it was allowed to give breath to the image of the beast so that the image of the beast should even speak, and to cause those who would not worship the image of the beast to be slain. "},{"num":16,"verse":"Also it causes all, both small and great, both rich and poor, both free and slave, to be marked on the right hand or the forehead, "},{"num":17,"verse":"so that no one can buy or sell unless he has the mark, that is, the name of the beast or the number of its name. "},{"num":18,"verse":"This calls for wisdom: let him who has understanding reckon the number of the beast, for it is a human number, its number is six hundred and sixty-six."}]