[{"num":13,"verse":"I saw a beast with ten horns and seven heads rising out of the blackness of the sea. On its horns hung ten crowns, and on its heads were inscribed blasphemous names. "},{"num":2,"verse":"This beast was like a leopard, its feet were like the claws of a bear, and its mouth was like the jaws of a lion. The dragon bestowed it with his power and his throne and his great authority. "},{"num":3,"verse":"One of the beast’s heads appeared to have suffered a fatal blow, but its mortal wound had somehow been healed. Amazed at the miracle and its power, all the earth followed the beast. "},{"num":4,"verse":"People worshiped the dragon because he had given his authority to the beast, and they worshiped the beast because of its power."},{"num":5,"verse":"And the beast was given a mouth that bellowed arrogant boasts and uttered great blasphemies, and it was permitted to do what it willed for 42 months. "},{"num":6,"verse":"Its mouth opened with a stream of insults against God, blaspheming His name, cursing His dwelling and those who live in heaven. "},{"num":7,"verse":"Also it received permission to declare war against the saints and conquer them. Not a single nation, people, language, or ethnicity could escape its dominion. "},{"num":8,"verse":"The inhabitants of the earth will worship it, that is, all those whose names have not been recorded before the foundation of the world in the book of life of the Lamb who was slaughtered."},{"num":9,"verse":"Let the person who is able to hear, listen carefully."},{"num":11,"verse":"As I watched, I saw a second beast, this one rising up from the earth. It had two horns like a lamb, but it was speaking with the voice of a dragon."},{"num":12,"verse":"This earth-beast exercises all of the authority given to it by the first beast, and it forces the earth and all its inhabitants to bow down and worship the first beast, whose mortal wound had been healed. "},{"num":13,"verse":"And the earth-beast performs fantastic miracles. Like Elijah on Mount Carmel, it even causes fire to blaze down from heaven to earth for all to see. "},{"num":14,"verse":"Since it is allowed to perform these miracles in the presence of the first beast, the earth-beast deceives the inhabitants of the earth, commanding them to make an image of the first beast that had survived the mortal wound inflicted by the sword. "},{"num":15,"verse":"And the earth-beast was granted permission to breathe into the image and to animate it so that it could even speak. It decreed that those who refuse to worship the image of the first beast must be killed, "},{"num":16,"verse":"and the earth-beast mandates that all humans must carry a mark on their right hands or foreheads: both great and small, both rich and poor, both free and slave."},{"num":17,"verse":"Those who do not carry this mark, that is, those who do not have the name of the first beast or the number representing its name inscribed on them, are not allowed to sell their wares or buy in the market."},{"num":18,"verse":"Here is divine wisdom: let anyone who understands these mysteries figure out the number of the beast because it is the number of a person. Its number is 666."}]