[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joanna, the wife of Chuza.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Here again we have a convert of the upper class. The name was the feminine form of Joannes, and appears in modern languages abbreviated into Joanne, Joan, or Jane. Nothing further is known of Chuza—but the “steward” (the same word as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the “tutor” or “guardian” of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the Tetrarch, the manager of his income and expenditure, must have been a man of some mark. We may think of him and his wife as having probably come under the influence of the Baptist or of Manaen, the foster-brother of the Tetrarch, probably also of one of the “servants” to whom Antipas imparted his belief that John the Baptist was risen from the dead. Joanna appears again in the history of the Resurrection (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is possible, as suggested in the Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that he may have been identical with the “nobleman” or “member of the royal household” at Capernaum. On this supposition her ministration may have been the result of overflowing gratitude for the restored life of her son.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Susanna.—The name, which meant a “lily” (comp. Rhoda, “a rose,” in Acts 12:13, and Tamar, “a palm,” in Genesis 38:6, 2Samuel 13:2, as parallel instances of feminine names derived from flowers or trees), meets us in the well-known Apocryphal addition to the Book of Daniel known as Susanna and the Elders. Nothing further is known of the person thus named.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Susanna.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The name, which meant a “lily” (comp. Rhoda, “a rose,” in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Tamar",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “a palm,” in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 38:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Samuel 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as parallel instances of feminine names derived from flowers or trees), meets us in the well-known Apocryphal addition to the Book of Daniel known as ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Susanna and the Elders.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Nothing further is known of the person thus named.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Many others.—It seems clear that St. Luke must have come into personal contact with some, at least, of those whom he describes so fully. They were, we may well believe, among the “eye-witnesses and ministers of the word” (Luke 1:2) from whom he derived much of his information. (See Introduction.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Many others.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It seems clear that St. Luke must have come into personal contact with some, at least, of those whom he describes so fully. They were, we may well believe, among the “eye-witnesses and ministers of the word” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") from whom he derived much of his information. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Introduction.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-3 We are here told what Christ made the constant business of his life, it was teaching the gospel. Tidings of the kingdom of God are glad tidings, and what Christ came to bring. Certain women attended upon him who ministered to him of their substance. It showed the mean condition to which the Saviour humbled himself, that he needed their kindness, and his great humility, that he accepted it. Though rich, yet for our sakes he became poor.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Herod's steward - Herod Antipas, who reigned in Galilee. He was a son of Herod the Great. The word \"steward\" means one who has charge of the domestic affairs of a family, to provide for it. This office was generally held by a \"slave\" who was esteemed the most faithful, and was often conferred as a reward of fidelity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ministered - Gave for his support.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of their substance - Their property; their possessions. Christians then believed, when they professed to follow Christ, that it was proper to give \"all\" up to him - their property as well as their hearts; and the same thing is still required that is, to commit all that we have to his disposal; to be willing to part with it for the promotion of his glory, and to leave it when he calls us away from it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of their substance - Their property; their possessions. Christians then believed, when they professed to follow Christ, that it was proper to give \"all\" up to him - their property as well as their hearts; and the same thing is still required that is, to commit all that we have to his disposal; to be willing to part with it for the promotion of his glory, and to leave it when he calls us away from it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. Joanna, wife of Chuza, Herod's steward—If the steward of such a godless, cruel, and licentious wretch as Herod Antipas (see on [1595]Mr 6:14, &c.) differed greatly from himself, his post would be no easy or enviable one. That he was a disciple of Christ is very improbable, though he might be favorably disposed towards Him. But what we know not of him, and may fear he lacked, we are sure his wife possessed. Healed either of \"evil spirits\" or of some one of the \"infirmities\" here referred to—the ordinary diseases of humanity—she joins in the Saviour's train of grateful, clinging followers. Of \"Susanna,\" next mentioned, we know nothing but the name, and that here only. But her services on this memorable occasion have immortalized her name. \"Wheresoever this gospel shall be preached throughout the whole world, this also that she hath done,\" in ministering to the Lord of her substance on His Galilean tour, \"shall be spoken of as a memorial of her\" (Mr 14:9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "many others—that is, many other healed women. What a train! and all ministering unto Him of their substance, and He allowing them to do it and subsisting upon it! \"He who was the support of the spiritual life of His people disdained not to be supported by them in the body. He was not ashamed to penetrate so far into the depths of poverty as to live upon the alms of love. He only fed others miraculously; for Himself, He lived upon the love of His people. He gave all things to men, His brethren, and received all things from them, enjoying thereby the pure blessing of love: which is then only perfect when it is at the same time both giving and receiving. Who could invent such things as these? It was necessary to live in this manner that it might be so recorded\" [Olshausen].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 8:3\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joanna, the wife of Chuza, Herod's steward,.... Joanna, or Juchan, as the Syriac version calls her, was a name, among the Jews, for a woman, as Jochanan, or John, was for a man. In the Talmud (e) we read of one Jochani, or Joanni, the daughter of Retibi, the same name with this. Her husband's name was Chuza. Dr. Lightfoot observes, from a Talmudic treatise (f), such a name in the genealogy of Haman, who is called the son of Chuza; and Haman being an Edomite, and this man being in the family of Herod, who was of that race, suggests it to be an Idumean name. But in my edition of that treatise, Haman is not called the son of Chuza, but , \"the son of Ciza\"; and besides, Chuza is a Jewish name, and the name of a family of note among the Jews: hence we read (g) of R. Broka the Chuzite; where the gloss is, \"for he was\", , \"of the family of Chuzai\". And elsewhere (h) mention is made of two sons of Chuzai; and both the gloss, and Piske Harosh upon the place, say, \"they were Jews\": so Abimi is said to be of the family of Chuzai, or the Chuzites (i); and the same is said of R. Acha (k). This man, here mentioned, was Herod's steward; a steward of Herod the \"tetrarch\", of Galilee. The Arabic version calls him his \"treasurer\"; and the Vulgate Latin, and the Ethiopic versions, his \"procurator\"; and some have thought him to be a deputy governor of the province under him; but he seems rather to be a governor, or \"chief of his house\", as the Syriac version renders it: he was one that presided in his family, and managed his domestic affairs; was an overseer of them, as Joseph was in Potiphar's house; and the same Greek word that is here used, is adopted by the Jews into their language, and used of Joseph (l): and who moreover say (m), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"let not a man appoint a steward in his house; for if Potiphar had not appointed Joseph,  \"a steward\" in his house, he had not come into that matter,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of calumny and reproach. It was common for kings, princes, and great men, to have such an officer in their families. We read (n) of a steward of king Agrippa's, who was of this same family. The Persic version is very foreign to the purpose, making Chuza to be \"of the family of Herod\". This man might be either dead, as some have conjectured; or, if living, might be secretly a friend of Christ, and so willing that his wife should follow him; or, if an enemy, such was her zeal for Christ, that she cheerfully exposed herself to all his resentments; and chose rather meanness, contempt, and persecution with Christ, and for his sake, than to enjoy all the pleasures of Herod's court without him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And Susannah; this also was a name for a woman with the, Jews, as appears from the history of one of this name with them, which stands among the apocryphal writings. She, as well as Joanna, and perhaps also Mary Magdalene, were rich, and persons of substance, as well as note, as should seem by what follows: \"and many others\"; that is, many other women; for the words, are of the feminine gender: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which ministered unto him of their substance; four ancient copies of Beza's, and five of Stephens's, and the Syriac version read, \"which ministered unto them\"; that is, to Christ, and his disciples, as the Persic version expresses it. This shows the gratitude of these women, who having received favours from Christ, both for their souls and bodies, make returns to him out of their worldly substance, in a way of thankfulness; and also the low estate of Christ, and his disciples, who stood in need of such ministrations; and may be an instruction to the churches of Christ to take care of their ministers, and to communicate in all good things to them, of whose spiritual things they partake; and may be a direction to them to minister to them of what is their own substance, and not another's; and to minister a proper part, and not the whole, as these women ministered to Christ, and his apostles, of substance which was their own, and that not all of it, but out of it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) T. Bab. Sota, fol. 22. 1.((f) Massechet Sopherim, c. 13. sect. 6. (g) T. Bab. Tasnith, fol. 22. 1.((h) T. Bab. Nedarim, fol. 22. 1.((i) Juchasin, fol. 75. 1.((k) Juchasin, fol. 78. 1.((l) Targum Jon. & Jerus. in Genesis 39.4. (m) T. Bab. Beracot, fol 63. 1. & Maimon lssure Bia, c. 22. sect. 15. & Maggid Misn. in ib. (n) T. Bab. Sacca, fol. 27. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) T. Bab. Sota, fol. 22. 1.((f) Massechet Sopherim, c. 13. sect. 6. (g) T. Bab. Tasnith, fol. 22. 1.((h) T. Bab. Nedarim, fol. 22. 1.((i) Juchasin, fol. 75. 1.((k) Juchasin, fol. 78. 1.((l) Targum Jon. & Jerus. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".4. (m) T. Bab. Beracot, fol 63. 1. & Maimon lssure Bia, c. 22. sect. 15. & Maggid Misn. in ib. (n) T. Bab. Sacca, fol. 27. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joanna the wife of Chuza Herod's steward, and Susanna, and many others, which ministered unto him of their substance.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joanna",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] She is mentioned only in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but had apparently been healed of some infirmity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the wife of Chuza Herod’s steward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The court of Antipas was well aware of the ministry and claims of Jesus. Not only had John the Baptist been a familiar figure there, but Manaen, Herod’s fosterbrother, early became a Christian (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and whether Chuzas be the courtier (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "basilikos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", E. V. ‘nobleman’) of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or not, that courtier could only have been in the retinue of Antipas, and must have made known the healing of his son by Jesus. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "epitropos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘administrator,’ conveys the impression of a higher rank than steward (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "oikonomos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Rabbis adopted the word in Hebrew letters, and said that Obadiah was Ahab’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "epitropos.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Manaen at Antioch was perhaps the source of St Luke’s special knowledge about the Herodian family.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Susanna",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The name means ‘Lily.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "many others",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which ministered unto him of their substance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or ‘to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ B, D, F, G, H, &c. This notice is deeply interesting as throwing light on the otherwise unsolved problem of the means of livelihood possessed by Jesus and His Apostles. They had a common purse which sufficed not only for their own needs but for those of the poor (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 13:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Apostles had absolutely forsaken their daily callings, but we may suppose that some of them (like Matthew and the sons of the wealthier fisherman Zebedee) had some small resources of their own, and here we see that these women, some of whom (as tradition says of Mary of Magdala) were rich, helped to maintain them. It must also be borne in mind (1) that the needs of an Oriental are very small. A few dates, a little parched corn, a draught of water, a few figs or grapes plucked from the roadside trees, suffice him; and in that climate he can sleep during most of the year in the open air wrapped up in the same outer garment which serves him for the day. Hence the maintenance of a poor man in Palestine is wholly different from the standard of maintenance required in such countries as ours with their many artificial needs. And yet (2) in spite of this our Lord was so poor as to be homeless (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and without the means of even paying the small Temple-tribute of a didrachm (about ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 6 d.),",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was demanded from every adult Jew. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰωάννα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joanna",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the wife of a husband of high standing in the world. [Her public attendance on the Saviour does not seem to have been without effect, in bringing it about that Herod came to know something concerning Jesus, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—V. g.]: yet in the household of Jesus Mary Magdalene takes precedency of her.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπιτρόπου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "steward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διηκόνουν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ministered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The record of their ministry to the Lord is an ample reward of their liberality. But at that time, no doubt, many supposed them to be silly women.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Joanna the wife of Chuza Herod's steward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". She must have been a person of wealth and high rank at the court of Herod Antipas. There were evidently not a few believers in that wicked and dissolute centre. Some years later we read of Manaen, the foster-brother of Herod, as a notable Christian (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Even Herod himself, we know, at first heard John the Baptist gladly. and, after the terrible judicial murder, we find that unhappy prince fancying that his victim had risen from the dead. It has been suggested that this Chuza was the nobleman of Capernaum whose dying son was healed by Jesus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If this be the case, there would be a special reason for the loving devotion of this Joanna to the Master. She reappears among the faithful women in the history of the Resurrection (ch. 24:10). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Susanna",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The name signifies \"lily.\" The Jews were fond of giving the names of flowers and trees to their girls; thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Rhoda",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a rose (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Tamar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " palm (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 13:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), among many instances. Of this Susanna nothing further is known. Luke 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Steward (ἐπιτρόπου)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From ἐπιτρέπω, to turn toward; thence to turn over to, transfer, and so commit or intrust to. The word thus literally means, one to whom the management of affairs is turned over.",
        "children": []
      }
    ]
  }
]