[[],[{"type":"header","content":"Shun Idolatry"},{"type":"prose","content":"“If a prophet arises among you, or a dreamer of dreams, and gives you a sign or a wonder, "}],[{"type":"prose","content":"and the sign or the wonder which he spoke (foretold) to you comes to pass, and if he says, ‘Let us follow after other gods whom you have not known and let us serve  worship them,’ "}],[{"type":"prose","content":"you shall not listen to the words of that prophet or that dreamer of dreams; for the LORD your God is testing you to know whether you love the LORD your God with all your heart  mind and all your soul [your entire being]. "}],[{"type":"prose","content":"You shall walk after the LORD your God and you shall fear [and worship] Him [with awe-filled reverence and profound respect], and you shall keep His commandments and you shall listen to His voice, and you shall serve Him, and cling to Him. "}],[{"type":"prose","content":"But that prophet or that dreamer of dreams shall be put to death, because he has counseled rebellion against the LORD your God who brought you from the land of Egypt and redeemed you from the house of slavery, to draw you away from the way in which the LORD your God has commanded you to walk. So you shall remove the evil from among you."}],[{"type":"prose","content":"“If your brother, the son of your mother, or your son or daughter, or the wife you cherish, or your friend who is as [precious to you as] your own life (soul), entices you secretly, saying, ‘Let us go and serve other gods’  whom neither you nor your fathers have known, "}],[{"type":"prose","content":"of the gods of the peoples who are around you, near you or far from you, from one end of the earth to the other, "}],[{"type":"prose","content":"you shall not consent to him or listen to him; and your eye shall not pity him, nor shall you spare him or conceal him. "}],[{"type":"prose","content":"Instead, you shall most certainly execute him; your hand shall be first [to be raised] against him to put him to death, and afterwards the hand of all the people. "}],[{"type":"prose","content":"So you shall stone him to death with stones, because he has tried to draw you away from the LORD your God who brought you from the land of Egypt, from the house of slavery. "}],[{"type":"prose","content":"Then all Israel will hear and be afraid, and will never again do such a wicked thing among you."}],[{"type":"prose","content":"“If you hear [it said] in one of your cities, which the LORD your God gives you to live in, "}],[{"type":"prose","content":"that some worthless  evil men have gone out from among you and have tempted the inhabitants of their city [to sin], saying, ‘Let us go and serve other gods’ whom you have not known, "}],[{"type":"prose","content":"then you shall investigate and search out [witnesses] and ask thorough . If it is true and the matter is established that this loathsome thing has been done among you, "}],[{"type":"prose","content":"you shall most certainly strike the inhabitants of that city with the edge of the sword, utterly destroying it and all that is in it, even its livestock with the edge of the sword. "}],[{"type":"prose","content":"Then you shall collect all its spoil (plunder) into the middle of its open square and burn the city and set fire to the spoil as a whole burnt offering to the LORD your God. It shall be a ruin forever. It shall not be built again. "}],[{"type":"prose","content":"Nothing from that which is put under the ban (designated for destruction) shall cling to your hand, so that the LORD may turn away from His burning anger and show mercy to you, and have compassion on you and make you increase, just as He swore to your fathers, "}],[{"type":"prose","content":"because you have listened to  obeyed the voice of the LORD your God, keeping all His commandments which I am commanding you today, and doing what is right in the eyes of the LORD your God."}]]