[[],[{"type":"header","content":"A Warning against Idolatry"},{"type":"prose","content":"“Suppose there are prophets among you or those who dream dreams about the future, and they promise you signs or miracles,"}],[{"type":"prose","content":"and the predicted signs or miracles occur. If they then say, ‘Come, let us worship other gods’—gods you have not known before—"}],[{"type":"prose","content":"do not listen to them. The  your God is testing you to see if you truly love him with all your heart and soul."}],[{"type":"prose","content":"Serve only the  your God and fear him alone. Obey his commands, listen to his voice, and cling to him."}],[{"type":"prose","content":"The false prophets or visionaries who try to lead you astray must be put to death, for they encourage rebellion against the  your God, who redeemed you from slavery and brought you out of the land of Egypt. Since they try to lead you astray from the way the  your God commanded you to live, you must put them to death. In this way you will purge the evil from among you."}],[{"type":"prose","content":"“Suppose someone secretly entices you—even your brother, your son or daughter, your beloved wife, or your closest friend—and says, ‘Let us go worship other gods’—gods that neither you nor your ancestors have known."}],[{"type":"prose","content":"They might suggest that you worship the gods of peoples who live nearby or who come from the ends of the earth."}],[{"type":"prose","content":"But do not give in or listen. Have no pity, and do not spare or protect them."}],[{"type":"prose","content":"You must put them to death! Strike the first blow yourself, and then all the people must join in."}],[{"type":"prose","content":"Stone the guilty ones to death because they have tried to draw you away from the  your God, who rescued you from the land of Egypt, the place of slavery."}],[{"type":"prose","content":"Then all Israel will hear about it and be afraid, and no one will act so wickedly again."}],[{"type":"prose","content":"“When you begin living in the towns the  your God is giving you, you may hear"}],[{"type":"prose","content":"that scoundrels among you are leading their fellow citizens astray by saying, ‘Let us go worship other gods’—gods you have not known before."}],[{"type":"prose","content":"In such cases, you must examine the facts carefully. If you find that the report is true and such a detestable act has been committed among you,"}],[{"type":"prose","content":"you must attack that town and completely destroy all its inhabitants, as well as all the livestock."}],[{"type":"prose","content":"Then you must pile all the plunder in the middle of the open square and burn it. Burn the entire town as a burnt offering to the  your God. That town must remain a ruin forever; it may never be rebuilt."}],[{"type":"prose","content":"Keep none of the plunder that has been set apart for destruction. Then the  will turn from his fierce anger and be merciful to you. He will have compassion on you and make you a large nation, just as he swore to your ancestors."}],[{"type":"prose","content":"“The  your God will be merciful only if you listen to his voice and keep all his commands that I am giving you today, doing what pleases him."}]]