[[],[{"type":"prose","content":" If prophets or those who divine by dreams appear among you and promise you omens or portents, "}],[{"type":"prose","content":"and the omens or the portents declared by them take place, and they say, “Let us follow other gods” (whom you have not known) “and let us serve them,” "}],[{"type":"prose","content":"you must not heed the words of those prophets or those who divine by dreams; for the LORD your God is testing you, to know whether you indeed love the LORD your God with all your heart and soul. "}],[{"type":"prose","content":"The LORD your God you shall follow, him alone you shall fear, his commandments you shall keep, his voice you shall obey, him you shall serve, and to him you shall hold fast. "}],[{"type":"prose","content":"But those prophets or those who divine by dreams shall be put to death for having spoken treason against the LORD your God—who brought you out of the land of Egypt and redeemed you from the house of slavery—to turn you from the way in which the LORD your God commanded you to walk. So you shall purge the evil from your midst."}],[{"type":"prose","content":"If anyone secretly entices you—even if it is your brother, your father’s son or your mother’s son, or your own son or daughter, or the wife you embrace, or your most intimate friend—saying, “Let us go worship other gods,” whom neither you nor your ancestors have known, "}],[{"type":"prose","content":"any of the gods of the peoples that are around you, whether near you or far away from you, from one end of the earth to the other, "}],[{"type":"prose","content":"you must not yield to or heed any such persons. Show them no pity or compassion and do not shield them. "}],[{"type":"prose","content":"But you shall surely kill them; your own hand shall be first against them to execute them, and afterwards the hand of all the people. "}],[{"type":"prose","content":"Stone them to death for trying to turn you away from the LORD your God, who brought you out of the land of Egypt, out of the house of slavery. "}],[{"type":"prose","content":"Then all Israel shall hear and be afraid, and never again do any such wickedness."}],[{"type":"prose","content":"If you hear it said about one of the towns that the LORD your God is giving you to live in, "}],[{"type":"prose","content":"that scoundrels from among you have gone out and led the inhabitants of the town astray, saying, “Let us go and worship other gods,” whom you have not known, "}],[{"type":"prose","content":"then you shall inquire and make a thorough investigation. If the charge is established that such an abhorrent thing has been done among you, "}],[{"type":"prose","content":"you shall put the inhabitants of that town to the sword, utterly destroying it and everything in it—even putting its livestock to the sword. "}],[{"type":"prose","content":"All of its spoil you shall gather into its public square; then burn the town and all its spoil with fire, as a whole burnt offering to the LORD your God. It shall remain a perpetual ruin, never to be rebuilt. "}],[{"type":"prose","content":"Do not let anything devoted to destruction stick to your hand, so that the LORD may turn from his fierce anger and show you compassion, and in his compassion multiply you, as he swore to your ancestors, "}],[{"type":"prose","content":"if you obey the voice of the LORD your God by keeping all his commandments that I am commanding you today, doing what is right in the sight of the LORD your God."}]]