[{"header":"Beware of False Prophets"},{"num":13,"verse":"“Whatever I command you, you must take care to do—you are not to add to it or take away from it."},{"num":2,"verse":"“Suppose a prophet or a dreamer of dreams rises up among you and gives you a sign or wonder, "},{"num":3,"verse":"and the sign or wonder he spoke to you comes true, while saying, ‘Let’s follow other gods’—that you have not known, and—‘Let’s serve them!’"},{"num":4,"verse":" You must not listen to the words of that prophet or that dreamer of dreams—for Adonai your God is testing you, to find out whether you love Adonai your God with all your heart and with all your soul. "},{"num":5,"verse":"Adonai your God you will follow and Him you will fear. His mitzvot you will keep, to His voice you will listen, Him you will serve and to Him you will cling. "},{"num":6,"verse":"That prophet or dreamer of dreams must be put to death! For he has spoken falsehood against Adonai your God, who brought you out from the land of Egypt and redeemed you from the house of slavery, to entice you from the way Adonai your God commanded you to walk. So you will purge the evil from your midst."},{"num":7,"verse":"“Suppose your brother—your mother’s son—or your son or daughter, or the wife of your bosom, or your best friend of your own soul misleads you secretly, saying, ‘Let’s go and serve other gods’—that you and your fathers have not known, "},{"num":8,"verse":"from among the gods of the peoples around you, near you or far off from you, from one end of the earth to the other. "},{"num":9,"verse":"You are not to give in or listen to him, your eye is not to pity him, and you are not to spare or conceal him. "},{"num":10,"verse":"Instead, you will surely put him to death. Your hand should be the first against him to put him to death, and afterwards the hand of all the people. "},{"num":11,"verse":"You are to stone him with stones to death because he tried to entice you away from Adonai your God, who brought you out from the land of Egypt, from the house of slavery. "},{"num":12,"verse":"Then all Israel will hear and be afraid, and never again will they do such an evil thing as this in your midst."},{"num":13,"verse":"“Suppose you hear it said in one of your cities, which Adonai your God is giving you to dwell in, "},{"num":14,"verse":"that worthless fellows have gone out from among you and enticed the inhabitants of their city, saying, ‘Let’s go and serve other gods’—that you have not known. "},{"num":15,"verse":"Then you are to investigate, search out and inquire thoroughly. If indeed it is true and the matter certain that this abomination has been done in your midst, "},{"num":16,"verse":"you will surely strike down the inhabitants of that city with the edge of the sword, utterly destroying it and all that is in it and its livestock with the sword. "},{"num":17,"verse":"You are to gather all its plunder into the middle of the street, and you are to burn with fire the city and all its plunder—all of it to Adonai your God. It will be a ruin forever—it shall never be built again. "},{"num":18,"verse":"Nothing from the ban should cling to your hand, so that Adonai may turn from the fierceness of His anger and show you mercy, and have compassion on you and multiply you, just as He swore to your fathers—"},{"num":19,"verse":"when you listen to the voice of Adonai your God, keeping all His mitzvot that I am commanding you today, doing what is right in the eyes of Adonai your God."}]