[{"header":"Chapter 3"},{"num":1,"verse":"Now these are the nations that the Lord left to put Israel to the test through them (that is, all of those who had not experienced the wars in Canaan)."},{"num":2,"verse":"This was so that the descendants of the Israelites might learn about war, for up to that time they had not yet experienced it."},{"num":3,"verse":"They were the five lords of the Philistines, all of the Canaanites, the Sidonians, and the Hivites who were living in the mountains of Lebanon between Mount Baal-hermon and Lebo-hamath."},{"num":4,"verse":"They were left there to put Israel to the test to see whether they would obey the commandments of the Lord that the Lord had given them through Moses."},{"num":5,"verse":"The Israelites lived among the Canaanites, the Hittites, the Amorites, the Perizzites, the Hivites, and the Jebusites."},{"num":6,"verse":"They took their daughters to be their wives, they gave their own daughters to their sons, and they served their gods."},{"num":7,"verse":"Othniel’s Conquest. The Israelites did what was evil in the sight of the Lord, forgetting the Lord, their God, and serving the Baals and the Asherahs."},{"num":8,"verse":"The anger of the Lord blazed out against Israel, so he sold them into the hands of Cushan-rishathaim, the king of Aram-naharaim. The Israelites were subjected to Cushan-rishathaim for eight years."},{"num":9,"verse":"When the Israelites cried out to the Lord, the Lord sent the Israelites a liberator. It was Othniel, the son of Kenaz, Caleb’s younger brother, and he delivered them."},{"num":10,"verse":"The Spirit of the Lord came upon him, and he became a judge of Israel. He went to war, and the Lord delivered Cushan-rishathaim, the king of Aram-naharaim, into his hands. His hand overpowered Cushan-rishathaim."},{"num":11,"verse":"The land was at peace for forty years, and then Othniel, the son of Kenaz, died."},{"num":12,"verse":"Ehud’s Victory. The Israelites once again did what was evil in the sight of the Lord. Because of the evil they had done in the sight of the Lord, the Lord gave Eglon, the king of Moab, power over Israel."},{"num":13,"verse":"He joined up with the Ammonites and the Amalekites, and they went and attacked Israel, conquering the City of Palms."},{"num":14,"verse":"The Israelites were subjects of Eglon, the king of Moab, for eighteen years."},{"num":15,"verse":"The Israelites cried out to the Lord, and the Lord raised up a liberator for them. He was Ehud, the son of Gera, the Benjaminite, a left-handed man. The Israelites sent him with tribute to Eglon, the king of Moab."},{"num":16,"verse":"Ehud had made a double-edged sword that was one foot long, and he strapped it on under his clothing on his right thigh."},{"num":17,"verse":"He brought the tribute to Eglon. Now Eglon was a very fat man."},{"num":18,"verse":"When he had received the tribute, he dismissed the people who were carrying the tribute."},{"num":19,"verse":"At the idols of Gilgal, he turned back and said, “I have a secret message for you, O king.” He said, “Be quiet,” until all his attendants left him."},{"num":20,"verse":"Ehud then approached him while he was sitting alone in the upper room. Ehud said, “I have a message from God for you.” As he got out of his seat,"},{"num":21,"verse":"Ehud reached in with his left hand, drew the sword out from his right thigh, and stuck it into his stomach."},{"num":22,"verse":"It went in so far that even the handle of the sword was covered over by fat, and he could not draw the sword out from his stomach. In fact, excrement came out."},{"num":23,"verse":"When Ehud went out onto the porch, he shut and locked the doors to the upper room behind himself."},{"num":24,"verse":"When he left, the servants came back. They saw that the doors to the upper room were locked, and they said, “He must be relieving himself in the summer chamber.”"},{"num":25,"verse":"They waited so long that they became anxious, but he still did not open the doors of the upper room. They took a key and opened it, and they found their lord dead on the ground."},{"num":26,"verse":"While they were waiting, Ehud was able to escape. Passing beyond the idols, he hurried to Seirah."},{"num":27,"verse":"When he arrived, he blew a trumpet in the hill country of Ephraim. The Israelites went down with him from the hill country of Ephraim, and he stood in front of them."},{"num":28,"verse":"He said, “Follow me, for the Lord has delivered your enemies, the Moabites, into your hands.” They followed him, and they captured the fords of the Jordan opposite Moab, and they did not let anyone cross over."},{"num":29,"verse":"They slew around ten thousand of the Moabites that day, all of them robust and courageous warriors, and not one of them escaped."},{"num":30,"verse":"Moab was vanquished that day under the hand of Israel, and there was peace in the land for eighty years."},{"num":31,"verse":"Deliverance by Shamgar. He was succeeded by Shamgar, the son of Anath. He killed six hundred Philistines with an oxgoad, and he delivered Israel."}]