[{"num":1,"verse":"Here is a list of the nations the Lord left in the land to test the new generation of Israel who had not experienced the wars of Canaan. For God wanted to give opportunity to the youth of Israel to exercise faith and obedience in conquering their enemies:* the Philistines (five cities), the Canaanites, the Sidonians, the Hivites living in Mount Lebanon, from Baal-hermon to the entrance of Hamath. "},{"num":4,"verse":"These people were a test to the new generation of Israel, to see whether they would obey the commandments the Lord had given to them through Moses."},{"num":5,"verse":"So Israel lived among the Canaanites, Hittites, Hivites, Perizzites, Amorites, and Jebusites. "},{"num":6,"verse":"But instead of destroying them, the people of Israel intermarried with them. The young men of Israel took their girls as wives, and the Israeli girls married their men. And soon Israel was worshiping their gods. "},{"num":7,"verse":"So the people of Israel were very evil in God’s sight, for they turned against Jehovah their God and worshiped Baal and the Asheroth idols."},{"num":8,"verse":"Then the anger of the Lord flamed out against Israel, and he let King Cushan-rishathaim of eastern Syria conquer them. They were under his rule for eight years. "},{"num":9,"verse":"But when Israel cried out to the Lord, he gave them Caleb’s nephew, Othniel (son of Kenaz, Caleb’s younger brother) to save them. "},{"num":10,"verse":"The Spirit of the Lord took control of him, and he reformed and purged Israel so that when he led the forces of Israel against the army of King Cushan-rishathaim, the Lord helped Israel conquer him completely."},{"num":11,"verse":"Then, for forty years under Othniel, there was peace in the land. But when Othniel died, "},{"num":12,"verse":"the people of Israel turned once again to their sinful ways, so God helped King Eglon of Moab to conquer part of Israel at that time. "},{"num":13,"verse":"Allied with him were the armies of the Ammonites and the Amalekites. These forces defeated the Israelis and took possession of Jericho, often called “The City of Palm Trees.” "},{"num":14,"verse":"For the next eighteen years the people of Israel were required to pay crushing taxes to King Eglon."},{"num":15,"verse":"But when they cried to the Lord, he sent them a savior, Ehud (son of Gera, a Benjaminite), who was left-handed. Ehud was the man chosen to carry Israel’s annual tax money to the Moabite capital. "},{"num":16,"verse":"Before he went on this journey, he made himself a double-edged dagger eighteen inches long and hid it in his clothing, strapped against his right thigh. "},{"num":17,"verse":"After delivering the money to King Eglon (who, by the way, was very fat!), he started home again. But outside the city, at the quarries of Gilgal, he sent his companions on and returned alone to the king."},{"num":20,"verse":"Ehud walked over to him as he was sitting in a cool upstairs room and said to him, “It is a message from God!”"},{"num":21,"verse":"whereupon Ehud reached beneath his robe with his strong left hand, pulled out the double-bladed dagger strapped against his right thigh, and plunged it deep into the king’s belly. "},{"num":22,"verse":"The hilt of the dagger disappeared beneath the flesh, and the fat closed over it as the entrails oozed out. Leaving the dagger there, Ehud locked the doors behind him and escaped across an upstairs porch."},{"num":24,"verse":"When the king’s servants returned and saw that the doors were locked, they waited, thinking that perhaps he was using the bathroom. "},{"num":25,"verse":"But when, after a long time, he still didn’t come out, they became concerned and got a key. And when they opened the door, they found their master dead on the floor."},{"num":26,"verse":"Meanwhile Ehud had escaped past the quarries to Seirah. "},{"num":27,"verse":"When he arrived in the hill country of Ephraim, he blew a trumpet as a call to arms and mustered an army under his own command."},{"num":28,"verse":"“Follow me,” he told them, “for the Lord has put your enemies, the Moabites, at your mercy!”"},{"num":29,"verse":"Then they attacked the Moabites and killed about ten thousand of the strongest and most skillful of their fighting men, letting not one escape. "},{"num":30,"verse":"So Moab was conquered by Israel that day, and the land was at peace for the next eighty years."},{"num":31,"verse":"The next judge after Ehud was Shamgar (son of Anath). He once killed six hundred Philistines with an ox goad, thereby saving Israel from disaster."}]