[{"num":3,"verse":"Now these are the nations that Adonai left, to test all Israel who had not experienced any of the wars of Canaan. "},{"num":2,"verse":"It was only in order that the generations of Bnei-Yisrael might learn from war, which they had not experienced before. "},{"num":3,"verse":"These nations included the five Philistine lords, and all the Canaanites, Zidonians and the Hivites living in the hill country of Lebanon from Mount Baal-hermon to the entrance of Hamath. "},{"num":4,"verse":"They were for testing Israel, to know whether they would obey the mitzvot of Adonai, which He had commanded their fathers by Moses’ hand."},{"num":5,"verse":"But Bnei-Yisrael settled among the Canaanites, the Hittites, the Amorites, the Perizzites, the Hivites and the Jebusites, "},{"num":6,"verse":"and took their daughters for themselves as wives, gave their own daughters to their sons, and worshipped their gods. "},{"num":7,"verse":"Bnei-Yisrael did what was evil in Adonai’s eyes, forgot Adonai their God and worshipped the Baalim and the Asherahs. "},{"num":8,"verse":"So Adonai’s anger burned against Israel, and He sold them over into the hand of King Cushan-rishathaim of Aram-naharaim, and Bnei-Yisrael served Cushan-rishathaim for eight years."},{"header":"Othniel, Ehud and Shamgar"},{"num":9,"verse":"When Bnei-Yisrael cried out to Adonai, Adonai raised up a deliverer for Bnei-Yisrael to deliver them—Othniel son of Kenaz, Caleb’s younger kinsman. "},{"num":10,"verse":"The Spirit of Adonai came upon him as he judged Israel. When he went out to war, Adonai gave King Cushan-rishathaim of Aram into his hand so that he had the upper hand over Cushan-rishathaim. "},{"num":11,"verse":"Then the land had peace 40 years."},{"num":12,"verse":"Bnei-Yisrael again did what was evil in Adonai’s eyes. So Adonai strengthened King Eglon of Moab against Israel, because they had done evil in Adonai’s eyes. "},{"num":13,"verse":"So he gathered to himself the people of Ammon and Amalek, then went and defeated Israel and took possession of the City of Palms. "},{"num":14,"verse":"Bnei-Yisrael became subject to King Eglon of Moab for 18 years."},{"num":15,"verse":"But when Bnei-Yisrael cried out to Adonai, Adonai raised up a deliverer for them, Ehud son of Gera the Benjamite—a left-handed man. Now Bnei-Yisrael sent tribute with him to King Eglon of Moab. "},{"num":16,"verse":"Ehud made himself a double-edged sword, a cubit in length, which he girded on his right thigh under his cloak. "},{"num":17,"verse":"Then he presented the tribute to King Eglon of Moab. Eglon was a very fat man. "},{"num":18,"verse":"Now when Ehud had finished presenting the tribute, he dismissed the people who had carried the tribute, "},{"num":19,"verse":"but he himself turned back, at the idols that were near Gilgal, and said, “I have a secret message for you, O king.”"},{"num":20,"verse":"Then Ehud approached him while he was sitting alone in a roof chamber where it was cool, and said, “I have a message from God for you,” so he arose from his throne. "},{"num":21,"verse":"Then Ehud reached with his left hand, drew the sword from his right thigh and thrust it into his belly. "},{"num":22,"verse":"Even the handle went in after the blade and the fat closed over the blade, for he did not withdraw the sword out of his belly—and the filth came out. "},{"num":23,"verse":"Then Ehud went out by the porch, shut the doors of the roof chamber on him, and locked them."},{"num":24,"verse":"After he had gone out, his courtiers came and looked, but behold, the doors of the roof chamber were locked. So they said, “He is only relieving himself in the cool chamber.” "},{"num":25,"verse":"So they waited till they were embarrassed, but behold, he still did not open the doors of the roof chamber. So they took the key and opened them—and behold, their master was lying dead on the floor."},{"num":26,"verse":"But Ehud escaped while they were lingering, passed beyond the idols and escaped to Seirah. "},{"num":27,"verse":"When he arrived, he blew the shofar in the hill country of Ephraim, so Bnei-Yisrael went down with him from the hill country, and he was in front of them. "},{"num":28,"verse":"He said to them, “Follow me, for Adonai has delivered your enemies the Moabites into your hand.” So they went down after him and seized the fords of the Jordan opposite Moab, and allowed no one to cross over. "},{"num":29,"verse":"Then they struck down at that time about 10,000 men of Moab—all stout men of valor—not a man escaped."},{"num":30,"verse":"So Moab was subdued that day under the hand of Israel. Then the land had peace for 80 years."},{"num":31,"verse":"After him came Shamgar son of Anath, who struck down 600 Philistine men with an ox-goad. So he also delivered Israel."}]