[{"num":8,"verse":"And it came to pass afterwards that *he* went through [the country] city by city, and village by village, preaching and announcing the glad tidings of the kingdom of God; and the twelve [were] with him,"},{"num":2,"verse":"and certain women who had been healed of wicked spirits and infirmities, Mary who was called Magdalene, from whom seven demons had gone out,"},{"num":3,"verse":"and Joanna, wife of Chuza, Herod's steward, and Susanna, and many others, who ministered to him of their substance."},{"num":4,"verse":"And a great crowd coming together, and those who were coming to him out of each city, he spoke by parable:"},{"num":5,"verse":"The sower went out to sow his seed; and as he sowed, some fell along the way, and it was trodden under foot, and the birds of the heaven devoured it up;"},{"num":6,"verse":"and other fell upon the rock, and having sprung up, it was dried up because it had not moisture;"},{"num":7,"verse":"and other fell in the midst of the thorns, and the thorns having sprung up with [it] choked it;"},{"num":8,"verse":"and other fell into the good ground, and having sprung up bore fruit a hundredfold. As he said these things he cried, He that has ears to hear, let him hear."},{"num":9,"verse":"And his disciples asked him [saying], What may this parable be?"},{"num":10,"verse":"And he said, To you it is given to know the mysteries of the kingdom of God, but to the rest in parables, in order that seeing they may not see, and hearing they may not understand."},{"num":11,"verse":"But the parable is this: The seed is the word of God."},{"num":12,"verse":"But those by the wayside are those who hear; then comes the devil and takes away the word from their heart that they may not believe and be saved."},{"num":13,"verse":"But those upon the rock, those who when they hear receive the word with joy; and these have no root, who believe for a time, and in time of trial fall away."},{"num":14,"verse":"But that that fell where the thorns were, these are they who having heard go away and are choked under cares and riches and pleasures of life, and bring no fruit to perfection."},{"num":15,"verse":"But that in the good ground, these are they who in an honest and good heart, having heard the word keep it, and bring forth fruit with patience."},{"num":16,"verse":"And no one having lighted a lamp covers it with a vessel or puts it under a couch, but sets it on a lamp-stand, that they who enter in may see the light."},{"num":17,"verse":"For there is nothing hid which shall not become manifest, nor secret which shall not be known and come to light."},{"num":18,"verse":"Take heed therefore how ye hear; for whosoever has, to him shall be given, and whosoever has not, even what he seems to have shall be taken from him."},{"num":19,"verse":"And his mother and his brethren came to him, and could not get to him because of the crowd."},{"num":20,"verse":"And it was told him [saying], Thy mother and thy brethren stand without, wishing to see thee."},{"num":21,"verse":"But he answering said to them, My mother and my brethren are those who hear the word of God and do [it]."},{"num":22,"verse":"And it came to pass on one of the days, that *he* entered into a ship, himself and his disciples; and he said to them, Let us pass over to the other side of the lake; and they set off from shore."},{"num":23,"verse":"And as they sailed, he fell asleep; and a sudden squall of wind came down on the lake, and they were filled [with water], and were in danger;"},{"num":24,"verse":"and coming to [him] they woke him up, saying, Master, master, we perish. But he, rising up, rebuked the wind and the raging of the water; and they ceased, and there was a calm."},{"num":25,"verse":"And he said to them, Where is your faith? And, being afraid, they were astonished, saying to one another, Who then is this, that he commands even the winds and the water, and they obey him?"},{"num":26,"verse":"And they arrived in the country of the Gadarenes, which is over against Galilee."},{"num":27,"verse":"And as he got out [of the ship] on the land, a certain man out of the city met him, who had demons a long time, and put on no clothes, and did not abide in a house, but in the tombs."},{"num":28,"verse":"But seeing Jesus, he cried out, and fell down before him, and with a loud voice said, What have I to do with thee, Jesus Son of the Most High God? I beseech thee torment me not."},{"num":29,"verse":"For he had commanded the unclean spirit to go out from the man. For very often it had seized him; and he had been bound, kept with chains and fetters; and breaking the bonds he was driven by the demon into the deserts."},{"num":30,"verse":"And Jesus asked him saying, What is thy name? And he said, Legion: for many demons had entered into him."},{"num":31,"verse":"And they besought him that he would not command them to go away into the bottomless pit."},{"num":32,"verse":"And there was there a herd of many swine feeding on the mountain, and they besought him that he would suffer them to enter into those; and he suffered them."},{"num":33,"verse":"And the demons, going out from the man, entered into the swine, and the herd rushed down the precipice into the lake, and were choked."},{"num":34,"verse":"But they that fed [them], seeing what had happened, fled, and told [it] to the city and to the country."},{"num":35,"verse":"And they went out to see what had happened, and came to Jesus, and found the man from whom the demons had gone out, sitting, clothed and sensible, at the feet of Jesus. And they were afraid."},{"num":36,"verse":"And they also who had seen it told them how the possessed man had been healed."},{"num":37,"verse":"And all the multitude of the surrounding country of the Gadarenes asked him to depart from them, for they were possessed with great fear; and *he*, entering into the ship, returned."},{"num":38,"verse":"But the man out of whom the demons had gone besought him that he might be with him. But he sent him away, saying,"},{"num":39,"verse":"Return to thine house and relate how great things God has done for thee. And he went away through the whole city, publishing how great things Jesus had done for him."},{"num":40,"verse":"And it came to pass when Jesus returned, the crowd received him gladly, for they were all expecting him."},{"num":41,"verse":"And behold, a man came, whose name was Jairus, and he was [a] ruler of the synagogue, and falling at the feet of Jesus besought him to come to his house,"},{"num":42,"verse":"because he had an only daughter, about twelve years old, and she was dying. And as he went the crowds thronged him."},{"num":43,"verse":"And a woman who had a flux of blood since twelve years, who, having spent all her living on physicians, could not be cured by any one,"},{"num":44,"verse":"coming up behind, touched the hem of his garment, and immediately her flux of blood stopped."},{"num":45,"verse":"And Jesus said, Who has touched me? But all denying, Peter and those with him said, Master, the crowds close thee in and press upon thee, and sayest thou, Who has touched me?"},{"num":46,"verse":"And Jesus said, Some one has touched me, for *I* have known that power has gone out from me."},{"num":47,"verse":"And the woman, seeing that she was not hid, came trembling, and falling down before him declared before all the people for what cause she had touched him, and how she was immediately healed."},{"num":48,"verse":"And he said to her, [Be of good courage,] daughter; thy faith has healed thee; go in peace."},{"num":49,"verse":"While he was yet speaking, comes some one from the ruler of the synagogue, saying to him, Thy daughter is dead; do not trouble the teacher."},{"num":50,"verse":"But Jesus, hearing it, answered him saying, Fear not: only believe, and she shall be made well."},{"num":51,"verse":"And when he came to the house he suffered no one to go in but Peter and John and James and the father of the child and the mother."},{"num":52,"verse":"And all were weeping and lamenting her. But he said, Do not weep, for she has not died, but sleeps."},{"num":53,"verse":"And they derided him, knowing that she had died."},{"num":54,"verse":"But *he*, having turned them all out and taking hold of her hand, cried saying, Child, arise."},{"num":55,"verse":"And her spirit returned, and immediately she rose up; and he commanded [something] to eat to be given to her."},{"num":56,"verse":"And her parents were amazed; but he enjoined them to tell no one what had happened."}]