[{"header":"Women Who Accompanied Jesus"},{"num":8,"verse":"Some time later Jesus traveled through towns and villages, preaching the Good News about the Kingdom of God. The twelve disciples went with him, "},{"num":2,"verse":"and so did some women who had been healed of evil spirits and diseases: Mary (who was called Magdalene), from whom seven demons had been driven out; "},{"num":3,"verse":"Joanna, whose husband Chuza was an officer in Herod's court; and Susanna, and many other women who used their own resources to help Jesus and his disciples."},{"header":"The Parable of the Sower(B)"},{"num":4,"verse":"People kept coming to Jesus from one town after another; and when a great crowd gathered, Jesus told this parable:"},{"num":5,"verse":"“Once there was a man who went out to sow grain. As he scattered the seed in the field, some of it fell along the path, where it was stepped on, and the birds ate it up. "},{"num":6,"verse":"Some of it fell on rocky ground, and when the plants sprouted, they dried up because the soil had no moisture. "},{"num":7,"verse":"Some of the seed fell among thorn bushes, which grew up with the plants and choked them. "},{"num":8,"verse":"And some seeds fell in good soil; the plants grew and bore grain, one hundred grains each.”"},{"header":"The Purpose of the Parables(C)"},{"num":9,"verse":"His disciples asked Jesus what this parable meant, "},{"num":10,"verse":"and he answered, “The knowledge of the secrets of the Kingdom of God has been given to you, but to the rest it comes by means of parables, so that they may look but not see, and listen but not understand."},{"header":"Jesus Explains the Parable of the Sower(E)"},{"num":11,"verse":"“This is what the parable means: the seed is the word of God. "},{"num":12,"verse":"The seeds that fell along the path stand for those who hear; but the Devil comes and takes the message away from their hearts in order to keep them from believing and being saved. "},{"num":13,"verse":"The seeds that fell on rocky ground stand for those who hear the message and receive it gladly. But it does not sink deep into them; they believe only for a while but when the time of testing comes, they fall away. "},{"num":14,"verse":"The seeds that fell among thorn bushes stand for those who hear; but the worries and riches and pleasures of this life crowd in and choke them, and their fruit never ripens. "},{"num":15,"verse":"The seeds that fell in good soil stand for those who hear the message and retain it in a good and obedient heart, and they persist until they bear fruit."},{"header":"A Lamp under a Bowl(F)"},{"num":16,"verse":"“No one lights a lamp and covers it with a bowl or puts it under a bed. Instead, it is put on the lampstand, so that people will see the light as they come in."},{"num":17,"verse":"“Whatever is hidden away will be brought out into the open, and whatever is covered up will be found and brought to light."},{"num":18,"verse":"“Be careful, then, how you listen; because those who have something will be given more, but whoever has nothing will have taken away from them even the little they think they have.”"},{"header":"Jesus' Mother and Brothers(J)"},{"num":19,"verse":"Jesus' mother and brothers came to him, but were unable to join him because of the crowd. "},{"num":20,"verse":"Someone said to Jesus, “Your mother and brothers are standing outside and want to see you.”"},{"num":21,"verse":"Jesus said to them all, “My mother and brothers are those who hear the word of God and obey it.”"},{"header":"Jesus Calms a Storm(K)"},{"num":22,"verse":"One day Jesus got into a boat with his disciples and said to them, “Let us go across to the other side of the lake.” So they started out. "},{"num":23,"verse":"As they were sailing, Jesus fell asleep. Suddenly a strong wind blew down on the lake, and the boat began to fill with water, so that they were all in great danger. "},{"num":24,"verse":"The disciples went to Jesus and woke him up, saying, “Master, Master! We are about to die!”"},{"num":25,"verse":"Then he said to the disciples, “Where is your faith?”"},{"header":"Jesus Heals a Man with Demons(L)"},{"num":26,"verse":"Jesus and his disciples sailed on over to the territory of Gerasa, which is across the lake from Galilee. "},{"num":27,"verse":"As Jesus stepped ashore, he was met by a man from the town who had demons in him. For a long time this man had gone without clothes and would not stay at home, but spent his time in the burial caves. "},{"num":28,"verse":"When he saw Jesus, he gave a loud cry, threw himself down at his feet, and shouted, “Jesus, Son of the Most High God! What do you want with me? I beg you, don't punish me!” "},{"num":29,"verse":"He said this because Jesus had ordered the evil spirit to go out of him. Many times it had seized him, and even though he was kept a prisoner, his hands and feet tied with chains, he would break the chains and be driven by the demon out into the desert."},{"num":30,"verse":"Jesus asked him, “What is your name?”"},{"num":31,"verse":"The demons begged Jesus not to send them into the abyss."},{"num":32,"verse":"There was a large herd of pigs near by, feeding on a hillside. So the demons begged Jesus to let them go into the pigs, and he let them. "},{"num":33,"verse":"They went out of the man and into the pigs. The whole herd rushed down the side of the cliff into the lake and was drowned."},{"num":34,"verse":"The men who had been taking care of the pigs saw what happened, so they ran off and spread the news in the town and among the farms. "},{"num":35,"verse":"People went out to see what had happened, and when they came to Jesus, they found the man from whom the demons had gone out sitting at the feet of Jesus, clothed and in his right mind; and they were all afraid. "},{"num":36,"verse":"Those who had seen it told the people how the man had been cured. "},{"num":37,"verse":"Then all the people from that territory asked Jesus to go away, because they were terribly afraid. So Jesus got into the boat and left. "},{"num":38,"verse":"The man from whom the demons had gone out begged Jesus, “Let me go with you.”"},{"num":39,"verse":"“Go back home and tell what God has done for you.”"},{"header":"Jairus' Daughter and the Woman Who Touched Jesus' Cloak(M)"},{"num":40,"verse":"When Jesus returned to the other side of the lake, the people welcomed him, because they had all been waiting for him. "},{"num":41,"verse":"Then a man named Jairus arrived; he was an official in the local synagogue. He threw himself down at Jesus' feet and begged him to go to his home, "},{"num":42,"verse":"because his only daughter, who was twelve years old, was dying."},{"num":43,"verse":"Among them was a woman who had suffered from severe bleeding for twelve years; she had spent all she had on doctors, but no one had been able to cure her. "},{"num":44,"verse":"She came up in the crowd behind Jesus and touched the edge of his cloak, and her bleeding stopped at once. "},{"num":45,"verse":"Jesus asked, “Who touched me?”"},{"num":46,"verse":"But Jesus said, “Someone touched me, for I knew it when power went out of me.” "},{"num":47,"verse":"The woman saw that she had been found out, so she came trembling and threw herself at Jesus' feet. There in front of everybody, she told him why she had touched him and how she had been healed at once. "},{"num":48,"verse":"Jesus said to her, “My daughter, your faith has made you well. Go in peace.”"},{"num":49,"verse":"While Jesus was saying this, a messenger came from the official's house. “Your daughter has died,” he told Jairus; “don't bother the Teacher any longer.”"},{"num":50,"verse":"But Jesus heard it and said to Jairus, “Don't be afraid; only believe, and she will be well.”"},{"num":51,"verse":"When he arrived at the house, he would not let anyone go in with him except Peter, John, and James, and the child's father and mother. "},{"num":52,"verse":"Everyone there was crying and mourning for the child. Jesus said, “Don't cry; the child is not dead—she is only sleeping!”"},{"num":53,"verse":"They all made fun of him, because they knew that she was dead. "},{"num":54,"verse":"But Jesus took her by the hand and called out, “Get up, child!” "},{"num":55,"verse":"Her life returned, and she got up at once, and Jesus ordered them to give her something to eat. "},{"num":56,"verse":"Her parents were astounded, but Jesus commanded them not to tell anyone what had happened."}]