[{"header":"The Beginning of the World"},{"num":1,"verse":"God created the sky and the earth. At first,"},{"num":2,"verse":"the earth was completely empty. There was nothing on the earth. Darkness covered the ocean, and God’s Spirit moved over the water."},{"header":"The First Day—Light"},{"num":3,"verse":"Then God said, “Let there be light!” And light began to shine."},{"num":4,"verse":"He saw the light, and he knew that it was good. Then he separated the light from the darkness."},{"num":5,"verse":"God named the light “day,” and he named the darkness “night.”"},{"header":"The Second Day—Sky"},{"num":6,"verse":"Then God said, “Let there be a space to separate the water into two parts!”"},{"num":7,"verse":"So God made the space and separated the water. Some of the water was above it, and some of the water was below it."},{"num":8,"verse":"God named that space “sky.” There was evening, and then there was morning. This was the second day."},{"header":"The Third Day—Dry Land and Plants"},{"num":9,"verse":"Then God said, “Let the water under the sky be gathered together so that the dry land will appear.” And it happened."},{"num":10,"verse":"God named the dry land “earth,” and he named the water that was gathered together “seas.” And God saw that this was good."},{"num":11,"verse":"Then God said, “Let the earth grow grass, plants that make grain, and fruit trees. The fruit trees will make fruit with seeds in it. And each plant will make its own kind of seed. Let these plants grow on the earth.” And it happened."},{"num":12,"verse":"The earth grew grass and plants that made grain. And it grew trees that made fruit with seeds in it. Every plant made its own kind of seeds. And God saw that this was good."},{"num":13,"verse":"There was evening, and then there was morning. This was the third day."},{"header":"The Fourth Day—Sun, Moon, and Stars"},{"num":14,"verse":"Then God said, “Let there be lights in the sky. These lights will separate the days from the nights. They will be used for signs to show when special meetings begin and to show the days and years."},{"num":15,"verse":"They will be in the sky to shine light on the earth.” And it happened."},{"num":16,"verse":"So God made the two large lights. He made the larger light to rule during the day and the smaller light to rule during the night. He also made the stars."},{"num":17,"verse":"God put these lights in the sky to shine on the earth."},{"num":18,"verse":"He put them in the sky to rule over the day and over the night. They separated the light from the darkness. And God saw that this was good."},{"num":19,"verse":"There was evening, and then there was morning. This was the fourth day."},{"header":"The Fifth Day—Fish and Birds"},{"num":20,"verse":"Then God said, “Let the water be filled with many living things, and let there be birds to fly in the air over the earth.”"},{"num":21,"verse":"So God created the large sea animals. He created all the many living things in the sea and every kind of bird that flies in the air. And God saw that this was good."},{"num":22,"verse":"God blessed all the living things in the sea and told them to have many babies and fill the seas. And he blessed the birds on land and told them to have many more babies."},{"num":23,"verse":"There was evening, and then there was morning. This was the fifth day."},{"header":"The Sixth Day—Land Animals and People"},{"num":24,"verse":"Then God said, “Let the earth produce many kinds of living things. Let there be many different kinds of animals. Let there be large animals and small crawling animals of every kind. And let all these animals produce more animals.” And all these things happened."},{"num":25,"verse":"So God made every kind of animal. He made the wild animals, the tame animals, and all the small crawling things. And God saw that this was good."},{"num":26,"verse":"Then God said, “Now let’s make humans who will be like us. They will rule over all the fish in the sea and the birds in the air. They will rule over all the large animals and all the little things that crawl on the earth.”"},{"num":27,"verse":"So God created humans in his own image. He created them to be like himself. He created them male and female."},{"num":28,"verse":"God blessed them and said to them, “Have many children. Fill the earth and take control of it. Rule over the fish in the sea and the birds in the air. Rule over every living thing that moves on the earth.”"},{"num":29,"verse":"God said, “I am giving you all the grain bearing plants and all the fruit trees. These trees make fruit with seeds in it. This grain and fruit will be your food."},{"num":30,"verse":"And I am giving all the green plants to the animals. These green plants will be their food. Every animal on earth, every bird in the air, and all the little things that crawl on the earth will eat that food.” And all these things happened."},{"num":31,"verse":"God looked at everything he had made. And he saw that everything was very good."}]