[{"header":"The Story of Creation"},{"num":1,"verse":"In the beginning, when God created the universe, "},{"num":2,"verse":"the earth was formless and desolate. The raging ocean that covered everything was engulfed in total darkness, and the Spirit of God was moving over the water. "},{"num":3,"verse":"Then God commanded, “Let there be light”—and light appeared. "},{"num":4,"verse":"God was pleased with what he saw. Then he separated the light from the darkness, "},{"num":5,"verse":"and he named the light “Day” and the darkness “Night.” Evening passed and morning came—that was the first day."},{"num":6,"verse":"Then God commanded, “Let there be a dome to divide the water and to keep it in two separate places”—and it was done. So God made a dome, and it separated the water under it from the water above it. "},{"num":8,"verse":"He named the dome “Sky.” Evening passed and morning came—that was the second day."},{"num":9,"verse":"Then God commanded, “Let the water below the sky come together in one place, so that the land will appear”—and it was done. "},{"num":10,"verse":"He named the land “Earth,” and the water which had come together he named “Sea.” And God was pleased with what he saw. "},{"num":11,"verse":"Then he commanded, “Let the earth produce all kinds of plants, those that bear grain and those that bear fruit”—and it was done. "},{"num":12,"verse":"So the earth produced all kinds of plants, and God was pleased with what he saw. "},{"num":13,"verse":"Evening passed and morning came—that was the third day."},{"num":14,"verse":"Then God commanded, “Let lights appear in the sky to separate day from night and to show the time when days, years, and religious festivals begin; "},{"num":15,"verse":"they will shine in the sky to give light to the earth”—and it was done. "},{"num":16,"verse":"So God made the two larger lights, the sun to rule over the day and the moon to rule over the night; he also made the stars. "},{"num":17,"verse":"He placed the lights in the sky to shine on the earth, "},{"num":18,"verse":"to rule over the day and the night, and to separate light from darkness. And God was pleased with what he saw. "},{"num":19,"verse":"Evening passed and morning came—that was the fourth day."},{"num":20,"verse":"Then God commanded, “Let the water be filled with many kinds of living beings, and let the air be filled with birds.” "},{"num":21,"verse":"So God created the great sea monsters, all kinds of creatures that live in the water, and all kinds of birds. And God was pleased with what he saw. "},{"num":22,"verse":"He blessed them all and told the creatures that live in the water to reproduce and to fill the sea, and he told the birds to increase in number. "},{"num":23,"verse":"Evening passed and morning came—that was the fifth day."},{"num":24,"verse":"Then God commanded, “Let the earth produce all kinds of animal life: domestic and wild, large and small”—and it was done. "},{"num":25,"verse":"So God made them all, and he was pleased with what he saw."},{"num":26,"verse":"Then God said, “And now we will make human beings; they will be like us and resemble us. They will have power over the fish, the birds, and all animals, domestic and wild, large and small.” "},{"num":27,"verse":"So God created human beings, making them to be like himself. He created them male and female, "},{"num":28,"verse":"blessed them, and said, “Have many children, so that your descendants will live all over the earth and bring it under their control. I am putting you in charge of the fish, the birds, and all the wild animals. "},{"num":29,"verse":"I have provided all kinds of grain and all kinds of fruit for you to eat; "},{"num":30,"verse":"but for all the wild animals and for all the birds I have provided grass and leafy plants for food”—and it was done. "},{"num":31,"verse":"God looked at everything he had made, and he was very pleased. Evening passed and morning came—that was the sixth day."}]