[{"num":1,"verse":"When God began creating the heavens and the earth, "},{"num":2,"verse":"the earth was a shapeless, chaotic mass,* with the Spirit of God brooding over the dark vapors.*"},{"num":3,"verse":"Then God said, “Let there be light.” And light appeared. "},{"num":4,"verse":"And God was pleased with it and divided the light from the darkness. He called the light “daytime,” and the darkness “nighttime.” Together they formed the first day."},{"num":6,"verse":"And God said, “Let the vapors separate to form the sky above and the oceans below.” "},{"num":7,"verse":"So God made the sky, dividing the vapor above from the water below. This all happened on the second day."},{"num":9,"verse":"Then God said, “Let the water beneath the sky be gathered into oceans so that the dry land will emerge.” And so it was. Then God named the dry land “earth,” and the water “seas.” And God was pleased. "},{"num":11,"verse":"And he said, “Let the earth burst forth with every sort of grass and seed-bearing plant, and fruit trees with seeds inside the fruit, so that these seeds will produce the kinds of plants and fruits they came from.” And so it was, and God was pleased. "},{"num":13,"verse":"This all occurred on the third day."},{"num":14,"verse":"Then God said, “Let bright lights appear in the sky to give light to the earth and to identify the day and the night; they shall bring about the seasons on the earth, and mark the days and years.” And so it was. "},{"num":16,"verse":"For God had made two huge lights, the sun and moon, to shine down upon the earth—the larger one, the sun, to preside over the day and the smaller one, the moon, to preside through the night; he had also made the stars. "},{"num":17,"verse":"And God set them in the sky to light the earth, "},{"num":18,"verse":"and to preside over the day and night, and to divide the light from the darkness. And God was pleased. "},{"num":19,"verse":"This all happened on the fourth day."},{"num":20,"verse":"Then God said, “Let the waters teem with fish and other life, and let the skies be filled with birds of every kind.” "},{"num":21,"verse":"So God created great sea animals, and every sort of fish and every kind of bird. And God looked at them with pleasure, and blessed them all. “Multiply and stock the oceans,” he told them, and to the birds he said, “Let your numbers increase. Fill the earth!” "},{"num":23,"verse":"That ended the fifth day."},{"num":24,"verse":"And God said, “Let the earth bring forth every kind of animal—cattle and reptiles and wildlife of every kind.” And so it was. "},{"num":25,"verse":"God made all sorts of wild animals and cattle and reptiles. And God was pleased with what he had done."},{"num":26,"verse":"Then God said, “Let us make a man—someone like ourselves,* to be the master of all life upon the earth and in the skies and in the seas.”"},{"num":28,"verse":"And God blessed them and told them, “Multiply and fill the earth and subdue it; you are masters of the fish and birds and all the animals. "},{"num":29,"verse":"And look! I have given you the seed-bearing plants throughout the earth and all the fruit trees for your food. "},{"num":30,"verse":"And I’ve given all the grass and plants to the animals and birds for their food.” "},{"num":31,"verse":"Then God looked over all that he had made, and it was excellent in every way. This ended the sixth day."}]