[{"num":1,"verse":"Divrei Kohelet, Ben Dovid, Melech in Yerushalayim."},{"num":2,"verse":"Hevel havalim, saith Kohelet, hevel havalim; all is hevel."},{"num":3,"verse":"What profit hath a man from all his amal (toil) which he hath toiled under the shemesh?"},{"num":4,"verse":"Dor v’dor, generations come and go, passing away; but ha’aretz remaineth l’olam."},{"num":5,"verse":"The shemesh also ariseth, and the shemesh goeth down, and hasteth to its place, there to arise again."},{"num":6,"verse":"The ruach (wind) goeth toward the darom (south), and turneth about unto the tzafon (north); it whirleth about continually, and the ruach returneth again according to its circuits."},{"num":7,"verse":"All the neharot (rivers) run into the yam; yet the yam is not full; unto the place from whence the neharot come, thither they return to go again."},{"num":8,"verse":"All things are wearisome; no ish can express it; the ayin is not satisfied with seeing, nor the ozen full with hearing."},{"num":9,"verse":"The thing that hath been, it is that which shall be; and that which is done is that which shall be done; and there is nothing chadash under the shemesh."},{"num":10,"verse":"Is there anything whereof it may be said, See, this is chadash? L’olamim (ages ago), which were before us, it hath been already."},{"num":11,"verse":"There is no zichron (remembrance) of former things; neither shall there be with those who come after any zikaron (recollection) of things that are to come."},{"num":12,"verse":"I, Kohelet, was Melech over Yisroel in Yerushalayim."},{"num":13,"verse":"And I set my lev to seek and search out by chochmah concerning all things that are done under Shomayim; what grievous task hath Elohim given to the bnei haAdam to be afflicted therewith."},{"num":14,"verse":"I have seen all the ma’asim that are done under the shemesh; and, hinei, all is hevel and chasing after ruach (wind)."},{"num":15,"verse":"That which is crooked cannot be made straight; and chesron (that which is lacking) cannot be numbered."},{"num":16,"verse":"I communed with mine own lev, saying, Hinei, I am come to greatness, even greater chochmah than all they that have been before me over Yerushalayim; yea, my lev had great experience of chochmah and da’as."},{"num":17,"verse":"And I applied my lev to have da’as of chochmah, and to have da’as of holelot (madness) and sichlut (folly); I perceived that this also is striving after ruach (wind)."},{"num":18,"verse":"For in much chochmah (wisdom) is much ka’as (grief, vexation); and he that increaseth da’as increaseth mach’ov (sorrow)."}]