[{"header":"Saul Is Rejected"},{"num":15,"verse":"Samuel said to Saul, “The Lord sent me to anoint you to be king over his people Israel. Therefore, listen to the voice of the Lord. "},{"num":2,"verse":"This is what the Lord of Armies says. I will repay Amalek for what they did to Israel when they blocked Israel’s way as it was coming up out of Egypt. "},{"num":3,"verse":"Go and strike Amalek. Devote everything they have to destruction. Do not spare them. Kill both men and women, infants and nursing babies, oxen and sheep, camels and donkeys.”"},{"num":4,"verse":"So Saul summoned the troops and organized them for battle at Telaim. There were two hundred thousand foot soldiers and ten thousand men from Judah. "},{"num":5,"verse":"Then Saul came to the city of Amalek and set up an ambush in the ravine. "},{"num":6,"verse":"Saul said to the Kenites, “Go! Leave! Get away from the Amalekites, so that I do not destroy you along with them, because you showed kindness to all the people of Israel when they came up out of Egypt.” So the Kenites moved away from the Amalekites."},{"num":7,"verse":"Saul struck the Amalekites from Havilah all the way to Shur, which borders Egypt. "},{"num":8,"verse":"He took Agag, the king of the Amalekites, alive, and he devoted all the people to destruction with the edge of the sword. "},{"num":9,"verse":"But Saul and the people spared Agag and the best of the sheep, the cattle, the fattened calves, and the lambs, along with everything else that was good, because they were not willing to devote them to destruction. But everything that was undesirable and worthless, that they devoted to destruction."},{"num":10,"verse":"Then the word of the Lord came to Samuel: "},{"num":11,"verse":"“I regret that I have set up Saul to be king, for he has turned back from following me, and he has not carried out my words.” Samuel was angry, and he cried to the Lord all night."},{"num":12,"verse":"Samuel got up to meet Saul early in the morning, but Samuel was told, “Saul went to Carmel, and he set up a monument for himself there. Then he turned and continued down to Gilgal.”"},{"num":13,"verse":"When Samuel came to Saul, Saul said to him, “You are blessed by the Lord! I have carried out the word of the Lord.”"},{"num":14,"verse":"Samuel said, “Then what does this mean—this bleating of sheep in my ears and the lowing of cattle that I hear?”"},{"num":15,"verse":"Saul said, “They have been brought here from the Amalekites, because the people spared the best of the sheep and the cattle to sacrifice to the Lord your God. But we have completely destroyed the rest.”"},{"num":16,"verse":"Then Samuel said to Saul, “Stop right there! Let me tell you what the Lord said to me last night.”"},{"num":17,"verse":"Samuel said, “Though you were insignificant in your own sight, you were made the head of the tribes of Israel. The Lord anointed you king over Israel. "},{"num":18,"verse":"Then the Lord sent you on a mission and said, ‘Go and devote the Amalekites, that sinful people, to destruction. Fight against them until they are exterminated.’ "},{"num":19,"verse":"Why didn’t you listen to the voice of the Lord? Why did you swoop down on the plunder and do what was evil in the Lord’s sight?”"},{"num":20,"verse":"Saul said to Samuel, “But I have obeyed the voice of the Lord and have completed the mission that the Lord gave me. I have captured Agag king of Amalek, and I have completely destroyed the Amalekites. "},{"num":21,"verse":"But the people took some of the plunder: sheep, cattle, and the best of what was devoted to destruction, to sacrifice to the Lord your God in Gilgal.”"},{"num":22,"verse":"Samuel said, “Does the Lord take as much pleasure in burnt offerings and sacrifices, as in obedience to the voice of the Lord? Know this! To obey is better than sacrifice, and to pay attention is better than the fat of rams. "},{"num":23,"verse":"For rebellion is the same as the sin of witchcraft, and arrogance is like having useless idols or consulting household gods. Because you have rejected the word of the Lord, he has also rejected you as king.”"},{"num":24,"verse":"Saul said to Samuel, “I have sinned, for I have transgressed against the command of the Lord, as well as against your words, because I was afraid of the people, so I listened to their voice. "},{"num":25,"verse":"But now, please pardon my sin and come back with me again, so that I may worship the Lord.”"},{"num":26,"verse":"But Samuel said to Saul, “I will not return with you, because you have rejected the word of the Lord, and the Lord has rejected you from being king over Israel.”"},{"num":27,"verse":"As Samuel turned to leave, Saul grabbed the edge of his robe, and it tore. "},{"num":28,"verse":"Samuel said to him, “The Lord has torn the kingdom of Israel away from you today, and he has given it to a neighbor of yours who is better than you. "},{"num":29,"verse":"The Splendor of Israel will not lie or change his mind, because he is not a man, who changes his mind.”"},{"num":30,"verse":"Then Saul said, “I have sinned, but please honor me now before the elders of my people and before Israel. Come back with me, so that I may worship the Lord your God.” "},{"num":31,"verse":"So Samuel went back with Saul, and Saul worshipped the Lord."},{"num":32,"verse":"Then Samuel said, “Bring Agag the king of the Amalekites here to me!”"},{"num":33,"verse":"Samuel said, “As your sword has made women childless, so your mother will be childless among women!” Then Samuel cut Agag to pieces before the Lord in Gilgal."},{"num":34,"verse":"Samuel then went to Ramah, and Saul went up to his house at Gibeah of Saul. "},{"num":35,"verse":"Until the day of his death, Samuel never again came to see Saul. Samuel did, however, mourn for Saul, but the Lord regretted that he had made Saul king over Israel."}]