[{"num":15,"verse":"Shmuel also said unto Sha’ul, Hashem sent me limeshachacha (to anoint thee) to be Melech over His people, over Yisroel; now therefore shema (pay heed) thou unto the voice of the Divrei Hashem."},{"num":2,"verse":"Thus saith Hashem Tzva’os, I remember that which Amalek did to Yisroel, how he waylaid him on the derech, when he came up from Mitzrayim."},{"num":3,"verse":"Now go and attack Amalek, and utterly destroy all that they have, and spare them not; but slay both ish and isha, olel, and yonek, shor, seh, gamal, and chamor."},{"num":4,"verse":"And Sha’ul gathered HaAm together, and numbered them at Tela’im, two hundred elef foot soldiers, and ten elef Ish Yehudah."},{"num":5,"verse":"And Sha’ul came to a city of Amalek, and lay in wait in the valley."},{"num":6,"verse":"And Sha’ul said unto the Keni, Go, depart, get you away from among the Amaleki, lest I destroy you with them; for ye showed chesed to kol Bnei Yisroel, when they came up out of Mitzrayim. So the Keni moved away from among Amalek."},{"num":7,"verse":"And Sha’ul attacked Amalek from Chavilah until where thou comest to Shur, that is alongside Mitzrayim."},{"num":8,"verse":"And he took Agag Melech Amalek alive, and destroyed with utter cherem destruction kol haAm with the edge of the cherev."},{"num":9,"verse":"But Sha’ul and HaAm spared Agag, and the best of the tzon, and of the bakar, and of the fat bulls, and the fat sheep, and all that was tov, and would not utterly destroy them; but everything that was despised and worthless, that they destroyed with utter cherem destruction."},{"num":10,"verse":"Then came the Devar Hashem unto Shmuel, saying,"},{"num":11,"verse":"I greatly regret and relent and reconsider that I have set up Sha’ul to be Melech; for he is turned back from following Me, and hath not performed My Devar. And it grieved Shmuel; and he cried out unto Hashem kol halailah."},{"num":12,"verse":"And when Shmuel rose early to meet Sha’ul in the boker, it was told Shmuel, saying, Sha’ul came to Carmel, and, hinei, he set up a yad (hand, i.e. memorial, monument) for himself. And he turned and went down to Gilgal."},{"num":13,"verse":"And Shmuel came to Sha’ul; and Sha’ul said unto him, Baruch atah l’Hashem; I have carried out the Devar Hashem."},{"num":14,"verse":"And Shmuel said, What meaneth then this bleating of the tzon (sheep) in mine ears, and the lowing of the bakar (cattle) which I hear?"},{"num":15,"verse":"And Sha’ul said, They have brought them from Amalek; for HaAm spared the best of the tzon and of the bakar, in order to sacrifice unto Hashem Eloheicha; and the rest we have destroyed in utter cherem desruction."},{"num":16,"verse":"Then Shmuel said unto Sha’ul, Stop, and I will tell thee what Hashem hath said to me this night. And he said unto him, Say on."},{"num":17,"verse":"And Shmuel said, When thou wast katon (little) in thine own eyes, wast thou not made the Rosh Shivtei Yisroel, and Hashem anointed thee Melech over Yisroel?"},{"num":18,"verse":"And Hashem sent thee baderech (on a mission), and said, Go destroy with utter cherem destruction the chatta’im (sinners), Amalek, and make war against them until they be consumed."},{"num":19,"verse":"Why then didst thou not obey the voice of Hashem, but didst pounce upon the plunder, and didst harah (the evil) in the eyes of Hasham?"},{"num":20,"verse":"And Sha’ul said unto Shmuel, Yes, I have obeyed the voice of Hashem, and have gone baderech (on the mission) which Hashem sent me, and have brought back Agag Melech Amalek, and have destroyed Amalek with utter cherem destruction."},{"num":21,"verse":"But HaAm took of the plunder the tzon and bakar, the reshit of the cherem to sacrifice unto Hashem Eloheicha at Gilgal."},{"num":22,"verse":"And Shmuel said, Hath Hashem as great chefetz (delight) in olot and zevakhim, as in obeying the voice of Hashem? Hinei, to obey is better than zevach (sacrifice), and to pay heed than the chelev eilim (fat of rams)."},{"num":23,"verse":"For meri (rebellion) is as the chattat (sin) of kesem (witchcraft, soothsaying, divination), and stubbornness is as heathenish iniquity and idolatry. Because thou hast rejected the Devar Hashem, He hath also rejected thee from being Melech."},{"num":24,"verse":"And Sha’ul said unto Shmuel, Chatati (I have sinned): for I have transgressed the commandment of Hashem, and thy words: because I feared HaAm, and listened to their voice."},{"num":25,"verse":"Therefore, now, pardon my sin, and turn back with me, that I may worship Hashem."},{"num":26,"verse":"And Shmuel said unto Sha’ul, I will not go back with thee: for thou hast rejected the Davar Hashem, and Hashem hath rejected thee from being Melech over Yisroel."},{"num":27,"verse":"And as Shmuel turned about to go away, he [Sha’ul] seized the edge of his me’il (robe, mantle), and he tore (it)."},{"num":28,"verse":"And Shmuel said unto him, Hashem hath torn the Mamlechut Yisroel from thee this day, and hath given it to a re’a (neighbor) of thine, that is better than thou."},{"num":29,"verse":"And also the Netzach Yisroel (Eternal One of Israel) will not lie nor relent: for He is not an adam, that He should change His mind."},{"num":30,"verse":"Then he said, Chatati (I have sinned): yet honor me now, before the Ziknei Ami, and before Yisroel, and turn back with me, that I may worship Hashem Eloheicha."},{"num":31,"verse":"So Shmuel turned back after Sha’ul; and Sha’ul worshiped Hashem."},{"num":32,"verse":"Then said Shmuel, Bring ye to me Agag Melech Amalek. And Agag came unto him confidently. And Agag thought, Surely the mar hamavet (bitterness of death) is past."},{"num":33,"verse":"And Shmuel said, As thy cherev hath made nashim childless, so shall immecha be childless among nashim. And Shmuel cut Agag in pieces before Hashem at Gilgal."},{"num":34,"verse":"Then Shmuel went to Ramah; and Sha’ul went up to his bais at Giveat Sha’ul."},{"num":35,"verse":"Until his [Shaul’s] yom mot Shmuel came not again to see him: nevertheless Shmuel mourned for Sha’ul: and Hashem relented that He had made Sha’ul Melech over Yisroel."}]