[{"header":"Israel Destroys Arad"},{"num":21,"verse":"The Canaanite king of the city of Arad lived in the Negev Desert. He heard that Israel was coming along the road to Atharim. So he attacked the Israelites. He captured some of them. "},{"num":2,"verse":"Then Israel made a promise to the Lord. They said, “Hand these people over to us. If you do, we will set their cities apart to you in a special way to be destroyed.” "},{"num":3,"verse":"The Lord gave Israel what they asked for. He handed the Canaanites over to them. Israel completely destroyed them and their towns. So that place was named Hormah."},{"header":"Moses Makes a Bronze Snake"},{"num":4,"verse":"The Israelites traveled from Mount Hor along the way to the Red Sea. They wanted to go around Edom. But they grew tired on the way. "},{"num":5,"verse":"So they spoke against God and against Moses. They said, “Why have you brought us up out of Egypt? Do you want us to die here in the desert? We don’t have any bread! We don’t have any water! And we hate this awful food!”"},{"num":6,"verse":"Then the Lord sent poisonous snakes among the Israelites. The snakes bit them. Many of the people died. "},{"num":7,"verse":"The others came to Moses. They said, “We sinned when we spoke against the Lord and against you. Pray that the Lord will take the snakes away from us.” So Moses prayed for the people."},{"num":8,"verse":"The Lord said to Moses, “Make a snake. Put it up on a pole. Then anyone who is bitten can look at it and remain alive.” "},{"num":9,"verse":"So Moses made a bronze snake. He put it up on a pole. Then anyone who was bitten by a snake and looked at the bronze snake remained alive."},{"header":"The People Continue On to Moab"},{"num":10,"verse":"The Israelites moved on. They camped at Oboth. "},{"num":11,"verse":"Then they started out from Oboth. They camped in Iye Abarim. It’s in the desert on the eastern border of Moab. "},{"num":12,"verse":"From there they moved on. They camped in the Zered Valley. "},{"num":13,"verse":"They started out from there and camped by the Arnon River. It’s in the desert that spreads out into the territory of the Amorites. The Arnon is the border of Moab. It’s between Moab and the Amorites. "},{"num":14,"verse":"Here is what the Book of the Wars of the Lord says about it."},{"num":16,"verse":"From there the Israelites continued on to Beer. That was the well where the Lord spoke to Moses. He said, “Gather the people together. I will give them water to drink.”"},{"num":17,"verse":"Then Israel sang a song. They said,"},{"num":19,"verse":"They went from Mattanah to Nahaliel. They went from Nahaliel to Bamoth. "},{"num":20,"verse":"And they went from Bamoth to a valley in Moab. It’s the valley where the highest slopes of Pisgah look out over a dry and empty land."},{"header":"Israel Wins the Battle Over Sihon and Og"},{"num":21,"verse":"The Israelites sent messengers to speak to Sihon. He was the king of the Amorites. The messengers said to him,"},{"num":23,"verse":"But Sihon wouldn’t let Israel pass through his territory. He gathered his whole army together. Then he marched out into the desert against Israel. When he reached Jahaz, he fought against Israel. "},{"num":24,"verse":"But Israel put him to death with their swords. They took over his land. They took everything from the Arnon River to the Jabbok River. But they didn’t take over any of the land of the Ammonites. That’s because the Ammonites had built strong forts along their border. "},{"num":25,"verse":"The Israelites captured all the cities of the Amorites. Then they settled down in them. They captured the city of Heshbon. They also captured all the settlements around it. "},{"num":26,"verse":"Sihon, the king of the Amorites, ruled in Heshbon. He had fought against an earlier king of Moab. Sihon had taken from him all his land all the way to the Arnon River."},{"num":27,"verse":"That’s why the poets say,"},{"num":31,"verse":"So Israel settled in the land of the Amorites."},{"num":32,"verse":"Moses sent spies to the city of Jazer. The Israelites captured the settlements around it. They drove out the Amorites who were there. "},{"num":33,"verse":"Then they turned and went up along the road toward Bashan. Og was the king of Bashan. He and his whole army marched out. They went to fight against Israel at Edrei."},{"num":34,"verse":"The Lord said to Moses, “Do not be afraid of Og. I have handed him over to you. I have given you his whole army. I have also given you his land. Do to him what you did to Sihon, the king of the Amorites. He ruled in Heshbon.”"},{"num":35,"verse":"So the Israelites struck down Og and his sons. And they wiped out his whole army. They didn’t leave anyone alive. They took over his land for themselves."}]