[{"num":23,"verse":"And Sara lived a hundred and twenty-seven years."},{"num":2,"verse":"And she died in the city of Arbee which is Hebron, in the land of Chanaan: and Abraham came to mourn and weep for her."},{"num":3,"verse":"And after he rose up from the funeral obsequies, he spoke to the children of Heth, saying:"},{"num":4,"verse":"I am a stranger and sojourner among you: give me the right of a buryingplace with you, that I may bury my dead."},{"num":5,"verse":"The children of Heth answered, saying:"},{"num":6,"verse":"My Lord, hear us, thou art a prince of God among us: bury thy dead in our principal sepulchres: and no man shall have power to hinder thee from burying thy dead in his sepulchre."},{"num":7,"verse":"Abraham rose up, and bowed down to the people of the land, to wit the children of Heth:"},{"num":8,"verse":"And said to them: If it please your soul that I should bury my dead, hear me, and intercede for me to Ephron the son of Seor."},{"num":9,"verse":"That he may give me the double cave, which he hath in the end of his field: for as much money as it is worth he shall give it me before you, for a possession of a buryingplace."},{"num":10,"verse":"Now Ephron dwelt in the midst of the children of Heth. And Ephron made answer to Abraham in the hearing of all that went in at the gate of the city, saying:"},{"num":11,"verse":"Let it not be so, my lord, but do thou rather hearken to what I say: The field I deliver to thee, and the cave that is therein, in the presence of the children of my people, bury thy dead."},{"num":12,"verse":"Abraham bowed down before the people of the land,"},{"num":13,"verse":"And he spoke to Ephron, in the presence of the people: I beseech thee to hear me: I will give money for the field: take it, and so I will bury my dead in it."},{"num":14,"verse":"And Ephron answered:"},{"num":15,"verse":"My lord, hear me. The ground which thou desirest, is worth four hundred sicles of silver: this is the price between me and thee: but what is this? bury thy dead."},{"num":16,"verse":"And when Abraham had heard this, he weighed out the money that Ephron had asked, in the hearing of the children of Heth, four hundred sicles of silver of common current money."},{"num":17,"verse":"And the field that before was Ephron's, wherein was the double cave, looking towards Mambre, both it and the cave, and all the trees thereof in all its limits round about,"},{"num":18,"verse":"Was made sure to Abraham for a possession, in the sight of the children of Heth, and of all that went in at the gate of his city."},{"num":19,"verse":"And so Abraham buried Sara his wife, in a double cave of the field, that looked towards Mambre, this is Hebron in the land of Chanaan."},{"num":20,"verse":"And the field was made sure to Abraham, and the cave that was in it, for a possession to bury in, by the children of Heth."}]