[{"header":"Sarah Dies"},{"num":23,"verse":"Sarah lived to be 127 years old. "},{"num":2,"verse":"She died in Kiriath Arba (that is, Hebron) in the land of Canaan. Abraham was very sad and cried because of her. "},{"num":3,"verse":"After a while Abraham got up from the side of his wife’s body. And he went to talk to the Hittites. He said, "},{"num":4,"verse":"“I am only a stranger and a foreigner here. Sell me some of your land so that I can bury my dead wife.”"},{"num":5,"verse":"The Hittites answered Abraham, "},{"num":6,"verse":"“Sir, you are a great leader among us. You may have the best place we have to bury your dead. You may have any of our burying places that you want. None of us will stop you from burying your dead wife.”"},{"num":7,"verse":"Abraham rose and bowed to the people of the land, the Hittites. "},{"num":8,"verse":"Abraham said to them, “If you truly want to help me bury my dead wife here, speak to Ephron for me. He is the son of Zohar. "},{"num":9,"verse":"Ask him to sell me the cave of Machpelah. It is at the edge of his field. I will pay him the full price. You can be the witnesses that I am buying it as a burial place.”"},{"num":10,"verse":"Ephron was sitting among the Hittites at the city gate. Ephron answered Abraham, "},{"num":11,"verse":"“No, sir. I will give you the land and the cave that is in it. I will give it to you with these people as witnesses. Bury your dead wife.”"},{"num":12,"verse":"Then Abraham bowed down before the Hittites. "},{"num":13,"verse":"He said to Ephron before all the people, “Please let me pay you the full price for the field. Accept my money, and I will bury my dead there.”"},{"num":14,"verse":"Ephron answered Abraham, "},{"num":15,"verse":"“Sir, the land is worth ten pounds of silver. But I won’t argue with you over the price. Take the land, and bury your dead wife.”"},{"num":16,"verse":"Abraham agreed and paid Ephron in front of the Hittite witnesses. Abraham weighed out the full price: ten pounds of silver. They counted the weight as the traders normally did."},{"num":17,"verse":"So Ephron’s field in Machpelah, east of Mamre, was sold. Abraham became the owner of the field, the cave in it and all the trees that were in the field. The sale was made at the city gate, with the Hittites as witnesses. "},{"num":19,"verse":"After this, Abraham buried his wife Sarah in the cave. It was in that field of Machpelah, near Mamre. (Mamre was later called Hebron in the land of Canaan.) "},{"num":20,"verse":"Abraham bought the field and the cave on it from the Hittites. He used it as a burying place."}]