[[],[{"type":"header","content":"The Altar of Incense"},{"type":"prose","content":"“You shall make an altar upon which to burn incense; you shall make it of acacia wood. "}],[{"type":"prose","content":"It shall be a cubit long and a cubit wide. It shall be square and it shall be two cubits high. Its horns of one piece with it. "}],[{"type":"prose","content":"You shall overlay it with pure gold, its top and its sides all around, and its horns; and you shall make a gold molding all around it. "}],[{"type":"prose","content":"You shall make two gold rings under its molding, make them on the two side walls—on opposite sides—they shall be holders for the poles with which to carry it. "}],[{"type":"prose","content":"You shall make the poles of acacia wood overlaid with gold. "}],[{"type":"prose","content":"You shall put the altar of incense [in the Holy Place] in front  outside of the veil that screens the ark of the Testimony, before the mercy seat that is over the Testimony, where I will meet with you. "}],[{"type":"prose","content":"Aaron shall burn sweet  fragrant incense on it; he shall burn it every morning when he trims  tends the lamps. "}],[{"type":"prose","content":"When Aaron sets up the lamps at twilight, he shall burn incense, a perpetual incense before the  throughout your generations. "}],[{"type":"prose","content":"You shall not offer any strange incense on this altar, or burnt offering or meal offering; you shall not pour out a drink offering on it. "}],[{"type":"prose","content":"Once a year Aaron shall make atonement [for sin] on its horns. He shall make atonement on it with the blood of the sin offering of atonement once a year throughout your generations. It is most holy to the .”"},{"type":"header","content":"The Ransom Money"}],[{"type":"prose","content":"Then the  said to Moses, "}],[{"type":"prose","content":"“When you take the census of the Israelites, each one shall give a ransom for himself to the  when you count them, so that no plague will come on them when you number them. "}],[{"type":"prose","content":"This is what everyone who is counted shall give [as he joins those already counted]: a half shekel, according to the sanctuary shekel the shekel is twenty gerahs; a half shekel as a contribution to the . "}],[{"type":"prose","content":"Everyone who is counted, from twenty years old and over, [as he joins those already counted], shall give this contribution to the . "}],[{"type":"prose","content":"The rich shall not give more and the poor shall not give less than half a shekel, when you give this contribution to the  to make atonement for yourselves. "}],[{"type":"prose","content":"You shall take the atonement money from the Israelites and use it [exclusively] for the service of the Tent of Meeting, so that it may be a memorial for the Israelites before the , to make atonement for yourselves.”"},{"type":"header","content":"The Bronze Basin"}],[{"type":"prose","content":"Then the  said to Moses, "}],[{"type":"prose","content":"“You shall also make a basin of bronze, with a base of bronze, for washing. You shall put it [outside in the court] between the Tent of Meeting and the altar [of burnt offering], and you shall put water in it. "}],[{"type":"prose","content":"Aaron and his sons shall wash their hands and their feet. "}],[{"type":"prose","content":"When they enter the Tent of Meeting, they shall wash with water, so that they will not die. Also, when they approach the altar to minister, to burn an offering in the fire to the  [they shall do the same]. "}],[{"type":"prose","content":"They shall wash their hands and their feet, so that they will not die; it shall be a perpetual statute for them, for Aaron and his descendants throughout their generations.”"},{"type":"header","content":"The Anointing Oil"}],[{"type":"prose","content":"Moreover, the  said to Moses, "}],[{"type":"prose","content":"“Take for yourself the best spices: five hundred  of liquid myrrh, half as much—two hundred and fifty—of sweet-scented cinnamon, and two hundred and fifty of fragrant cane, "}],[{"type":"prose","content":"and five hundred  of cinnamon blossom according to the sanctuary shekel, and a hin of olive oil. "}],[{"type":"prose","content":"You shall make of these a holy anointing oil, a perfume mixture, the work of a perfumer; it shall be a sacred anointing oil. "}],[{"type":"prose","content":"You shall anoint the Tent of Meeting with it, and the ark of the Testimony, "}],[{"type":"prose","content":"and the table [for the bread] and all its utensils, and the lampstand and its utensils, and the altar of incense, "}],[{"type":"prose","content":"and the altar of burnt offering with all its utensils, and the basin [for cleansing] and its base. "}],[{"type":"prose","content":"You shall consecrate them, that they may be most holy; whatever touches them must be holy (set apart for God). "}],[{"type":"prose","content":"You shall anoint Aaron and his sons, and consecrate them, that they may serve as priests to Me. "}],[{"type":"prose","content":"You shall say to the Israelites, ‘This shall be a holy  sacred anointing oil, to Me [alone] throughout your generations. "}],[{"type":"prose","content":"It shall not be poured on anyone’s body, nor shall you make any like it in the same composition. It is holy, and it shall be sacred to you. "}],[{"type":"prose","content":"Whoever prepares any like it or puts any of it on a layman shall be cut off from his people [excluding him from the atonement made for them].’”"},{"type":"header","content":"The Incense"}],[{"type":"prose","content":"Then the  said to Moses, “Take sweet  fragrant spices—stacte, onycha, and galbanum, sweet  fragrant spices with pure frankincense; there shall be an equal amount of each— "}],[{"type":"prose","content":"and make incense with it, a perfume, the work of a perfumer, salted, pure and sacred. "}],[{"type":"prose","content":"You shall crush some of it [into a] very fine [powder], and put some of it before the Testimony in the Tent of Meeting, where I will meet with you; it shall be most holy to you. "}],[{"type":"prose","content":"The incense which you shall make, you shall not make in the same proportions for yourselves; it shall be holy to you for the . "}],[{"type":"prose","content":"Whoever makes any like it, to use as perfume shall be cut off from his people [excluding him from the atonement made for them].”"}]]