[{"header":"The Altar for Burning Incense(A)"},{"num":30,"verse":"“Make an altar out of acacia wood, for burning incense. "},{"num":2,"verse":"It is to be square, 18 inches long and 18 inches wide, and it is to be 36 inches high. Its projections at the four corners are to form one piece with it. "},{"num":3,"verse":"Cover its top, all four sides, and its projections with pure gold, and put a gold border around it. "},{"num":4,"verse":"Make two gold carrying rings for it and attach them below the border on two sides to hold the poles with which it is to be carried. "},{"num":5,"verse":"Make these poles of acacia wood and cover them with gold. "},{"num":6,"verse":"Put this altar outside the curtain which hangs in front of the Covenant Box. That is the place where I will meet you. "},{"num":7,"verse":"Every morning when Aaron comes to take care of the lamps, he is to burn sweet-smelling incense on it. "},{"num":8,"verse":"He must do the same when he lights the lamps in the evening. This offering of incense is to continue without interruption for all time to come. "},{"num":9,"verse":"Do not offer on this altar any forbidden incense, any animal offering, or any grain offering, and do not pour out any wine offering on it. "},{"num":10,"verse":"Once a year Aaron is to perform the ritual for purifying the altar by putting on its four projections the blood of the animal sacrificed for sin. This is to be done every year for all time to come. This altar is to be completely holy, dedicated to me, the Lord.”"},{"header":"The Tax for the Tent of the Lord's Presence"},{"num":11,"verse":"The Lord said to Moses, "},{"num":12,"verse":"“When you take a census of the people of Israel, each man is to pay me a price for his life, so that no disaster will come on him while the census is being taken. "},{"num":13,"verse":"Everyone included in the census must pay the required amount of money, weighed according to the official standard. Everyone must pay this as an offering to me. "},{"num":14,"verse":"Everyone being counted in the census, that is, every man twenty years old or older, is to pay me this amount. "},{"num":15,"verse":"The rich man is not to pay more, nor the poor man less, when they pay this amount for their lives. "},{"num":16,"verse":"Collect this money from the people of Israel and spend it for the upkeep of the Tent of my presence. This tax will be the payment for their lives, and I will remember to protect them.”"},{"header":"The Bronze Basin"},{"num":17,"verse":"The Lord said to Moses, "},{"num":18,"verse":"“Make a bronze basin with a bronze base. Place it between the Tent and the altar, and put water in it. "},{"num":19,"verse":"Aaron and his sons are to use the water to wash their hands and feet "},{"num":20,"verse":"before they go into the Tent or approach the altar to offer the food offering. Then they will not be killed. "},{"num":21,"verse":"They must wash their hands and feet, so that they will not die. This is a rule which they and their descendants are to observe forever.”"},{"header":"The Anointing Oil"},{"num":22,"verse":"The Lord said to Moses, "},{"num":23,"verse":"“Take the finest spices—12 pounds of liquid myrrh, 6 pounds of sweet-smelling cinnamon, 6 pounds of sweet-smelling cane, "},{"num":24,"verse":"and 12 pounds of cassia (all weighed according to the official standard). Add one gallon of olive oil, "},{"num":25,"verse":"and make a sacred anointing oil, mixed like perfume. "},{"num":26,"verse":"Use it to anoint the Tent of my presence, the Covenant Box, "},{"num":27,"verse":"the table and all its equipment, the lampstand and its equipment, the altar for burning incense, "},{"num":28,"verse":"the altar for burning offerings, together with all its equipment, and the washbasin with its base. "},{"num":29,"verse":"Dedicate these things in this way, and they will be completely holy, and anyone or anything that touches them will be harmed by the power of its holiness. "},{"num":30,"verse":"Then anoint Aaron and his sons, and ordain them as priests in my service. "},{"num":31,"verse":"Say to the people of Israel, ‘This holy anointing oil is to be used in my service for all time to come. "},{"num":32,"verse":"It must not be poured on ordinary men, and you must not use the same formula to make any mixture like it. It is holy, and you must treat it as holy. "},{"num":33,"verse":"Whoever makes any like it or uses any of it on anyone who is not a priest will no longer be considered one of my people.’”"},{"header":"The Incense"},{"num":34,"verse":"The Lord said to Moses, “Take an equal part of each of the following sweet spices—stacte, onycha, galbanum, and pure frankincense. "},{"num":35,"verse":"Use them to make incense, mixed like perfume. Add salt to keep it pure and holy. "},{"num":36,"verse":"Beat part of it into a fine powder, take it into the Tent of my presence, and sprinkle it in front of the Covenant Box. Treat this incense as completely holy. "},{"num":37,"verse":"Do not use the same formula to make any incense like it for yourselves. Treat it as a holy thing dedicated to me. "},{"num":38,"verse":"If anyone makes any like it for use as perfume, he will no longer be considered one of my people.”"}]