[{"header":"Chapter 30"},{"num":1,"verse":"Altar of Incense. For burning incense you shall make an altar of acacia wood, "},{"num":2,"verse":"with a square surface, a cubit long, a cubit wide, and two cubits high, with horns that are of one piece with it. "},{"num":3,"verse":"Its grate on top, its walls on all four sides, and its horns you shall plate with pure gold. Put a gold molding around it. "},{"num":4,"verse":"Underneath the molding you shall put gold rings, two on one side and two on the opposite side, as holders for the poles used in carrying it. "},{"num":5,"verse":"Make the poles, too, of acacia wood and plate them with gold. "},{"num":6,"verse":"This altar you are to place in front of the veil that hangs before the ark of the covenant where I will meet you."},{"num":7,"verse":"On it Aaron shall burn fragrant incense. Morning after morning, when he prepares the lamps, "},{"num":8,"verse":"and again in the evening twilight, when he lights the lamps, he shall burn incense. Throughout your generations this shall be the regular incense offering before the Lord. "},{"num":9,"verse":"On this altar you shall not offer up any profane incense, or any burnt offering or grain offering; nor shall you pour out a libation upon it. "},{"num":10,"verse":"Once a year Aaron shall purge its horns. Throughout your generations he is to purge it once a year with the blood of the atoning purification offering. This altar is most sacred to the Lord."},{"num":11,"verse":"Census Tax. The Lord also told Moses: "},{"num":12,"verse":"When you take a census of the Israelites who are to be enrolled, each one, as he is enrolled, shall give the Lord a ransom for his life, so that no plague may come upon them for being enrolled. "},{"num":13,"verse":"This is what everyone who is enrolled must pay: a half-shekel, according to the standard of the sanctuary shekel—twenty gerahs to the shekel—a half-shekel contribution to the Lord. "},{"num":14,"verse":"Everyone who is enrolled, of twenty years or more, must give the contribution to the Lord. "},{"num":15,"verse":"The rich need not give more, nor shall the poor give less, than a half-shekel in this contribution to the Lord to pay the ransom for their lives. "},{"num":16,"verse":"When you receive this ransom money from the Israelites, you shall donate it to the service of the tent of meeting, that there it may be a reminder of the Israelites before the Lord of the ransom paid for their lives."},{"num":17,"verse":"The Basin. The Lord told Moses: "},{"num":18,"verse":"For ablutions you shall make a bronze basin with a bronze stand. Place it between the tent of meeting and the altar, and put water in it. "},{"num":19,"verse":"Aaron and his sons shall use it in washing their hands and feet. "},{"num":20,"verse":"When they are about to enter the tent of meeting, they must wash with water, lest they die. Likewise when they approach the altar to minister, to offer an oblation to the Lord, "},{"num":21,"verse":"they must wash their hands and feet, lest they die. This shall be a perpetual statute for him and his descendants throughout their generations."},{"num":22,"verse":"The Anointing Oil. The Lord told Moses: "},{"num":23,"verse":"Take the finest spices: five hundred shekels of free-flowing myrrh; half that amount, that is, two hundred and fifty shekels, of fragrant cinnamon; two hundred and fifty shekels of fragrant cane; "},{"num":24,"verse":"five hundred shekels of cassia—all according to the standard of the sanctuary shekel; together with a hin of olive oil; "},{"num":25,"verse":"and blend them into sacred anointing oil, perfumed ointment expertly prepared. With this sacred anointing oil "},{"num":26,"verse":"you shall anoint the tent of meeting and the ark of the covenant, "},{"num":27,"verse":"the table and all its utensils, the menorah and its utensils, the altar of incense "},{"num":28,"verse":"and the altar for burnt offerings with all its utensils, and the basin with its stand. "},{"num":29,"verse":"When you have consecrated them, they shall be most sacred; whatever touches them shall be sacred. "},{"num":30,"verse":"Aaron and his sons you shall also anoint and consecrate as my priests. "},{"num":31,"verse":"Tell the Israelites: As sacred anointing oil this shall belong to me throughout your generations. "},{"num":32,"verse":"It may not be used in any ordinary anointing of the body, nor may you make any other oil of a like mixture. It is sacred, and shall be treated as sacred by you. "},{"num":33,"verse":"Whoever prepares a perfume like this, or whoever puts any of this on an unauthorized person, shall be cut off from his people."},{"num":34,"verse":"The Incense. The Lord told Moses: Take these aromatic substances: storax and onycha and galbanum, these and pure frankincense in equal parts; "},{"num":35,"verse":"and blend them into incense. This fragrant powder, expertly prepared, is to be salted and so kept pure and sacred. "},{"num":36,"verse":"Grind some of it into fine dust and put this before the covenant in the tent of meeting where I will meet you. This incense shall be treated as most sacred by you. "},{"num":37,"verse":"You may not make incense of a like mixture for yourselves; you must treat it as sacred to the Lord. "},{"num":38,"verse":"Whoever makes an incense like this for his own enjoyment of its fragrance, shall be cut off from his people."}]