[{"header":"Chapter 18"},{"num":1,"verse":"Migration of the Danites. In those days there was no king in Israel. In those days the tribe of the Danites were in search of a heritage to dwell in, for up to that time no heritage had been allotted to them among the tribes of Israel."},{"num":2,"verse":"So the Danites sent from their clans five powerful men of Zorah and Eshtaol, to reconnoiter the land and scout it. “Go, scout the land,” they were told. They went into the mountain region of Ephraim, and they spent the night there. "},{"num":3,"verse":"While they were near the house of Micah, they recognized the voice of the young Levite, so they turned aside. They asked him, “Who brought you here? What are you doing here? What is your interest here?” "},{"num":4,"verse":"“This is what Micah has done for me,” he replied to them. “He has hired me and I have become his priest.” "},{"num":5,"verse":"They said to him, “Consult God, that we may know whether the journey we are making will lead to success.” "},{"num":6,"verse":"The priest said to them, “Go in peace! The journey you are making is under the eye of the Lord.”"},{"num":7,"verse":"So the five men went on and came to Laish. They saw the people there living securely after the manner of the Sidonians, quiet and trusting, with no lack of any natural resource. They were distant from the Sidonians and had no dealings with the Arameans. "},{"num":8,"verse":"When the five returned to their kin in Zorah and Eshtaol, they were asked, “What do you have to report?” "},{"num":9,"verse":"They replied, “Come, let us attack them, for we have seen the land and it is very good. Are you going to hesitate? Do not be slow to go in and take possession of the land! "},{"num":10,"verse":"When you go you will come to a trusting people. The land stretches out in both directions, and God has indeed given it into your power—a place where no natural resource is lacking.”"},{"num":11,"verse":"So six hundred of the clan of the Danites, men armed with weapons of war, set out from Zorah and Eshtaol. "},{"num":12,"verse":"They marched up into Judah and encamped near Kiriath-jearim; for this reason the place is called Mahaneh-dan to this day (it lies west of Kiriath-jearim)."},{"num":13,"verse":"From there they passed on into the mountain region of Ephraim and came to the house of Micah. "},{"num":14,"verse":"Then the five men who had gone to reconnoiter the land spoke up and said to their kindred, “Do you know that in these houses there are an ephod, teraphim, and an idol overlaid with silver? Now decide what you must do!” "},{"num":15,"verse":"So turning in that direction, they went to the house of the young Levite at the home of Micah and greeted him. "},{"num":16,"verse":"The six hundred Danites stationed themselves at the entrance of the gate armed with weapons of war. "},{"num":17,"verse":"The five men who had gone to reconnoiter the land went up "},{"num":18,"verse":"and entered the house of Micah with the priest standing there. They took the idol, the ephod, the teraphim and the metal image. When the priest said to them, “What are you doing?” "},{"num":19,"verse":"they said to him, “Be still! Put your hand over your mouth! Come with us and be our father and priest. Is it better for you to be priest for the family of one man or to be priest for a tribe and a clan in Israel?” "},{"num":20,"verse":"The priest, agreeing, took the ephod, the teraphim, and the idol, and went along with the troops. "},{"num":21,"verse":"As they turned to depart, they placed their little ones, their livestock, and their goods at the head of the column."},{"num":22,"verse":"When the Danites had gone some distance from the house of Micah, Micah and the men in the houses nearby mustered and overtook them. "},{"num":23,"verse":"They called to the Danites, who turned and said to Micah, “What do you want that you have called this muster?” "},{"num":24,"verse":"“You have taken my god, which I made for myself, and you have gone off with my priest as well,” he answered. “What is left for me? How, then, can you ask me, ‘What do you want?’” "},{"num":25,"verse":"The Danites said to him, “Do not let your voice be heard near us, or aggravated men will attack you, and you will have forfeited your life and the lives of your family!” "},{"num":26,"verse":"Then the Danites went on their way, and Micah, seeing that they were too strong for him, turned back and went home."},{"num":27,"verse":"Having taken what Micah had made and his priest, they marched against Laish, a quiet and trusting people; they put them to the sword and destroyed the city by fire. "},{"num":28,"verse":"No one came to their aid, since the city was far from Sidon and they had no dealings with the Arameans; the city was in the valley that belongs to Beth-rehob. The Danites then rebuilt the city and occupied it. "},{"num":29,"verse":"They named it Dan after their ancestor Dan, who was born to Israel. But Laish was the name of the city formerly. "},{"num":30,"verse":"The Danites set up the idol for themselves, and Jonathan, son of Gershom, son of Moses, and his descendants were priests for the tribe of the Danites until the time the land went into captivity. "},{"num":31,"verse":"They maintained the idol Micah had made as long as the house of God was in Shiloh."}]