[{"num":19,"verse":"Ahab told Jezebel all that Elijah had done and how he had slain all the prophets [of Baal] with the sword."},{"num":2,"verse":"Then Jezebel sent a messenger to Elijah, saying, So let the gods do to me, and more also, if I make not your life as the life of one of them by this time tomorrow."},{"num":3,"verse":"Then he was afraid and arose and went for his life and came to Beersheba of Judah [over eighty miles, and out of Jezebel’s realm] and left his servant there."},{"num":4,"verse":"But he himself went a day’s journey into the wilderness and came and sat down under a lone broom or juniper tree and asked that he might die. He said, It is enough; now, O Lord, take away my life; for I am no better than my fathers."},{"num":5,"verse":"As he lay asleep under the broom or juniper tree, behold, an angel touched him and said to him, Arise and eat."},{"num":6,"verse":"He looked, and behold, there was a cake baked on the coals, and a bottle of water at his head. And he ate and drank and lay down again."},{"num":7,"verse":"The angel of the Lord came the second time and touched him and said, Arise and eat, for the journey is too great for you."},{"num":8,"verse":"So he arose and ate and drank, and went in the strength of that food forty days and nights to Horeb, the mount of God."},{"num":9,"verse":"There he came to a cave and lodged in it; and behold, the word of the Lord came to him, and He said to him, What are you doing here, Elijah?"},{"num":10,"verse":"He replied, I have been very jealous for the Lord God of hosts; for the Israelites have forsaken Your covenant, thrown down Your altars, and killed Your prophets with the sword. And I, I only, am left; and they seek my life, to take it away."},{"num":11,"verse":"And He said, Go out and stand on the mount before the Lord. And behold, the Lord passed by, and a great and strong wind rent the mountains and broke in pieces the rocks before the Lord, but the Lord was not in the wind; and after the wind an earthquake, but the Lord was not in the earthquake;"},{"num":12,"verse":"And after the earthquake a fire, but the Lord was not in the fire; and after the fire [a sound of gentle stillness and] a still, small voice."},{"num":13,"verse":"When Elijah heard the voice, he wrapped his face in his mantle and went out and stood in the entrance of the cave. And behold, there came a voice to him and said, What are you doing here, Elijah?"},{"num":14,"verse":"He said, I have been very jealous for the Lord God of hosts, because the Israelites have forsaken Your covenant, thrown down Your altars, and slain Your prophets with the sword. And I, I only, am left, and they seek my life, to destroy it."},{"num":15,"verse":"And the Lord said to him, Go, return on your way to the Wilderness of Damascus; and when you arrive, anoint Hazael to be king over Syria."},{"num":16,"verse":"And anoint Jehu son of Nimshi to be king over Israel, and anoint Elisha son of Shaphat of Abel-meholah to be prophet in your place."},{"num":17,"verse":"And him who escapes from the sword of Hazael Jehu shall slay, and him who escapes the sword of Jehu Elisha shall slay."},{"num":18,"verse":"Yet I will leave Myself 7,000 in Israel, all the knees that have not bowed to Baal and every mouth that has not kissed him."},{"num":19,"verse":"So Elijah left there and found Elisha son of Shaphat, whose plowing was being done with twelve yoke of oxen, and he drove the twelfth. Elijah crossed over to him and cast his mantle upon him."},{"num":20,"verse":"He left the oxen and ran after Elijah and said, Let me kiss my father and mother, and then I will follow you. And he [testing Elisha] said, Go on back. What have I done to you? [Settle it for yourself.]"},{"num":21,"verse":"So Elisha went back from him. Then he took a yoke of oxen, slew them, boiled their flesh with the oxen’s yoke [as fuel], and gave to the people, and they ate. Then he arose, followed Elijah, and served him."}]