[{"num":11,"verse":"And the Lord spoke to Moses and Aaron, saying:"},{"num":2,"verse":"Say to the children of Israel: These are the animals which you are to eat of all the living things of the earth."},{"num":3,"verse":"Whatsoever hath the hoof divided, and cheweth the cud among the beasts, you shall eat."},{"num":4,"verse":"But whatsoever cheweth indeed the cud, and hath a hoof, but divideth it not, as the camel, and others, that you shall not eat, but shall reckon it among the unclean."},{"num":5,"verse":"The cherogrillus which cheweth the cud, but divideth not the hoof, is unclean."},{"num":6,"verse":"The hare also: for that too cheweth the cud, but divideth not the hoof."},{"num":7,"verse":"And the swine, which, though it divideth the hoof, cheweth not the cud."},{"num":8,"verse":"The flesh of these you shall not eat, nor shall you touch their carcasses, because they are unclean to you."},{"num":9,"verse":"These are the things that breed in the waters, and which it is lawful to eat. All that hath fins, and scales, as well in the sea, as in the rivers, and the pools, you shall eat."},{"num":10,"verse":"But whatsoever hath not fins and scales, of those things that move and live in the waters, shall be an abomination to you,"},{"num":11,"verse":"And detestable: their flesh you shall not eat, and their carcasses you shall avoid."},{"num":12,"verse":"All that have not fins and scales, in the waters, shall be unclean."},{"num":13,"verse":"Of birds these are they which you must not eat, and which are to be avoided by you: The eagle, and the griffon, and the osprey,"},{"num":14,"verse":"And the kite, and the vulture, according to their kind,"},{"num":15,"verse":"And all that is of the raven kind, according to their likeness."},{"num":16,"verse":"The ostrich, and the owl, and the larus, and the hawk according to its kind."},{"num":17,"verse":"The screech owl, and the cormorant, and the ibis,"},{"num":18,"verse":"And the swan, and the bittern, and the porphyrion,"},{"num":19,"verse":"The heron, and the charadrion according to its kind, the houp also, and the bat."},{"num":20,"verse":"Of things that fly, whatsoever goeth upon four feet, shall be abominable to you."},{"num":21,"verse":"But whatsoever walketh upon four feet, but hath the legs behind longer, wherewith it hoppeth upon the earth,"},{"num":22,"verse":"That you shall eat, as the bruchus in its kind, the attacus, and ophiomachus, and the locust, every one according to their kind."},{"num":23,"verse":"But of dying things whatsoever hath four feet only, shall be an abomination to you:"},{"num":24,"verse":"And whosoever shall touch the carcasses of them, shall be defiled, and shall be unclean until the evening:"},{"num":25,"verse":"And if it be necessary that he carry any of these things when they are dead, he shall wash his clothes, and shall be unclean until the sun set."},{"num":26,"verse":"Every beast that hath a hoof, but divideth it not, nor cheweth the cud, shall be unclean: and he that toucheth it, shall be defiled."},{"num":27,"verse":"That which walketh upon hands of all animals which go on all four, shall be unclean: he that shall touch their carcasses shall be defiled until evening."},{"num":28,"verse":"And he that shall carry such carcasses, shall wash his clothes, and shall be unclean until evening: because all these things are unclean to you."},{"num":29,"verse":"These also shall be reckoned among unclean things, of all that move upon the earth, the weasel, and the mouse, and the crocodile, every one according to their kind:"},{"num":30,"verse":"The shrew, and the chameleon, and the stello, and the lizard, and the mole:"},{"num":31,"verse":"All these are unclean. He that toucheth their carcasses shall be unclean until the evening."},{"num":32,"verse":"And upon what thing soever any of their carcasses shall fall, it shall be defiled, whether it be a vessel of wood, or a garment, or skins or haircloths; or any thing in which work is done, they shall be dipped in water, and shall be unclean until the evening, and so afterwards shall be clean."},{"num":33,"verse":"But an earthen vessel, into which any of these shall fall, shall be defiled, and therefore is to be broken."},{"num":34,"verse":"Any meat which you eat, if water from such a vessel be poured upon it, shall be unclean; and every liquor that is drunk out of any such vessel, shall be unclean."},{"num":35,"verse":"And upon whatsoever thing any of these dead beasts shall fall, it shall be unclean: whether it be oven, or pots with feet, they shall be destroyed, and shall be unclean."},{"num":36,"verse":"But fountains and cisterns, and all gatherings together of waters shall be clean. He that toucheth their carcasses shall be defiled."},{"num":37,"verse":"If it fall upon seed corn, it shall not defile it."},{"num":38,"verse":"But if any man pour water upon the seed, and afterwards it be touched by the carcasses, it shall be forthwith defiled."},{"num":39,"verse":"If any beast die, of which it is lawful for you to eat, he that toucheth the carcass thereof, shall be unclean until the evening:"},{"num":40,"verse":"And he that eateth or carrieth any thing thereof, shall wash his clothes, and shall be unclean until the evening."},{"num":41,"verse":"All that creepeth upon the earth shall be abominable, neither shall it be taken for meat."},{"num":42,"verse":"Whatsoever goeth upon the breast on four feet, or hath many feet, or traileth on the earth, you shall not eat, because it is abominable."},{"num":43,"verse":"Do not defile your souls, nor touch aught thereof, lest you be unclean,"},{"num":44,"verse":"For I am the Lord your God: be holy because I am holy. Defile not your souls by any creeping thing, that moveth upon the earth."},{"num":45,"verse":"For I am the Lord, who brought you out of the land of Egypt, that I might be your God."},{"num":46,"verse":"You shall be holy, because I am holy. This is the law of beasts and fowls, and of every living creature that moveth in the waters, and creepeth on the earth:"},{"num":47,"verse":"That you may know the differences of the clean, and unclean, and know what you ought to eat, and what to refuse."}]