[{"num":11,"verse":"Then the Lord said to Moses and Aaron,"},{"num":2,"verse":"“Tell the people of Israel that the animals which may be used for food include any animal with cloven hooves which chews its cud. "},{"num":4,"verse":"This means that the following may not be eaten:"},{"num":8,"verse":"You may not eat their meat or even touch their dead bodies; they are forbidden foods for you."},{"num":9,"verse":"“As to fish, you may eat whatever has fins and scales, whether taken from rivers or from the sea; "},{"num":10,"verse":"but all other water creatures are strictly forbidden to you. "},{"num":11,"verse":"You mustn’t eat their meat or even touch their dead bodies. "},{"num":12,"verse":"I’ll repeat it again—any water creature that does not have fins or scales is forbidden to you."},{"num":13,"verse":"“Among the birds, these are the ones you may not eat: the eagle, the metire, the osprey, the falcon (all kinds), the kite, the raven (all kinds), the ostrich, the nighthawk, the seagull, the hawk (all kinds), the owl, the cormorant, the ibis, the marsh hen, the pelican, the vulture, the stork, the heron (all kinds), the hoopoe, the bat."},{"num":20,"verse":"“No insects may be eaten, "},{"num":21,"verse":"with the exception of those that jump; locusts of all varieties—ordinary locusts, bald locusts, crickets, and grasshoppers—may be eaten. "},{"num":23,"verse":"All insects that fly and walk or crawl are forbidden to you."},{"num":24,"verse":"“Anyone touching their dead bodies shall be defiled until the evening "},{"num":25,"verse":"and must wash his clothes immediately. He must also quarantine himself until nightfall, as being ceremonially defiled."},{"num":26,"verse":"“You are also defiled by touching any animal with only semiparted hoofs, or any animal that does not chew the cud. "},{"num":27,"verse":"Any animal that walks on paws is forbidden to you as food. Anyone touching the dead body of such an animal shall be defiled until evening. "},{"num":28,"verse":"Anyone carrying away the carcass shall wash his clothes and be ceremonially defiled until evening; for it is forbidden to you."},{"num":29,"verse":"“These are the forbidden small animals which scurry about your feet or crawl upon the ground: the mole, the rat, the great lizard, the gecko, the mouse, the lizard, the snail, the chameleon. "},{"num":31,"verse":"Anyone touching their dead bodies shall be defiled until evening, "},{"num":32,"verse":"and anything upon which the carcass falls shall be defiled—any article of wood, or of clothing, a rug, or a sack; anything it touches must be put into water and is defiled until evening. After that it may be used again. "},{"num":33,"verse":"If it falls into a pottery bowl, anything in the bowl is defiled, and you shall smash the bowl. "},{"num":34,"verse":"If the water used to cleanse the defiled article touches any food, all of it is defiled. Any drink which is in the defiled bowl is also contaminated."},{"num":35,"verse":"“If the dead body of such an animal touches any clay oven, it is defiled and must be smashed. "},{"num":36,"verse":"If the body falls into a spring or cistern where there is water, that water is not defiled; yet anyone who pulls out the carcass is defiled. "},{"num":37,"verse":"And if the carcass touches grain to be sown in the field, it is not contaminated; "},{"num":38,"verse":"but if the seeds are wet and the carcass falls upon it, the seed is defiled."},{"num":39,"verse":"“If an animal which you are permitted to eat dies of disease, anyone touching the carcass shall be defiled until evening. "},{"num":40,"verse":"Also, anyone eating its meat or carrying away its carcass shall wash his clothes and be defiled until evening."},{"num":41,"verse":"“Animals that crawl shall not be eaten. This includes all reptiles that slither along upon their bellies as well as those that have legs. No crawling thing with many feet may be eaten, for it is defiled. "},{"num":43,"verse":"Do not defile yourselves by touching it."},{"num":44,"verse":"“I am the Lord your God. Keep yourselves pure concerning these things, and be holy, for I am holy; therefore do not defile yourselves by touching any of these things that crawl upon the earth. "},{"num":45,"verse":"For I am the Lord who brought you out of the land of Egypt to be your God. You must therefore be holy, for I am holy.” "},{"num":46,"verse":"These are the laws concerning animals, birds, and whatever swims in the water or crawls upon the ground. "},{"num":47,"verse":"These are the distinctions between what is ceremonially clean and may be eaten, and what is ceremonially defiled and may not be eaten, among all animal life upon the earth."}]