[{"num":11,"verse":"Yahweh spoke to Moses and to Aaron, saying to them, "},{"num":2,"verse":"“Speak to the children of Israel, saying, ‘These are the living things which you may eat among all the animals that are on the earth. "},{"num":3,"verse":"Whatever parts the hoof, and is cloven-footed, and chews the cud among the animals, that you may eat."},{"num":4,"verse":"“‘Nevertheless these you shall not eat of those that chew the cud, or of those who part the hoof: the camel, because it chews the cud but doesn’t have a parted hoof, is unclean to you. "},{"num":5,"verse":"The hyrax, because it chews the cud but doesn’t have a parted hoof, is unclean to you. "},{"num":6,"verse":"The hare, because it chews the cud but doesn’t have a parted hoof, is unclean to you. "},{"num":7,"verse":"The pig, because it has a split hoof, and is cloven-footed, but doesn’t chew the cud, is unclean to you. "},{"num":8,"verse":"You shall not eat their meat. You shall not touch their carcasses. They are unclean to you."},{"num":9,"verse":"“‘You may eat of all these that are in the waters: whatever has fins and scales in the waters, in the seas, and in the rivers, that you may eat. "},{"num":10,"verse":"All that don’t have fins and scales in the seas and rivers, all that move in the waters, and all the living creatures that are in the waters, they are an abomination to you, "},{"num":11,"verse":"and you shall detest them. You shall not eat of their meat, and you shall detest their carcasses. "},{"num":12,"verse":"Whatever has no fins nor scales in the waters is an abomination to you."},{"num":13,"verse":"“‘You shall detest these among the birds; they shall not be eaten because they are an abomination: the eagle, the vulture, the black vulture, "},{"num":14,"verse":"the red kite, any kind of black kite, "},{"num":15,"verse":"any kind of raven, "},{"num":16,"verse":"the horned owl, the screech owl, the gull, any kind of hawk, "},{"num":17,"verse":"the little owl, the cormorant, the great owl, "},{"num":18,"verse":"the white owl, the desert owl, the osprey, "},{"num":19,"verse":"the stork, any kind of heron, the hoopoe, and the bat."},{"num":20,"verse":"“‘All flying insects that walk on all fours are an abomination to you. "},{"num":21,"verse":"Yet you may eat these: of all winged creeping things that go on all fours, which have long, jointed legs for hopping on the earth. "},{"num":22,"verse":"Even of these you may eat: any kind of locust, any kind of katydid, any kind of cricket, and any kind of grasshopper. "},{"num":23,"verse":"But all winged creeping things which have four feet are an abomination to you."},{"num":24,"verse":"“‘By these you will become unclean: whoever touches their carcass shall be unclean until the evening. "},{"num":25,"verse":"Whoever carries any part of their carcass shall wash his clothes, and be unclean until the evening."},{"num":26,"verse":"“‘Every animal which has a split hoof that isn’t completely divided, or doesn’t chew the cud, is unclean to you. Everyone who touches them shall be unclean. "},{"num":27,"verse":"Whatever goes on its paws, among all animals that go on all fours, they are unclean to you. Whoever touches their carcass shall be unclean until the evening. "},{"num":28,"verse":"He who carries their carcass shall wash his clothes, and be unclean until the evening. They are unclean to you."},{"num":29,"verse":"“‘These are they which are unclean to you among the creeping things that creep on the earth: the weasel, the rat, any kind of great lizard, "},{"num":30,"verse":"the gecko, and the monitor lizard, the wall lizard, the skink, and the chameleon. "},{"num":31,"verse":"These are they which are unclean to you among all that creep. Whoever touches them when they are dead shall be unclean until the evening. "},{"num":32,"verse":"Anything they fall on when they are dead shall be unclean; whether it is any vessel of wood, or clothing, or skin, or sack, whatever vessel it is, with which any work is done, it must be put into water, and it shall be unclean until the evening. Then it will be clean. "},{"num":33,"verse":"Every earthen vessel into which any of them falls and all that is in it shall be unclean. You shall break it. "},{"num":34,"verse":"All food which may be eaten which is soaked in water shall be unclean. All drink that may be drunk in every such vessel shall be unclean. "},{"num":35,"verse":"Everything whereupon part of their carcass falls shall be unclean; whether oven, or range for pots, it shall be broken in pieces. They are unclean, and shall be unclean to you. "},{"num":36,"verse":"Nevertheless a spring or a cistern in which water is gathered shall be clean, but that which touches their carcass shall be unclean. "},{"num":37,"verse":"If part of their carcass falls on any sowing seed which is to be sown, it is clean. "},{"num":38,"verse":"But if water is put on the seed, and part of their carcass falls on it, it is unclean to you."},{"num":39,"verse":"“‘If any animal of which you may eat dies, he who touches its carcass shall be unclean until the evening. "},{"num":40,"verse":"He who eats of its carcass shall wash his clothes, and be unclean until the evening. He also who carries its carcass shall wash his clothes, and be unclean until the evening."},{"num":41,"verse":"“‘Every creeping thing that creeps on the earth is an abomination. It shall not be eaten. "},{"num":42,"verse":"Whatever goes on its belly, and whatever goes on all fours, or whatever has many feet, even all creeping things that creep on the earth, them you shall not eat; for they are an abomination. "},{"num":43,"verse":"You shall not make yourselves abominable with any creeping thing that creeps. You shall not make yourselves unclean with them, that you should be defiled by them. "},{"num":44,"verse":"For I am Yahweh your God. Sanctify yourselves therefore, and be holy; for I am holy. You shall not defile yourselves with any kind of creeping thing that moves on the earth. "},{"num":45,"verse":"For I am Yahweh who brought you up out of the land of Egypt, to be your God. You shall therefore be holy, for I am holy."},{"num":46,"verse":"“‘This is the law of the animal, and of the bird, and of every living creature that moves in the waters, and of every creature that creeps on the earth, "},{"num":47,"verse":"to make a distinction between the unclean and the clean, and between the living thing that may be eaten and the living thing that may not be eaten.’”"}]