[{"num":12,"verse":"3 Who they were that went with David when he fled from Saul. 14 Their valiantness. 23 They that came unto him unto Hebron out of every tribe to make him King."},{"num":1,"verse":"These also are they that came to David to Ziklag, while he was yet kept close, because of Saul the son of Kish: and they were among the valiant and helpers of the battle."},{"num":2,"verse":"They were weaponed with bows, and could use the right and the left hand with stones, and with arrows and with bows, and were of Saul’s brethren, even of Benjamin."},{"num":3,"verse":"The chief were Ahiezer, and Joash the sons of Shemaah a Gibeathite, and Jeziel, and Pelet the sons of Azmaveth, Berachah and Jehu the Anathothite,"},{"num":4,"verse":"And Ishmaiah the Gibeonite, a valiant man among thirty, and above the thirty, and Jeremiah, and Jahaziel, and Johanan, and Jozabad the Gederathite,"},{"num":5,"verse":"Eluzai, and Jerimoth, and Bealiah, and Shemariah, and Shephatiah the Haruphite,"},{"num":6,"verse":"Elkanah, and Jisshiah, and Azarel, and Joezer, Jashobeam of Korah,"},{"num":7,"verse":"And Joelah, and Zebadiah the sons of Jeroham of Gedor,"},{"num":8,"verse":"And of the Gadites there separated themselves some unto David into the hold of the wilderness, valiant men of war, and men of arms, and apt for battle, which could handle spear and shield, and their faces were like the faces of lions, and were like the roes in the mountains in swiftness,"},{"num":9,"verse":"Ezer the chief, Obadiah the second, Eliab the third,"},{"num":10,"verse":"Mishmannah the fourth, Jeremiah the fifth,"},{"num":11,"verse":"Attai the sixth, Eliel the seventh,"},{"num":12,"verse":"Johanan the eight, Elzabad the ninth,"},{"num":13,"verse":"Jeremiah the tenth, Machbanai the eleventh."},{"num":14,"verse":"These were the sons of Gad, captains of the host: one of the least could resist an hundred, and the greatest a thousand."},{"num":15,"verse":"These are they that went over Jordan in the first month, when he had filled over all his banks, and put to flight all them of the valley, toward the East and the West."},{"num":16,"verse":"And there came of the children of Benjamin, and Judah to the hold unto David,"},{"num":17,"verse":"And David went out to meet them, and answered and said unto them, If ye be come peaceably unto me to help me, mine heart shall be knit unto you: but if you come to betray me to mine adversaries, seeing there is no wickedness in mine hands, the God of our fathers behold it, and rebuke it."},{"num":18,"verse":"And the spirit came upon Amasai, which was the chief of thirty, and he said, Thine are we, David, and with thee, O son of Jesse. Peace, peace be unto thee, and peace be unto thine helpers: for thy God helpeth thee. Then David received them, and made them captains of the garrison."},{"num":19,"verse":"¶ And of Manasseh, some fell to David, when he came with the Philistines against Saul to battle, but they helped them not: for the Princes of the Philistines by advisement sent him away, saying, He will fall to his master Saul for our heads."},{"num":20,"verse":"As he went to Ziklag, there fell to him of Manasseh, Adnah, and Jozabad, and Jediael, and Michael, and Jozabad, and Elihu, and Zillethai, heads of the thousands that were of Manasseh."},{"num":21,"verse":"And they helped David against that band: for they were all valiant men, and were captains in the host."},{"num":22,"verse":"For at that time day by day, there came to David to help him, until it was a great host, like the host of God."},{"num":23,"verse":"And these are the numbers of the captains that were armed to battle, and came to David to Hebron to turn the kingdom of Saul to him, according to the word of the Lord."},{"num":24,"verse":"The children of Judah that bare shield and spear, were six thousand and eight hundred armed to the war."},{"num":25,"verse":"Of the children of Simeon valiant men of war, seven thousand and an hundred."},{"num":26,"verse":"Of the children of Levi four thousand and six hundred."},{"num":27,"verse":"And Jehoiada was the chief of them of Aaron: and with him three thousand and seven hundred."},{"num":28,"verse":"And Zadok a young man very valiant, and of his father’s household came two and twenty captains."},{"num":29,"verse":"And of the children of Benjamin the brethren of Saul three thousand: for a great part of them unto that time kept the ward of the house of Saul."},{"num":30,"verse":"And of the children of Ephraim twenty thousand, and eight hundred valiant men and famous men in the household of their fathers."},{"num":31,"verse":"And of the half tribe of Manasseh eighteen thousand, which were appointed by name to come and make David King."},{"num":32,"verse":"And of the children of Issachar which were men that had understanding of the times, to know what Israel ought to do: the heads of them were two hundred, and all their brethren were at their commandment."},{"num":33,"verse":"Of Zebulun that went out to battle, expert in war, and in all instruments of war, fifty thousand which could set the battle in array: they were not of a double heart."},{"num":34,"verse":"And of Naphtali thousand captains, and with them with shield and spear seven and thirty thousand."},{"num":35,"verse":"And of Dan expert in battle, eight and twenty thousand and six hundred."},{"num":36,"verse":"And of Asher that went out to the battle and were trained in the wars, forty thousand."},{"num":37,"verse":"And of the other side of Jordan of the Reubenites, and of the Gadites, and of the half tribe of Manasseh with all instruments of war to fight with, an hundred and twenty thousand."},{"num":38,"verse":"All these men of war that could lead an army, came with upright heart to Hebron to make David king over all Israel: and all the rest of Israel was of one accord to make David King."},{"num":39,"verse":"And there they were with David three days, eating and drinking: for their brethren had prepared for them."},{"num":40,"verse":"Moreover, they that were near them until Issachar, and Zebulun, and Naphtali brought bread upon asses, and on camels, and on mules, and on oxen, even meat, flour, figs, and raisins, and wine and oil, and beeves and sheep abundantly: for there was joy in Israel."}]