[{"header":"Fighting Men Join David"},{"num":12,"verse":"Some fighting men came to David at Ziklag. They were among those who helped him in battle. David had been forced to hide from Saul, the son of Kish. "},{"num":2,"verse":"The men were armed with bows. They were able to shoot arrows or throw stones from a sling with either hand. They were relatives of Saul from the tribe of Benjamin. Here is a list of them."},{"num":8,"verse":"Some men of Gad went over to David’s side at his usual place of safety in the desert. They were brave fighting men. They were ready for battle. They were able to use shields and spears. Their faces were like the faces of lions. They could run as fast as antelopes in the mountains."},{"num":14,"verse":"All these men of Gad were army commanders. The least important of them was equal to 100 men. The most important was equal to 1,000. "},{"num":15,"verse":"They went across the Jordan River when it was flowing over its banks. That happened in the first month of spring. They chased away everyone who lived in the valleys. They chased them away from the east and west sides of the river."},{"num":16,"verse":"Some men from the territories of Benjamin and Judah also came to David at his usual place of safety. "},{"num":17,"verse":"David went out to meet them. He said to them, “Have you come to me in peace? Have you come to help me? If you have, I’m ready for you to join me. But suppose you have come to hand me over to my enemies when I haven’t even harmed anyone. Then may the God of our people see it and judge you.”"},{"num":18,"verse":"The Spirit of God came on Amasai. He was leader of the 30 chiefs. He said,"},{"num":19,"verse":"Some people from the tribe of Manasseh went over to David’s side. They did this when he marched out with the Philistines to fight against Saul. But David and his men didn’t help the Philistines. That’s because after all the Philistine rulers had discussed the matter, they sent him away. They said, “Suppose he deserts to his master Saul. Then our heads will be cut off!” "},{"num":20,"verse":"So David went to Ziklag. Here are the men of Manasseh who went over to his side. They were Adnah, Jozabad, Jediael, Michael, Jozabad, Elihu and Zillethai. They were leaders of groups of 1,000 men in Manasseh. "},{"num":21,"verse":"They helped David fight against enemy armies. All the men of Manasseh were brave fighting men. They were commanders in David’s army. "},{"num":22,"verse":"Day after day men came to help David. Soon he had a large army. It was like the army of God."},{"header":"Other Fighting Men Join David at Hebron"},{"num":23,"verse":"Large numbers of men came to David at Hebron. They were prepared for battle. They came to hand Saul’s kingdom over to him, just as the Lord had said. Here are the numbers of the men who came."},{"num":38,"verse":"All these fighting men offered to serve in the army."},{"num":39,"verse":"The men spent three days there with David. They ate and drank what their families had given them. "},{"num":40,"verse":"Their neighbors also brought food. They brought it on donkeys, camels, mules and oxen. They came from as far away as the territories of Issachar, Zebulun and Naphtali. There was plenty of flour, fig cakes, raisin cakes, wine, olive oil, cattle and sheep. The Israelites brought all these things because they were so happy."}]