[{"num":12,"verse":"Now these are they that came to Dovid to Tziklag, while he was still a fugitive because of Sha’ul Ben Kish; and they were among the gibborim, helpers in milchamah."},{"num":2,"verse":"They were armed with keshet (bow), and could use both the right hand and the left in hurling stones and shooting khitzim (arrows) from a keshet; they were kinsmen of Sha’ul, of Binyamin."},{"num":3,"verse":"The head was Achiezer, then Yoash, the Bnei Shema’ah the Giveati; Yeziel, Pelet, the Bnei Azmavet; Berachah, and Yehu the Antoti."},{"num":5,"verse":"And Yishmayah the Giveoni, a gibbor among the Shloshim (Thirty), and over the Shloshim; and Yirmeyah, Yachaziel, Yochanan, and Yozavad the Gederati,"},{"num":6,"verse":"Eluzai, Yerimot, Bealyah, Shemaryahu, and Shephatyahu the Charuphi,"},{"num":7,"verse":"Elkanah, Yishiyahu, Azare’el, Yoezer, and Yashov‘am, the Korchi,"},{"num":8,"verse":"And Yoelah, and Zevadyah, the Bnei Yerocham of Gedor."},{"num":9,"verse":"And of the Gadi there separated themselves unto Dovid into the stronghold in the midbar gibborei hachayil (men of valor), and anshei tzavah (army men) for milchamah, that could handle shield and spear, whose faces were like the faces of aryeh, and were as swift as the gazelles upon the harim;"},{"num":10,"verse":"Ezer the head, Ovadyah the second, Eliav the third,"},{"num":11,"verse":"Mishmannah the fourth, Yirmeyah the fifth,"},{"num":12,"verse":"Attai the sixth, Eliel the seventh,"},{"num":13,"verse":"Yochanan the eighth, Elzavad the ninth,"},{"num":14,"verse":"Yirmeyah the tenth, Machbanai the eleventh."},{"num":15,"verse":"These were of the Bnei Gad, commanders of the tzava (army). One of the least was equal to a hundred, and the greatest to an elef."},{"num":16,"verse":"These are they that went over Yarden in the first month, when it was overflowing all its banks; they put to flight all them of the valleys, both toward the east, and toward the west."},{"num":17,"verse":"And there came of the Bnei Binyamin and Yehudah to the stronghold unto Dovid."},{"num":18,"verse":"And Dovid went out before them, and answered and said unto them, If ye be come in shalom unto me to help me, mine lev shall be united unto you, but if ye be come to betray me to mine enemies, seeing there is no chamas in mine hands, Elohei Avoteinu look thereon, and pass [His] judgment."},{"num":19,"verse":"Then the Ruach [HaKodesh] came upon Amasai, who was head of the Thirty, and he said, Thine are we, Dovid, and on thy side, thou Ben Yishai. Shalom, shalom be unto thee, and shalom be to thine helpers; for Eloheicha helpeth thee. Then Dovid received them, and made them heads of the gedud (raiding band, troop)."},{"num":20,"verse":"And there defected some of Menasheh to Dovid, when he went with the Pelishtim (Philistines) against Sha’ul for milchamah, but they helped them [Pelishtim] not; for the rulers of the Pelishtim after etzah (counsel) sent him [Dovid] away, saying, He [Dovid] will defect to his adon Sha’ul to the jeopardy of our heads."},{"num":21,"verse":"As he went to Tziklag, there defected to him those of Menasheh, Adnach, and Yozavad, and Yedia’el, and Micha’el, and Yozavad, and Elihu, and Tziltai, heads of the alafim that were of Menasheh."},{"num":22,"verse":"And they helped Dovid against the gedud, for they were all gibborei chayil, and were sarim in the tzava (army)."},{"num":23,"verse":"For at that time day by day there came men to Dovid to help him, until it was a machaneh gadol, like the Machaneh Elohim."},{"num":24,"verse":"And these are the numbers of the leaders that were ready-armed for the army, and came to Dovid to Chevron, to turn over the Malchut Sha’ul to him, according to the word of Hashem."},{"num":25,"verse":"The Bnei Yehudah that bore shield and romach (spear) were six alafim and eight hundred, ready-armed for tzva."},{"num":26,"verse":"Of the Bnei Shim’on, gibborei chayil for tzava, shivat alafim and one hundred."},{"num":27,"verse":"Of the Bnei Levi four alafim and six hundred."},{"num":28,"verse":"And Yehoyada was the nagid of those of Aharon, and with him were three alafim and sheva hundred;"},{"num":29,"verse":"And Tzadok, a na’ar gibbor chayil, and of bais aviv twenty and two sarim."},{"num":30,"verse":"And of the Bnei Binyamin, the kindred of Sha’ul, three alafim; for up until then the greatest part of them had kept shomrim mishmeret Bais Sha’ul (guarded loyalty to the House of Sha’ul)."},{"num":31,"verse":"And of the Bnei Ephrayim twenty elef and eight hundred, gibborei chayil, famous throughout the bais of their avot."},{"num":32,"verse":"And of the half tribe of Menasheh eighteen elef, which were designated by shmot, to come and make Dovid Melech."},{"num":33,"verse":"And of the Bnei Yissakhar, which were men that had binah (understanding) of the times, to know what Yisroel ought to do; the heads of them were two hundred; and all their brethren were under their commandment."},{"num":34,"verse":"Of Zevulun, such as went forth to tzava (military service), expert in milchamah, with all instruments of milchamah, fifty elef, which could keep rank; they were not of double heart."},{"num":35,"verse":"And of Naphtali elef sarim, and with them with shield and khanit (spear) thirty and shivah elef."},{"num":36,"verse":"And of the Dani expert in milchamah twenty and eight elef and six hundred."},{"num":37,"verse":"And of Asher, such as went forth to tzava (military service), expert in milchamah, forty elef."},{"num":38,"verse":"And on the other side of Yarden, of the Reuveni, and the Gadi, and of the half shevet (tribe) of Menasheh, with all manner of instruments of tzava for the milchamah, a hundred and twenty elef."},{"num":39,"verse":"All these anshei milchamah, that could keep rank, came with a levav shalem to Chevron, to make Dovid Melech over kol Yisroel; and all the rest also of Yisroel were of lev echad to make Dovid Melech."},{"num":40,"verse":"And there they were with Dovid yamim shloshah, eating and drinking, for their brethren had prepared for them."},{"num":41,"verse":"Moreover they that were kerovim (near ones, neighbors) to them, even unto Yissakhar and Zevulun and Naphtali, brought lechem on chamorim, and on gemalim (camels), and on peradim, and on bakar, and food of kemach (flour), cakes of figs, and raisin cakes, and yayin, and shemen, and bakar, and tzon abundantly; for there was simchah in Yisroel."}]