[{"num":7,"verse":"Thus hath Adonoi Hashem showed unto me; and, hinei, He formed locusts in the beginning of the springing up of the second crop; and, hinei, it was the second crop after the mowing of the melech."},{"num":2,"verse":"And it came to pass, that when they had made an end of eating the vegetation of ha’aretz, then I said, O Adonoi Hashem, forgive, I beseech thee; how shall Ya’akov survive? For he is katon."},{"num":3,"verse":"Hashem relented for this; It shall not be, saith Hashem."},{"num":4,"verse":"Thus hath Adonoi Hashem showed unto me; and, hinei, Adonoi Hashem called to punish with eish, and it devoured the tehom rabbah (great deep), and did devour the chelek (portion)."},{"num":5,"verse":"Then said I, O Adonoi Hashem, cease, I beseech thee; how shall Ya’akov survive? For he is katon."},{"num":6,"verse":"Hashem relented for this: This also shall not be, saith Adonoi Hashem."},{"num":7,"verse":"Thus He showed me; and, hinei, Hashem stood upon a chomah (wall) made with a plumb line, and a plumb line in His hand."},{"num":8,"verse":"And Hashem said unto me, Amos, what seest thou? And I said, A plumb line. Then said Hashem, Hineni, I will set a plumb line in the midst of My people Yisroel; I will not again pass by them [and spare them] anymore;"},{"num":9,"verse":"And the high places of Yitzchak shall be desolate, and the mikdeshei Yisroel (i.e., heathen sanctuaries) shall be laid waste; and I will rise against the Bais Yarov‘am with the cherev."},{"num":10,"verse":"Then Amatzyah the kohen of Beit-El sent to Yarov‘am Melech Yisroel, saying, Amos hath conspired against thee in the midst of Bais Yisroel; the land is not able to bear all his words."},{"num":11,"verse":"For thus Amos saith, Yarov‘am shall die by the cherev, and Yisroel shall surely be led away into the golus out of their own land."},{"num":12,"verse":"Also Amatzyah said unto Amos, O thou seer, go, flee thee away into Eretz Yehudah, and there eat lechem, and prophesy there:"},{"num":13,"verse":"But prophesy not again any more at Beit-El; for it is the Mikdash Melech, and it is the Bais Mamlachah."},{"num":14,"verse":"Then answered Amos, and said to Amatzyah, I was no navi, neither was I a ben navi; but I was a herder, and a dresser of sycamore-fig trees;"},{"num":15,"verse":"And Hashem took me as I followed the tzon, and Hashem said unto me, Go, prophesy unto My people Yisroel."},{"num":16,"verse":"Now therefore hear thou the Devar Hashem: Thou sayest, Prophesy not against Yisroel, and drop not thy word against the Bais Yitzchak."},{"num":17,"verse":"Therefore thus saith Hashem: Thy isha shall be a zonah in the city, and thy banim and thy banot shall fall by the cherev, and thy land shall be divided by line; and thou shalt die in an adamah temei’ah (unclean land); and Yisroel shall surely go forth of his land into golus (exile)."}]