[{"header":"Jacob Goes to Egypt"},{"num":46,"verse":"So Israel set out, along with everything that belonged to him. When he came to Beersheba, he offered sacrifices to the God of his father Isaac. "},{"num":2,"verse":"In visions of the night God said to Israel, “Jacob, Jacob.”"},{"num":3,"verse":"“I am God, the God of your father,” He said. “Do not be afraid to go down to Egypt, for I will turn you into a great nation there. "},{"num":4,"verse":"I Myself will go down with you to Egypt and I Myself will also most certainly bring you up. Joseph will put his hands on your eyes.”"},{"num":5,"verse":"Then Jacob arose from Beersheba and Israel’s sons carried Jacob their father, their little children, and their wives in the carts that Pharaoh had sent to carry him. "},{"num":6,"verse":"They also took their livestock and their possessions they had acquired in the land of Canaan and they came to Egypt, Jacob and all his offspring with him. "},{"num":7,"verse":"His sons and his grandsons with him, his daughters and his granddaughters, and all his offspring, he brought with him to Egypt. "},{"num":8,"verse":"Now these are the names of the sons of Israel who came to Egypt, Jacob and his sons: Jacob’s firstborn, Reuben, "},{"num":9,"verse":"and Reuben’s sons: Hanoch, Pallu, Hezron and Carmi. "},{"num":10,"verse":"Simeon’s sons: Jemuel, Jamin, Ohad, Jachin, Zochar and Shaul the son of the Canaanite woman. "},{"num":11,"verse":"Levi’s sons: Gershon, Kohath and Merari. "},{"num":12,"verse":"Judah’s sons: Er, Onan, Shelah, Perez and Zerah. Er died along with Onan in the land of Canaan. Perez’s sons were Hezron and Hamul. "},{"num":13,"verse":"Issachar’s sons: Tola, Puvah, Iob and Shimron. "},{"num":14,"verse":"Zebulun’s sons: Sered, Elon and Jahleel. "},{"num":15,"verse":"These are Leah’s sons whom she bore to Jacob in Paddan-aram, along with his daughter Dinah. The tally of all of his sons and daughters was 33 people."},{"num":16,"verse":"Gad’s sons: Ziphion, Haggi, Shuni, Ezbon, Eri, Arodi and Areli. "},{"num":17,"verse":"Asher’s sons: Imnah, Ishvah, Ishvi, Beriah, and Serah their sister. Beriah’s sons: Heber and Malchiel. "},{"num":18,"verse":"These are the sons of Zilpah, whom Laban gave to Leah his daughter. She bore these to Jacob: 16 people."},{"num":19,"verse":"The sons of Jacob’s wife Rachel: Joseph and Benjamin. "},{"num":20,"verse":"Manasseh and Ephraim were born to Joseph in the land of Egypt—Asenath the daughter of Potiphera priest of On bore them to him. "},{"num":21,"verse":"Benjamin’s sons: Bela, Becher, Ashbel, Gera, Naaman, Ehi, Rosh, Muppim, Huppim and Ard. "},{"num":22,"verse":"These are Rachel’s sons who were born to Jacob. The tally of all the people was 14."},{"num":23,"verse":"The sons of Dan: Hushim "},{"num":24,"verse":"Naphtali’s sons: Yachzeel, Guni, Yezer and Shillem. "},{"num":25,"verse":"These are the sons of Bilhah whom Laban gave to Rachel his daughter and she bore these to Jacob. The tally of all the people was seven. "},{"num":26,"verse":"All the people belonging to Jacob who came to Egypt—those coming from his loins (not counting the wives of Jacob’s sons)—the tally of all the people was 66. "},{"num":27,"verse":"The sons of Joseph who were born to him in Egypt was a tally of two people. The tally of all the people belonging to Jacob’s house who came to Egypt was 70."},{"num":28,"verse":"Now he sent Judah before him to Joseph to show him the way to Goshen. When they came to the land of Goshen, "},{"num":29,"verse":"Joseph harnessed his chariot and went up to Goshen to meet his father Israel. As soon as he appeared before him, he fell upon his neck, and wept on his neck for some time."},{"num":30,"verse":"Then Israel said to Joseph, “At this time I am ready to die, after seeing your face in person—for you’re still alive!”"},{"num":31,"verse":"Then Joseph said to his brothers and to his father’s household, “I’ll go up and tell Pharaoh, and say to him, ‘My brothers and my father’s household who were in the land of Canaan have come to me. "},{"num":32,"verse":"The men are shepherds, for they’ve been men who handle livestock, who have brought their flocks and cattle and everything that they possess.’ "},{"num":33,"verse":"So when Pharaoh calls you and says, ‘What is your occupation?’ "},{"num":34,"verse":"you must say, ‘Your servants have been men who handle livestock since the time of our youth until now, both we and our fathers,’ so that you can live in the land of Goshen, because every shepherd is loathsome to the Egyptians.”"}]