[{"num":46,"verse":"And Israel went forth with all things that he had, and he came to the well of (the) oath (And Jacob went forth with all that he had, and he came to Beersheba); and when sacrifices were slain there to [the] God of his father Isaac,"},{"num":2,"verse":"he heard God by a vision in that night calling to him (he heard God in a vision that night calling to him), and saying to him, Jacob! Jacob! To whom he answered, Lo! I am present."},{"num":3,"verse":"God said to him, I am the full strong God of thy father; do not thou dread, go down into Egypt, for I shall make thee there into a great folk; (And God said to him, I am the very strong God of thy father; do not thou fear, but go down to Egypt, for there I shall make thee into a great nation;)"},{"num":4,"verse":"I shall go down thither with thee, and I shall bring thee turning again from thence (and I shall bring thee back again from there), and Joseph shall set his hand on thine eyes."},{"num":5,"verse":"Jacob rose from the well of (the) oath (And then Jacob set out from Beersheba), and his sons took him, with their little children, and (their) wives, in the wains which Pharaoh had sent to bear the eld man,"},{"num":6,"verse":"and all things which he wielded in the land of Canaan; and he came into Egypt with [all] his seed,"},{"num":7,"verse":"his sons, and their sons, and (all the) daughters, and all the generation(s) together."},{"num":8,"verse":"Forsooth these be the names of the sons of Israel, that entered into Egypt; Jacob with his free children. The first begotten is Reuben; (And these be the names of the children of Israel who went to Egypt; that is, the names of Jacob and his sons. The first-born was Reuben;)"},{"num":9,"verse":"the sons of Reuben; Hanoch, and Phallu, and Hezron, and Carmi."},{"num":10,"verse":"The sons of Simeon; Jemuel, and Jamin, and Ohad, and Jachin, and Zohar, and Saul, the son of a woman of Canaan (and Shaul, the son of a Canaanite woman)."},{"num":11,"verse":"The sons of Levi; Gershon, Kohath, and Merari."},{"num":12,"verse":"The sons of Judah; Er, and Onan, and Shelah, and Pharez, and Zarah. Forsooth Er and Onan died in the land of Canaan; and the sons of Pharez were born, Hezron, and Hamul. (The sons of Judah; Er, and Onan, and Shelah, and Perez, and Zarah. And Er and Onan died in the land of Canaan; and the sons of Perez were Hezron and Hamul.)"},{"num":13,"verse":"The sons of Issachar; Tola, and Phuvah, and Job, and Shimron."},{"num":14,"verse":"The sons of Zebulun; Sered, and Elon, and Jahleel."},{"num":15,"verse":"These be the sons of Leah, which she childed (to Jacob) in Mesopotamia of Syria, with Dinah, her daughter; all the souls of his sons and (of his) daughters (by Leah), (were) three and thirty. (These be the sons of Leah, whom she bare for Jacob in Paddan-aram, besides their daughter Dinah; all of his sons and his daughter by Leah, were three and thirty.)"},{"num":16,"verse":"The sons of Gad; Ziphion, and Haggi, Shuni, and Ezbon, Eri, and Arodi, and Areli."},{"num":17,"verse":"The sons of Asher; Jimnah, and Ishuah, and Isui, and Beriah; and Serah, the sister of them (and their sister Serah). The sons of Beriah; Heber, and Malchiel."},{"num":18,"verse":"These were the sons of Zilpah, whom Laban gave to Leah, his daughter (whom Laban gave to his daughter Leah), and (through whom) Jacob begat these sixteen persons."},{"num":19,"verse":"The sons of Rachel, Jacob’s wife, were Joseph and Benjamin."},{"num":20,"verse":"And two sons were born to Joseph in the land of Egypt, Manasseh and Ephraim, which Asenath, [the] daughter of Potipherah, priest of Heliopolis, childed to him (bare for him)."},{"num":21,"verse":"The sons of Benjamin were Belah, and Becher, and Ashbel, Gera, and Naaman, and Ehi, and Rosh, and Muppim, and Huppim, and Ard."},{"num":22,"verse":"These were the sons of Rachel, the which Jacob begat (whom Jacob begat through her); all the persons were fourteen."},{"num":23,"verse":"The son of Dan; Hushim."},{"num":24,"verse":"The sons of Naphtali; Jahzeel, and Guni, and Jezer, and Shillem."},{"num":25,"verse":"These were the sons of Bilhah, whom Laban gave to Rachel his daughter (whom Laban gave to his daughter Rachel). And Jacob begat these (through Bilhah); all the souls were seven."},{"num":26,"verse":"And all the men that entered with Jacob into Egypt, and went out of his thigh, without his sons’ wives, were sixty and six. (And so all those who went with Jacob to Egypt, and came out of his thigh, not including his sons’ wives, were sixty-six.)"},{"num":27,"verse":"Forsooth the sons of Joseph, that were born to him in the land of Egypt, were two men. (So) All the souls of the house of Jacob, that entered into Egypt, were seventy."},{"num":28,"verse":"Forsooth Jacob sent Judah before him to Joseph, that he should tell to him, and he meet with them in Goshen. And when Jacob had come thither, (And Jacob sent Judah ahead, to tell Joseph to come and meet them in Goshen. And so when Jacob arrived there,)"},{"num":29,"verse":"Joseph went up in his chariot to meet his father at the same place (Joseph came up in his chariot, and met his father there). And he saw Jacob, and felled on his neck, and wept betwixt embracings."},{"num":30,"verse":"And the father said to Joseph, Now I shall die joyful, for I have seen thy face, and I (shall) leave thee living."},{"num":31,"verse":"And Joseph spake to his brethren, and to all his father’s house(hold), (and said,) I shall go up, and tell to Pharaoh, and I shall say to him, My brethren, and the house(hold) of my father, that were in the land of Canaan, be come to me,"},{"num":32,"verse":"and they be men keepers of sheep, and have busyness of flocks to be fed (and these men be shepherds, and herdsmen, and be busy to feed their flocks, and their herds); (and) they brought with them their sheep, and (their) great beasts, and all things which they might have."},{"num":33,"verse":"And when Pharaoh shall call you, and shall say, What is your work?"},{"num":34,"verse":"ye shall answer, We be thy servants, men shepherds (We, thy servants, be shepherds, and herdsmen), from our childhood till into this present time, both we and our fathers. Soothly ye shall say these things, (so) that ye may dwell in the land of Goshen, for Egyptians loathe all keepers of sheep."}]