[{"header":"Don’t show favoritism"},{"num":2,"verse":"My brothers and sisters, when you show favoritism you deny the faithfulness of our Lord Jesus Christ, who has been resurrected in glory."},{"num":2,"verse":"Imagine two people coming into your meeting. One has a gold ring and fine clothes, while the other is poor, dressed in filthy rags."},{"num":3,"verse":"Then suppose that you were to take special notice of the one wearing fine clothes, saying, “Here’s an excellent place. Sit here.” But to the poor person you say, “Stand over there”; or, “Here, sit at my feet.”"},{"num":4,"verse":"Wouldn’t you have shown favoritism among yourselves and become evil-minded judges?"},{"num":5,"verse":"My dear brothers and sisters, listen! Hasn’t God chosen those who are poor by worldly standards to be rich in terms of faith? Hasn’t God chosen the poor as heirs of the kingdom he has promised to those who love him?"},{"num":6,"verse":"But you have dishonored the poor. Don’t the wealthy make life difficult for you? Aren’t they the ones who drag you into court?"},{"num":7,"verse":"Aren’t they the ones who insult the good name spoken over you at your baptism?"},{"num":8,"verse":"You do well when you really fulfill the royal law found in scripture, Love your neighbor as yourself."},{"num":9,"verse":"But when you show favoritism, you are committing a sin, and by that same law you are exposed as a lawbreaker."},{"num":10,"verse":"Anyone who tries to keep all of the Law but fails at one point is guilty of failing to keep all of it."},{"num":11,"verse":"The one who said, Don’t commit adultery, also said, Don’t commit murder. So if you don’t commit adultery but do commit murder, you are a lawbreaker."},{"num":12,"verse":"In every way, then, speak and act as people who will be judged by the law of freedom."},{"num":13,"verse":"There will be no mercy in judgment for anyone who hasn’t shown mercy. Mercy overrules judgment."},{"header":"Showing faith"},{"num":14,"verse":"My brothers and sisters, what good is it if people say they have faith but do nothing to show it? Claiming to have faith can’t save anyone, can it?"},{"num":15,"verse":"Imagine a brother or sister who is naked and never has enough food to eat."},{"num":16,"verse":"What if one of you said, “Go in peace! Stay warm! Have a nice meal!”? What good is it if you don’t actually give them what their body needs?"},{"num":17,"verse":"In the same way, faith is dead when it doesn’t result in faithful activity."},{"num":18,"verse":"Someone might claim, “You have faith and I have action.” But how can I see your faith apart from your actions? Instead, I’ll show you my faith by putting it into practice in faithful action."},{"num":19,"verse":"It’s good that you believe that God is one. Ha! Even the demons believe this, and they tremble with fear."},{"num":20,"verse":"Are you so slow? Do you need to be shown that faith without actions has no value at all?"},{"num":21,"verse":"What about Abraham, our father? Wasn’t he shown to be righteous through his actions when he offered his son Isaac on the altar?"},{"num":22,"verse":"See, his faith was at work along with his actions. In fact, his faith was made complete by his faithful actions."},{"num":23,"verse":"So the scripture was fulfilled that says, Abraham believed God, and God regarded him as righteous. What is more, Abraham was called God’s friend."},{"num":24,"verse":"So you see that a person is shown to be righteous through faithful actions and not through faith alone."},{"num":25,"verse":"In the same way, wasn’t Rahab the prostitute shown to be righteous when she received the messengers as her guests and then sent them on by another road?"},{"num":26,"verse":"As the lifeless body is dead, so faith without actions is dead."}]