[{"num":2,"verse":"My brethren, do not have the faith of our Lord Jesus Christ, [Lord] of glory, with respect of persons:"},{"num":2,"verse":"for if there come unto your synagogue a man with a gold ring in splendid apparel, and a poor man also come in in vile apparel,"},{"num":3,"verse":"and ye look upon him who wears the splendid apparel, and say, Do thou sit here well, and say to the poor, Do thou stand there, or sit here under my footstool:"},{"num":4,"verse":"have ye not made a difference among yourselves, and become judges having evil thoughts?"},{"num":5,"verse":"Hear, my beloved brethren: Has not God chosen the poor as to the world, rich in faith, and heirs of the kingdom, which he has promised to them that love him?"},{"num":6,"verse":"But *ye* have despised the poor [man]. Do not the rich oppress you, and [do not] *they* drag you before [the] tribunals?"},{"num":7,"verse":"And [do not] *they* blaspheme the excellent name which has been called upon you?"},{"num":8,"verse":"If indeed ye keep [the] royal law according to the scripture, Thou shalt love thy neighbour as thyself, ye do well."},{"num":9,"verse":"But if ye have respect of persons, ye commit sin, being convicted by the law as transgressors."},{"num":10,"verse":"For whoever shall keep the whole law and shall offend in one [point], he has come under the guilt of [breaking] all."},{"num":11,"verse":"For he who said, Thou shalt not commit adultery, said also, Thou shalt not kill. Now if thou dost not commit adultery, but killest, thou art become transgressor of [the] law."},{"num":12,"verse":"So speak ye, and so act, as those that are to be judged by [the] law of liberty;"},{"num":13,"verse":"for judgment [will be] without mercy to him that has shewn no mercy. Mercy glories over judgment."},{"num":14,"verse":"What [is] the profit, my brethren, if any one say he have faith, but have not works? can faith save him?"},{"num":15,"verse":"Now if a brother or a sister is naked and destitute of daily food,"},{"num":16,"verse":"and one from amongst you say to them, Go in peace, be warmed and filled; but give not to them the needful things for the body, what [is] the profit?"},{"num":17,"verse":"So also faith, if it have not works, is dead by itself."},{"num":18,"verse":"But some one will say, *Thou* hast faith and *I* have works. Shew me thy faith without works, and *I* from my works will shew thee my faith."},{"num":19,"verse":"*Thou* believest that God is one. Thou doest well. The demons even believe, and tremble."},{"num":20,"verse":"But wilt thou know, O vain man, that faith without works is dead?"},{"num":21,"verse":"Was not Abraham our father justified by works when he had offered Isaac his son upon the altar?"},{"num":22,"verse":"Thou seest that faith wrought with his works, and that by works faith was perfected."},{"num":23,"verse":"And the scripture was fulfilled which says, Abraham believed God, and it was reckoned to him as righteousness, and he was called Friend of God."},{"num":24,"verse":"Ye see that a man is justified on the principle of works, and not on the principle of faith only."},{"num":25,"verse":"But was not in like manner also Rahab the harlot justified on the principle of works, when she had received the messengers and put [them] forth by another way?"},{"num":26,"verse":"For as the body without a spirit is dead, so also faith without works is dead."}]