[{"num":1,"verse":"Paul, prisoner for the sake of Jesus Christ, and brother Timothy to Philemon our much-loved fellow-worker, Apphia our sister and Archippus who is with us in the fight; to the church that meets in your house—grace and peace be to you from God our Father and from the Lord Jesus Christ."},{"header":"A personal appeal"},{"num":4,"verse":"I always thank God for you, Philemon, in my constant prayers for you all, for I have heard how you love and trust both the Lord Jesus himself and those who believe in him. And I pray that those who share your faith may also share your knowledge of all the good things that believing in Jesus Christ can mean to us. It is your love, my brother, that gives us such comfort and happiness, for it cheers the hearts of your fellow Christians."},{"num":8,"verse":"And although I could rely on my authority in Christ and dare to order you to do what I consider right, I am not doing that. No, I am appealing to that love of yours, a simple personal appeal from Paul the old man, in prison for Jesus Christ’s sake. I am appealing for my child. Yes I have become a father though I have been under lock and key, and the child’s name is—Onesimus! Oh, I know you have found him pretty useless in the past but he is going to be useful now, to both of us."},{"num":12,"verse":"I am sending him back to you: will you receive him as my son, part of me? I should have dearly loved to have kept him with me: he could have done what you would have done—looked after me here in prison for the Gospel’s sake. But I would do nothing without consulting you first, for if you have a favour to give me, let it be spontaneous and not forced from you by circumstances!"},{"num":15,"verse":"It occurs to me that there has been a purpose in your losing him. You lost him, a slave, for a time; now you are having him back for good, not merely as a slave, but as a brother-Christian. He is already especially loved by me—how much more will you be able to love him, both as a man and as a fellow-Christian! You and I have so much in common haven’t we? Then do welcome him as you would welcome me. If you feel he has wronged or cheated you put it down to my account. I’ve written this with my own hand: I, Paul, hereby promise to repay you. (Of course I’m not stressing the fact that you might be said to owe me your very soul!) Now do grant me this favour, my brother—such an act of love will do my old heart good. As I send you this letter I know you’ll do what I ask—I believe, in fact, you’ll do more."},{"num":22,"verse":"Will you do something else? Get the guest-room ready for me, for I have great hopes that through your prayers I myself will be returned to you as well!"},{"num":23,"verse":"Epaphras, here in prison with me, sends his greetings: so do Mark, Aristarchus, Demas and Luke, all fellow-workers for God. The grace of our Lord Jesus Christ be with your spirit, amen."}]