[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11, 12) “As an eagle awakeneth her nest,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Over her young she broodeth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "She spreadeth out her wings, she taketh up",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "each one of them,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "She beareth him on her pinions:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jehovah alone leadeth him,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And a stranger-god is not with Him.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The eagle in Hebrew is masculine. He is one of the creatures that is honoured with a description by the lips of Jehovah Himself in Job 39:27-30. But beautiful as the simile and the description in these places are, they are surpassed in gentleness by our Saviour when He says, “How often would I have gathered thy children together, as a hen doth gather her brood under her wings, and ye would not” (Luke 13:34).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The eagle in Hebrew is masculine. He is one of the creatures that is honoured with a description by the lips of Jehovah Himself in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:27-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But beautiful as the simile and the description in these places are, they are surpassed in gentleness by our Saviour when He says, “How often would I have gathered thy children together, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "as a hen doth gather her brood under her wings, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and ye would not” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 13:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Fluttereth.—Or, broodeth, is the word in Genesis 1:2, the Spirit of God brooding over the face of the waters. (13, 14) The verbs again are all present. “He maketh him to ride,” &c.,",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Fluttereth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "broodeth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is the word in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Spirit of God ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "brooding ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "over the face of the waters. (13, 14) The verbs again are all present. “",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "He maketh ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "him to ride,” &c.,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE EAGLE AND ITS BROODDeuteronomy 32:11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE EAGLE AND ITS BROOD",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is an incomplete sentence in the Authorised Version, but really it should be rendered as a complete one; the description of the eagle’s action including only the two first clauses, and {the figure being still retained} the person spoken of in the last clauses being God Himself. That is to say, it should read thus, ‘As an eagle stirreth up his nest, fluttereth over his young, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " spreads abroad His wings, takes them, bears them on His pinions.’ That is far grander, as well as more compact, than the somewhat dragging comparison which, according to the Authorised Version, is spread over the whole verse and tardily explained, in the following, by a clause introduced by an unwarranted ‘So’-’the Lord alone did lead him, and there was no strange god with him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, of course, we all know that the original reference of these words is to the deliverance of the Israelites from Egypt, and their training in the desert. In the solemn address by Jehovah at the giving of the law {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, the same metaphor is employed, and, no doubt, that passage was the source of the extended imagery here. There we read, ‘Ye know what I did to the Egyptians, and how I bore you on eagles’ wings, and brought you unto Myself.’ The meaning of the glowing metaphor, with its vivid details, is just that Jehovah brought Israel out of its fixed abode in Goshen, and trained it for mature national life by its varied desert experiences. As one of the prophets puts the same idea, ‘I taught Ephraim to go,’ where the figure of the parent bird training its callow fledglings for flight is exchanged for that of the nurse teaching a child to walk. While, then, the text primarily refers to the experience of the infant nation in the forty years’ wanderings, it carries large truths about us all; and sets forth the true meaning and importance of life. There seem to me to be three thoughts here, which I desire to touch on briefly: first, a great thought about God; then an illuminating thought about the true meaning and aspect of life; and lastly a calming thought about the variety of the methods by which God carries out our training.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Here is a great thought about God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Here is a great thought about God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, it may come as something of a shock if I say that the bird that is selected for the comparison is not really the eagle, but one which, in our estimation, is of a very much lower order-viz. the carnivorous vulture. But a poetical emblem is not the less fitting, though, besides the points of resemblance, the thing which is so used has others less noble. Our modern repugnance to the vulture as feeding on carcasses was probably not felt by the singer of this song. What he brings into view are the characteristics common to the eagle and the vulture; superb strength in beak and claw, keenness of vision almost incredible, magnificent sweep of pinion and power of rapid, unwearied flight. And these characteristics, we may say, have their analogues in the divine nature, and the emblem not unfitly shadows forth one aspect of the God of Israel, who is ‘fearful in praises,’ who is strong to destroy as well as to save, whose all-seeing eye marks every foul thing, and who often pounces on it swiftly to rend it to pieces, though the sky seemed empty a moment before.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the action described in the text is not destructive, terrible, or fierce. The monarch of the sky busies itself with tender cares for its brood. Then, there is gentleness along with the terribleness. The strong beak and claw, the gaze that can see so far, and the mighty spread of wings that can lift it till it is an invisible speck in the blue vault, go along with the instinct of paternity: and the fledglings in the nest look up at the fierce beak and bright eyes, and know no terror. The impression of this blending of power and gentleness is greatly deepened, as it seems to me, if we notice that it is the male bird that is spoken about in the text, which should be rendered: ‘As the eagle stirreth up ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nest and fluttereth over ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " young.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So we just come to the thought that we must keep the true balance between these two aspects of that great divine nature-the majesty, the terror, the awfulness, the soaring elevation, the all-penetrating vision, the power of the mighty pinion, one stroke of which could crush a universe into nothing; and, on the other side, the yearning instinct of Fatherhood, the love and gentleness, and all the tender ministries for us, His children, to which these lead. Brethren, unless we keep hold of both of these in due equipoise and inseparably intertwining, we damage the one which we retain almost as much as the one which we dismiss. For there is no love like the love that is strong, and can be fierce, and there is no condescension like the condescension of Him who is the Highest, in order that He may be, and because He is ready to be, the lowest. Modern tendencies, legitimately recoiling from the one-sidedness of a past generation, are now turning away far too much from the Old Testament conceptions of Jehovah, which are concentrated in that metaphor of the vulture in the sky. And thereby we destroy the love, in the name of which we scout the wrath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Infinite mercy, but, I wis,As infinite a justice too.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Infinite mercy, but, I wis,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "As infinite a justice too.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘As the vulture stirreth up his nest,’-that is the Old Testament revelation of the terribleness and gentleness of Jehovah. ‘How often would I have gathered thy children together, even as a hen gathereth her chickens under her wing?’-that is the New Testament modification of the image. But you never could have had the New unless you first had had the Old. And you are a foolish man if, in the name of the sanctity of the New, you cast away the teaching of the Old. Keep both the metaphors, and they will explain and confirm each other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Here we have an illuminating thought of the meaning of life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Here we have an illuminating thought of the meaning of life.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "What is it all for? To teach us to fly, to exercise our half-fledged wings in short flights, that may prepare us for, and make it possible to take, longer ones. Every event that befalls us has a meaning beyond itself; and every task that we have to do reacts upon us, the doers, and either fits or hinders us for larger work. Life as a whole, and in its minutest detail, is worthy of God to give, and worthy of us to possess, only if we recognise the teaching that is put into picturesque form in this text-that the meaning of all which God does to us is to train us for something greater yonder. Life as a whole is ‘full of sound and fury, signifying nothing,’ unless it is an apprenticeship training. What are we here for? To make character. That is the aim and end of all-to make character; to get experience; to learn the use of our tools. I declare it seems to me that the world had better be wiped out altogether, incontinently, unless there is a world beyond, where a man shall use the force which here he made his own. ‘Thou hast been faithful in a few things; behold I will make thee ruler over many things.’ No man gets to the heart of the mystery of life or has in his hand the key which will enable him to unlock all the doors and difficulties of human experience, unless he gets to this-that it is all meant as training.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If we could only carry that clear conviction with us day by day into the little things of life, what different things these, which we call the monotonous trifles of our daily duties, would become! The things may be small and unimportant, but the way in which we do them is not unimportant. The same fidelity may be exercised, and must be brought to bear, in order to do the veriest trifle of our daily lives rightly, as needs to be invoked, in order to get us safely through the crises and great times of life. There are no great principles for great duties, and little ones for little duties. We have to regulate all our conduct by the same laws. Life is built up of trifles, as mica-flakes, if there be enough of them, make the Alpine summits towering thousands of feet into the blue. Character may be manifested in the great moments, but it is made in the small ones. So, life is meant for discipline, and unless we use it for that, however much enjoyment we get out of it, we misuse it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, there is here a calming thought as to the variety of God’s methods with us. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, there is here a calming thought as to the variety of God’s methods with us.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘As the eagle stirreth up his nest.’ No doubt the callow brood are much warmer and more comfortable in the nest than when they are turned out of it. The Israelites were by no means enamoured with the prospect of leaving the flesh-pots and the onions and the farmhouses that they had got for themselves in Goshen, to tramp with their cattle through the wilderness. They went after Moses with considerable disinclination.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Here we have, then, as the first thing needed, God’s loving compulsion to effort. To ‘stir up the nest’ means to make a man uncomfortable where he is;-sometimes by the prickings of his conscience, which are often the voices of God’s Spirit; sometimes by changes of circumstances, either for the better or for the worse; and oftentimes by sorrows. The straw is pulled out of the nest, and it is not so comfortable to lie in; or a bit of it develops a sharp point that runs into the half-feathered skin, and makes the fledgling glad to come forth into the air. We all shrink from change. What should we do if we had it not? We should stiffen into habits that would dwarf and weaken us. We all recoil from storms. What should we do if we had them not? Sea and air would stagnate, and become heavy and putrid and pestilential, if it were not for the wild west wind and the hurtling storms. So all our changes, instead of being whimpered over, and all our sorrows, instead of being taken reluctantly, should be recognised as being what they are, loving summonses to effort. Then their pressure would be modified, and their blessing would be secured when their purpose was served.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the training of the father-eagle is not confined to stirring up the nest. What is to become of the young ones when they get out of it, and have never been accustomed to bear themselves up in the invisible ether about them? So ‘he fluttereth over his young.’ It is a very beautiful word that is employed here, which ‘flutter’ scarcely gives us. It is the same word that is used in the first chapter of Genesis, about the Spirit of God ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "brooding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the face of the waters’; and it suggests how near, how all-protecting with expanded wings, the divine Father comes to the child whose restfulness He has disturbed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And is not that true? Had you ever trouble that you took as from Him, which did not bring that hovering presence nearer you, until you could almost feel the motion of the wing, and be brushed by it as it passed protectingly above your head? Ah, yes! ‘Stirring the nest’ is meant to be the precursor of closer approach of the Father to us; and if we take our changes and our sorrows as loving summonses from Him to effort, be sure that we shall realise Him as near to us, in a fashion that we never did before.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is not all. There is sustaining power. ‘He spreadeth abroad his wings; he taketh them; beareth them on his wings.’ On those broad pinions we are lifted, and by them we are guarded. It matters little whether the belief that the parent bird thus carries the young, when wearied with their short flights, is correct or not. The truth which underlies the representation is what concerns us. The beautiful metaphor is a picturesque way of saying, ‘In all their afflictions He was afflicted; and the Angel of His presence saved them.’ It is a picturesque way of saying, ‘Thou canst do all things through Christ which strengtheneth thee.’ And we may be very sure that if we let Him ‘stir up our nests’ and obey His loving summons to effort, He will come very near to strengthen us for our attempts, and to bear us up when our own weak wings fail. The Psalmist sang that angels’ hands should bear up God’s servant. That is little compared with this promise of being carried heavenwards on Jehovah’s own pinions. A vile piece of Greek mythology tells how Jove once, in the guise of an eagle, bore away a boy between his great wings. It is foul where it stands, but it is blessedly true about Christian experience. If only we lay ourselves on God’s wings-and that not in idleness, but having ourselves tried our poor little flight-He will see that no harm comes to us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " During life this training will go on; and after life, what then? Then, in the deepest sense, the old word will be true, ‘Ye know how I bore you on eagle’s wings and brought you ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to Myself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’; and the great promise shall be fulfilled, when the half-fledged young brood are matured and full grown, ‘They shall mount up with wings as eagles; they shall run and not be weary; they shall walk and not faint.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 32:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As an eagle stirreth up her nest — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The nest is here put for the young ones in the nest. The eagle is observed by naturalists to have a most tender affection to her young, and therefore the care of God over Israel is here well illustrated thereby. By her voice she encourages and stirs them up to fly, hovers over them, bears, and defends them by her strength; and for their preservation she is peculiarly fitted, by the quickness of her eye in espying danger, by her swiftness and great strength, as well as by her strong affection for them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Taketh them, beareth them on her wings — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The eagle is said to take her young ones upon her wings, while they are so weak and feeble that they fail in their attempts to fly, and to support them till they acquire strength to commit themselves to the air. But the expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on her wings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may mean, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as on her wings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, gently, tenderly, and safely, as if she did not carry them in her claws, for fear of hurting them, but upon her wings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:7-14 Moses gives particular instances of God's kindness and concern for them. The eagle's care for her young is a beautiful emblem of Christ's love, who came between Divine justice and our guilty souls, and bare our sins in his own body on the tree. And by the preached gospel, and the influences of the Holy Spirit, He stirs up and prevails upon sinners to leave Satan's bondage. In ver. 13,14, are emblems of the conquest believers have over their spiritual enemies, sin, Satan, and the world, in and through Christ. Also of their safety and triumph in him; of their happy frames of soul, when they are above the world, and the things of it. This will be the blessed case of spiritual Israel in every sense in the latter day.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"so,\" which the King James Version supplies in the next verse, should he inserted before \"spreadeth,\" and omitted from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sense is, \"so He spread out His wings, took them up,\" etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. As an eagle … fluttereth over her young—This beautiful and expressive metaphor is founded on the extraordinary care and attachment which the female eagle cherishes for her young. When her newly fledged progeny are sufficiently advanced to soar in their native element, she, in their first attempts at flying, supports them on the tip of her wing, encouraging, directing, and aiding their feeble efforts to longer and sublimer flights. So did God take the most tender and powerful care of His chosen people; He carried them out of Egypt and led them through all the horrors of the wilderness to the promised inheritance.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Her nest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. her young ones in the nest, by a common metonymy; which she by her cry and motion provoketh to fly by her example. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Spreadeth abroad her wings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as preparing herself to fly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "On her wings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as on her wings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. gently, and tenderly, and safely too, as if she carried them not in her claws for fear of hurting them, but upon her wings. So it is only an ellipsis of the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is frequent, as hath been showed. Though some say the eagle doth usually carry her young ones upon her wings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As an eagle stirreth up her nest,.... Her young ones in it, to get them out of it: Jarchi says the eagle is merciful to its young, and does not go into its nest suddenly, but first makes a noise, and disturbs them with her wings, striking them against a tree or its branches, that so they being awakened may be fitter to receive her: with respect to literal Israel, Egypt was their nest, where they were who were then in their infant state, lay like young birds in a nest; and though it was a filthy one and where they were confined, yet they seemed sometimes as if they did not care to come out of it; until the Lord made use of means to get them out, by the ministry of Moses and Aaron, by suffering their taskmasters to make their bondage heavier, and by judgments inflicted on the Egyptians, which made them urgent upon them to depart: with respect to spiritual Israel, their nest is a state of unregeneracy, in which they are at ease, and do not care to be awakened and stirred out of it; but the Lord, in love to them, awakens them, stirs them up, and gets them out, by sending his ministers to arouse them, by letting in the law into their consciences, which works a sense of wrath, by convincing them by his Spirit of their sin and danger, opening their eyes to see their wretched and miserable estate and condition, and by exerting his almighty power, plucking them as brands out of the burning: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fluttereth over her young; by that means to get them out of the nest, and teach them to fly, as well as to preserve them from the attempts of any to take them away; for though some writers represent the eagle as hardhearted to its young, casting them out of the nest, when they are taken care of by the offifrage; yet this is to be understood of it when tired with nursing, and when its young are capable of taking care of themselves; or of some sort of eagles; for Aelianus (r) testifies, that of all animals the eagle is most affectionate to its young, and most studiously careful of them; when it sees anyone coming to them, it will not suffer them to go away unpunished, but will beat them with its wings and tear them with its nails: Jarchi thinks this phrase is expressive of the manner of its incubation on its young; it does not, he says, lie heavy upon them, but lifts up herself, and touches them as if she did not touch them; but it rather signifies the motion she makes with her wings to get her young, when fledged, out of the nest, and to teach them to make use of their wings, as she does; and we are told that young eagles, when their wings are weak, will fly about their dams and learn of them to fly (s); and hence it is that young eagles while they are eating flutter their wings, that motion being so natural to them, and seeing their dams do so likewise (t): this passage seems to contradict a notion that has obtained with some, that an eagle only breeds one at a time; the philosopher says (u), the eagle lays three eggs and casts out two of them; according to the verse of Musaeus, it lays three, casts out two, and brings up one; and so, he says, it commonly is the case: but sometimes three young ones are seen together; and the black eagles are more kind to their young, and careful in the nourishment of them; and the same says Pliny (w); yea we are told, that sometimes seven are seen in a nest (x): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "spreadeth abroad her wings taketh them, beareth them on her wings; that is, spreads forth her wings when she flutters over her young to instruct them; or she does this in order to take up her young and carry them on them: it is said that eagles fly round their nest, and vary the flights for the instruction of their young; and afterwards taking them on their backs, they soar with them aloft, in order to try their strength, shaking them off into the air: and if they perceive them too weak to sustain themselves, they with surprising dexterity fly under them again, and receive them on their wings to prevent their fall (y); See Gill on Exodus 19:4; thus the Lord, comparable to this creature for his affection to the people of Israel, his care of them, and his strength to bear and carry them, did bear them as on eagles' wings, and carried and saved them all the days of old; even Christ, the Angel of Jehovah's presence, the rock of salvation they rejected, see Exodus 19:4; and all this in a spiritual and evangelic sense may be expressive of the gracious dealings of God with his spiritual Israel; teaching and enabling them to mount up with wings as eagles, to soar aloft in the exercise of faith, hope, and love, entering thereby within the vail into the holiest of all, and living in the constant and comfortable expectation of heaven and happiness; and of the Lord's taking his people up from the low estate in which they are, and raising them up to near communion with himself, bearing them on his heart, in his hands, and on his arm, supporting them under all their afflictions, and carrying them, through all their troubles and difficulties, safe to eternal glory and happiness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "spreadeth abroad her wings taketh them, beareth them on her wings; that is, spreads forth her wings when she flutters over her young to instruct them; or she does this in order to take up her young and carry them on them: it is said that eagles fly round their nest, and vary the flights for the instruction of their young; and afterwards taking them on their backs, they soar with them aloft, in order to try their strength, shaking them off into the air: and if they perceive them too weak to sustain themselves, they with surprising dexterity fly under them again, and receive them on their wings to prevent their fall (y); See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; thus the Lord, comparable to this creature for his affection to the people of Israel, his care of them, and his strength to bear and carry them, did bear them as on eagles' wings, and carried and saved them all the days of old; even Christ, the Angel of Jehovah's presence, the rock of salvation they rejected, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and all this in a spiritual and evangelic sense may be expressive of the gracious dealings of God with his spiritual Israel; teaching and enabling them to mount up with wings as eagles, to soar aloft in the exercise of faith, hope, and love, entering thereby within the vail into the holiest of all, and living in the constant and comfortable expectation of heaven and happiness; and of the Lord's taking his people up from the low estate in which they are, and raising them up to near communion with himself, bearing them on his heart, in his hands, and on his arm, supporting them under all their afflictions, and carrying them, through all their troubles and difficulties, safe to eternal glory and happiness. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Hist. Animal. l. 2. c. 40. (s) Suidas, vol. 1. p. 89. (t) Bochart. Hierozoic. par. 2. l. 2. c. 3. col. 178. (u) Aristot. Hist. Animal. l. 6. c. 6. (w) Nat Hist. l. 10. c. 3.((x) Vid. Bochart ut supra. (t)) (y) See Harris's Voyages, vol. 1. B. 1. c. 2. sect. 14. p. 486. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) Hist. Animal. l. 2. c. 40. (s) Suidas, vol. 1. p. 89. (t) Bochart. Hierozoic. par. 2. l. 2. c. 3. col. 178. (u) Aristot. Hist. Animal. l. 6. c. 6. (w) Nat Hist. l. 10. c. 3.((x) Vid. Bochart ut supra. (t)) (y) See Harris's Voyages, vol. 1. B. 1. c. 2. sect. 14. p. 486. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As an eagle stirreth up her nest, {f} fluttereth over her young, spreadeth abroad her wings, taketh them, beareth them on her wings:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As an eagle stirreth up her nest, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fluttereth over her young, spreadeth abroad her wings, taketh them, beareth them on her wings:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) To teach them to fly.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eagle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nesher",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her nest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "young",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the father bird’s; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cp. above ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Spreadeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his wings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "doth catch",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "beareth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] As in R.V. marg. preferable to R.V. text. All these clauses still describe the eagle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - God's treatment of his people is compared to that of an eagle towards its young (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the Authorized Version, the apodosis of the sentence is made to begin at ver. 12, and ver. 11 is wholly understood of the eagle and its young. To this arrangement it has been objected that it overlooks the fact that the suffixes to the verbs \"taketh\" and \"beareth\" are singulars, and are to be understood consequently, not of the eaglets, but of Israel. It has, therefore, been proposed to render the passage thus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "As an eagle which stirreth up its nest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "fluttereth over its young",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he spread out his wings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "took him up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and carried him on his pinions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The Lord alone did lead him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The comparison is thus made to pass into a metaphorical representation of the Lord's dealing with Israel. One feels that there is something violent in this, for whilst God's care for Israel might be fittingly ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "compared to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that of an eagle towards her young, it is less fit to speak of God himself as if he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "were",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " an eagle with wings which he spread abroad and on which he bare Israel. The rendering in the Authorized Version is on this account to be preferred, if it can be grammatically vindicated. And this it may on the ground that the suffixes may be understood of the \"nest\" as containing the young (\"continens pro contento,\" a common rhetorical trope in Scripture; see Glass., 'Philippians Sac.,' p. 686; cf. Virgil, 'AEneid,' 12:475, \"nidisque loquacibus escam\"); or the young may be referred to individually, \"taketh it, beareth it,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". each of them; or, if the nest be understood, the whole body of them as therein contained. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Stirreth up her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [its] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "nest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". its nestlings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "provocans ad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "volandum pullos suos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Vulgate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is the explanation usually given of the initial clause of this verse; but its accuracy has been questioned, Furst would render the verb by \"watchesover; \"but though ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "הֵעִיר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the Hiph. of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עוּר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to watch, may have this meaning, it is undoubtedly used generally in the sense of rousing, exciting, stirring up. Knobel retains this meaning, but understands the clause of the exciting of the nestlings by the parent bird coming to them with food. This is certainly more in keeping with what follows; for when the eagle nestles or broods over her young, she does not excite them to fly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Fluttereth over her young",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "broods over",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nestles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "cherishes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "יְרַחֵפ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Spreadeth abroad her wings,",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Spreadeth abroad her wings,",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. \"I once saw a very interesting sight above one of the crags of Ben Nevis, as I was going in pursuit of black game. Two parent eagles were teaching their offspring, two young birds, the maneuvers of flight. They began by rising from the top of a mountain, in the eye of the sun; - it was about midday, and bright for this climate. They at first made small circles, and the young imitated them; they paused on their wings, waiting till they had made their first flight, holding them on their expanded wings when they appeared exhausted, and then took a second and larger gyration, always rising towards the sun, and enlarging their circle of flight, so as to make a gradually ascending spiral\" (Davy, 'Salinertia;' see also Bochart, 'Hierozoicon,' 2:181). The general reference is to God's fostering care of Israel, and especially his dealing with them when \"he suffered their manners in the wilderness\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), disciplined them, and trained them for what they were appointed to do. Deuteronomy 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"As an eagle, which stirreth up its nest and soars over its young, He spread out His wings, took him up, carried him upon His wings.\" Under the figure of an eagle, which teaches its young to fly, and in doing so protects them from injury with watchful affection, Moses describes the care with which the Lord came to the relief of His people in their helplessness, and assisted them to develop their strength. This figure no doubt refers more especially to the protection and assistance of God experienced by Israel in its journey through the Arabian desert; but it must not be restricted to this. It embraces both the deliverance of Israel out of Egypt by the outstretched arm of the Lord, as we may see from a comparison with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the Lord is said to have brought His people out of Egypt upon eagles' wings, and also the introduction into Canaan, when the Lord drove the Canaanites out from before them and destroyed them. This verse contains an independent thought; the first half is the protasis, the second the apodosis. The nominative to \"spreadeth abroad\" is Jehovah; and the suffixes in יקּחהוּ and ישּׂאהוּ (\"taketh\" and \"beareth\") refer to Israel or Jacob (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), like the suffixes in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As כּ cannot open a sentence like כּאשׁר, we must supply the relative אשׁר after נשׁר. קנּו העיר, to waken up, rouse up its nest, i.e., to encourage the young ones to fly. It is rendered correctly by the Vulgate, provocans ad volandum pullos suos; and freely by Luther, \"bringeth out its young.\" \"Soareth over its young:\" namely, in order that, when they were attempting to fly, if any were in danger of falling through exhaustion, it might take them at once upon its powerful wings, and preserve them from harm. Examples of this, according to the popular belief, are given by Bochart (Hieroz. ii. p. 762). רחף, from רחף to be loose or slack (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): in the Piel it is applied to a bird in the sense of loosening its wings, as distinguished from binding its wings to its body; hence (1) to sit upon eggs with loosened wings, and (2) to fly with loosened wings. Here it is used in the latter sense, because the young are referred to. The point of comparison between the conduct of God towards Jacob and the acts of an eagle towards its young, is the loving care with which He trained Israel to independence. The carrying of Israel upon the eagle's wings of divine love and omnipotence was manifested in the most glorious way in the guidance of it by the pillar of cloud and fire, though it was not so exclusively in this visible vehicle of the gracious presence of God as that the comparison can be restricted to this phenomenon alone. Luther's interpretation is more correct than this - \"Moses points out in these words, how He fostered them in the desert, bore with their manners, tried them and blessed them that they might learn to fly, i.e., to trust in Him,\" - except that the explanation of the expression \"to fly\" is narrowed too much.",
        "children": []
      }
    ]
  }
]