[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "GOD’S TRUE TREASURE IN MANDeuteronomy 32:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "GOD’S TRUE TREASURE IN MAN",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Titus 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I choose these two texts because they together present us with the other side of the thought to that which I have elsewhere considered, that man’s true treasure is in God. That great axiom of the religious consciousness, which pervades the whole of Scripture, is rapturously expressed in many a psalm, and never more assuredly than in that one which struggles up from the miry clay in which the Psalmist’s ‘steps had well-nigh slipped’ and soars and sings thus: ‘The Lord is the portion of my inheritance and of my cup; Thou maintainest my lot,’ ‘The lines are fallen unto me in pleasant places; yea, I have a goodly heritage.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You observe the correspondence between these words and those of my first text: ‘The Lord’s portion is His people; Jacob is the lot of His inheritance.’ The correspondence in the original is not quite so marked as it is in our Authorised Version, but still the idea in the two passages is the same. Now it is plain that persons can possess persons only by love, sympathy, and communion. From that it follows that the possession must be mutual; or, in other words, that only he can say ‘Thou art mine’ who can say ‘I am Thine.’ And so to possess God, and to be possessed by God, are but two ways of putting the same fact. ‘The Lord is the portion of His people, and the Lord’s portion is His people,’ are only two ways of stating the same truth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then my second text clearly quotes the well-known utterance that lies at the foundation of the national life of Israel: ‘Ye shall be unto Me a peculiar treasure above all people,’ and claims that privilege, like all Israel’s privileges, for the Christian Church. In like manner Peter {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} quotes the same words, ‘a peculiar people,’ as properly applying to Christians. I need scarcely remind you that ‘peculiar’ here is used in its proper original sense of belonging to, or, as the Revised Version gives it, ‘a people for God’s own possession’ and has no trace of the modern signification of ‘singular.’ Similarly we find Paul in his Epistle to the Ephesians giving both sides of the idea of the inheritance in intentional juxtaposition, when he speaks {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} of the ‘earnest of our inheritance . . . unto the redemption of God’s own possession.’ In the words before us we have the same idea; and this text besides tells us how Christ, the Revealer of God, wins men for Himself, and what manner of men they must be whom He counts as His.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Therefore there are, as I take it, three things to be spoken about now. First, God has a special ownership in some people. Second, God owns these people because He has given Himself to them. Third, God possesses, and is possessed by, His inheritance, that He may give and receive services of love. Or, in briefer words, I have to speak about this wonderful thought of a special divine ownership, what it rests upon, and what it involves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. God has special ownership in some people. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. God has special ownership in some people.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘The Lord’s portion is His people; Jacob is the lot of His inheritance.’ Put side by side with those other words of the Old Testament: ‘All souls are Mine,’ or the utterance of the 100th Psalm rightly translated: ‘It is He that hath made us, and to Him we belong.’ There is a right of absolute and utter ownership and possession inherent in the very relation of Creator and creature; so that the being made is wholly and altogether at the disposal, and is the property, of Him that makes him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But is that enough for God’s heart? Is that worth calling ownership at all? An arbitrary tyrant in an unconstitutional kingdom, or a slave-owner, may have the most absolute right of property over his subject or his slave; may have the right of entire disposal of all his industry, of the profit of all his labour; may be able to do anything he likes with him, may have the power of life and death; but such ownership is only of the husk and case of a man: the man himself may be free, and may smile at the claim of possession. ‘They may ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "own",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ the body, and after that have no more than they can do.’ That kind of authority and ownership, absolute and utter, to the point of death, may satisfy a tyrant or a slave-driver, it does not satisfy the loving heart of God. It is not real possession at all. In what sense did Nero own Paul when he shut him up in prison, and cut his head off? Does the slave-owner own the man whom he whips within an inch of his life, and who dare not do anything without his permission? Does God, in any sense that corresponds with the longing of infinite love, own the men that reluctantly obey Him, and are simply, as it were, tools in His hands? He covets and longs for a deeper relationship and tenderer ties, and though all creatures are His, and all men are His servants and His possession, yet, like certain regiments in our own British army, there are some who have the right to bear in a special manner on their uniform and on their banners the emblazonment, ‘The King’s Own.’ ‘The Lord’s portion is His people; Jacob is the lot of His inheritance.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Well, then, the next thought is that the special relationship of possession is constituted by mutual love. I said at the beginning of these remarks that as concerns men’s relations, the only real possession is through love, sympathy, and communion, and that that must necessarily be mutual. We have a perfect right to apply the human analogy here; in fact, we are bound to do it if we would rightly understand such words as those of my text; and it just leads us to this, that the one thing whereby God reckons that He possesses a man at all is when His love falls upon that man’s heart and soaks into it, and when there springs up in the heart a corresponding emotion and affection. The men who welcome the divine love that goes through the whole world, seeking such to worship it, and to trust it, and to become its own; and who therefore lovingly yield to the loving divine will, and take it for their law-these are the men whom He regards as His ‘portion’ and ‘the lot of His inheritance.’ So that God is mine, and that ‘I am God’s,’ are two ends of one truth; ‘I possess Him,’ and ‘I am possessed by Him,’ are but the statement of one fact expressed from two points of view. In the one case you look upon it from above, in the other case you look upon it from beneath. All the sweet commerce of mutual surrender and possession which makes the joy of our hearts, in friendship and in domestic life, we have the right to lift up into this loftier region, and find in it the last teaching of what makes the special bond of mutual possession between God and man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And deep words of Scripture point in that direction. Those parables of our Lord’s: the lost sheep, the lost coin, the lost son, in their infinite beauty, whilst they contain a great deal besides this, do contain this in their several ways; the money, the animal, the man belong to the woman of the house, to the shepherd, to the father. Each is ‘lost’ in a different fashion, but the most clear revelation is given in the last parable of the three, which explains the other two. The son was ‘lost’ when he did not love the father; and he was ‘found’ by the father when he returned the yearning of the father’s heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, dear brethren, it ever is; the one thing that knits men to God is that the silken cord of love let down from Heaven should by our own hand be wrapped round our own hearts, and then we are united to Him. We are His and He is ours by the double action of His love manifested by Him, and His love received by us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now there is nothing in all that of favouritism. The declaration that there are people who have a special relationship to the divine heart may be so stated as to have a very ugly look, and it often has been so stated as to be nothing more than self-complacent Pharisaism, which values a privilege principally because its possession is an insult to somebody else that has it not.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There has been plenty of Christianity of that sort in the world, but there is nothing of it in the thoughts of these texts rightly looked at. There is only this: it cannot but be that men who yield to God and love Him, and try to live near Him and to do righteousness, are His in a manner that those who steel themselves against Him and turn away from Him are not. Whilst all creatures have a place in His heart, and are flooded with His benefits, and get as much of Him as they can hold, the men who recognise the source of their blessing, and turn to it with grateful hearts, are nearer Him than those that do not do so. Let us take care, lest for the sake of seeming to preserve the impartiality of His love, we have destroyed all in Him that makes His love worth having. If to Him the good and the bad, the men who fear Him and the men who fear Him not, are equally satisfactory, and, in the same manner, the objects of an equal love, then He is not a God that has pleasure in righteousness; and if He is not a God that ‘has pleasure in righteousness,’ He is not a God for us to trust to. We are not giving countenance to the notion that God has any step-children, any petted members of His family, when we cleave to this-they that have welcomed His love into their hearts are nearer to Him than those that have closed the door against it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And there is one more point here about this matter of ownership on which I dwell for a moment, namely, that this conception of certain men being in a special sense God’s possession and inheritance means also that He has a special delight in, and lofty appreciation of, them. All this material creation exists for the sake of growing good men and women. That is the use of the things that are seen and temporal; they are like greenhouses built for the great Gardener’s use in striking and furthering the growth of His plants; and when He has got the plants He has got what He wanted, and you may pull the greenhouse down if you like. And so God estimates, and teaches us to estimate, the relative value and greatness of the material and the spiritual in this fashion, that He says to us in effect: ‘All these magnificences and magnitudes round you are small and vulgar as compared with this-a heart in which wisdom and divine truth and the love and likeness of God have attained to some tolerable measure of maturity and of strength.’ These are His ‘jewels,’ as the Roman matron said about her two boys. The great Father looks upon the men that love Him as His jewels, and, having got the jewels, the rock in which they were embedded and preserved may be crushed when you like. ‘They shall be Mine,’ saith the Lord, ‘My treasures in that day of judgment which I make.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, my brother, all the insignificance of man, as compared with the magnitude and duration of the universe, need not stagger our faith that the divinest thing in the universe is a heart that has learnt to love God and aspires after Him, and should but increase our wonder and our gratitude that He has been mindful of man and has visited him, in order that He might give Himself to men, and so might win men for Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That brings me, and very briefly, to the other points that I desire to deal with now. The second one, which is suggested to us from my second text in the Epistle to Titus, is that this possession, by God, of man, like man’s possession of God, comes because God has given Himself to man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Apostle puts it very strongly in the Epistle to Titus: ‘The glorious appearing of the great God and our Saviour Jesus Christ, who gave Himself for us that He might purify unto Himself ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a people for a possession",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ Israel, according to one metaphor, was God’s ‘son,’ begotten by that great redeeming act of deliverance from the captivity of Egypt {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. According to another metaphor, Israel was God’s bride, wooed and won for His own by that same act. Both of these figures point to the thought that in order to get man for His own He has to give Himself to man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the very height and sublimity of that truth is found in the Christian fact which the Apostle points to here. We need not depart from human analogies here either. Christ gave Himself to us that He might acquire us for Himself. Absolute possession of others is only possible at the price of absolute surrender to them. No human heart ever gave itself away unless it was convinced that the heart to which it gave itself had given itself to it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And on the lower levels of gratitude and obligation, the only thing that binds a man to another in utter submission is the conviction that that other has given himself in absolute sacrifice for him. A doctor goes into the wards of an hospital with his life in his hands, and because he does, he wins the full confidence and affection of those whom he treats. You cannot buy a heart with anything less than a heart. In the barter of the world it is not ‘skin for skin,’ but it is ‘self for self’; and if you want to own me, you must give yourself altogether to me. And the measure in which teachers and guides and preachers and philanthropists of all sorts make conquests of men is the measure in which they make themselves sacrifices for men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now all that is true, and is lifted to its superlative truth, in the great central fact of the Christian faith. But there is more than human analogy here. Christ is not only self-sacrifice in the sense of surrender, but He is sacrifice in the sense of giving Himself for our redemption and forgiveness. He has not only given Himself to us, He has given Himself for us. And there, and on that, is builded, and on that alone has He a right to build, or have we a right to yield to it, His claim to absolute authority and utter command over each of us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He has died for us, therefore the springs of our life are at His disposal; and the strongest motives which can sway our lives are set in motion by His touch. His death, says this text, redeems us from iniquity and purifies us. That points to its power in delivering us from the service and practice of sin. He buys us from the despot whose slaves we were, and makes us His own in the hatred of evil and the doing of righteousness. Moved by His death, we become capable of heroisms and martyrdoms of devotion to Him. Brethren, it is only as that self-sacrificing love touches us, which died for our sins upon the Cross, that the diabolical chain of selfishness will be broken from our affections and our wills, and we shall be led into the large place of glad surrender of ourselves to the sweetness and the gentle authority of His omnipotent love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The last thought that I suggest is the issues to which this mutual possession points. God owns men, and is owned by them, in order that there may be a giving and receiving of mutual services of love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘The Lord’s portion is His people.’ That in the Old Testament is always laid as the foundation of certain obligations under which He has come, and which He will abundantly discharge. What is a great landlord expected to do to his estate? ‘What ought I to have done to my vineyard?’ the divine Proprietor asks through the mouth of His servant the prophet. He ought to till it, He ought not to starve it, He ought to fence it, He ought to cast a wall about it, He ought to reap the fruits. And He does all that for His inheritance. God’s honour is concerned in His portion not being waste. It is not to be a ‘garden of the sluggard,’ by which people who pass can see the thorns growing there. So He will till it, He will plough it, He will pick out the weeds, and all the disciplines of life will come to us, and the ploughshare will be driven deep into the heart, that ‘the peaceable fruit of righteousness’ may spring up. He will fence His vineyard. Round about His inheritance His hand will be cast, within His people His Spirit will dwell. No harm shall come near thee if thy love is given to Him; safe and untouched by evil thou shalt walk if thou walk with God. ‘He that toucheth you toucheth the apple of Mine eye.’ The soul that trusts Him He takes in charge, and before any evil can fall to it ‘the pillared firmament must be rottenness, and earth be built on stubble.’ ‘He is able to keep that which I have committed unto Him against that day.’ ‘The Lord’s portion is His people,’ and ‘none shall pluck them out of His hand.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And on the other side, we belong to God in Christ. What do we owe Him? What does the vineyard owe the husbandman? Fruit. We are His, therefore we are bound to absolute submission. ‘Ye are not your own.’ Life, circumstances, occupations, all-we hold them at His will. We have no more right of property in anything than a slave in the bad old days had in his cabin and patch of ground. They belonged to the master to whom he belonged. Let us recognise our stewardship, and be glad to know ourselves His, and all events and things which we sometimes think ours, His also.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are His, therefore we owe absolute trust. The slave has at least this blessing in his lot, that he need have no anxieties; nor need we. We belong to God, and He will take care of us. A rich man’s horses and dogs are well cared for, and our Owner will not leave us unheeded. Our well-being involves His good name. Leave anxious thought to masterless hearts which have to front the world with nobody at their backs. If you are God’s you will be looked after.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are His, therefore we are bound to live to His praise. That is the conclusion which one Old Testament passage draws. ‘This people have I formed for Myself; they shall show forth My praise’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. The Apostle Peter quotes these words immediately after those from Exodus, which describe Israel as ‘a people for God’s own possession,’ when he says ‘that ye should show forth the praise of Him who hath called you.’ Let us, then, live to His glory, and remember that the servants of the King are bound to stand to their colours amid rebels, and that they who know the sweetness of possessing God, and the blessedness of yielding to His supreme control, should acknowledge what they have found of His goodness, and ‘tell forth the honour of His name, and make His praise glorious.’ Let not all the magnificent and wonderful expenditure of divine longing and love be in vain, nor run off your hearts like water poured upon a rock. Surely the sun’s flames leaping leagues high, they tell us, in tongues of burning gas, must melt everything that is near them. Shall we keep our hearts sullen and cold before such a fire of love? Surely that superb and wonderful manifestation of the love of God in the Cross of Christ should melt into running rivers of gratitude all the ice of our hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘He gave Himself for me!’ Let us turn to Him and say: ‘Lo! I give myself to Thee. Thou art mine. Make me Thine by the constraint of Thy love, so utterly, and so saturate my spirit with Thyself, that it shall not only be Thine, but in a very deep sense it shall be Thee, and that it may be “no more I that live, but Christ that liveth in me.”‘",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 32:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord’s portion is his people — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Highly prized and loved by him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As if he had said, The Israelites are that portion of mankind whom God was pleased to redeem out of bondage, and to make his peculiar people. It is no wonder, therefore, that he has so great a regard for them, and takes special care of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:7-14 Moses gives particular instances of God's kindness and concern for them. The eagle's care for her young is a beautiful emblem of Christ's love, who came between Divine justice and our guilty souls, and bare our sins in his own body on the tree. And by the preached gospel, and the influences of the Holy Spirit, He stirs up and prevails upon sinners to leave Satan's bondage. In ver. 13,14, are emblems of the conquest believers have over their spiritual enemies, sin, Satan, and the world, in and through Christ. Also of their safety and triumph in him; of their happy frames of soul, when they are above the world, and the things of it. This will be the blessed case of spiritual Israel in every sense in the latter day.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These verses set forth in figurative language the helpless and hopeless state of the nation when God took pity on it, and the love and care which He bestowed on it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8, 9. When the most High divided to the nations their inheritance—In the division of the earth, which Noah is believed to have made by divine direction (Ge 10:5; De 2:5-9; Ac 17:26, 27), Palestine was reserved by the wisdom and goodness of Heaven for the possession of His peculiar people and the display of the most stupendous wonders. The theater was small, but admirably suited for the convenient observation of the human race—at the junction of the two great continents of Asia and Africa, and almost within sight of Europe. From this spot as from a common center the report of God's wonderful works, the glad tidings of salvation through the obedience and sufferings of His own eternal Son, might be rapidly and easily wafted to every part of the globe.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he set the bounds of the people according to the number of the children of Israel—Another rendering, which has received the sanction of eminent scholars, has been proposed as follows: \"When the Most High divided to the nations their inheritance, when He separated the sons of Adam and set the bounds of every people, the children of Israel were few in numbers, when the Lord chose that people and made Jacob His inheritance\" (compare De 30:5; Ge 34:30; Ps 105:9-12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " It is no wonder God had so great a regard to this people, for he chose them out of all mankind to be his peculiar portion and treasure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the Lord's portion is his people, Jacob is the lot of his inheritance. This is the reason why the Lord so early provided a portion or inheritance for the children of Israel in the land of Canaan; because they were his part, his portion, his inheritance, which he chose by lot for himself, or allotted to himself; whom he chose to be his special and peculiar people; for though all the world is his, he only reserved a part for himself, which he separated from all the rest, and considers as his portion and inheritance, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; thus the spiritual Israel of God, as they are his people, whom he has chosen, taken into covenant, given to Christ, and are redeemed and saved by him; they are his part or portion, separated by distinguishing grace from the rest of the world; and are the inheritance of Christ, who is appointed heir of all things, and is an unalienable inheritance; and is obtained by lot, or rather is measured out by a rod or line; by the line of electing grace, by which the church and people of God are circumscribed, marked out, and distinguished from others; and by the line and rule of the sacred Scriptures, which are the measure and standard of faith and practice, of worship and discipline to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the LORD's portion is his people; Jacob is the lot of his inheritance.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "portion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "lot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inheritance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] LXX removes ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jacob",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to this line, and to the end of the following adds ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In that case ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is superfluous both to the sense and to the rhythm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "measuring-rope",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scale",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "range",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Deuteronomy 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God did this, because He had chosen Israel as His own nation, even before it came into existence. As the Lord's people of possession (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Israel was Jehovah's portion, and the inheritance assigned to Him. חבל, a cord, or measure, then a piece of land measured off; here it is figuratively applied to the nation.",
        "children": []
      }
    ]
  }
]