[{"header":"Nebuchadnezzar’s Letter"},{"num":4,"verse":"From King Nebuchadnezzar:"},{"num":2,"verse":"It seemed good to me to declare the signs and wonders that the Most High God did for me."},{"header":"Nebuchadnezzar Seeks the Meaning of His Dream"},{"num":4,"verse":"When I, Nebuchadnezzar, was carefree in my house and prospering in my palace, "},{"num":5,"verse":"I saw a dream that frightened me. The images I saw while I was on my bed and the visions in my head alarmed me. "},{"num":6,"verse":"So I issued a decree to bring before me all of the wise men of Babylon so that they could give the interpretation of the dream and make it known to me. "},{"num":7,"verse":"Then the magicians, the spell casters, the astrologers, and the diviners came, and I told them the dream. However, they could not make its meaning known to me. "},{"num":8,"verse":"Afterward, Daniel came before me (whose name is Belteshazzar, like the name of my god, and a spirit of the holy gods dwells in him), and I told him the dream."},{"header":"Daniel Explains Nebuchadnezzar’s Dream"},{"num":19,"verse":"Then Daniel, whose name was Belteshazzar, was horrified for a moment, and his thoughts troubled him. The king said, “Belteshazzar, do not let the dream and its meaning trouble you.”"},{"header":"Nebuchadnezzar’s Dream Is Fulfilled"},{"num":28,"verse":"All this happened to King Nebuchadnezzar. "},{"num":29,"verse":"At the end of twelve months he was walking on top of the palace of his kingdom in Babylon. "},{"num":30,"verse":"The king said, “Isn’t this the great Babylon that I built for a royal residence by my mighty power and my majestic glory?”"},{"num":31,"verse":"While the word was still in the king’s mouth, a voice came down from heaven. It said, “It is announced to you, King Nebuchadnezzar: The kingdom has been taken away from you. "},{"num":32,"verse":"You will be driven away from humans, and your dwelling will be with the wild animals. Grass will be fed to you as grass is fed to bulls, and seven times will pass over you until you know that the Most High rules the kingdoms of men, and he gives them to whomever he wishes.”"},{"num":33,"verse":"Immediately the word was fulfilled against Nebuchadnezzar, and he was driven away from humans. So he ate grass as bulls do, and his body was wet with the dew from the sky until his hair grew long like eagles’ feathers and his nails like birds’ claws."}]