[{"num":4,"verse":"2 Another dream of Nebuchadnezzar, which Daniel declareth. 29 The Prophet declareth how of a proud king, he should become as a beast. 31 After he confesseth the power of God, and is restored to his former dignity."},{"num":1,"verse":"I Nebuchadnezzar being at rest in mine house, and flourishing in my palace,"},{"num":2,"verse":"Saw a dream, which made me afraid, and the thoughts upon my bed, and the visions of mine head troubled me."},{"num":3,"verse":"Therefore made I a decree, that they should bring all the wise men of Babel before me, that they might declare unto me the interpretation of the dream."},{"num":4,"verse":"So came the enchanters, the astrologians, the Chaldeans and the soothsayers, to whom I told the dream, but they could not show me the interpretation thereof,"},{"num":5,"verse":"Till at the last Daniel came before me, (whose name was Belteshazzar, according to the name of my god, which hath the spirit of the holy gods in him) and before him I told the dream, saying,"},{"num":6,"verse":"O Belteshazzar, chief of the enchanters, because I know, that the spirit of the holy gods is in thee, and no secret troubleth thee, tell me the visions of my dream, that I have seen, and the interpretation thereof."},{"num":7,"verse":"Thus were the visions of my head in my bed, and behold, I saw a tree in the midst of the earth, and the height thereof was great:"},{"num":8,"verse":"A great tree and strong, and the height thereof reached unto heaven, and the sight thereof to the ends of all the earth."},{"num":9,"verse":"The boughs thereof were fair and the fruit thereof much, and in it was meat for all: it made a shadow under it for the beasts of the field, and the fowls of the heaven dwelt in the boughs thereof, and all flesh fed of it."},{"num":10,"verse":"I saw in the visions of mine head upon my bed, and behold, a watchman and an holy one came down from heaven,"},{"num":11,"verse":"And cried aloud, and said thus, Hew down the tree, and break off his branches: shake off his leaves, and scatter his fruit, that the beasts may flee from under it, and the fowls from his branches."},{"num":12,"verse":"Nevertheless, leave the stump of his roots in the earth, and with a band of iron and brass bind it among the grass of the field, and let it be wet with the dew of heaven, and let his portion be with the beasts among the grass of the field."},{"num":13,"verse":"Let his heart be changed from man’s nature, and let a beast’s heart be given unto him, and let seven times be passed over him."},{"num":14,"verse":"The sentence is according to the decree of the watchmen, and according to the word of the holy ones: the demand was answered, to the intent that living men may know, that the most High hath power over the kingdom of men, and giveth it to whomsoever he will, and appointeth over it the most abject among men."},{"num":15,"verse":"This is the dream, that I King Nebuchadnezzar have seen: therefore thou, O Belteshazzar, declare the interpretation thereof: for all the wise men of my kingdom are not able to show me the interpretation: but thou art able, for the spirit of the holy gods is in thee."},{"num":16,"verse":"¶ Then Daniel (whose name was Belteshazzar) held his peace by the space of one hour, and his thoughts troubled him, and the King spake and said, Belteshazzar, let neither the dream, nor the interpretation thereof trouble thee. Belteshazzar answered and said, My lord, the dream be to them that hate thee, and the interpretation thereof to thine enemies."},{"num":17,"verse":"The tree that thou sawest, which was great and mighty, whose height reached unto the heaven, and the sight thereof through all the world,"},{"num":18,"verse":"Whose leaves were fair, and the fruit thereof much, and in it was meat for all, under the which the beasts of the field dwelt, and upon whose branches the fowls of the heaven did sit,"},{"num":19,"verse":"It is thou, O king, that art great and mighty: for thy greatness is grown, and reacheth unto heaven, and thy dominion to the ends of the earth."},{"num":20,"verse":"Whereas the King saw a watchman, and an holy one that came down from heaven, and said, Hew down the tree, and destroy it, yet leave the stump of the roots thereof in the earth, and with a band of iron and brass bind it among the grass of the field, and let it be wet with the dew of heaven, and let his portion be with the beasts of the field, till seven times pass over him."},{"num":21,"verse":"This is the interpretation, O king, and it is the decree of the most High, which is come upon my lord the king,"},{"num":22,"verse":"That they shall drive thee from men, and thy dwelling shall be with the beasts of the field: they shall make thee to eat grass as the oxen, and they shall wet thee with the dew of heaven: and seven times shall pass over thee, till thou know, that the most High beareth rule over the kingdom of men, and giveth it to whomsoever he will."},{"num":23,"verse":"Whereas they said, that one should leave the stump of the tree roots, thy kingdom shall remain unto thee: after that, thou shalt know, that the heavens have the rule."},{"num":24,"verse":"Wherefore, O king, let my counsel be acceptable unto thee, and break off thy sins by righteousness, and thine iniquities by mercy towards the poor: lo, let there be a healing of thine error."},{"num":25,"verse":"All these things shall come upon the king Nebuchadnezzar."},{"num":26,"verse":"¶ At the end of twelve months, he walked in the royal palace of Babel."},{"num":27,"verse":"And the king spake and said, Is not this great Babel that I have built for the house of the kingdom by the might of my power, and for the honor of my majesty?"},{"num":28,"verse":"While the word was in the king’s mouth, a voice came down from heaven, saying, O king Nebuchadnezzar, to thee be it spoken, Thy kingdom is departed from thee,"},{"num":29,"verse":"And they shall drive thee from men, and thy dwelling shall be with the beasts of the field: they shall make thee to eat grass, as the oxen, and seven times shall pass over thee, until thou knowest, that the most High beareth rule over the kingdom of men, and giveth it unto whomsoever he will."},{"num":30,"verse":"The very same hour was this thing fulfilled upon Nebuchadnezzar, and he was driven from men, and did eat grass as the oxen, and his body was wet with the dew of heaven, till his hairs were grown as eagles feathers, and his nails like birds claws."},{"num":31,"verse":"And at the end of these days, I Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding was restored unto me, and I gave thanks unto the most High, and I praised and honored him, that liveth forever, whose power is an everlasting power, and his kingdom is from generation to generation."},{"num":32,"verse":"And all the inhabitants of the earth are reputed as nothing: and according to his will he worketh in the army of heaven, and in the inhabitants of the earth: and none can stay his hand, nor say unto him, What doest thou?"},{"num":33,"verse":"At the same time was mine understanding restored unto me, and I returned to the honor of my kingdom: my glory and my beauty was restored unto me, and my counselors and my princes sought unto me, and I was established in my kingdom, and my glory was augmented toward me."},{"num":34,"verse":"Now therefore I Nebuchadnezzar praise, and extol and magnify the king of heaven, whose works are all truth, and his ways judgment: and those that walk in pride, he is able to abase."}]