[{"header":"Chapter 4[a]"},{"num":1,"verse":"I, Nebuchadnezzar, was living in contentment at home and enjoying the luxury of my palaces."},{"num":2,"verse":"However, as I lay in my bed, I had a dream that frightened me, and the visions that I experienced in my mind were a source of torment."},{"num":3,"verse":"Therefore, I issued a decree that all the wise men of Babylon were to be brought before me and offer me their interpretation of the dream."},{"num":4,"verse":"When the magicians, the soothsayers, the Chaldeans, and the diviners arrived, I related to them the content of the dream, but they were unable to explain its meaning."},{"num":5,"verse":"Finally Daniel, whom I had renamed Belteshazzar, after the name of my god and in whom resides the Spirit of the holy God, came into my presence, and I related to him my dream."},{"num":6,"verse":"“O Belteshazzar, chief of the magicians, I know that the Spirit of the holy God resides in you and that no mystery is too difficult for you to resolve. Listen to the dream that I experienced, and tell me its interpretation."},{"num":7,"verse":"“These were the visions that came to me as I lay in my bed:"},{"num":10,"verse":"“In the vision I saw as I lay in my bed, I next beheld a holy sentinel coming down from heaven."},{"num":11,"verse":"He shouted loudly:"},{"num":15,"verse":"“This is the dream that I, King Nebuchadnezzar, had. Now I am depending upon you, Belteshazzar, to interpret its meaning, although none of the wise men in my kingdom can interpret its meaning, you can do so because the Spirit of the holy God resides in you.”"},{"num":16,"verse":"Daniel Interprets the Dream. Then Daniel, who was called Belteshazzar, was greatly upset and confused. The king said, “Belteshazzar, do not allow the dream and its meaning to terrify you.” Belteshazzar replied, “My lord, may the dream be meant for those who hurt you, and its interpretation for your enemies."},{"num":17,"verse":"The tree that you saw, which grew great and strong, with its top reaching the sky so that it could be seen throughout the entire earth,"},{"num":18,"verse":"a tree with beautiful foliage and abundant fruit, providing food for all and affording shade for the wild beasts, with the birds of heaven dwelling in its branches—"},{"num":19,"verse":"that tree is you, O king. You have grown great and strong. Your power has increased and now reaches the sky; your sovereignty extends to the ends of the earth."},{"num":20,"verse":"“In regard to the king’s vision of a holy sentinel descending from heaven and saying: ‘Cut down the tree and destroy it, but leave the stump and its roots in the ground, bound with iron and bronze, in the grass of the field; let him be bathed by the dew of heaven, and let his lot be with the wild beasts until seven years pass over him,’"},{"num":21,"verse":"this is the interpretation, O king. It is a decree that the Most High has issued upon my lord the king:"},{"num":23,"verse":"“As for the command to leave untouched the stump and the roots of the tree, this means that your kingdom will once again be subject to your rule once you come to acknowledge the sovereignty of Heaven."},{"num":24,"verse":"May the king be willing to take my advice. Atone for your sins with deeds of righteousness, and for your iniquities with mercy to the oppressed. If you do so, you will enjoy a long and peaceful life.”"},{"num":25,"verse":"The Dream Is Fulfilled. All this happened to King Nebuchadnezzar."},{"num":26,"verse":"At the end of twelve months, as he was walking on the roof of the royal palace,"},{"num":27,"verse":"the king said, “How magnificent Babylon is! Was it not built as a royal residence by my mighty strength and for my majestic glory?”"},{"num":28,"verse":"These words were not completely out of his mouth when a voice came from heaven:"},{"num":30,"verse":"This sentence was immediately fulfilled. Nebuchadnezzar was cast out from human society, and he ate grass as oxen do. His body was drenched with the dew of heaven until his hair grew like the feathers of an eagle and his nails became like a bird’s talons."},{"num":31,"verse":"When the period was over, I, Nebuchadnezzar, raised my eyes to heaven and my power of reasoning was restored to me."},{"num":33,"verse":"At that very moment my power of reason returned to me, and my glory and splendor were restored to me. My counselors and my lords sought my counsel. I was reestablished in my kingdom, and my power was greatly increased."}]