[{"header":"King Abijam of Judah"},{"num":15,"verse":"Abijam became king of Judah in Jeroboam’s eighteenth year as king of Israel, "},{"num":2,"verse":"and he ruled from Jerusalem for three years. His mother was Maacah the daughter of Abishalom."},{"num":3,"verse":"Abijam did not truly obey the Lord his God as his ancestor David had done. Instead, he was sinful just like his father Rehoboam. "},{"num":4,"verse":"David had always obeyed the Lord’s commands by doing right, except in the case of Uriah. And since Abijam was David’s great-grandson, the Lord kept Jerusalem safe and let Abijam have a son who would be the next king."},{"num":6,"verse":"The war that had broken out between Rehoboam and Jeroboam continued during the time that Abijam was king."},{"num":8,"verse":"Abijam died and was buried in Jerusalem, and his son Asa became king."},{"header":"King Asa of Judah"},{"num":9,"verse":"Asa became king of Judah in the twentieth year of Jeroboam’s rule in Israel, "},{"num":10,"verse":"and he ruled forty-one years from Jerusalem. His grandmother was Maacah the daughter of Abishalom."},{"num":11,"verse":"Asa obeyed the Lord, as David had done. "},{"num":12,"verse":"He forced the prostitutes at the shrines to leave the country, and he got rid of the idols his ancestors had made. "},{"num":13,"verse":"His own grandmother Maacah had made an idol of Asherah, and Asa took it and burned it in Kidron Valley. Then he removed Maacah from her position as queen mother."},{"num":14,"verse":"As long as Asa lived, he was completely faithful to the Lord, even though he did not destroy the local shrines. "},{"num":15,"verse":"He placed in the temple all the silver and gold objects that he and his father had dedicated to the Lord."},{"num":16,"verse":"Asa was always at war with King Baasha of Israel. "},{"num":17,"verse":"One time, Baasha invaded Judah and captured the town of Ramah. He started making the town stronger, so he could put troops there to stop people from going in and out of Judah."},{"num":18,"verse":"When Asa heard about this, he took the silver and gold from his palace and from the Lord’s temple. He gave it to some of his officials and sent them to Damascus with this message for King Benhadad of Syria: "},{"num":19,"verse":"“Our fathers signed a peace treaty. Why don’t we do the same thing? This silver and gold is a present for you. So, would you please break your treaty with Baasha and force him to leave my country?”"},{"num":20,"verse":"Benhadad did what Asa asked and sent the Syrian army into Israel. They captured the towns of Ijon, Dan, and Abel-Bethmaacah, and the territories of Chinneroth and Naphtali. "},{"num":21,"verse":"When Baasha heard about it, he left Ramah and went back to Tirzah."},{"num":22,"verse":"Asa ordered everyone in Judah to carry away the stones and wood Baasha had used to strengthen the town of Ramah. Then he used these same stones and wood to fortify the town of Geba in the territory of Benjamin and the town of Mizpah."},{"num":23,"verse":"Everything else Asa did while he was king, including his victories and the towns he rebuilt, is written in The History of the Kings of Judah. When he got older, he had a foot disease. "},{"num":24,"verse":"Asa died and was buried in the tomb of his ancestors in Jerusalem. His son Jehoshaphat then became king."},{"header":"King Nadab of Israel"},{"num":25,"verse":"Nadab son of Jeroboam became king of Israel in Asa’s second year as king of Judah, and he ruled two years. "},{"num":26,"verse":"Nadab disobeyed the Lord by following the evil example of his father, who had caused the Israelites to sin."},{"num":27,"verse":"Baasha son of Ahijah was from the tribe of Issachar, and he made plans to kill Nadab. When Nadab and his army went to attack the town of Gibbethon in Philistia, Baasha killed Nadab there. So in the third year of Asa’s rule, Baasha became king of Israel."},{"num":29,"verse":"The Lord’s prophet Ahijah had earlier said, “Not one man or boy in Jeroboam’s family will be left alive.” And, as soon as Baasha became king, he killed everyone in Jeroboam’s family, "},{"num":30,"verse":"because Jeroboam had made the Lord God of Israel angry by sinning and causing the Israelites to sin."},{"num":31,"verse":"Everything else Nadab did while he was king is written in The History of the Kings of Israel."},{"num":32,"verse":"King Asa of Judah and King Baasha of Israel were always at war."},{"header":"King Baasha of Israel"},{"num":33,"verse":"Baasha son of Ahijah became king of Israel in Asa’s third year as king of Judah, and he ruled twenty-four years from Tirzah. "},{"num":34,"verse":"Baasha also disobeyed the Lord by acting like Jeroboam, who had caused the Israelites to sin."}]