[{"num":1,"verse":"Abijam began his three-year reign as king of Judah in Jerusalem during the eighteenth year of Jeroboam’s reign in Israel. (Abijam’s mother was Maacah, the daughter of Abishalom.) "},{"num":3,"verse":"He was as great a sinner as his father was, and his heart was not right with God, as King David’s was. "},{"num":4,"verse":"But despite Abijam’s sin, the Lord remembered David’s love and did not end the line of David’s royal descendants. "},{"num":5,"verse":"For David had obeyed God during his entire life except for the affair concerning Uriah the Hittite. "},{"num":6,"verse":"During Abijam’s reign there was constant war between Israel and Judah. "},{"num":7,"verse":"The rest of Abijam’s history is recorded in The Annals of the Kings of Judah. "},{"num":8,"verse":"When he died he was buried in Jerusalem, and his son Asa reigned in his place."},{"num":9,"verse":"Asa became king of Judah, in Jerusalem, in the twentieth year of the reign of Jeroboam over Israel, "},{"num":10,"verse":"and reigned forty-one years. (His grandmother was Maacah, the daughter of Abishalom.) "},{"num":11,"verse":"He pleased the Lord like his ancestor King David. "},{"num":12,"verse":"He executed the male prostitutes and removed all the idols his father had made. "},{"num":13,"verse":"He deposed his grandmother Maacah as queen mother because she had made an idol—which he cut down and burned at Kidron Brook. "},{"num":14,"verse":"However, the shrines on the hills were not removed, for Asa did not realize that these were wrong. "},{"num":15,"verse":"He made permanent exhibits in the Temple of the bronze shields his grandfather had dedicated, along with the silver and gold vessels he himself had donated."},{"num":16,"verse":"There was lifelong war between King Asa of Judah and King Baasha of Israel. "},{"num":17,"verse":"King Baasha built the fortress city of Ramah in an attempt to cut off all trade with Jerusalem. "},{"num":18,"verse":"Then Asa took all the silver and gold left in the Temple treasury and all the treasures of the palace, and gave them to his officials to take to Damascus, to King Ben-hadad of Syria, with this message:"},{"num":19,"verse":"“Let us be allies just as our fathers were. I am sending you a present of gold and silver. Now break your alliance with King Baasha of Israel so that he will leave me alone.”"},{"num":20,"verse":"Ben-hadad agreed and sent his armies against some of the cities of Israel; and he destroyed Ijon, Dan, Abel-beth-maacah, all of Chinneroth, and all the cities in the land of Naphtali. "},{"num":21,"verse":"When Baasha received word of the attack, he discontinued building the city of Ramah and returned to Tirzah. "},{"num":22,"verse":"Then King Asa made a proclamation to all Judah, asking every able-bodied man to help demolish Ramah and haul away its stones and timbers. And King Asa used these materials to build the city of Geba in Benjamin and the city of Mizpah."},{"num":23,"verse":"The rest of Asa’s biography—his conquests and deeds and the names of the cities he built—is found in The Annals of the Kings of Judah. In his old age his feet became diseased, "},{"num":24,"verse":"and when he died, he was buried in the royal cemetery in Jerusalem. Then his son Jehoshaphat became the new king of Judah."},{"num":25,"verse":"Meanwhile over in Israel, Nadab, the son of Jeroboam, had become king. He reigned two years, beginning in the second year of the reign of King Asa of Judah. "},{"num":26,"verse":"But he was not a good king; like his father, he worshiped many idols and led all of Israel into sin."},{"num":27,"verse":"Then Baasha (the son of Ahijah, from the tribe of Issachar) plotted against him and assassinated him while he was with the Israeli army laying siege to the Philistine city of Gibbethon. "},{"num":28,"verse":"So Baasha replaced Nadab as the king of Israel in Tirzah during the third year of the reign of King Asa of Judah. "},{"num":29,"verse":"He immediately killed all of the descendants of King Jeroboam, so that not one of the royal family was left, just as the Lord had said would happen when he spoke through Ahijah, the prophet from Shiloh. "},{"num":30,"verse":"This was done because Jeroboam had angered the Lord God of Israel by sinning and leading the rest of Israel into sin."},{"num":31,"verse":"Further details of Baasha’s reign are recorded in The Annals of the Kings of Israel."},{"num":32,"verse":"There was continuous warfare between King Asa of Judah and King Baasha of Israel. Baasha reigned for twenty-four years, "},{"num":34,"verse":"but all that time he continually disobeyed the Lord. He followed the evil paths of Jeroboam, for he led the people of Israel into the sin of worshiping idols."}]