[{"num":13,"verse":"In that day an open well shall be to the house of David, and to men dwelling at Jerusalem, into washing away of a sinful man, and of a woman defouled in unclean blood. (On that day there shall be an open well for the house of David, and for those who live in Jerusalem, to wash clean any sinful man, and any woman defiled with unclean blood.)"},{"num":2,"verse":"And it shall be, in that day, saith the Lord of hosts, I shall destroy the names of idols from the land, and they shall no more be thought on; and I shall take away from earth false prophets, and an unclean spirit. (And it shall be, on that day, saith the Lord of hosts, I shall destroy the names of idols from off the land, and they shall no more be thought upon; and I shall take away from the land the false prophets, and the unclean spirits.)"},{"num":3,"verse":"And it shall be, when any man shall prophesy any more, his father and mother that engendered him, shall say to him, Thou shalt not live, for thou hast spoken leasing in the name of the Lord; and his father and his mother, the engenderers of him, shall prick him, when he hath prophesied. (And it shall be, when any man shall prophesy any more, his father and his mother who begat him, shall say to him, Thou shalt not live, for thou hast spoken lies in the name of the Lord; and his father and his mother, who begat him, shall pierce, or shall stab, him, when he hath prophesied.)"},{"num":4,"verse":"And it shall be, in that day, prophets shall be ashamed, each of his vision, when he shall prophesy; neither they shall be covered with a mantle of sackcloth, that they lie; (And it shall be, on that day, every prophet shall be ashamed of his vision, when he shall prophesy; nor shall any of them be covered with a mantle of sackcloth, because they lie;)"},{"num":5,"verse":"but he shall say, I am not a prophet; I am a man an earth-tiller, for Adam is mine ensample from my youth. (but he shall say, I am not a prophet; I am a farmer, and mankind is my example from my youth.)"},{"num":6,"verse":"And it shall be said to him, What be these wounds in the middle of thine hands? And he shall say, With these I was wounded in the house of them that loved me. (And it shall be said to him, What be these wounds in the midst of thy hands? And he shall say, I was wounded with these in the house of those who loved me.)"},{"num":7,"verse":"Sword, be thou raised on my shepherd, and on a man cleaving to me, saith the Lord of hosts; smite thou the shepherd, and the sheep of the flock shall be scattered. And I shall turn mine hand to the little (ones). (Sword, be thou raised against my shepherd, and against a man cleaving to me, saith the Lord of hosts; strike thou down the shepherd, and the sheep of the flock shall be scattered. And then I shall turn my hand against the young ones.)"},{"num":8,"verse":"And two parts (of the people) shall be in each land, saith the Lord, and they shall be scattered, and shall fail, and the third part shall be left in it."},{"num":9,"verse":"And I shall lead the third part by (the) fire, and I shall burn them, as silver is burnt, and I shall prove them, as gold is proved. He shall call to help my name, and I shall graciously hear him; and I shall say, Thou art my people, and he shall say, Thou art my Lord God. (And I shall lead the third part through the fire, and I shall burn them, like silver is burned, and I shall prove them, like gold is proved. They shall call my name for help, and I shall graciously hear, or I shall graciously answer, them; and I shall say, Thou art my people, and they shall say, Thou art the Lord our God.)"}]