[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 29:15-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:15-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I was eyes to the blind — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, instead of eyes, to instruct, direct, and assist such, as through ignorance or weakness were apt to mistake, and to be seduced or cheated by the craft and artifices of evil- minded men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And feet was I to the lame — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, ready to help him who was unable to help himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I was a father to the poor — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For the poor I had such a tender affection, that I was as careful of their interest as if I had been their father, and was as ready to relieve them, and supply their wants, as if they had been my children. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the cause which I knew not I searched out — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I was their advocate, as well as their judge, and never ceased considering their cause, when there was any obscurity in it, till I thoroughly understood it, that I might set it in a true light, cleared of all false colours, and do them justice. In all causes, especially in those which concerned the poor, I diligently inquired into the matters of fact, patiently and impartially heard both sides, laid all circumstances together, that might discover the truth and the merits of every cause; and then, and not till then, gave judgment upon it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:7-17 All sorts of people paid respect to Job, not only for the dignity of his rank, but for his personal merit, his prudence, integrity, and good management. Happy the men who are blessed with such gifts as these! They have great opportunities of honouring God and doing good, but have great need to watch against pride. Happy the people who are blessed with such men! it is a token for good to them. Here we see what Job valued himself by, in the day of his prosperity. It was by his usefulness. He valued himself by the check he gave to the violence of proud and evil men. Good magistrates must thus be a restraint to evil-doers, and protect the innocent; in order to this, they should arm themselves with zeal and resolution. Such men are public blessings, and resemble Him who rescues poor sinners from Satan. How many who were ready to perish, now are blessing Him! But who can show forth His praises? May we trust in His mercy, and seek to imitate His truth, justice, and love.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I was eyes to the blind - An exceedingly beautiful expression, whose meaning is obvious. He became their counsellor and guide.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And feet was I to the lame - I assisted them, and became their benefactor. I did for them, in providing a support, what they would have done for themselves if they had been in sound health. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And feet was I to the lame - I assisted them, and became their benefactor. I did for them, in providing a support, what they would have done for themselves if they had been in sound health. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. Literally, \"the blind\" (De 27:18); \"lame\" (2Sa 9:13); figuratively, also the spiritual support which the more enlightened gives to those less so (Job 4:3; Heb 12:13; Nu 10:31).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Eyes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. instead of eyes, to instruct, and direct, and assist. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To the blind; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Corporally. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Spiritually; such as through ignorance or weakness were apt to mistake, and to be seduced or cheated by the craft and artifices of evil-minded men. These I cautioned, and advised, and led into the right way. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Feet was I to the lame, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. ready to help him who was unable to help himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I was eyes to the blind,.... Either in a literal sense: there was a law in Israel against putting a stumbling block before the blind, and a curse pronounced on those that caused them to wander out of the way; which implied that they ought to remove all impediments out of their way, and should lead, guide, and direct them in the right way; and this Job might do, if not in his own person, yet by his servants, and so was as eyes unto them, and especially by taking care of and providing for persons in such circumstances: or rather in a civil sense; such who were in perplexity and distress, oppressed by their neighbours, but did not know how to get justice done them, what steps to take, or methods to pursue, to obtain their right or secure it; these Job instructed with his good advice and counsel, and put them into a way of proceeding whereby they could be extricated out of their difficulties, and peaceably enjoy their own, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and it might be true of him in a spiritual sense; that he was eyes to his blind Heathen neighbours among whom he dwelt; who were ignorant of God, and of the living Redeemer, and of the way of life and salvation by him, and of their miserable and lost estate, and of their need of a Saviour; not being acquainted with the nature of sin, and the sad consequences of it, and with the way of atonement for it, nor with the mind and will of God, and the worship of him; all which he might be a means of enlightening their minds with: Eliphaz owns he instructed many, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; thus ministers of the Gospel are eyes to the blind; for though they cannot give eyes, or spiritual sight to men, which is only from the Lord, yet they may be instruments of opening blind eyes, and of turning men from darkness to light, as the word preached by them is a means of \"enlightening the eyes\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; whereby men come to see their lost estate, and the way of salvation by Christ: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and feet was I to the lame; either in a literal sense, as David was to Mephibosheth, when he sent for and maintained him at his own table, so that he had no occasion to seek for his bread elsewhere, 2 Samuel 9:13; and Job might make a provision in some way or another for such sort of persons: or rather in a civil sense, such who were engaged in law suits, and had justice on their side, but for want of friends or money, or both, could not carry them on; these Job supported and supplied, and carried them through their suits, and got their cause for them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and feet was I to the lame; either in a literal sense, as David was to Mephibosheth, when he sent for and maintained him at his own table, so that he had no occasion to seek for his bread elsewhere, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and Job might make a provision in some way or another for such sort of persons: or rather in a civil sense, such who were engaged in law suits, and had justice on their side, but for want of friends or money, or both, could not carry them on; these Job supported and supplied, and carried them through their suits, and got their cause for them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I was eyes to the blind, and feet was I to the lame.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The blind he enabled to see that which of themselves they could not perceive; the lame he enabled to attain to that which of themselves they were unable to reach.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I was eyes to the blind, and feet was I to the lame",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Persian kings had officials, whom they called their \"eyes\" and their \"ears\" - observers who were to inform them of all that went on in the provinces ('Ancient Monarchies,' vol. 3. p. 213). Job acted as \"eyes\" to the blind of his time, giving them the information which their infirmity hindered them from obtaining. He was also feet to the lame, taking  messages for them, going on their errands, and the like. He was kind and helpful to his fellow-men, not only in great, but also in little matters. Job 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15  I was eyes to the blind,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And feet was I to the lame.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  I was a father to the needy,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the cause of the unknown I found out,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  And broke the teeth of the wicked,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I cast the spoil forth out of his teeth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The less it is Job's purpose here to vindicate himself before the friends, the more forcible is the refutation which the accusations of the most hard-hearted uncharitableness raised against him by them, especially by Eliphaz, Job 22, find everywhere here. His charity relieved the bodily and spiritual wants of others - eyes to the blind (לעוּר with Pathach), feet to the lame. A father was he to the needy, which is expressed by a beautiful play of words, as if it were: the carer for the care-full ones; or what perhaps corresponds to the primary significations of אב and אביון:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The less it is Job's purpose here to vindicate himself before the friends, the more forcible is the refutation which the accusations of the most hard-hearted uncharitableness raised against him by them, especially by Eliphaz, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", find everywhere here. His charity relieved the bodily and spiritual wants of others - eyes to the blind (לעוּר with Pathach), feet to the lame. A father was he to the needy, which is expressed by a beautiful play of words, as if it were: the carer for the care-full ones; or what perhaps corresponds to the primary significations of אב and אביון:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: There is an old Arabic defective verb, bayya, which signifies \"to seek an asylum for one's self,\" e.g., anâ baj, I come as one seeking protection, a suppliant, in the usual language synon. of Arab. dachala, and thereby indicating its relationship to the Hebr. בּוא, perhaps the root of בּית (בּתּים), the ת of which would then not be a radical letter, but, as according to Ges. Thes. in זית, used only in the forming of the word, and the original meaning would be \"a refuge.\" Traced to a secondary verb, אבה (properly to take up the fugitive, qabila-l-bı̂ja) springing from this primitive verb, אב would originally signify a guardian, protector; and from the fact of this name denoting, according to the form פּעל, properly in general the protecting power, the ideal femin. in אבות (Arab. abawât' and the Arabic dual abawain (properly both guardians), which embraces father and mother, would be explained and justified. Thus the rare phenomenon that the same אבה signifies in Hebr. \"to be willing,\" and in Arab. \"to refuse,\" would be solved. The notion of taking up the fugitive would have passed over in the Hebrew, taken according to its positive side, into the notion of being willing, i.e., of receiving and accepting (אבּל, qabila, e.g., 1 Kings 20:8, לא תעבה  equals  la taqbal); in the Arabic, however, taken according to its negative side, as refusing the fugitive to his pursuer, into that of not being willing; and the usage of the language favours this: abâhu ‛aleihi, he protected him against (Arab. 'lâ) the other (refused him to the other); Arab. abı̂yun  equals  ma'bin, protected, inaccessible to him who longs for it; Arab. ibyat, the protection, i.e., the retention of the milk in the udder. Hence אביון, from the Hebrew signif. of the verb, signifies one who desires anything, or a needy person, but originally (inasmuch as אבה is connected with Arab. byy) one who needs protection; from the Arabic signif. of Arab. 'abâ, one who restrains himself because he is obliged, one to whom what he wants is denied. To the Arab. ibja (defence, being hindered) corresponds in form the Hebr. אבה, according to which אניות אבה, Job 9:26, may be understood of ships, which, with all sails set and in all haste, seek the sheltering harbour before the approaching storm. We leave this suggestion for further research to sift and prove. More on Job 34:36. - Wetzst.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: There is an old Arabic defective verb, bayya, which signifies \"to seek an asylum for one's self,\" e.g., anâ baj, I come as one seeking protection, a suppliant, in the usual language synon. of Arab. dachala, and thereby indicating its relationship to the Hebr. בּוא, perhaps the root of בּית (בּתּים), the ת of which would then not be a radical letter, but, as according to Ges. Thes. in זית, used only in the forming of the word, and the original meaning would be \"a refuge.\" Traced to a secondary verb, אבה (properly to take up the fugitive, qabila-l-bı̂ja) springing from this primitive verb, אב would originally signify a guardian, protector; and from the fact of this name denoting, according to the form פּעל, properly in general the protecting power, the ideal femin. in אבות (Arab. abawât' and the Arabic dual abawain (properly both guardians), which embraces father and mother, would be explained and justified. Thus the rare phenomenon that the same אבה signifies in Hebr. \"to be willing,\" and in Arab. \"to refuse,\" would be solved. The notion of taking up the fugitive would have passed over in the Hebrew, taken according to its positive side, into the notion of being willing, i.e., of receiving and accepting (אבּל, qabila, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 20:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", לא תעבה  equals  la taqbal); in the Arabic, however, taken according to its negative side, as refusing the fugitive to his pursuer, into that of not being willing; and the usage of the language favours this: abâhu ‛aleihi, he protected him against (Arab. 'lâ) the other (refused him to the other); Arab. abı̂yun  equals  ma'bin, protected, inaccessible to him who longs for it; Arab. ibyat, the protection, i.e., the retention of the milk in the udder. Hence אביון, from the Hebrew signif. of the verb, signifies one who desires anything, or a needy person, but originally (inasmuch as אבה is connected with Arab. byy) one who needs protection; from the Arabic signif. of Arab. 'abâ, one who restrains himself because he is obliged, one to whom what he wants is denied. To the Arab. ibja (defence, being hindered) corresponds in form the Hebr. אבה, according to which אניות אבה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", may be understood of ships, which, with all sails set and in all haste, seek the sheltering harbour before the approaching storm. We leave this suggestion for further research to sift and prove. More on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - Wetzst.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the protector of those needing (seeking) protection. The unknown he did not regard as those who were nothing to him, but went unselfishly and impartially into the ground of their cause. לא־ידעתּי is an attributive clause, as Job 18:21; Isaiah 55:5; Isaiah 41:3, and freq., with a personal obj. (eorum) quos non noveram, for the translation causam quam nesciebam (Jer.) gives a tame, almost meaningless, thought. With reference to the suff. in אחקרהוּ, on the form ehu used seldom by Waw consec. (Job 12:4), and by the imper. (Job 40:11), chiefly with a solemn calm tone of speech, vid., Ew. 250, c. Further: He spared not to render wrong-doers harmless, and snatched from them what they had taken from others. The cohortative form of the fut. consec., ואשׁבּרה, has been discussed already on Job 1:15; Job 19:20. The form מתלּעות is a transposition of מלתּעות, to render it more convenient for pronunciation, for the Arab. ṭl‛, efferre se, whence a secondary form, Arab. tl‛, although used of the appearing of the teeth, furnishes no such appropriate primary signification as the Arab. lḏg, pungere, mordere, whence a secondary form, Arab. ltg; the Aethiopic maltâht, jawbone (maxilla), also favours מלתעה as the primary form. He shattered the grinders of the roguish, and by moral indignation against the robber he cast out of his teeth what he had stolen. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the protector of those needing (seeking) protection. The unknown he did not regard as those who were nothing to him, but went unselfishly and impartially into the ground of their cause. לא־ידעתּי is an attributive clause, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and freq., with a personal obj. (eorum) quos non noveram, for the translation causam quam nesciebam (Jer.) gives a tame, almost meaningless, thought. With reference to the suff. in אחקרהוּ, on the form ehu used seldom by Waw consec. (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and by the imper. (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), chiefly with a solemn calm tone of speech, vid., Ew. 250, c. Further: He spared not to render wrong-doers harmless, and snatched from them what they had taken from others. The cohortative form of the fut. consec., ואשׁבּרה, has been discussed already on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The form מתלּעות is a transposition of מלתּעות, to render it more convenient for pronunciation, for the Arab. ṭl‛, efferre se, whence a secondary form, Arab. tl‛, although used of the appearing of the teeth, furnishes no such appropriate primary signification as the Arab. lḏg, pungere, mordere, whence a secondary form, Arab. ltg; the Aethiopic maltâht, jawbone (maxilla), also favours מלתעה as the primary form. He shattered the grinders of the roguish, and by moral indignation against the robber he cast out of his teeth what he had stolen. ",
            "children": []
          }
        ]
      }
    ]
  }
]