[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To the gate.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—There business was transacted. (Comp. the expression, which is still used with reference to the Turkish Empire, of “the Sublime Porte,” or the supreme Place of government; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 127:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Jer. 35:20, &c.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 29:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When I went out to the gate — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When I went from my dwelling to the gate of the city, the place of judicature, which, as has often been observed, was in the gates. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When I prepared my seat in the streets — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When I caused the seat of justice to be set for me in that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "open place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ברחוב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "barechob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies, near the gate, where the people assembled for the administration of justice. By this, and several other expressions, it appears that Job was a magistrate or judge in his country.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:7-17 All sorts of people paid respect to Job, not only for the dignity of his rank, but for his personal merit, his prudence, integrity, and good management. Happy the men who are blessed with such gifts as these! They have great opportunities of honouring God and doing good, but have great need to watch against pride. Happy the people who are blessed with such men! it is a token for good to them. Here we see what Job valued himself by, in the day of his prosperity. It was by his usefulness. He valued himself by the check he gave to the violence of proud and evil men. Good magistrates must thus be a restraint to evil-doers, and protect the innocent; in order to this, they should arm themselves with zeal and resolution. Such men are public blessings, and resemble Him who rescues poor sinners from Satan. How many who were ready to perish, now are blessing Him! But who can show forth His praises? May we trust in His mercy, and seek to imitate His truth, justice, and love.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When I went out to the gate - The \"gate\" of a city was a place of public concourse, and where courts were usually held. Job speaks here as a magistrate, and of the time when he went forth to sit as a judge, to try causes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When I prepared my seat in the street - That is, to sit as a judge. The seat or tribunal was placed in the street, in the open air, before the gate of the city, where great numbers might be convened, and hear and see justice done. The Arabs, to this day, hold their courts of justice in an open place, under the heavens, as in a field or a market-place. Norden's Travels in Egypt, ii. 140. There has been, however, great variety of opinion in regard to the meaning of this verse. Schultens enumerates no less than ten different interpretations of the passage. Herder translates it:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"When from my house I went to the assembly,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And spread my carpet in the place of meeting.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Prof. Lee translates it, \"When I went forth from the gate to the pulpit, and prepared my seat in the broad place.\" He supposes that Job refers to occasions when he addressed the people, and to the respect which was shown him then. Dr. Good renders it, \"As I went forth, the city rejoiced at me.\" It is probable, however, that our common version has given the true signification. The word rendered \"city\" (קרת  qereth), is a poetic form for (קריה  qiryâh) \"city,\" but does not frequently occur. It is found in Proverbs 8:3; Proverbs 9:3, Proverbs 9:14; Proverbs 11:11. The phrase \"upon the city\" - Hebrew עלי־קרת  ‛aly-qereth - or, \"over the city,\" may refer to the fact that the gate was in an elevated place, or that it was the chief place, and, as it were, over or at the head of the city. The meaning is, that as he went out from his house toward the gate that was situated in the most important part of the city, all did him reverence. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Prof. Lee translates it, \"When I went forth from the gate to the pulpit, and prepared my seat in the broad place.\" He supposes that Job refers to occasions when he addressed the people, and to the respect which was shown him then. Dr. Good renders it, \"As I went forth, the city rejoiced at me.\" It is probable, however, that our common version has given the true signification. The word rendered \"city\" (קרת  qereth), is a poetic form for (קריה  qiryâh) \"city,\" but does not frequently occur. It is found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 9:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The phrase \"upon the city\" - Hebrew עלי־קרת  ‛aly-qereth - or, \"over the city,\" may refer to the fact that the gate was in an elevated place, or that it was the chief place, and, as it were, over or at the head of the city. The meaning is, that as he went out from his house toward the gate that was situated in the most important part of the city, all did him reverence. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7-10. The great influence Job had over young and old, and noblemen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "through … street!—rather, When I went out of my house, in the country (see Job 1:1, prologue) to the gate (ascending), up to the city (which was on elevated ground), and when I prepared my (judicial) seat in the market place. The market place was the place of judgment, at the gate or propylæa of the city, such as is found in the remains of Nineveh and Persepolis (Isa 59:14; Ps 55:11; 127:5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When I went out from my dwelling to the gate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, of the city, as the following words show; to the place of judicature, which was in the gates, as hath been oft observed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Through the city; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " through that part of the city which was between my house and the gate. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. the gate belonging to the city. So Job might live in the country adjoining to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When I prepared my seat; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when I caused the seat of justice to be set for me. By this and divers other expressions it appears that Job was a magistrate or judge in his country. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the street",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. in that void and open place within or near the gate, where the people assembled for the administration of justice among them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When I went out to the, gate through the city,.... Job having described his former state of happiness by the personal favours he enjoyed, and by the prosperity of his family, and his abundance of plenty at home, proceeds to give an account of the honour and respect he had from men of every age and rank abroad: though he had an affluence of the things of this world, he did not indulge himself at home in ease and sloth; but went abroad to take care of the public welfare, maintain public peace, and administer public justice among his neighbours; performing the office of a civil magistrate, which is often expressed in Scripture by going in and out before the people: Job went out from his own house to the gate of the city, where a court of judicature was kept, as it was usual in those times and countries to hold them in the gates of the city; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and to which he passed through the city, very probably, in great pomp and splendour, suitable to his office and character, which drew the eyes and attention of the people to him; by which it should seem that his house was on one side of the city, and the gate where justice was administered was on the other; though it may be rendered, \"over the city\" (o), and the sense be, that he passed along as he that was over the city, the chief man in it, and president of the court of justice, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when I prepared my seat in the street; where he sat, not as a teacher, though he was an instructor, not only of his family, but of his neighbours, as Eliphaz himself testifies, Job 4:3; and it was usual for such to have seats to sit upon, as those had who succeeded Moses, and are said to sit in his chair; and it was usual to call to men and instruct them in open public places; hence Wisdom is said to utter her voice in the streets, in the opening of the gates, at the entry of the city, at the coming in at the doors, Proverbs 1:20; but Job here speaks of himself as a civil magistrate, as a judge upon the bench, who had a seat or throne erected for him to sit upon, while he was hearing and trying causes; and this was set up in the street under the open air, before the gate of the city, where the whole city might be convened together, and hear and see justice done to their neighbours; in such a street, before the gate of the city, Ezra read the law to Israel; and in such an one Hezekiah got the people of Israel together, and spoke comfortably to them when invaded by Sennacherib; see Nehemiah 8:2; and the Arabs, to this day, hold their courts of justice in an open place under the heavens, as in a field, or in a market place (p); and it is right that courts of justice should be open and accessible to all. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "when I prepared my seat in the street; where he sat, not as a teacher, though he was an instructor, not only of his family, but of his neighbours, as Eliphaz himself testifies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it was usual for such to have seats to sit upon, as those had who succeeded Moses, and are said to sit in his chair; and it was usual to call to men and instruct them in open public places; hence Wisdom is said to utter her voice in the streets, in the opening of the gates, at the entry of the city, at the coming in at the doors, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but Job here speaks of himself as a civil magistrate, as a judge upon the bench, who had a seat or throne erected for him to sit upon, while he was hearing and trying causes; and this was set up in the street under the open air, before the gate of the city, where the whole city might be convened together, and hear and see justice done to their neighbours; in such a street, before the gate of the city, Ezra read the law to Israel; and in such an one Hezekiah got the people of Israel together, and spoke comfortably to them when invaded by Sennacherib; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the Arabs, to this day, hold their courts of justice in an open place under the heavens, as in a field, or in a market place (p); and it is right that courts of justice should be open and accessible to all. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o)  \"super civitatem\", Pagninus, Montanus, Schmidt; \"super urbe\", Schultens. (p) Norden's Travels in Egypt and Nubia, vol. 2. p. 140, 141, 158. See Joseph. Antiqu. l. 18. c. 5. sect. 6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o)  \"super civitatem\", Pagninus, Montanus, Schmidt; \"super urbe\", Schultens. (p) Norden's Travels in Egypt and Nubia, vol. 2. p. 140, 141, 158. See Joseph. Antiqu. l. 18. c. 5. sect. 6. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When I went out to the gate through the city, when I prepared my seat in the street!",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The third and chiefest element of his past happiness was the respect of men, and the joy of intercourse with them. This is the main subject of the chapter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the gate through the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, the gate ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "by the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job, a rich landowner, probably did not live in the city but on his estate that adjoined it. He took part, however, in all the life of the city, and sat in the council that guided its affairs. The “gate” is spoken of as the place where the Council or Assembly of the town met. Such a “gate” is usually a building of considerable size, like an arcade, and hence it is spoken of here as an independent edifice ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beside",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the city. Others render ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "up to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the city, supposing that the city, as not unusual, was built on an eminence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the street",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "broad place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i. e. market place, a synonym for “gate.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When I went out to the gate through the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "by the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or over ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "against the city.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"gate\" was the place where justice was administered, and public business generally despatched. It would be \"over against\" the city, separated from it by a large square or place (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "רְחוב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in which a multitude might assemble (sue ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hither Job was accustomed to proceed  from time to time, to act as judge and administrator. When I prepared my seat in the street. On such occasions a seat would be brought out and \"prepared,\" where the judge would sit to hear causes and deliver sentences (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Job 29:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  7  When I went forth to the gate of the city,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Prepared my seat in the market,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  8  Then the young men hid themselves as soon as they saw me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the aged rose up, remained standing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  9  Princes refrained from speaking,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And laid their hand on their mouth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  The voice of the nobles was hidden,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And their tongue clave to their palate.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When he left the bounds of his domain, and came into the city, he was everywhere received with the profoundest respect. From the facts of the case, it is inadmissible to translate quum egrederer portam after Genesis 34:24, comp. infra, Job 31:34, for the district where Job dwelt is to be thought of as being without a gate. True, he did not dwell with his family in tents, i.e., pavilions of hair, but in houses; he was not a nomad (a wandering herdsman), or what is the same thing, a Beduin, otherwise his children would not have been slain in a stone house, Job 1:19. \"The daughter of the duck,\" says an Arabian proverb, \"is a swimmer,\" and the son of a Beduin never dwells in a stone house. He was, however, also, not a citizen, but a hadarı̂ (חצרי), i.e., a permanent resident, a large landowner and husbandman. Thus therefore שׁער (for which Ew. after the lxx reads שׁחר: \"when I went up early in the morning to the city\") is locative, for שׁערה (comp. צא השּׂדה, go out into the field, Genesis 27:3): when he went forth to the gate above the city; or even, since it is natural to imagine the city as situated on an eminence: up to the city (so that צאת includes in itself by implication the notion of עלות); not, however: to the gate near the city (Stick., Hahn), since the gate of a city is not situated near the city, but is part of the city itself. The gates of cities and large houses in Western Asia are vaulted entrances, with large recesses on either side, where people congregate for business and negotiations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When he left the bounds of his domain, and came into the city, he was everywhere received with the profoundest respect. From the facts of the case, it is inadmissible to translate quum egrederer portam after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. infra, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for the district where Job dwelt is to be thought of as being without a gate. True, he did not dwell with his family in tents, i.e., pavilions of hair, but in houses; he was not a nomad (a wandering herdsman), or what is the same thing, a Beduin, otherwise his children would not have been slain in a stone house, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"The daughter of the duck,\" says an Arabian proverb, \"is a swimmer,\" and the son of a Beduin never dwells in a stone house. He was, however, also, not a citizen, but a hadarı̂ (חצרי), i.e., a permanent resident, a large landowner and husbandman. Thus therefore שׁער (for which Ew. after the lxx reads שׁחר: \"when I went up early in the morning to the city\") is locative, for שׁערה (comp. צא השּׂדה, go out into the field, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): when he went forth to the gate above the city; or even, since it is natural to imagine the city as situated on an eminence: up to the city (so that צאת includes in itself by implication the notion of עלות); not, however: to the gate near the city (Stick., Hahn), since the gate of a city is not situated near the city, but is part of the city itself. The gates of cities and large houses in Western Asia are vaulted entrances, with large recesses on either side, where people congregate for business and negotiations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Layard, New Discoveries, p. 57.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The open space at the gate, which here, as in Nehemiah 8:1, Nehemiah 8:3, Nehemiah 8:16, is called רחוב, i.e., the open space within the gate and by the gate, was the forum (Job 5:4).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The open space at the gate, which here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is called רחוב, i.e., the open space within the gate and by the gate, was the forum (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      }
    ]
  }
]