[{"header":"David Anointed as King over All of Israel"},{"num":5,"verse":"So all the tribes of Israel came to David at Hebron, and they said, “Here we are, we are your flesh and blood. "},{"num":2,"verse":"For some time, when Saul was king over us, you were leading Israel in and out. Yahweh had said to you, ‘You shall be the shepherd of my people Israel, and you will be the leader over Israel.’” "},{"num":3,"verse":"All the elders of Israel came to the king at Hebron, and King David made a covenant with them at Hebron in the presence of Yahweh; then they anointed David as king over Israel. "},{"num":4,"verse":"David was thirty years old when he began to reign; he reigned forty years. "},{"num":5,"verse":"He reigned over Judah at Hebron for seven years and six months; and he reigned over all Israel and Judah at Jerusalem for thirty-three years."},{"header":"The Capture and Growth of Jerusalem"},{"num":6,"verse":"The king and his men went to Jerusalem, to the Jebusites, the inhabitants of the land. They said to David, “You will not come here, for even the blind and the lame can turn you back, saying, ‘David cannot come here.’” "},{"num":7,"verse":"David captured the fortress of Zion, the city of David. "},{"num":8,"verse":"David had said, “On that day when we attack the Jebusites, one must attack the lame and the blind, those who hate the soul of David, by means of the water supply.” For thus the blind and the lame would say, “He cannot come into the house.” "},{"num":9,"verse":"David occupied the fortress and called it the city of David. And David built all around it from the Millo and inward."},{"num":10,"verse":"David continued growing stronger and stronger, and Yahweh the God of hosts was with him. "},{"num":11,"verse":"So Hiram, the king of Tyre, sent messengers to David, along with cedar trees and craftsmen skilled in wood and in stone masonry, and they built a house for David. "},{"num":12,"verse":"David realized that Yahweh had established him as king over Israel and that he had exalted his kingdom because of his people Israel. "},{"num":13,"verse":"David took more concubines and wives from Jerusalem after he came from Hebron, and more sons and daughters were born to him. "},{"num":14,"verse":"These are the names of the ones born to him in Jerusalem: Shammua and Shobab and Nathan and Solomon; "},{"num":15,"verse":"Ibhar and Elishua and Nepheg and Japhia; "},{"num":16,"verse":"Elishama and Eliada and Eliphelet."},{"header":"War with the Philistines"},{"num":17,"verse":"When the Philistines heard that they had anointed David as king over Israel, all the Philistines went up to seek David, but David heard and went down to the stronghold. "},{"num":18,"verse":"Now the Philistines had come, and they spread out in the Valley of Rephaim. "},{"num":19,"verse":"And David inquired of Yahweh, saying, “Shall I go up to the Philistines? Will you give them into my hands?” Yahweh said to David, “Go up, for I will certainly give the Philistines into your hand.” "},{"num":20,"verse":"So David came to Baal Perazim and defeated them there; and David said, “Yahweh has burst through my enemies before me like the bursting of water.” Therefore he called the name of that place Baal Perazim. "},{"num":21,"verse":"They had left their idols there, so David and his men carried them away."},{"num":22,"verse":"Once again the Philistines came up and spread out in the Valley of Rephaim. "},{"num":23,"verse":"So David inquired of Yahweh, but he said, “You shall not go up. Rather, go around to their rear and come to them from opposite the balsam trees. "},{"num":24,"verse":"And it shall be that when you hear the sound of marching in the tops of the balsam trees, then pay attention, for then Yahweh has gone out before you to strike down the army of the Philistines.” "},{"num":25,"verse":"So David did thus, just as Yahweh had commanded him, and he struck down the Philistines from Geba all the way to Gezer."}]