[{"header":"David Becomes King Over Israel"},{"num":5,"verse":"All the tribes of Israel came to see David at Hebron. They said, “We are your own flesh and blood. "},{"num":2,"verse":"In the past, Saul was our king. But you led Israel on their military campaigns. And the Lord said to you, ‘You will be the shepherd over my people Israel. You will become their ruler.’ ”"},{"num":3,"verse":"All the elders of Israel came to see King David at Hebron. There the king made a covenant with them in front of the Lord. They anointed David as king over Israel."},{"num":4,"verse":"David was 30 years old when he became king. He ruled for 40 years. "},{"num":5,"verse":"In Hebron he ruled over Judah for seven and a half years. In Jerusalem he ruled over all of Israel and Judah for 33 years."},{"header":"David Captures Jerusalem"},{"num":6,"verse":"The king and his men marched to Jerusalem. They went to attack the Jebusites who lived there. The Jebusites said to David, “You won’t get in here. Even people who can’t see or walk can keep you from coming in.” The Jebusites thought, “David can’t get in here.” "},{"num":7,"verse":"But David captured the fort of Zion. It became known as the City of David."},{"num":8,"verse":"On that day David had said, “Someone might win the battle over the Jebusites. But they will have to crawl through the water tunnel to get into the city. That’s the only way they can reach those enemies of mine that you say can’t see or walk.” That’s why people say, “Those who ‘can’t see or walk’ won’t enter David’s palace.”"},{"num":9,"verse":"David moved into the fort. He called it the City of David. He built up the area around the fort. He filled in the low places. He started at the bottom and worked his way up. "},{"num":10,"verse":"David became more and more powerful. That’s because the Lord God who rules over all was with him."},{"num":11,"verse":"Hiram was king of Tyre. He sent messengers to David. He sent cedar logs along with them. He also sent skilled workers. They worked with wood and stone. They built a palace for David. "},{"num":12,"verse":"Then David knew that the Lord had made his position as king secure. He knew that he had made him king over the whole nation of Israel. He knew that the Lord had greatly honored his kingdom. The Lord had done it because the Israelites were his people."},{"num":13,"verse":"After David left Hebron, he got more concubines and wives in Jerusalem. More sons and daughters were born to him there. "},{"num":14,"verse":"Here is a list of the children who were born to him in Jerusalem. Their names were Shammua, Shobab, Nathan, Solomon, "},{"num":15,"verse":"Ibhar, Elishua, Nepheg, Japhia, "},{"num":16,"verse":"Elishama, Eliada and Eliphelet."},{"header":"David Wins the Battle Over the Philistines"},{"num":17,"verse":"The Philistines heard that David had been anointed king over Israel. So their whole army went to look for him. But David heard about it. He went down to his usual place of safety. "},{"num":18,"verse":"The Philistines had come and spread out in the Valley of Rephaim. "},{"num":19,"verse":"So David asked the Lord for advice. He said, “Should I go and attack the Philistines? Will you hand them over to me?”"},{"num":20,"verse":"So David went to Baal Perazim. There he won the battle over the Philistines. He said, “The Lord has broken through against my enemies when I’ve attacked them. He has broken through just as water breaks through a dam.” That’s why the place was called Baal Perazim. "},{"num":21,"verse":"The Philistines left the statues of their gods there. So David and his men carried off the statues."},{"num":22,"verse":"Once more the Philistines came up. They spread out in the Valley of Rephaim. "},{"num":23,"verse":"So David asked the Lord for advice. The Lord answered, “Do not go straight up. Instead, circle around behind them. Attack them in front of the poplar trees. "},{"num":24,"verse":"Listen for the sound of marching in the tops of the trees. Then move quickly. The sound will mean that I have gone out in front of you. I will strike down the Philistine army.” "},{"num":25,"verse":"So David did just as the Lord had commanded him. He struck down the Philistines. He struck them down from Gibeon all the way to Gezer."}]