[[],[{"type":"header","content":"Sabbath Questions"},{"type":"prose","content":"At that particular time Jesus went through the grainfields on the Sabbath, and His disciples were hungry and began to pick the heads of grain and eat them. "}],[{"type":"prose","content":"But when the Pharisees saw this, they said to Him, “Look! Your disciples are doing what is unlawful on the Sabbath.” "}],[{"type":"prose","content":"He said to them,  [in the Scriptures]    [the sanctity of]    [for those in distress],  [animal] "}],[{"type":"header","content":"Lord of the Sabbath"},{"type":"prose","content":"Leaving there, He went into their synagogue. "}],[{"type":"prose","content":"A man  whose hand was withered. And they asked Jesus, “Is it lawful  permissible to heal on the Sabbath?”— so that they might accuse Him  bring charges into court. "}],[{"type":"prose","content":"But He said to them,   "}],[{"type":"prose","content":"Then He said to the man,  The man reached out and it was restored, as normal  healthy as the other. "}],[{"type":"prose","content":"But the Pharisees went out and conspired against Him,  how they could destroy Him."}],[{"type":"prose","content":"Being aware of this, Jesus left there. Many followed Him, and He healed all of them [who were sick], "}],[{"type":"prose","content":"and warned them not to tell [publicly] who He was. "}],[{"type":"prose","content":" to fulfill what was spoken by the prophet Isaiah:"}],[{"type":"header","content":"The Pharisees Rebuked"},{"type":"prose","content":"Then a demon-possessed man who was blind and mute was brought to Jesus, and He healed him, so that the mute man both spoke and saw. "}],[{"type":"prose","content":"All the people wondered in amazement, and said, “Could this be the Son of David (the Messiah)?” "}],[{"type":"prose","content":"But the Pharisees heard it and said, “This man casts out demons only by [the help of] Beelzebul (Satan) the prince of the demons.”"}],[{"type":"prose","content":"Knowing their thoughts Jesus said to them,  [continue to]   [that is, his demons],   [the help of]   [before you expected it]. "},{"type":"header","content":"The Unpardonable Sin"},{"type":"prose","content":" [once and for all on My side]  [unequivocally]  [every evil, abusive, injurious speaking, or indignity against sacred things]  [Holy]   [by attributing the miracles done by Me to Satan] "},{"type":"header","content":"Words Reveal Character"},{"type":"prose","content":"   [inner]  [inner]    [reflecting your spiritual condition]  [rejecting Me] "}],[{"type":"header","content":"The Desire for Signs"},{"type":"prose","content":"Then some of the scribes and Pharisees said to Him, “Teacher, we want to see a sign (attesting miracle) from You [proving that You are what You claim to be].” "}],[{"type":"prose","content":"But He replied and said to them,  [that is morally unfaithful to God]  [miraculous]    [as witnesses]   [as a witness]   "}],[{"type":"header","content":"Changed Relationships"},{"type":"prose","content":"While He was still talking to the crowds, it happened that His mother and brothers stood outside, asking to speak to Him. "}],[{"type":"prose","content":"Someone said to Him, “Look! Your mother and Your brothers are standing outside asking to speak to You.” "}],[{"type":"prose","content":"But Jesus replied to the one who told Him,  "}],[{"type":"prose","content":"And stretching out His hand toward His disciples [and all His other followers], He said,   [by believing in Me, and following Me] "}]]