[[],[{"type":"header","content":"Jesus Is Lord of the Sabbath"},{"type":"prose","content":"At that time Jesus went through the grainfields on the Sabbath. His disciples were hungry, and they began to pluck heads of grain and to eat."}],[{"type":"prose","content":"But when the Pharisees saw it, they said to him, “Look, your disciples are doing what is not lawful to do on the Sabbath.”"}],[{"type":"prose","content":"He said to them, "}],[{"type":"header","content":"A Man with a Withered Hand"},{"type":"prose","content":"He went on from there and entered their synagogue."}],[{"type":"prose","content":"And a man was there with a withered hand. And they asked him, “Is it lawful to heal on the Sabbath?”—so that they might accuse him."}],[{"type":"prose","content":"He said to them, "}],[{"type":"prose","content":"Then he said to the man,  And the man stretched it out, and it was restored, healthy like the other."}],[{"type":"prose","content":"But the Pharisees went out and conspired against him, how to destroy him."}],[{"type":"header","content":"God's Chosen Servant"},{"type":"prose","content":"Jesus, aware of this, withdrew from there. And many followed him, and he healed them all"}],[{"type":"prose","content":"and ordered them not to make him known."}],[{"type":"prose","content":"This was to fulfill what was spoken by the prophet Isaiah:"}],[{"type":"header","content":"Blasphemy Against the Holy Spirit"},{"type":"prose","content":"Then a demon-oppressed man who was blind and mute was brought to him, and he healed him, so that the man spoke and saw."}],[{"type":"prose","content":"And all the people were amazed, and said, “Can this be the Son of David?”"}],[{"type":"prose","content":"But when the Pharisees heard it, they said, “It is only by Beelzebul, the prince of demons, that this man casts out demons.”"}],[{"type":"prose","content":"Knowing their thoughts, he said to them, "},{"type":"header","content":"A Tree Is Known by Its Fruit"}],[{"type":"header","content":"The Sign of Jonah"},{"type":"prose","content":"Then some of the scribes and Pharisees answered him, saying, “Teacher, we wish to see a sign from you.”"}],[{"type":"prose","content":"But he answered them, "},{"type":"header","content":"Return of an Unclean Spirit"}],[{"type":"header","content":"Jesus' Mother and Brothers"},{"type":"prose","content":"While he was still speaking to the people, behold, his mother and his brothers stood outside, asking to speak to him."}],[{"type":"prose","content":"But he replied to the man who told him, "}],[{"type":"prose","content":"And stretching out his hand toward his disciples, he said, "}]]