[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And I took unto me faithful witnesses.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That the prophet’s challenge to his gainsayers might be made more emphatic, the setting-up of the tablet is to be formally attested. And the witnesses whom the prophet calls were probably men of high position, among those who had been foremost in advising the alliance with Assyria. Of Uriah or Urijah, the priest, we know that he complied with the king’s desire to introduce an altar after the pattern which he had seen at Damascus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Kings 16:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Of Zechariah we know nothing; but the name was a priestly one (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 24:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and it has been conjectured, from his association with Isaiah, that he may have been the writer of a section of the book that bears the name of a later Zechariah (Zechariah 9-12), which bears traces of being of a much earlier date than the rest of the book. The combination of “Zachariah, son of Jeberechiah” reminds us of Zacharias, the son of Barachias, and points to a priestly family. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the name appears as belonging to the Asaph section of the Levites. A more probable view is that he was identical with the father of the queen then reigning, and was therefore the grandfather of Hezekiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Probably, looking to the prophet’s habit of tracing auguries in names, the two witnesses may have been partly chosen for the significance of those which they bore, Uriah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., “",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Jah is my light,” Zechariah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., “",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Jah will remember,” each of which comes in with a special appropriateness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 8:2-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:2-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I took me faithful witnesses — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Persons of unquestionable reputation, who should bear witness that the following name and prophecy were written and published by me, according to God’s command. It is likely these witnesses signed a copy of the prophecy with their own hands, and dated it according to the time it was declared by the prophet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I went unto the prophetess ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— His own wife, so called, because she was the wife of a prophet, wives being frequently denominated from their husband’s titles. Or possibly she herself might be endowed with the gift of prophecy. Some commentators suppose that Isaiah married another wife on this occasion, and that the witnesses above mentioned were called to attest the matrimonial contract, according to the custom of the Jews. But there are no indications of this, and, as it is certain from the preceding chapter that he already had a wife, the mother of Shear-jashub, it seems highly improbable that he should take another. Others again suppose, that these witnesses, who were persons of rank, “were called on to attend the circumcision of the prophet’s son, and to attest the name by which he was called, as well as the prophecy, confirmed and illustrated by that name.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-8 The prophet is to write on a large roll, or on a metal tablet, words which meant, Make speed to spoil, hasten to the prey: pointing out that the Assyrian army should come with speed, and make great spoil. Very soon the riches of Damascus and of Samaria, cities then secure and formidable, shall be taken away by the king of Assyria. The prophet pleads with the promised Messiah, who should appear in that land in the fulness of time, and, therefore, as God, would preserve it in the mean time. As a gentle brook is an apt emblem of a mild government, so an overflowing torrent represents a conqueror and tyrant. The invader's success was also described by a bird of prey, stretching its wings over the whole land. Those who reject Christ, will find that what they call liberty is the basest slavery. But no enemy shall pluck the believer out of Emmanuel's hand, or deprive him of his heavenly inheritance.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I took unto me faithful witnesses - What was the precise object in calling in these witnesses is not known. Some have supposed that it was to bear testimony to the marriage of the prophet at that time. But it may have been for the purpose of a public record of the prophecy; a record so made, that the precise time when it was delivered could be attested without dispute. The prophecy was an important one; and it was important to know, in the most authentic and undisputed manner, that such a prophecy had been delivered. It is probable that the prophecy, attested by the names of those two men, was suspended in some public place in the temple, so that it might be seen by the people, and allay their fears; and in order to remove from the multitude every suspicion that it was a prophecy after the event. That this was a real, and not a symbolic transaction, is perfectly manifest, not only from the narrative itself, but from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They are called 'faithful,' not off account of their private character, but because their public testimony would be credited by the people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To record - To bear witness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Uriah the priest - This is, doubtless, the same man that is mentioned in 2 Kings 16:10. He was a man of infamous character; the accomplice of Ahaz in corrupting the true religion; but still his testimony might be the more valuable to Ahaz, as he was associated with him in his plans.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Uriah the priest - This is, doubtless, the same man that is mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He was a man of infamous character; the accomplice of Ahaz in corrupting the true religion; but still his testimony might be the more valuable to Ahaz, as he was associated with him in his plans.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And Zechariah ... - It is not certainly known who this was. Perhaps he was one of the Levites whose name is mentioned in 2 Chronicles 29:13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Zechariah ... - It is not certainly known who this was. Perhaps he was one of the Levites whose name is mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 29:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. I took—rather, \"The Lord said to me, that I should take,\" &c. [Maurer].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Uriah—an accomplice of Ahaz in idolatry, and therefore a witness not likely to assist the prophet of God in getting up a prophecy after the event (2Ki 16:10). The witnesses were in order that when the event should come, they might testify that the tablet containing the prophecy had been inscribed with it at the time that it professed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Zechariah—(2Ch 29:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Persons of unquestionable reputation, who should bear witness that the following name and prophecy was written and published by me, according to God’s command. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I took unto me faithful witnesses to record,.... Not his marriage, nor the birth of his son, nor the name he gave him, but the prophecy written in the roll, concerning the spoiling of Syria and Israel, in a very short time; that so, when it came to pass, it might be a clear and certain point that it had been foretold by him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Uriah the priest; of whom mention is made in 2 Kings 16:10 which some object to, because he proved a wicked man, and obeyed the king's command, contrary to the law of God, in building an altar according to the form of one at Damascus; but to this it is replied, that it was before this happened that Isaiah took him to be a witness; and besides, because of the authority of his office, and his familiarity with Ahaz, he must be allowed to be a proper and pertinent person to bear testimony in this case. Some indeed, and so the Jewish commentators, Jarchi, Aben Ezra, Kimchi, and Abarbinel, would have Uriah the prophet meant, who prophesied in the times of Jehoiakim, and was slain by him, Jeremiah 26:20 to which it is objected, that he was no priest, as this was and, besides, was not born at this time; it was a hundred and forty years after that he lived: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Uriah the priest; of whom mention is made in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which some object to, because he proved a wicked man, and obeyed the king's command, contrary to the law of God, in building an altar according to the form of one at Damascus; but to this it is replied, that it was before this happened that Isaiah took him to be a witness; and besides, because of the authority of his office, and his familiarity with Ahaz, he must be allowed to be a proper and pertinent person to bear testimony in this case. Some indeed, and so the Jewish commentators, Jarchi, Aben Ezra, Kimchi, and Abarbinel, would have Uriah the prophet meant, who prophesied in the times of Jehoiakim, and was slain by him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to which it is objected, that he was no priest, as this was and, besides, was not born at this time; it was a hundred and forty years after that he lived: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and Zechariah the son of Jeberechiah; this was Zechariah the prophet, as the Targum, and all the Jewish writers, say (o); who lived in the times of Darius, which was two hundred and forty years after this; but most likely this Zechariah is he who was Ahaz's wife's father, 2 Kings 18:2 or rather, as Vitringa thinks, Zechariah a Levite, a son of Asaph, 2 Chronicles 29:13 though there are some learned men (p), who think the two prophets Uriah and Zechariah are meant, though then unborn; who prophesied of the like or same things as Isaiah did; and so were faithful witnesses of his prophecy, as of the calamities that should come on the land, the restitution of it to its former fruitfulness, and the coming of the Messiah; nor is the observation of Abarbinel to be despised, taken from the ancient Jews, that these are the words, not of the prophet, but of God himself; as also that they are to be read in the future tense, \"and I will take to me\", &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Zechariah the son of Jeberechiah; this was Zechariah the prophet, as the Targum, and all the Jewish writers, say (o); who lived in the times of Darius, which was two hundred and forty years after this; but most likely this Zechariah is he who was Ahaz's wife's father, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or rather, as Vitringa thinks, Zechariah a Levite, a son of Asaph, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 29:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though there are some learned men (p), who think the two prophets Uriah and Zechariah are meant, though then unborn; who prophesied of the like or same things as Isaiah did; and so were faithful witnesses of his prophecy, as of the calamities that should come on the land, the restitution of it to its former fruitfulness, and the coming of the Messiah; nor is the observation of Abarbinel to be despised, taken from the ancient Jews, that these are the words, not of the prophet, but of God himself; as also that they are to be read in the future tense, \"and I will take to me\", &c. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) T. Bab. Maccot, fol. 24. 2.((p) Cocceius, Witsius, Miscel. Sacr. tom. 1. l. 1. c. 20. sect. 8, 9, 10. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) T. Bab. Maccot, fol. 24. 2.((p) Cocceius, Witsius, Miscel. Sacr. tom. 1. l. 1. c. 20. sect. 8, 9, 10. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I took to me {c} faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I took to me ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " faithful witnesses to record, Uriah the priest, and Zechariah the son of Jeberechiah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Because the thing was of great importance, he took these two witnesses, who were of credit with the people, when he set this up upon the door of the temple, even though Uriah was a flattering hypocrite, 2Ki 16:11.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I took",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebr. pointing gives ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and I will take",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (as in R.V.). The speaker is still Jehovah. The LXX. and other old versions have the imperative (“and take for me”) which, as addressed to the prophet, reads more naturally. Uriah the priest is mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; Zechariah is unknown, although the name occurs in the nearly contemporary notices of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He has even been identified, somewhat rashly, with the author of Zechariah 9-11 on the ground of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is not to be inferred that the two men were intimate friends of Isaiah, still less that they belonged to the band of his disciples (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 8:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); they are called to witness simply as responsible public persons, trusted by the people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And I took unto me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and I will have taken for me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is still God who is speaking. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Uriah the priest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Probably the high priest of the time, mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 16:10-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the ready tool of Ahaz at a later date. Though a bad man, he may have been a trustworthy witness to a fact. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Zechariah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Perhaps the father of Abi or Abijah, Ahaz's queen (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It would serve to call public attention still more to the tablet, if it bore the names of two such eminent persons as witnesses. Isaiah 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the midst of the Syro-Ephraimitish war, which was not yet at an end, Isaiah received instructions from God to perform a singular prophetic action. \"Then Jehovah said to me, Take a large slab, and write upon it with common strokes, 'In Speed Spoil, Booty hastens;' and I will take to me trustworthy witnesses, Uriyah the priest, and Zecharyahu the son of Yeberechyahu.\" The slab or table (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same word is used to signify a metal mirror) was to be large, to produce the impression of a monument; and the writing upon it was to be \"a man's pen\" (Cheret 'enōsh), i.e., written in the vulgar, and, so to speak, popular character, consisting of inartistic strokes that could be easily read (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Philip d'Aquin, in his Lexicon, adopts the explanation, \"Enosh-writing, i.e., hieroglyphic writing, so called because it was first introduced in the time of Enosh.\" Luzzatto renders it, a lettere cubitali; but the reading for this would be b'cheret ammath 'ish. The only true rendering is stylo vulgari (see Ges. Thes. s.v. 'enosh). The words to be written are introduced with Lamed, to indicate dedication (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or the object to which the inscription was dedicated or applied, as if it read, \"A table devoted to 'Spoil very quickly, booty hastens;' \" unless, indeed, l'mahēr is to be taken as a fut. instans, as it is by Luzzatto - after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - in the sense of acceleratura sunt spolia, or (what the position of the words might more naturally suggest) with mahēr in a transitive sense, as in the construction לבערּ היה, and others, accelerationi spolia, i.e., they are ready for hastening. Most of the commentators have confused the matter here by taking the words as a proper name (Ewald, 288, c), which they were not at first, though they became so afterwards. At first they were an oracular announcement of the immediate future, accelerant spolia, festinat praeda (spoil is quick, booty hastens). Spoil; booty; but who would the vanquished be? Jehovah knew, and His prophet knew, although not initiated into the policy of Ahaz. But their knowledge was studiously veiled in enigmas. For the writing was not to disclose anything to the people. It was simply to serve as a public record of the fact, that the course of events was one that Jehovah had foreseen and indicated beforehand. And when what was written upon the table should afterwards take place, they would know that it was the fulfilment of what had already been written, and therefore was an event pre-determined by God. For this reason Jehovah took to Himself witnesses. There is no necessity to read ואעידה (and I had it witnessed), as Knobel and others do; nor והעידה (and have it witnessed), as the Sept., Targum, Syriac, and Hitzig do. Jehovah said what He would do; and the prophet knew, without requiring to be told, that it was to be accomplished instrumentally through him. Uriah was no doubt the priest (Urijah), who afterwards placed himself at the service of Ahaz to gratify his heathenish desires (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 16:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Zechariah ben Yeberechyahu (Berechiah) was of course not the prophet of the times after the captivity, but possibly the Asaphite mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He is not further known to us. In good editions, ben is not followed by makkeph, but marked with mercha, according to the Masora at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These two men were reliable witnesses, being persons of great distinction, and their testimony would weigh with the people. When the time should arrive that the history of their own times solved the riddle of this inscription, these two men were to tell the people how long ago the prophet had written that down in his prophetic capacity. ",
        "children": []
      }
    ]
  }
]