[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The stretching out of his wings.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The metaphor within a metaphor is quite after the manner of Isaiah. The armies of Assyria are like a river in flood; the outspread waters on either side of the main stream are like the expanded wings of a great bird sweeping down on its prey.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall fill the breadth of thy land, O Immanuel.—The prophet has not forgotten, however, the nomen et omen of the earthly child, now growing towards the time when he would be able to “choose the good and refuse the evil.” The land over which the flood sweeps belongs to Him who is, in very deed, “God with us.” In Psalm 46:1-4 we have the prophecy turned into a hymn, or, less probably, the hymn which was the germ of the prophecy. The parallelism, in any case, is so clear as to make it certain that the two were contemporary, and refer to the same events. The same may be said, perhaps, of all the psalms of the sons of Korah. The hope of the psalmist fastens on the thought, “the Lord of hosts is with us” (Psalm 46:7; Psalm 46:11).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall fill the breadth of thy land, O Immanuel.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The prophet has not forgotten, however, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "nomen et omen ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the earthly child, now growing towards the time when he would be able to “choose the good and refuse the evil.” The land over which the flood sweeps belongs to Him who is, in very deed, “God with us.” In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we have the prophecy turned into a hymn, or, less probably, the hymn which was the germ of the prophecy. The parallelism, in any case, is so clear as to make it certain that the two were contemporary, and refer to the same events. The same may be said, perhaps, of all the psalms of the sons of Korah. The hope of the psalmist fastens on the thought, “the Lord of hosts is ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "with us”",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-8 The prophet is to write on a large roll, or on a metal tablet, words which meant, Make speed to spoil, hasten to the prey: pointing out that the Assyrian army should come with speed, and make great spoil. Very soon the riches of Damascus and of Samaria, cities then secure and formidable, shall be taken away by the king of Assyria. The prophet pleads with the promised Messiah, who should appear in that land in the fulness of time, and, therefore, as God, would preserve it in the mean time. As a gentle brook is an apt emblem of a mild government, so an overflowing torrent represents a conqueror and tyrant. The invader's success was also described by a bird of prey, stretching its wings over the whole land. Those who reject Christ, will find that what they call liberty is the basest slavery. But no enemy shall pluck the believer out of Emmanuel's hand, or deprive him of his heavenly inheritance.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He shall ... - That is, the Assyrians - though still retaining the idea of an overflowing stream, or a deluge of waters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Reach even to the neck - Chaldee, 'They shall come even to Jerusalem.' 'The prophet compares Jerusalem here,' says Kimchi, 'to the head of the human body. As when the waters reach to the neck of a man, he is very near drowning, so here, the prophet intimates that the whole land would be deluged, and that it would be nearly utterly destroyed.' The figure thus understood is a very sublime one Jerusalem was situated on hills - elevated above the surrounding country, and, in reference to the whole land, might be aptly compared to the human head. Thus, Josephus (De Bello, lib. iii. ch. ii.), describing Jerusalem, says - Ἱεροσόλυμα προανίσχουσα τῆς περιοίκου πάσης, ὥσπερ ἡ κεφαλὴ σώματος  Hierosoluma proanischousa tēs perioikou pasēs, hōsper hē kephalē sōmatos - \"Jerusalem, eminent above all the surrounding region, as the head of the body.\" The country is represented as being laid under water - a vast sea of rolling and tumultuous waves - with Jerusalem alone rising above them, standing in solitary grandeur amidst the heaving ocean, and itself in danger each moment of being ingulphed; see a similar figure, Isaiah 30:28 :",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Reach even to the neck - Chaldee, 'They shall come even to Jerusalem.' 'The prophet compares Jerusalem here,' says Kimchi, 'to the head of the human body. As when the waters reach to the neck of a man, he is very near drowning, so here, the prophet intimates that the whole land would be deluged, and that it would be nearly utterly destroyed.' The figure thus understood is a very sublime one Jerusalem was situated on hills - elevated above the surrounding country, and, in reference to the whole land, might be aptly compared to the human head. Thus, Josephus (De Bello, lib. iii. ch. ii.), describing Jerusalem, says - Ἱεροσόλυμα προανίσχουσα τῆς περιοίκου πάσης, ὥσπερ ἡ κεφαλὴ σώματος  Hierosoluma proanischousa tēs perioikou pasēs, hōsper hē kephalē sōmatos - \"Jerusalem, eminent above all the surrounding region, as the head of the body.\" The country is represented as being laid under water - a vast sea of rolling and tumultuous waves - with Jerusalem alone rising above them, standing in solitary grandeur amidst the heaving ocean, and itself in danger each moment of being ingulphed; see a similar figure, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He is spirit is like a torrent overflowing",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It shall reach to the middle of the neck.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And so also, Habakkuk 3:13 :",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And so also, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou didst go forth for the salvation of thy people,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the salvation of thine anointed:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou didst smite the head from the house of the wicked,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Destroying the foundation even to the neck.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the stretching out of his wings - This is a continuation of the same idea under a new figure. The term wings is often applied to an army, as well in modern as in ancient writings. It denotes that the invading army would be so vast as, when expanded or drawn out, to fill the land.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall fill the breadth - Shall occupy the entire land, so that there shall be no city or town which he shall not invade.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thy land, O Immanuel - see the note at Isaiah 7:14. If this be understood as referring to the son of Isaiah that was to be born, then it means that the child was given as a pledge that the land would be safe from the threatened invasion. It was natural, therefore, to address the child in that manner; as reminding the prophet that this land, which was about to be invaded, belonged to God, and was yet under his protection. Its meaning may be thus paraphrased: 'O thou who art a pledge of the protection of God - whose birth is an assurance that the land is under his care, and who art given as such a sign to the nation. Notwithstanding this pledge, the land shall be full of foes. They shall spread through every part and endanger all.' Yet the name, the circumstances of the birth, the promise at that time, would all remind the prophet and the king, that, notwithstanding this, the land would be still under the protection of God. If the language be understood as referring to the future Messiah, and as an address made to him then, by calling the land his land, it is intimated that it could not be brought to utter desolation, nor could the country where he was to be born remain wasted and ruined. It would be indeed invaded; the armies of the Assyrian would spread over it, but still it was the land of Immanuel; and was to be the place of his birth, and it was to be secure until the time should arrive for him to come. The probability is, I think, that the address is here solely to the Messiah; and that the purpose of God is to fix the mind of the prophet on the fact that the Messiah must come, as an assurance that the land could not be wholly and perpetually desolate; see the notes at Isaiah 7:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thy land, O Immanuel - see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". If this be understood as referring to the son of Isaiah that was to be born, then it means that the child was given as a pledge that the land would be safe from the threatened invasion. It was natural, therefore, to address the child in that manner; as reminding the prophet that this land, which was about to be invaded, belonged to God, and was yet under his protection. Its meaning may be thus paraphrased: 'O thou who art a pledge of the protection of God - whose birth is an assurance that the land is under his care, and who art given as such a sign to the nation. Notwithstanding this pledge, the land shall be full of foes. They shall spread through every part and endanger all.' Yet the name, the circumstances of the birth, the promise at that time, would all remind the prophet and the king, that, notwithstanding this, the land would be still under the protection of God. If the language be understood as referring to the future Messiah, and as an address made to him then, by calling the land his land, it is intimated that it could not be brought to utter desolation, nor could the country where he was to be born remain wasted and ruined. It would be indeed invaded; the armies of the Assyrian would spread over it, but still it was the land of Immanuel; and was to be the place of his birth, and it was to be secure until the time should arrive for him to come. The probability is, I think, that the address is here solely to the Messiah; and that the purpose of God is to fix the mind of the prophet on the fact that the Messiah must come, as an assurance that the land could not be wholly and perpetually desolate; see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. pass through—The flood shall not stop at Syria and Samaria, but shall penetrate into Judea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the neck—When the waters reach to the neck, a man is near drowning; still the head is not said to be overflowed. Jerusalem, elevated on hills, is the head. The danger shall be so imminent as to reach near it at Sennacherib's invasion in Hezekiah's reign; but it shall be spared (Isa 30:28).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wings—the extreme bands of the Assyrian armies, fulfilled (Isa 36:1; 37:25).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thy land, O Immanuel—Though temporarily applied to Isaiah's son, in the full sense this is applicable only to Messiah, that Judea is His, was, and still is, a pledge that, however sorely overwhelmed, it shall be saved at last; the \"head\" is safe even now, waiting for the times of restoration (Ac 1:6); at the same time these words imply that, notwithstanding the temporary deliverance from Syria and Israel, implied in \"Immanuel,\" the greatest calamities are to follow to Judah.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to wit, the river, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 8:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " which yet designs the same person and thing, to wit, the invasion of the king of Assyria. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall pass through Judah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and when he shall have finished his work against you, he shall invade the land of Judah, as Sennacherib did some few years after his conquest of Samaria, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 18:9,13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall reach even to the neck; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so as they shall be in great danger of being drowned or destroyed. He persists in the metaphor of a river swelling so high as to reach to a man’s neck, and be ready to overwhelm him. Such was the danger of Judah’s land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "when Sennacherib took all the fenced cities of Judah, 2 Kings 18:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "when Sennacherib took all the fenced cities of Judah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and sent his army against Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of his wings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of his forces, or of the wings of his army, as they anciently were and still are called. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of thy land, O Immanuel; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the land of Judah, so called because the Messiah, who is called by God himself Immanuel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", should certainly be born, and live, and die there. And this is added emphatically for the consolation of God’s people, to assure them, that notwithstanding this dreadful scourge, yet God would make a difference between Israel and Judah; and whereas Israel should be so broken by the Assyrian, that they should not be a people, as was threatened, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 7:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", Judah should be restored and preserved, for the sake of the Messiah, to be the place of his birth and ministry, according to that famous prophecy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 49:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he shall pass through Judah,.... That is, the king of Assyria, compared to a river of mighty waters; who should not only run over and possess the land of Israel, or the ten tribes, but should enter into Judea, and pass through it, as a chastisement for not trusting in the Lord, but sending to Assyria for help; who instead of helping, distressed them in the times of Ahaz, even Tilgathpilneser king of Assyria, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall overflow, and go over; the whole land of Judea, as Sennacherib king of Assyria did in Hezekiah's time: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall reach even to the neck; that is, to Jerusalem: the whole land is compared to a body, of which Jerusalem was the head; the Assyrian army, comparable to the waters of a great river, overflowed the whole land, took all the fenced cities of Judah, and came up even to Jerusalem, so that the whole was in great danger of being drowned and destroyed; as a man is, when the waters are come up to his neck; see 2 Kings 18:13, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he shall reach even to the neck; that is, to Jerusalem: the whole land is compared to a body, of which Jerusalem was the head; the Assyrian army, comparable to the waters of a great river, overflowed the whole land, took all the fenced cities of Judah, and came up even to Jerusalem, so that the whole was in great danger of being drowned and destroyed; as a man is, when the waters are come up to his neck; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the stretching out of his wings, the wings of the Assyrian army, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall fill the breadth of thy land, O Immanuel; Judea, called Immanuel's land, because he was to be born there, and converse and die there; and this is particularly mentioned, to show that, though this land should be overrun by the Assyrians, yet not destroyed, until Immanuel, the son of the virgin, was born here. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and he shall pass through the land of the house of Judah as an overflowing torrent, unto Jerusalem shall he come; and the people of his army shall fill the breadth of thy land, O Immanuel.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"and he shall pass through the land of the house of Judah as an overflowing torrent, unto Jerusalem shall he come; and the people of his army shall fill the breadth of thy land, O Immanuel.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he shall pass through Judah; he shall overflow and go over, he shall reach even to the {i} neck; and the spread of his wings shall fill the breadth of thy land, O {k} Immanuel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he shall pass through Judah; he shall overflow and go over, he shall reach ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " neck; and the spread of his wings shall fill the breadth of thy land, O ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Immanuel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) It will be ready to drown them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) He speaks this to Messiah, or Christ, in whom the faithful were comforted and who would not suffer his Church to be destroyed utterly.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he shall pass through Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better as R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he shall sweep onward into Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "overflow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go over",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are rightly taken as synonyms (not as R.V.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall reach even to the neck",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Judah is in the utmost extremity of danger, yet is not wholly submerged.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall fill … land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. “shall be the filling (as in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the breadth of thy land.” “Wings” cannot mean “masses of water branching off from the main current”; nor is there any evidence that the Hebrews spoke of the “wings” of an army, as we do. The figure of the deluge seems abruptly changed to that of a huge bird of prey, overshadowing the whole land with its extended wings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of thy land, O Immanuel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Without any change of the original consonantal text we might read, as at the end of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 8:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", “… of the land. For with us is God!” The change is perhaps not imperatively required even if Immanuel be an ordinary child; whereas, on the view that he is the Messiah, the apostrophe becomes natural. Still there remains a suspicion that the last part may be a gloss introduced from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 8:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he shall pass through Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " pass on ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "into Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (\"He shall sweep onward into Judah,\" Revised Version). The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Assyrians",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " will not be content with invading Syria and Samaria; they will \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pass",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on into Judaea.\" It is not clear whether this is to be done immediately by ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Tiglath-Pileser",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or by one of his successors at a later date. There is reason to believe from Tiglath-Pileser's inscriptions that he used the territory of Ahaz for the passage of his armies as those of a vassal king, but did not ravage them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He shall reach even to the neck",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Assyrian attacks on Judaea shall stop short of destroying it. The flood shall not submerge the head, but only rise as high as the neck. This prophecy was fulfilled, since it was not Assyria, but Babylon, which destroyed the Jewish kingdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The stretching out of his wings shall fill the breadth of thy land.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Assyrian armies shall visit every part of the land. The sudden change of metaphor is in the manner of Isaiah (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:30, 31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:24, 30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O Immanuel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the importance of this address, as indicating the kingly, and so (probably) the Divine character of Immanuel, see the notes on Isaiah 7:14. Isaiah could not speak of the land as belonging to his own infant son. Isaiah 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Not till then would this overflowing reach as far as Judah, but then it would do so most certainly and incessantly.\"And presses forward into Judah, overflows and pours onward, till it reaches to the neck, and the spreading out of its wings fill the breadth of thy land, Immanuel.\" The fate of Judah would be different from that of Ephraim. Ephraim would be laid completely under water by the river, i.e., would be utterly destroyed. And in Judah the stream, as it rushed forward, would reach the most dangerous height; but if a deliverer could be found, there was still a possibility of its being saved. Such a deliverer was Immanuel, whom the prophet sees in the light of the Spirit living through all the Assyrian calamities. The prophet appeals complainingly to him that the land, which is his land, is almost swallowed up by the world-power: the spreadings out (muttoth, a hophal noun: for similar substantive forms, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and more especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 66:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the wings of the stream (i.e., of the large bodies of water pouring out on both sides from the main stream, as from the trunk, and covering the land like two broad wings) have filled the whole land. According to Norzi, Immanul is to be written here as one word, as it is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the correct reading is Immân El, with mercha silluk (see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though it does not therefore cease to be a proper name. As Jerome observes, it is nomen proprium, non interpretatum; and so it is rendered in the Sept., Μεθ ̓ ἡμῶν ὁ Θεός. ",
        "children": []
      }
    ]
  }
]