[{"num":15,"verse":"2 The offering which the Israelites should offer when they came into the land of Canaan.  32 The punishment of him that brake the Sabbath."},{"num":1,"verse":"And the Lord spake unto Moses, saying,"},{"num":2,"verse":"Speak unto the children of Israel, and say unto them, When ye be come into the land of your habitations which I give unto you,"},{"num":3,"verse":"And will make an offering by fire unto the Lord, a burnt offering or a sacrifice to fulfill a vow, or a free offering, or in your feasts to make a sweet savor unto the Lord, of the herd or of the flock,"},{"num":4,"verse":"Then let him that offereth his offering unto the Lord, bring a meat offering of a tenth deal of fine flour, mingled with the fourth part of an Hin of oil."},{"num":5,"verse":"Also thou shalt prepare the fourth part of an Hin of wine to be poured on a lamb appointed for the burnt offering, or any offering."},{"num":6,"verse":"And for a ram thou shalt for a meat offering, prepare two tenth deals of fine flour, mingled with the third part of an Hin of oil."},{"num":7,"verse":"And for a drink offering thou shalt offer the third part of an Hin of wine, for a sweet savor unto the Lord."},{"num":8,"verse":"And when thou preparest a bullock for a burnt offering, or for a sacrifice to fulfill a vow or a peace offering to the Lord,"},{"num":9,"verse":"Then let him offer with the bullock a meat offering of three tenth deals of fine flour, mingled with half an Hin of oil."},{"num":10,"verse":"And thou shalt bring for a drink offering half an Hin of wine, for an offering made by fire of a sweet savor unto the Lord."},{"num":11,"verse":"Thus shall it be done for a bullock, or for a ram, or for a lamb, or for a kid."},{"num":12,"verse":"According to the number that ye prepare to offer, so shall ye do to everyone according to their number."},{"num":13,"verse":"All that are born of the country, shall do these things thus, to offer an offering made by fire of sweet savor unto the Lord."},{"num":14,"verse":"And if a stranger sojourn with you, or whosoever be among you in your generations, and will make an offering by fire of a sweet savor unto the Lord, as ye do, so he shall do."},{"num":15,"verse":"One ordinance shall be both for you of the Congregation, and also for the stranger that dwelleth with you, even an ordinance forever in your generations: as you are, so shall the stranger be before the Lord."},{"num":16,"verse":"One law and one manner shall serve both for you and for the stranger that sojourneth with you."},{"num":17,"verse":"¶ And the Lord spake unto Moses, saying,"},{"num":18,"verse":"Speak unto the children of Israel, and say unto them, When ye be come into the land, to the which I bring you,"},{"num":19,"verse":"And when ye shall eat of the bread of the land, ye shall offer an heave offering unto the Lord."},{"num":20,"verse":"Ye shall offer up a cake of the first of your dough for an heave offering: as the heave offering of the barn, so ye shall lift it up."},{"num":21,"verse":"Of the first of your dough ye shall give unto the Lord an heave offering in your generations."},{"num":22,"verse":"And if ye have erred, and not observed all these commandments, which the Lord hath spoken unto Moses,"},{"num":23,"verse":"Even all that the Lord hath commanded you by the hand of Moses, from the first day that the Lord commanded Moses, and hence forward among your generations:"},{"num":24,"verse":"And if so be that ought be committed ignorantly of the Congregation, then all the Congregation shall give a bullock for a burnt offering, for a sweet savor unto the Lord, with the meat offering and drink offering thereto, according to the manner, and an he goat for a sin offering."},{"num":25,"verse":"And the Priest shall make an atonement for all the Congregation of the children of Israel, and it shall be forgiven them: for it is ignorance: and they shall bring their offering for an offering made by fire unto the Lord, and their sin offering before the Lord for their ignorance."},{"num":26,"verse":"Then shall be forgiven all the Congregation of the children of Israel, and the stranger that dwelleth among them: for all the people were in ignorance."},{"num":27,"verse":"¶ But if any one person sin through ignorance, then he shall bring a she goat of a year old for a sin offering."},{"num":28,"verse":"And the Priest shall make an atonement for the ignorant person, when he sinneth by ignorance before the Lord, to make reconciliation for him: and it shall be forgiven him."},{"num":29,"verse":"He that is born among the children of Israel, and the stranger that dwelleth among them, shall have both one law, who so doth sin by ignorance."},{"num":30,"verse":"¶ But the person that doeth ought presumptuously, whether he be born in the land, or a stranger, the same blasphemeth the Lord: therefore that person shall be cut off from among his people,"},{"num":31,"verse":"Because he hath despised the word of the Lord, and hath broken his commandment: that person shall be utterly cut off: his iniquity shall be upon him."},{"num":32,"verse":"¶ And while the children of Israel were in the wilderness, they found a man that gathered sticks upon the Sabbath day."},{"num":33,"verse":"And they that found him gathering sticks, brought him unto Moses and to Aaron, and unto all the Congregation,"},{"num":34,"verse":"And they put him ward: for it was not declared what should be done unto him."},{"num":35,"verse":"Then the Lord said unto Moses, This man shall die the death: and let all the multitude stone him with stones without the host."},{"num":36,"verse":"And all the Congregation brought him without the host, and stoned him with stones, and he died, as the Lord had commanded Moses."},{"num":37,"verse":"¶ And the Lord spake unto Moses, saying,"},{"num":38,"verse":"Speak unto the children of Israel, and bid them that they make them fringes upon the borders of their garments throughout their generations, and put upon the fringes of the borders a ribbon of blue silk."},{"num":39,"verse":"And ye shall have the fringes that when ye look upon them, ye may remember all the commandments of the Lord, and do them: and that ye seek not after your own heart, nor after your own eyes, after the which ye go a whoring;"},{"num":40,"verse":"That ye may remember and do all my commandments, and be holy unto your God."},{"num":41,"verse":"I am the Lord your God, which brought you out of the land of Egypt to be your God: I am the Lord your God."}]