[{"num":15,"verse":"¶ And the LORD spoke unto Moses, saying,"},{"num":2,"verse":"Speak unto the sons of Israel and say unto them, When you have entered into the land of your habitations, which I give unto you"},{"num":3,"verse":"and will make an offering on fire unto the LORD, a burnt offering or a sacrifice, to offer a vow or of your free will or to make in your solemn feasts an acceptable savour unto the LORD, of the cows, or of the sheep,"},{"num":4,"verse":"then he that offers his offering unto the LORD shall bring a present of a tenth deal of flour mingled with the fourth part of a hin of oil;"},{"num":5,"verse":"and of wine for a drink offering shalt thou offer the fourth part of a hin in addition to the burnt offering or the sacrifice, for each lamb."},{"num":6,"verse":"And for each ram, thou shalt prepare as a present two tenth deals of flour mingled with the third part of a hin of oil;"},{"num":7,"verse":"and of wine for a drink offering thou shalt offer the third part of a hin, for an acceptable savour unto the LORD."},{"num":8,"verse":"And when thou preparest a bullock for a burnt offering or for a sacrifice, to offer a vow or a sacrifice of peace unto the LORD,"},{"num":9,"verse":"thou shalt offer with the bullock a present of three tenth deals of flour mingled with half of a hin of oil;"},{"num":10,"verse":"and of wine for a drink offering thou shalt offer half of a hin, for an offering on fire, of an acceptable savour unto the LORD."},{"num":11,"verse":"Thus shall it be done for each bullock or for each ram or for each lamb, the same for sheep as for goats."},{"num":12,"verse":"According to the number that ye shall prepare, so shall ye do to each one according to their number."},{"num":13,"verse":"All that are natural born shall do these things after this manner, to offer an offering on fire, of an acceptable savour unto the LORD."},{"num":14,"verse":"And when a stranger sojourns with you or whoever is among you, for your ages, if they will offer an offering on fire of an acceptable savour unto the LORD; as ye do, so he shall do."},{"num":15,"verse":"One statute shall be both for you of the congregation and also for the stranger that sojourns with you, a perpetual statute, for your ages; as ye are, so shall the stranger be before the LORD."},{"num":16,"verse":"One same law and the same right shall be for you and for the stranger that sojourns with you."},{"num":17,"verse":"The LORD also spoke unto Moses, saying,"},{"num":18,"verse":"Speak unto the sons of Israel and say unto them, When ye have come into the land where I bring you,"},{"num":19,"verse":"then it shall be that when ye begin to eat of the bread of the land, ye shall offer up an offering unto the LORD."},{"num":20,"verse":"Ye shall offer up a cake of the first of your dough for an offering; as the offering of the threshingfloor, so shall ye offer it."},{"num":21,"verse":"Of the firstfruits of your dough ye shall give unto the LORD an offering in your generations."},{"num":22,"verse":"¶ And when ye err and do not observe all these commandments which the LORD has spoken unto Moses,"},{"num":23,"verse":"even all that the LORD has commanded you by the hand of Moses, from the day that the LORD commanded Moses and from then on, for your ages,"},{"num":24,"verse":"then it shall be, if the sin was committed by ignorance without the knowledge of the congregation, that all the congregation shall offer one young bullock as a burnt offering, for an acceptable savour unto the LORD with its present and its drink offering, according to the law, and one he goat as the sin."},{"num":25,"verse":"And the priest shall reconcile all the congregation of the sons of Israel, and it shall be forgiven them, for it is ignorance; and they shall bring their offering, an offering on fire unto the LORD and their sins before the LORD which they committed in their ignorance."},{"num":26,"verse":"And it shall be forgiven all the congregation of the sons of Israel and the stranger that sojourns among them, seeing all the people were in ignorance."},{"num":27,"verse":"And if any person sins through ignorance, then he shall bring a she goat of the first year as the sin."},{"num":28,"verse":"And the priest shall reconcile the soul that errs ignorantly, when he sins by ignorance before the LORD, he shall be reconciled; and it shall be forgiven him."},{"num":29,"verse":"Ye shall have the same law for the one that sins through ignorance, both for the natural born among the sons of Israel and for the stranger that sojourns among them."},{"num":30,"verse":"¶ But the person that does something consciously, whether they are natural born or a stranger, the same reproaches the LORD; and that soul shall be cut off from among his people."},{"num":31,"verse":"Because he has despised the word of the LORD and has made void his commandment, that person shall utterly be cut off; his iniquity shall be upon him."},{"num":32,"verse":"And while the sons of Israel were in the wilderness, they found a man that gathered firewood upon the sabbath day."},{"num":33,"verse":"And those that found him gathering firewood brought him unto Moses and Aaron and unto all the congregation."},{"num":34,"verse":"And they put him in ward because it was not declared what should be done to him."},{"num":35,"verse":"And the LORD said unto Moses, The man shall be surely put to death; all the congregation shall stone him with stones outside the camp."},{"num":36,"verse":"Then all the congregation brought him outside the camp and stoned him with stones, and he died, as the LORD commanded Moses."},{"num":37,"verse":"¶ And the LORD spoke unto Moses, saying,"},{"num":38,"verse":"Speak unto the sons of Israel and bid them that they make for themselves fringes in the borders of their garments throughout their generations and that they put upon the fringe of the borders a ribband of blue."},{"num":39,"verse":"And it shall be unto you for a fringe that ye may look upon it and remember all the commandments of the LORD and do them and that ye seek not after your own heart and your own eyes, seeking after which ye fornicate."},{"num":40,"verse":"That ye may remember, and do all my commandments, and be holy unto your God."},{"num":41,"verse":"I am the LORD your God, who brought you out of the land of Egypt, to be your God. I AM your God."}]