[[],[{"type":"prose","content":"And Jehovah speaketh unto Moses, saying,"}],[{"type":"prose","content":"`Speak unto the sons of Israel, and thou hast said unto them, When ye come in unto the land of your dwellings, which I am giving to you,"}],[{"type":"prose","content":"then ye have prepared a fire-offering to Jehovah, a burnt-offering, or a sacrifice, at separating a vow or free-will-offering, or in your appointed things, to make a sweet fragrance to Jehovah, out of the herd, or out of the flock."}],[{"type":"prose","content":"`And he who is bringing near his offering to Jehovah hath brought near a present of flour, a tenth deal, mixed with a fourth of the hin of oil;"}],[{"type":"prose","content":"and wine for a libation, a fourth of the hin thou dost prepare for the burnt-offering or for a sacrifice, for the one lamb;"}],[{"type":"prose","content":"or for a ram thou dost prepare a present of flour, two-tenth deals, mixed with oil, a third of the hin;"}],[{"type":"prose","content":"and wine for a libation, a third part of the hin, thou dost bring near -- a sweet fragrance to Jehovah."}],[{"type":"prose","content":"`And when thou makest a son of the herd a burnt-offering or a sacrifice, at separating a vow or peace-offerings to Jehovah,"}],[{"type":"prose","content":"then he hath brought near for the son of the herd a present of flour, three-tenth deals, mixed with oil, a half of the hin;"}],[{"type":"prose","content":"and wine thou bringest near for a libation, a half of the hin -- a fire-offering of sweet fragrance to Jehovah;"}],[{"type":"prose","content":"thus it is done for the one ox, or for the one ram, or for a lamb of the sheep or of the goats."}],[{"type":"prose","content":"`According to the number that ye prepare, so ye do to each, according to their number;"}],[{"type":"prose","content":"every native doth thus with these, at bringing near a fire-offering of sweet fragrance to Jehovah;"}],[{"type":"prose","content":"and when a sojourner sojourneth with you, or whoso [is] in your midst to your generations, and he hath made a fire-offering of sweet fragrance to Jehovah, as ye do so he doth."}],[{"type":"prose","content":"`One statute is for you of the congregation and for the sojourner who is sojourning, a statute age-during to your generations: as ye [are] so is the sojourner before Jehovah;"}],[{"type":"prose","content":"one law and one ordinance is to you and to the sojourner who is sojourning with you.'"}],[{"type":"prose","content":"And Jehovah speaketh unto Moses, saying,"}],[{"type":"prose","content":"`Speak unto the sons of Israel, and thou hast said unto them, In your coming in unto the land whither I am bringing you in,"}],[{"type":"prose","content":"then it hath been, in your eating of the bread of the land, ye heave up a heave-offering to Jehovah;"}],[{"type":"prose","content":"the beginning of your dough a cake ye heave up -- a heave-offering; as the heave-offering of a threshing-floor, so ye do heave it."}],[{"type":"prose","content":"Of the beginning of your dough ye do give to Jehovah a heave-offering -- to your generations."}],[{"type":"prose","content":"`And when ye err, and do not all these commands which Jehovah hath spoken unto Moses,"}],[{"type":"prose","content":"the whole that Jehovah hath charged upon you by the hand of Moses, from the day that Jehovah hath commanded, and henceforth, to your generations,"}],[{"type":"prose","content":"then it hath been, if from the eyes of the company it hath been done in ignorance, that all the company have prepared one bullock, a son of the herd, for a burnt-offering, for sweet fragrance to Jehovah, and its present, and its libation, according to the ordinance, and one kid of the goats for a sin-offering."}],[{"type":"prose","content":"`And the priest hath made atonement for all the company of the sons of Israel, and it hath been forgiven them, for it [is] ignorance, and they -- they have brought in their offering, a fire-offering to Jehovah, even their sin-offering before Jehovah for their ignorance;"}],[{"type":"prose","content":"and it hath been forgiven to all the company of the sons of Israel, and to the sojourner who is sojourning in their midst; for to all the company [it is done] in ignorance."}],[{"type":"prose","content":"`And if one person sin in ignorance, then he hath brought near a she-goat, daughter of a year, for a sin-offering;"}],[{"type":"prose","content":"and the priest hath made atonement for the person who is erring, in his sinning in ignorance before Jehovah, by making atonement for him, and it hath been forgiven him;"}],[{"type":"prose","content":"for the native among the sons of Israel, and for the sojourner who is sojourning in their midst -- one law is to you, for him who is doing [anything] through ignorance."}],[{"type":"prose","content":"`And the person who doth [aught] with a high hand -- of the native or of the sojourner -- Jehovah he is reviling, and that person hath been cut off from the midst of his people;"}],[{"type":"prose","content":"because the word of Jehovah he despised, and His command hath broken -- that person is certainly cut off; his iniquity [is] on him.'"}],[{"type":"prose","content":"And the sons of Israel are in the wilderness, and they find a man gathering wood on the sabbath-day,"}],[{"type":"prose","content":"and those finding him gathering wood bring him near unto Moses, and unto Aaron, and unto all the company,"}],[{"type":"prose","content":"and they place him in ward, for it [is] not explained what is [to be] done to him."}],[{"type":"prose","content":"And Jehovah saith unto Moses, `The man is certainly put to death, all the company stoning him with stones, at the outside of the camp.'"}],[{"type":"prose","content":"And all the company bring him out unto the outside of the camp, and stone him with stones, and he dieth, as Jehovah hath commanded Moses."}],[{"type":"prose","content":"And Jehovah speaketh unto Moses, saying,"}],[{"type":"prose","content":"`Speak unto the sons of Israel, and thou hast said unto them, and they have made for themselves fringes on the skirts of their garments, to their generations, and they have put on the fringe of the skirt a ribbon of blue,"}],[{"type":"prose","content":"and it hath been to you for a fringe, and ye have seen it, and have remembered all the commands of Jehovah, and have done them, and ye search not after your heart, and after your eyes, after which ye are going a-whoring;"}],[{"type":"prose","content":"so that ye remember and have done all My commands, and ye have been holy to your God;"}],[{"type":"prose","content":"I [am] Jehovah your God, who hath brought you out from the land of Egypt to become your God; I, Jehovah, [am] your God.'"}]]