[{"num":11,"verse":"But King Solomon [defiantly] loved many foreign women—the daughter of Pharaoh, women of the Moabites, Ammonites, Edomites, Sidonians, and Hittites."},{"num":2,"verse":"They were of the very nations of whom the Lord said to the Israelites, You shall not mingle with them, neither shall they mingle with you, for surely they will turn away your hearts after their gods. Yet Solomon clung to these in love."},{"num":3,"verse":"He had 700 wives, princesses, and 300 concubines, and his wives turned away his heart from God."},{"num":4,"verse":"For when Solomon was old, his wives turned away his heart after other gods, and his heart was not perfect (complete and whole) with the Lord his God, as was the heart of David his father."},{"num":5,"verse":"For Solomon went after Ashtoreth the goddess of the Sidonians, and after Milcom the abominable idol of the Ammonites!"},{"num":6,"verse":"Solomon did evil in the sight of the Lord, and went not fully after the Lord, as David his father did."},{"num":7,"verse":"Then Solomon built a high place for Chemosh the abominable idol of Moab, on the hill opposite Jerusalem, and for Molech the abominable idol of the Ammonites."},{"num":8,"verse":"And he did so for all of his foreign wives, who burned incense and sacrificed to their gods."},{"num":9,"verse":"And the Lord was angry with Solomon because his heart was turned from the Lord, the God of Israel, Who had appeared to him twice,"},{"num":10,"verse":"And had commanded him concerning this thing, that he should not go after other gods, but he did not do what the Lord commanded."},{"num":11,"verse":"Therefore the Lord said to Solomon, Because you are doing this and have not kept My covenant and My statutes, which I have commanded you, I will surely rend the kingdom from you and will give it to your servant!"},{"num":12,"verse":"However, in your days I will not do it, for David your father’s sake. But I will rend it out of the hand of your son!"},{"num":13,"verse":"However, I will not tear away all the kingdom, but will give one tribe to your son for David My servant’s sake and for the sake of Jerusalem, which I have chosen."},{"num":14,"verse":"The Lord stirred up an adversary against Solomon, Hadad the Edomite; he was of royal descent in Edom."},{"num":15,"verse":"For when David was in Edom, and Joab the commander of Israel’s army went up to bury the slain, he slew every male in Edom."},{"num":16,"verse":"For Joab and all Israel remained there for six months, until he had cut off every male in Edom."},{"num":17,"verse":"But Hadad fled, he and certain Edomites of his father’s servants, to Egypt, Hadad being yet a little child."},{"num":18,"verse":"They set out from Midian and came to Paran, and took men with them out of Paran and came to Egypt, to Pharaoh king of Egypt, who gave [young] Hadad a house and land and ordered provisions for him."},{"num":19,"verse":"Hadad found great favor with Pharaoh, so that he gave him in marriage the sister of his own wife Tahpenes the queen."},{"num":20,"verse":"The sister of Tahpenes bore Hadad Genubath his son, whom Tahpenes weaned in Pharaoh’s house; and Genubath was in Pharaoh’s household among the sons of Pharaoh."},{"num":21,"verse":"But when Hadad heard in Egypt that David slept with his fathers and that Joab the commander of Israel’s army was dead, Hadad said to Pharaoh, Let me depart, that I may go to my own country."},{"num":22,"verse":"Then Pharaoh said to him, But what have you lacked with me that now you want to go to your own country? He replied, Nothing. However, let me go anyhow."},{"num":23,"verse":"God raised up for [Hadad] another adversary, Rezon son of Eliada, who had fled from his master, Hadadezer king of Zobah."},{"num":24,"verse":"Rezon gathered men about him and became leader of a marauding band after the slaughter by David. They went to Damascus and dwelt and made [Rezon] king in Damascus."},{"num":25,"verse":"And Rezon was an adversary to Israel all the days of Solomon, besides the mischief that Hadad did. Rezon abhorred Israel and reigned over Syria."},{"num":26,"verse":"Jeroboam son of Nebat, an Ephrathite of Zereda, Solomon’s servant, whose mother’s name was Zeruah, a widow woman, rebelled against the king—"},{"num":27,"verse":"And for this reason: Solomon built the Millo and repaired the breaches of the city of David his father."},{"num":28,"verse":"The man Jeroboam was a mighty man of courage. Solomon, seeing that the young man was industrious, put him in charge over all the [forced] labor of the house of Joseph."},{"num":29,"verse":"At that time, when Jeroboam went out of Jerusalem, the prophet Ahijah the Shilonite met him on the way. Ahijah had clad himself with a new garment; and they were alone in the field."},{"num":30,"verse":"Ahijah caught the new garment he wore and tore it into twelve pieces."},{"num":31,"verse":"He said to Jeroboam, You take ten pieces, for thus says the Lord, the God of Israel, Behold, I will tear the kingdom from the hand of Solomon and will give you ten tribes."},{"num":32,"verse":"But he shall have one tribe, for My servant David’s sake and for Jerusalem’s sake, the city which I have chosen out of all the tribes of Israel,"},{"num":33,"verse":"Because they have forsaken Me and have worshiped Ashtoreth the goddess of the Sidonians, Chemosh the god of the Moabites, and Milcom the god of the Ammonites, and have not walked in My ways, to do what is right in My sight, keeping My statutes and My ordinances as did David his father."},{"num":34,"verse":"However, I will not take the whole kingdom out of his hand; but I will make him ruler all the days of his life for David My servant’s sake, whom I chose because he kept My commandments and My statutes."},{"num":35,"verse":"But I will take the kingdom out of his son’s hand and give it to you, ten tribes."},{"num":36,"verse":"Yet to his son I will give one tribe, that David My servant may always have a light before Me in Jerusalem, the city where I have chosen to put My Name."},{"num":37,"verse":"And I will take you, and you shall reign according to all that your soul desires; and you shall be king over Israel."},{"num":38,"verse":"And if you will hearken to all I command you and will walk in My ways and do right in My sight, keeping My statutes and My commandments, as David My servant did, I will be with you and build you a sure house, as I built for David, and will give Israel to you."},{"num":39,"verse":"And I will for this afflict the descendants of David, but not forever."},{"num":40,"verse":"Solomon sought therefore to kill Jeroboam. But Jeroboam arose and fled into Egypt, to Shishak king of Egypt, and was in Egypt until Solomon died."},{"num":41,"verse":"The rest of the acts of Solomon—and all that he did, and his wisdom (skill)—are they not written in the book of the acts of Solomon?"},{"num":42,"verse":"The time Solomon reigned in Jerusalem over all Israel was forty years."},{"num":43,"verse":"And Solomon slept with his fathers and was buried in the city of David his father. Rehoboam his son reigned in his stead."}]