[{"header":"Solomon Disobeys the Lord"},{"num":1,"verse":"The Lord did not want the Israelites to worship foreign gods, so he had warned them not to marry anyone who was not from Israel."},{"num":3,"verse":"Seven hundred of his wives were daughters of kings, but he also married three hundred other women."},{"num":5,"verse":"Solomon also worshiped Astarte the goddess of Sidon, and Milcom the disgusting god of Ammon. "},{"num":6,"verse":"Solomon’s father had obeyed the Lord with all his heart, but Solomon disobeyed and did what the Lord hated."},{"num":7,"verse":"Solomon built shrines on a hill east of Jerusalem to worship Chemosh the disgusting god of Moab, and Molech the disgusting god of Ammon. "},{"num":8,"verse":"In fact, he built a shrine for each of his foreign wives, so all of them could burn incense and offer sacrifices to their own gods."},{"num":9,"verse":"The Lord God of Israel had appeared to Solomon two times and warned him not to worship foreign gods. But Solomon disobeyed and did it anyway. This made the Lord very angry, "},{"num":11,"verse":"and he said to Solomon:"},{"header":"Hadad Becomes an Enemy of Solomon"},{"num":14,"verse":"Hadad was from the royal family of Edom, and here is how the Lord made him Solomon’s enemy:"},{"num":15,"verse":"Some time earlier, when David conquered the nation of Edom, Joab his army commander went there to bury those who had died in battle. Joab and his soldiers stayed in Edom six months, and during that time they killed every man and boy who lived there."},{"num":17,"verse":"Hadad was a boy at the time, but he escaped to Midian with some of his father’s officials. At Paran some other men joined them, and they went to the king of Egypt. The king liked Hadad and gave him food, some land, and a house, and even let him marry the sister of Queen Tahpenes. "},{"num":20,"verse":"Hadad and his wife had a son named Genubath, and the queen let the boy grow up in the palace with her own children."},{"num":21,"verse":"When Hadad heard that David and Joab were dead, he said to the king, “Your Majesty, please let me go back to my own country.”"},{"num":22,"verse":"“Why?” asked the king. “Do you want something I haven’t given you?”"},{"header":"Rezon Becomes an Enemy of Solomon"},{"num":23,"verse":"Here is how God made Rezon son of Eliada an enemy of Solomon:"},{"num":24,"verse":"He formed his own small army and became its leader after David had defeated Hadadezer’s troops. Then Rezon and his army went to Damascus, where he became the ruler of Syria and an enemy of Israel."},{"header":"The Lord Makes a Promise to Jeroboam"},{"num":26,"verse":"Jeroboam was from the town of Zeredah in Ephraim. His father Nebat had died, but his mother Zeruah was still alive. Jeroboam was one of Solomon’s officials, but even he rebelled against Solomon. "},{"num":27,"verse":"Here is how it happened:"},{"num":28,"verse":"Solomon noticed that Jeroboam was a hard worker. So he put Jeroboam in charge of the work force from Manasseh and Ephraim."},{"num":29,"verse":"One day when Jeroboam was leaving Jerusalem, he met Ahijah, a prophet from Shiloh. No one else was anywhere around. Suddenly, Ahijah took off his new coat and ripped it into twelve pieces. "},{"num":31,"verse":"Then he said:"},{"num":40,"verse":"When Solomon learned what the Lord had told Jeroboam, Solomon tried to kill Jeroboam. But he escaped to King Shishak of Egypt and stayed there until Solomon died."},{"header":"Solomon Dies"},{"num":41,"verse":"Everything else Solomon did while he was king is written in the book about him and his wisdom. "},{"num":42,"verse":"After he had ruled forty years from Jerusalem, "},{"num":43,"verse":"he died and was buried there in the city of his father David. His son Rehoboam then became king."}]