[{"num":11,"verse":"King Shlomo loved many foreign women besides the daughter of Pharaoh. There were women from the Mo’avi, ‘Amoni, Edomi, Tzidoni and Hitti — "},{"num":2,"verse":"nations about which Adonai had said to the people of Isra’el, “You are not to go among them or they among you, because they will turn your hearts away toward their gods.” But Shlomo was deeply attached to them by his love. "},{"num":3,"verse":"He had 700 wives, all princesses, and 300 concubines; and his wives turned his heart away. "},{"num":4,"verse":"For when Shlomo became old, his wives turned his heart away toward other gods; so that he was not wholehearted with Adonai his God, as David his father had been. "},{"num":5,"verse":"For Shlomo followed ‘Ashtoret the goddess of the Tzidoni and Milkom the abomination of the ‘Amoni. "},{"num":6,"verse":"Thus Shlomo did what was evil in Adonai’s view and did not fully follow Adonai, as David his father had done. "},{"num":7,"verse":"Shlomo built a high place for K’mosh the abomination of Mo’av on the hill on front of Yerushalayim, and another for Molekh the abomination of the people of ‘Amon. "},{"num":8,"verse":"This is what he did for all his foreign wives, who then offered and sacrificed to their gods. "},{"num":9,"verse":"So Adonai grew angry with Shlomo, because his heart had turned away from Adonai the God of Isra’el, who had appeared to him twice "},{"num":10,"verse":"and given him orders concerning this matter that he should not follow other gods. But he didn’t obey Adonai’s orders."},{"num":11,"verse":"So Adonai said to Shlomo, “Since this is what has been in your mind, and you haven’t kept my covenant and my regulations which I ordered you to obey, I will tear the kingdom from you and give it to your servant. "},{"num":12,"verse":"However, for David your father’s sake I won’t do it while you are alive, but I will tear it away from your son. "},{"num":13,"verse":"Even then, I won’t tear away all the kingdom; I will give one tribe to your son for the sake of David my servant and for the sake of Yerushalayim, which I have chosen.”"},{"num":14,"verse":"Then Adonai raised up an adversary against Shlomo, Hadad the Edomi, of the royal line of Edom. "},{"num":15,"verse":"Back when David had been in Edom, and Yo’av the commander of the army had gone up to bury the dead, having killed every male in Edom "},{"num":16,"verse":"(for Yo’av and all Isra’el had stayed there six months, until he had eliminated every male in Edom), "},{"num":17,"verse":"Hadad had fled, he and a number of Edomi servants of his father’s with him, and gone into Egypt; at the time Hadad had been but a small boy. "},{"num":18,"verse":"On their way, they passed through Midyan and arrived in Pa’ran, took with them men from Pa’ran, and went on into Egypt, to Pharaoh king of Egypt. He gave Hadad a house, saw to it that he had food and gave him land. "},{"num":19,"verse":"Hadad became a great favorite of Pharaoh, so that he gave him his own wife’s sister in marriage, that is, the sister of Tachp’neis the queen. "},{"num":20,"verse":"The sister of Tachp’neis bore him G’nuvat his son, and Tachp’neis brought him up in Pharaoh’s own house, so that G’nuvat was in Pharaoh’s house along with Pharaoh’s sons. "},{"num":21,"verse":"When Hadad in Egypt heard that David slept with his ancestors and Yo’av the commander of the army was dead, Hadad said to Pharaoh, “Let me leave, so that I can return to my own country.” "},{"num":22,"verse":"Pharaoh asked him, “But what have you lacked with me that makes you want just now to go to your own country?” “Nothing in particular,” he replied, “but let me leave, anyway.”"},{"num":23,"verse":"God raised up another adversary against Shlomo, Rezon the son of Elyada, who had fled from his lord Hadad‘ezer king of Tzovah "},{"num":24,"verse":"when David killed the men from Tzovah. Rezon rallied men to himself and became the leader of a band of marauders; they went to Dammesek and settled there, while he became king of Dammesek. "},{"num":25,"verse":"He remained an adversary as long as Shlomo lived, causing difficulties in addition to those of Hadad. He detested Isra’el and ruled Aram."},{"num":26,"verse":"Also Yarov‘am the son of N’vat, an Efrati from Tz’redah, whose mother’s name was Tz’ru‘ah, one of Shlomo’s servants, rebelled against the king. "},{"num":27,"verse":"Here is the reason he rebelled against the king: Shlomo was building the Millo and closing the breach in [the wall of] the City of David his father. "},{"num":28,"verse":"Now this Yarov‘am was a strong, energetic man; and Shlomo, seeing how serious the young man was, made him supervisor over all the work being done by the tribe of Yosef. "},{"num":29,"verse":"Once, during this period, when Yarov‘am had gone out of Yerushalayim, the prophet Achiyah from Shiloh spotted him traveling. Achiyah was wearing a new cloak, and the two of them were alone in open country. "},{"num":30,"verse":"Achiyah took hold of his new cloak that he was wearing and tore it into twelve pieces. "},{"num":31,"verse":"Then he said to Yarov‘am, “Take ten pieces for yourself! For here is what Adonai the God of Isra’el says: ‘I am going to tear the kingdom out of Shlomo’s hand, and I will give ten tribes to you. "},{"num":32,"verse":"But he will keep one tribe for the sake of my servant David and for the sake of Yerushalayim, the city I have chosen from all the tribes of Isra’el. "},{"num":33,"verse":"I will do this because they have abandoned me and worshipped ‘Ashtoret the goddess of the Tzidoni, K’mosh the god of Mo’av and Milkom the god of the people of ‘Amon. They haven’t lived according to my ways, so that they could do what was right in my view and obey my regulations and rulings, as did David his father. "},{"num":34,"verse":"Nevertheless, I will not take the entire kingdom away from him; but I will make him prince as long as he lives, for the sake of David my servant, whom I chose, because he obeyed my mitzvot and regulations. "},{"num":35,"verse":"However, I will take the kingdom away from his son and give ten tribes of it to you. "},{"num":36,"verse":"To his son I will give one tribe, so that David my servant will always have a light burning before me in Yerushalayim, the city I chose for myself as the place to put my name. "},{"num":37,"verse":"I will take you, and you will rule over everything you want; you will be king over Isra’el. "},{"num":38,"verse":"Now if you will listen to all that I order you, live according to my ways and do what is right in my view, so that you observe my regulations and mitzvot, as David my servant did; then I will be with you, and I will build you a lasting dynasty, as I built for David; and I will give Isra’el to you. "},{"num":39,"verse":"For this [offense] I will trouble David’s descendants, but not forever.” "},{"num":40,"verse":"Because of this Shlomo tried to kill Yarov‘am; but Yarov‘am roused himself, fled to Egypt, to Shishak king of Egypt, and stayed in Egypt until the death of Shlomo."},{"num":41,"verse":"Other activities of Shlomo, all he accomplished and his wisdom are recorded in the Annals of Shlomo. "},{"num":42,"verse":"The length of Shlomo’s reign in Yerushalayim over all Isra’el was forty years. "},{"num":43,"verse":"Then Shlomo slept with his ancestors and was buried in the City of David his father, and Rechav‘am his son became king in his place."}]