[{"header":"God Sends His Son"},{"num":12,"verse":"Jesus used stories to teach the people. He said, “A man planted a vineyard. He put a wall around it and dug a hole for a winepress. Then he built a tower. He leased the vineyard to some farmers and left for a trip. "},{"num":12,"verse":"The Jewish leaders knew that the story was about them. So they wanted to find a way to arrest Jesus, but they were afraid of the people. So the leaders left him and went away."},{"header":"The Leaders Try to Trap Jesus"},{"num":13,"verse":"Later, the Jewish leaders sent some Pharisees and some men from the group called Herodians to Jesus. They wanted to catch Jesus saying something wrong. "},{"num":14,"verse":"They came to him and said, “Teacher, we know that you are an honest man. You are not afraid of what other people think about you. All men are the same to you. And you teach the truth about God’s way. Tell us: Is it right to pay taxes to Caesar? Should we pay them, or not?”"},{"num":15,"verse":"But Jesus knew what these men were really trying to do. He said, “Why are you trying to trap me? Bring me a silver coin. Let me see it.” "},{"num":16,"verse":"They gave Jesus a coin, and he asked, “Whose picture is on the coin? And whose name is written on it?”"},{"num":17,"verse":"Then Jesus said to them, “Give to Caesar the things that are Caesar’s. And give to God the things that are God’s.” The men were amazed at what Jesus said."},{"header":"Sadducees Try to Trick Jesus"},{"num":18,"verse":"Then some Sadducees came to Jesus. (Sadducees believe that no person will rise from death.) The Sadducees asked Jesus a question. "},{"num":19,"verse":"They said, “Teacher, Moses wrote that a man’s brother might die. He leaves a wife but no children. Then that man must marry the widow and have children for the dead brother. "},{"num":20,"verse":"There were seven brothers. The first brother married but died. He had no children. "},{"num":21,"verse":"So the second brother married the widow. But he also died and had no children. The same thing happened with the third brother. "},{"num":22,"verse":"All seven brothers married her and died. None of the brothers had any children. The woman was last to die. "},{"num":23,"verse":"But all seven brothers had married her. So at the time people rise from death, whose wife will the woman be?”"},{"num":24,"verse":"Jesus answered, “Why did you make this mistake? Is it because you don’t know what the Scriptures say? Or is it because you don’t know about the power of God? "},{"header":"The Most Important Command"},{"num":28,"verse":"One of the teachers of the law came to Jesus. He heard Jesus arguing with the Sadducees and the Pharisees. He saw that Jesus gave good answers to their questions. So he asked Jesus, “Which of the commands is most important?”"},{"num":29,"verse":"Jesus answered, “The most important command is this: ‘Listen, people of Israel! The Lord our God, he is the only Lord. "},{"num":32,"verse":"The man answered, “That was a good answer, Teacher. You were right when you said these things. God is the only Lord, and there is no other God besides him. "},{"num":33,"verse":"One must love God with all his heart, all his mind, and all his strength. And one must love his neighbor as he loves himself. These commands are more important than all the animals and sacrifices we offer to God.”"},{"num":34,"verse":"Jesus saw that the man answered him wisely. So Jesus said to him, “You are close to the kingdom of God.” And after that, no one was brave enough to ask Jesus any more questions."},{"num":35,"verse":"Jesus was teaching in the Temple. He asked, “Why do the teachers of the law say that the Christ is the son of David? "},{"num":38,"verse":"Jesus continued teaching. He said, “Beware of the teachers of the law. They like to walk around wearing clothes that look important. And they love for people to show respect to them in the marketplaces. "},{"header":"True Giving"},{"num":41,"verse":"Jesus sat near the Temple money box where people put their gifts. He watched the people put in their money. Many rich people gave large sums of money. "},{"num":42,"verse":"Then a poor widow came and gave two very small copper coins. These coins were not worth even a penny."},{"num":43,"verse":"Jesus called his followers to him. He said, “I tell you the truth. This poor widow gave only two small coins. But she really gave more than all those rich people. "}]