[{"header":"The Parable about the Tenant Farmers(A)"},{"num":12,"verse":"Then Jesus began to speak to them in parables. “A man planted a vineyard. He put a wall around it, dug a pit for the wine press, and built a watchtower. Then he leased it to tenant farmers and went abroad. "},{"num":2,"verse":"At the right time, he sent a servant to the farmers to collect from them a share of the produce from the vineyard. "},{"num":3,"verse":"But the farmers grabbed the servant, beat him, and sent him back empty-handed. "},{"num":4,"verse":"Again, the man sent another servant to them. They beat the servant over the head and treated him shamefully. "},{"num":5,"verse":"Then the man sent another, and that one they killed. So it was with many other servants. Some of these they beat, and others they killed. "},{"num":6,"verse":"He still had one more person to send, a son whom he loved. Finally, he sent him to them, saying, ‘They will respect my son.’ "},{"num":7,"verse":"But those farmers told one another, ‘This is the heir. Come on, let’s kill him, and the inheritance will be ours!’ "},{"num":8,"verse":"So they grabbed him, killed him, and threw him out of the vineyard."},{"num":9,"verse":"“Now what will the owner of the vineyard do? He will come, execute the farmers, and give the vineyard to others. "},{"num":10,"verse":"Haven’t you ever read this Scripture:"},{"num":12,"verse":"They were trying to arrest him but were afraid of the crowd. Realizing that he had spoken this parable against them, they left him alone and went away."},{"header":"A Question about Paying Taxes(B)"},{"num":13,"verse":"Then they sent some Pharisees and some Herodians to him, intending to trap him in what he said. "},{"num":14,"verse":"They came and told him, “Teacher, we know that you are sincere. You don’t favor any individual, because you pay no attention to external appearance. Instead, you teach the way of God truthfully. Is it lawful to pay taxes to Caesar or not? Should we pay them or shouldn’t we?”"},{"num":15,"verse":"Seeing through their hypocrisy, Jesus replied to them, “Why are you testing me? Bring me a denarius and let me look at it.”"},{"num":16,"verse":"So they brought one. Then he asked them, “Whose face and name are on this?”"},{"num":17,"verse":"So Jesus told them, “Give back to Caesar the things that are Caesar’s, and to God the things that are God’s.” And they were utterly amazed at him."},{"header":"A Question about the Resurrection(C)"},{"num":18,"verse":"Then some Sadducees, who claim there is no resurrection, came to Jesus and asked him, "},{"num":19,"verse":"“Teacher, Moses wrote for us that if a man’s brother dies and leaves a wife but no child, he should marry the widow and have children for his brother. "},{"num":20,"verse":"There were seven brothers. The first one married and died without having children. "},{"num":21,"verse":"Then the second married her and died without having children, and so did the third. "},{"num":22,"verse":"None of the seven left any children. Last of all, the woman died, too. "},{"num":23,"verse":"In the resurrection, whose wife will she be, since all seven had married her?”"},{"num":24,"verse":"Jesus answered them, “Aren’t you mistaken because you don’t know the Scriptures or God’s power? "},{"num":25,"verse":"When people rise from the dead, they neither marry nor are given in marriage but are like the angels in heaven. "},{"num":26,"verse":"As for the dead being raised, haven’t you read in the book of Moses, in the story about the bush, how God said, ‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? "},{"num":27,"verse":"He is not the God of the dead, but of the living. You are badly mistaken!”"},{"header":"The Greatest Commandment(D)"},{"num":28,"verse":"Then one of the scribes came near and heard the Sadducees arguing with one another. He saw how well Jesus answered them, so he asked him, “Which commandment is the most important of them all?”"},{"num":29,"verse":"Jesus answered, “The most important is, ‘Hear, O Israel, the Lord our God is one Lord, "},{"num":30,"verse":"and you must love the Lord your God with all your heart, with all your soul, with all your mind, and with all your strength.’ "},{"num":31,"verse":"The second is this: ‘You must love your neighbor as yourself.’ No other commandment is greater than these.”"},{"num":32,"verse":"Then the scribe told him, “Well said, Teacher! You have told the truth that ‘God is one, and there is no other besides him.’ "},{"num":33,"verse":"To love him with all your heart, with all your understanding, and with all your strength, and to love your neighbor as yourself is more important than all the burnt offerings and sacrifices.”"},{"num":34,"verse":"When Jesus saw how wisely the man answered, he told him, “You are not far from the kingdom of God.” After that, no one dared to ask him another question."},{"header":"A Question about David’s Son(E)"},{"num":35,"verse":"While Jesus was teaching in the Temple, he asked, “How can the scribes say that the Messiah is David’s son? "},{"num":36,"verse":"David himself said by the Holy Spirit,"},{"num":37,"verse":"David himself calls him ‘Lord,’ so how can he be his son?” And the large crowd kept listening to him with delight."},{"header":"Jesus Denounces the Scribes(F)"},{"num":38,"verse":"As he taught, he said, “Beware of the scribes! They like to walk around in long robes, to be greeted in the marketplaces, "},{"num":39,"verse":"and to have the best seats in the synagogues and the places of honor at banquets. "},{"num":40,"verse":"They devour widows’ houses and say long prayers to cover it up. They will receive greater condemnation!”"},{"header":"The Widow’s Offering(G)"},{"num":41,"verse":"As Jesus sat facing the offering box, he watched how the crowd was dropping their money into it. Many rich people were dropping in large amounts. "},{"num":42,"verse":"Then a destitute widow came and dropped in two small copper coins, worth about a cent. "},{"num":43,"verse":"He called his disciples and told them, “I tell all of you with certainty, this destitute widow has dropped in more than everyone who is contributing to the offering box, "},{"num":44,"verse":"because all of them contributed out of their surplus, but out of her poverty she has given everything she had to live on.”"}]