[[],[{"type":"header","content":"Parable of the Vine-growers"},{"type":"prose","content":"And He began to speak to them in parables: "}],[{"type":"prose","content":"And they were seeking to seize Him, and  they feared the people, for they understood that He told the parable against them. And  they left Him and went away."}],[{"type":"header","content":"Jesus Answers the Pharisees, Sadducees, and Scribes"},{"type":"prose","content":"Then they *sent some of the Pharisees and Herodians to Him in order to trap Him in a statement."}],[{"type":"prose","content":"They came and *said to Him, “Teacher, we know that You are truthful and do not care what anyone thinks; for You are not partial to anyone, but You teach the way of God in truth. Is it permissible to pay a poll-tax to Caesar, or not?"}],[{"type":"prose","content":"Are we to pay, or not pay?” But He, knowing their hypocrisy, said to them, "}],[{"type":"prose","content":"And they brought . And He *said to them,  And they said to Him, “Caesar’s.”"}],[{"type":"prose","content":"And Jesus said to them,  And they were utterly amazed at Him."}],[{"type":"prose","content":" Sadducees (who say that there is no resurrection) *came to Jesus, and  questioning Him, saying,"}],[{"type":"prose","content":"“Teacher, Moses wrote for us that if a man’s brother dies and leaves behind a wife and does not leave a child, his brother is to marry the wife and raise up children for his brother."}],[{"type":"prose","content":"There were seven brothers; and the first took a wife, and died leaving no children."}],[{"type":"prose","content":"The second one married her, and died leaving behind no children; and the third likewise;"}],[{"type":"prose","content":"and  the seven  left no children. Last of all the woman also died."}],[{"type":"prose","content":"In the resurrection, which one’s wife will she be? For  the seven had her as  wife.”"}],[{"type":"prose","content":"Jesus said to them, "}],[{"type":"prose","content":"One of the scribes came up and heard them arguing, and recognizing that He had answered them well, asked Him, “What commandment is the foremost of all?”"}],[{"type":"prose","content":"Jesus answered, "}],[{"type":"prose","content":"And the scribe said to Him, “Well , Teacher; You have truly stated that HE IS ONE, AND THERE IS NO OTHER BESIDES HIM;"}],[{"type":"prose","content":"and to love Him with all the heart, and with all the understanding, and with all the strength, and to love one’s neighbor as oneself, is much more than all the burnt offerings and sacrifices.”"}],[{"type":"prose","content":"When Jesus saw that he had answered intelligently, He said to him,  And , no one dared any longer to question Him."}],[{"type":"prose","content":"And Jesus responded and  saying, as He taught in the temple , "},{"type":"prose","content":" And the large crowd enjoyed listening to Him."}],[{"type":"prose","content":"And in His teaching He was saying: "}],[{"type":"header","content":"The Widow’s Coins"},{"type":"prose","content":"And  sat down opposite the treasury, and  watching how the people were putting money into the treasury; and many rich people were putting in large amounts."}],[{"type":"prose","content":"And a poor widow came and put in two lepta coins, which amount to a quadrans."}],[{"type":"prose","content":"Calling His disciples to Him, He said to them, "}]]