[{"header":"Chapter 12"},{"num":1,"verse":"The Parable of the Tenants. Then Jesus began to speak to them in parables: “A man planted a vineyard, put a fence around it, dug a pit for the winepress, and built a watchtower. Then he leased it to tenants and went off on a journey."},{"num":2,"verse":"“When the time arrived, he sent a servant to the tenants to collect from them his share of the produce of the vineyard."},{"num":3,"verse":"But they seized the servant, beat him, and sent him away empty-handed."},{"num":4,"verse":"Again, he sent them another servant, but they beat him over the head and treated him shamefully."},{"num":5,"verse":"Then he sent another, and that one they killed. He also sent many others, some of whom they beat, and others of whom they killed."},{"num":6,"verse":"“Finally, he had only one other to send—his beloved son. And so he sent him to them, thinking: ‘They will respect my son.’"},{"num":7,"verse":"But those tenants said to one another, ‘This is the heir. Come, let us kill him, and the inheritance will be ours!’"},{"num":8,"verse":"And so they seized him, killed him, and threw him out of the vineyard."},{"num":9,"verse":"“What then will the owner of the vineyard do? He will come and put those tenants to death and give the vineyard to others."},{"num":10,"verse":"Have you not read this Scripture:"},{"num":12,"verse":"They wanted to arrest him because they realized that this parable was directed at them, but they were afraid of the crowd. Therefore, they left him and went away."},{"header":"Controversies[b]"},{"num":13,"verse":"God or Caesar. Then they sent some Pharisees and Herodians to trap him in what he said."},{"num":14,"verse":"They came and said to him, “Teacher, we know that you are truthful and are not concerned with anyone’s opinion no matter what his station in life. Rather, you teach the way of God in accordance with the truth. Is it lawful or not for us to pay taxes to Caesar? Should we pay them or not?”"},{"num":15,"verse":"He was aware of their hypocrisy and said to them, “Why are you trying to trap me? Bring me a denarius and let me examine it.”"},{"num":16,"verse":"When they brought one, he asked them, “Whose image is this, and whose inscription?” They replied and said to him, “Caesar’s.”"},{"num":17,"verse":"Jesus said to them, “Give to Caesar what is due to Caesar, and to God what is due to God.” His reply left them completely amazed at him."},{"num":18,"verse":"Marriage and the Resurrection. Then some Sadducees, who assert that there is no resurrection, approached him and posed this question,"},{"num":19,"verse":"“Teacher, Moses wrote down for us that if a man’s brother dies, leaving a wife but no child, the man shall take his brother’s wife and raise up children for his brother."},{"num":20,"verse":"Now there were seven brothers. The first brother took a wife and died, leaving no children."},{"num":21,"verse":"The second brother married the widow and died, leaving no children. The same was true of the third brother."},{"num":22,"verse":"None of the seven left any children. Last of all, the woman herself died."},{"num":23,"verse":"Now at the resurrection, when they rise up, whose wife will she be, inasmuch as all seven had her?”"},{"num":24,"verse":"Jesus said to them, “Is not this the reason you are in error—namely, that you do not understand the Scriptures or the power of God?"},{"num":25,"verse":"For when they rise from the dead, they will neither marry nor be given in marriage. They are like angels in heaven."},{"num":26,"verse":"“And in regard to the dead being raised, have you not read in the book of Moses, in the account about the bush, how God said to him: ‘I am the God of Abraham, the God of Isaac, and the God of Jacob’"},{"num":27,"verse":"He is not the God of the dead but of the living. You are very badly mistaken.”"},{"num":28,"verse":"The Greatest Commandment. Then one of the scribes who had listened to these discussions, and who had observed how well Jesus answered them, asked Jesus, “Which is the first of all the commandments?”"},{"num":29,"verse":"Jesus answered, “The first is: ‘Hear, O Israel: the Lord our God, the Lord is one!"},{"num":30,"verse":"You shall love the Lord your God with all your heart, and with all your soul, and with all your mind, and with all your strength.’"},{"num":31,"verse":"The second is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.”"},{"num":32,"verse":"Then the scribe said to him, “Well said, Teacher. You have truly said, ‘He is one, and there is no other besides him.’"},{"num":33,"verse":"And ‘to love him with all your heart, and with all your understanding, and with all your strength, and to love your neighbor as yourself,’ is worth more than any burnt offerings and sacrifices.”"},{"num":34,"verse":"And when Jesus saw with what great understanding he had spoken, he said to him, “You are not far from the kingdom of God.” And after that no one dared to ask him any question."},{"num":35,"verse":"Jesus Is Lord. While Jesus was teaching in the temple area, he said, “How can the scribes say that the Christ is the Son of David?"},{"num":36,"verse":"David himself, inspired by the Holy Spirit, declared:"},{"num":37,"verse":"David himself calls him ‘Lord’; so how can he be his son?” And the large crowd listened to him with delight."},{"num":38,"verse":"Denunciation of the Scribes. In his teaching, he said, “Beware of the scribes, who like to walk around in long robes, to be greeted respectfully in the marketplace,"},{"num":39,"verse":"and to have the best seats in the synagogues and the places of honor at banquets."},{"num":40,"verse":"They devour the houses of widows, while for the sake of appearance they recite lengthy prayers. They will receive the severest possible condemnation.”"},{"num":41,"verse":"The Poor Widow’s Offering. As Jesus was sitting opposite the treasury, he watched the crowd putting money into the treasury. Many wealthy people put in large sums."},{"num":42,"verse":"A poor widow also came and put in two copper coins, that is, about a penny."},{"num":43,"verse":"Then he called his disciples to him and said, “Amen, I say to you, this poor widow has given more than all the other contributors to the treasury."},{"num":44,"verse":"For the others have all contributed out of their abundance, but she out of her poverty has given everything she possessed, all that she had to live on.”"}]