[{"num":16,"verse":"The causes wherefore the Moabites are destroyed."},{"num":1,"verse":"Send ye a lamb to the ruler of the world from the rock of the wilderness, unto the mountain of the daughter Zion."},{"num":2,"verse":"For it shall be as a bird that flieth, and a nest forsaken: the daughters of Moab shall be at the fords of Arnon."},{"num":3,"verse":"Gather a counsel, execute judgment, make thy shadow as the night in the midday: hide them that are chased out: bewray not him that is fled."},{"num":4,"verse":"Let my banished dwell with thee: Moab, be thou their covert from the face of the destroyer: for the extortioner shall end: the destroyer shall be consumed, and the oppressor shall cease out of the land."},{"num":5,"verse":"And in mercy shall the throne be prepared, and he shall sit upon it in steadfastness, in the tabernacle of David, judging, and seeking judgment, and hasting justice."},{"num":6,"verse":"We have heard of the pride of Moab (he is very proud) even his pride, and his arrogancy, and his indignation, but his lies shall not be so."},{"num":7,"verse":"Therefore shall Moab howl unto Moab, everyone shall howl: for the foundations of Kir Hareseth shall ye mourn, yet they shall be stricken."},{"num":8,"verse":"For the vineyards of Heshbon are cut down, and the vine of Sibmah: the lords of the heathen have broken the principal vines thereof: they are come unto Jazer: they wandered in the wilderness: her goodly branches stretched out themselves, and went over the sea."},{"num":9,"verse":"Therefore will I weep with the weeping of Jazer, and of the vine of Sibmah, O Heshbon: and Elealeh, I will make thee drunk with my tears, because upon thy summer fruits, and upon thy harvest a shouting is fallen."},{"num":10,"verse":"And gladness is taken away, and joy out of the plentiful field: and in the vineyards shall be no singing nor shouting for joy: the treader shall not tread wine in the wine presses: I have caused the rejoicing to cease."},{"num":11,"verse":"Wherefore, my bowels shall sound like an harp for Moab, and mine inward parts for Kir Heres."},{"num":12,"verse":"And when it shall appear that Moab shall be weary of his high places, then shall he come to his temple to pray, but he shall not prevail."},{"num":13,"verse":"This is the word that the Lord hath spoken against Moab since that time."},{"num":14,"verse":"And now the Lord hath spoken, saying, In three years as the years of an hireling, and the glory of Moab shall be contemned in all the great multitude, and the remnant shall be very small and feeble."}]