[{"header":"Job Answers the Lord"},{"num":42,"verse":"Then Job answered the Lord:"},{"header":"The Lord Gives Job’s Wealth Back"},{"num":7,"verse":"After the Lord finished talking to Job, he spoke to Eliphaz from Teman. He said, “I am angry with you and your two friends, because you did not tell the truth about me, as my servant Job did."},{"num":8,"verse":"So now, Eliphaz, get seven bulls and seven rams. Take them to my servant Job. Kill them and offer them as a burnt offering for yourselves. My servant Job will pray for you, and I will answer his prayer. Then I will not give you the punishment you deserve. You should be punished, because you were very foolish. You did not say what is right about me, as my servant Job did.”"},{"num":9,"verse":"So Eliphaz from Teman, Bildad from Shuah, and Zophar from Naamah obeyed the Lord. Then the Lord answered Job’s prayer."},{"num":10,"verse":"Job prayed for his friends, and the Lord made Job successful again. The Lord gave him twice as much as he had before."},{"num":11,"verse":"Then all his brothers and sisters and all the people who knew him before came to his house. They all ate a big meal with him. They comforted him and were sorry that the Lord had brought him so much trouble. Each person gave Job a piece of silver and a gold ring."},{"num":12,"verse":"The Lord blessed Job with even more than he had in the beginning. Job got 14,000 sheep, 6000 camels, 2000 oxen, and 1000 female donkeys."},{"num":13,"verse":"He also got seven sons and three daughters."},{"num":14,"verse":"He named the first daughter Jemimah and the second daughter Keziah. He named the third daughter Keren Happuch."},{"num":15,"verse":"Job’s daughters were among the most beautiful women in all the country. And, like their brothers, they each got a share of their father’s property."},{"num":16,"verse":"So Job lived for 140 years more. He lived to see his children, his grandchildren, his great-grandchildren, and his great-great-grandchildren."},{"num":17,"verse":"Job lived to be a very old man who had lived a good, long life."}]