[{"header":"Job Answers the Lord"},{"num":42,"verse":"Then Job answered the Lord:"},{"header":"End of the Story"},{"num":7,"verse":"After the Lord had said these things to Job, he spoke to Eliphaz the Temanite. The Lord said to him, “I am angry with you and your two friends. This is because you have not said what is right about me. But my servant Job did. "},{"num":8,"verse":"So now take seven bulls and seven male sheep. Go to my servant Job. And offer a burnt offering for yourselves. My servant Job will pray for you. And I will listen to his prayer. Then I will not punish you for being foolish. You have not said what is right about me. But my servant Job did.” "},{"num":9,"verse":"So Eliphaz the Temanite did as the Lord told him to do. Bildad the Shuhite and Zophar the Naamathite also did as the Lord said. And the Lord listened to Job’s prayer."},{"num":10,"verse":"After Job had prayed for his friends, God gave him success again. God gave Job twice as much as he had owned before. "},{"num":11,"verse":"Job’s brothers and sisters came to his house. Everyone who had known him before came to his house. And they all ate with him there. They comforted Job and spoke kindly to him. They made him feel better about the trouble the Lord had brought on him. And each one gave Job a piece of silver and a gold ring."},{"num":12,"verse":"The Lord blessed the last part of Job’s life even more than the first part. Job had 14,000 sheep and 6,000 camels. He had 1,000 pairs of oxen and 1,000 female donkeys. "},{"num":13,"verse":"Job also had seven sons and three daughters. "},{"num":14,"verse":"He named the first daughter Jemimah. The second daughter he named Keziah. And his third daughter he named Keren-Happuch. "},{"num":15,"verse":"There were no other women in all the land as beautiful as Job’s daughters. And their father Job gave them land to own along with their brothers."},{"num":16,"verse":"After this, Job lived 140 years. He lived to see his children, grandchildren, great-grandchildren and great-great-grandchildren. "},{"num":17,"verse":"Then Job died. He was old and had lived many years."}]