[{"num":7,"verse":"During the reign of Ahaz (the son of Jotham and grandson of Uzziah), Jerusalem was attacked by King Rezin of Syria and King Pekah of Israel (the son of Remaliah). But it was not taken; the city stood. "},{"num":2,"verse":"However, when the news came to the royal court, “Syria is allied with Israel against us!” the hearts of the king and his people trembled with fear as the trees of a forest shake in a storm."},{"num":3,"verse":"Then the Lord said to Isaiah, “Go out to meet King Ahaz, you and Shear-jashub, your son. You will find him at the end of the aqueduct that leads from Gihon Spring to the upper reservoir, near the road that leads down to the bleaching field. "},{"num":4,"verse":"Tell him to quit worrying. Tell him he needn’t be frightened by the fierce anger of those two has-beens, Rezin and Pekah. "},{"num":5,"verse":"Yes, the kings of Syria and Israel are coming against you."},{"num":6,"verse":"‘We will invade Judah and throw her people into panic. Then we’ll fight our way into Jerusalem and install the son of Tabeel as their king.’"},{"num":7,"verse":"“But the Lord God says: This plan will not succeed, "},{"num":8,"verse":"for Damascus will remain the capital of Syria alone, and King Rezin’s kingdom will not increase its boundaries. And within sixty-five years Ephraim, too, will be crushed and broken. "},{"num":9,"verse":"Samaria is the capital of Ephraim alone, and King Pekah’s power will not increase. You don’t believe me? If you want me to protect you, you must learn to believe what I say.”"},{"num":10,"verse":"Not long after this, the Lord sent this further message to King Ahaz:"},{"num":11,"verse":"“Ask me for a sign, Ahaz, to prove that I will indeed crush your enemies as I have said. Ask anything you like, in heaven or on earth.”"},{"num":12,"verse":"But the king refused. “No,” he said, “I’ll not bother the Lord with anything like that.”"},{"num":13,"verse":"Then Isaiah said: O House of David, you aren’t satisfied to exhaust my patience; you exhaust the Lord’s as well! "},{"num":14,"verse":"All right then, the Lord himself will choose the sign—a child shall be born to a virgin! And she shall call him Immanuel (meaning, “God is with us”). "},{"num":15,"verse":"By the time this child is weaned and knows right from wrong, the two kings you fear so much—the kings of Israel and Syria*—will both be dead.*"},{"num":17,"verse":"But later on, the Lord will bring a terrible curse on you and on your nation and your family. There will be terror such as has not been known since the division of Solomon’s empire into Israel and Judah—the mighty king of Assyria will come with his great army!"},{"num":18,"verse":"At that time the Lord will whistle for the army of Upper Egypt, and of Assyria too, to swarm down upon you like flies and destroy you, like bees to sting and to kill. "},{"num":19,"verse":"They will come in vast hordes, spreading across the whole land, even into the desolate valleys, caves, and thorny parts, as well as to all your fertile acres. "},{"num":20,"verse":"In that day the Lord will take this “razor”—these Assyrians you have hired to save you—and use it on you to shave off everything you have: your land, your crops, your people.*"},{"num":21,"verse":"When they finally stop plundering, the whole nation will be a pastureland; whole flocks and herds will be destroyed, and a farmer will be fortunate to have a cow and two sheep left. But the abundant pastureland will yield plenty of milk, and everyone left will live on curds and wild honey. "},{"num":23,"verse":"At that time the lush vineyards will become patches of briars. "},{"num":24,"verse":"All the land will be one vast thornfield, a hunting ground overrun by wildlife. "},{"num":25,"verse":"No one will go to the fertile hillsides where once the gardens grew, for thorns will cover them; cattle, sheep, and goats will graze there."}]