[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For the joy of the Lord is your strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This beautiful sentence is, literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "delight in Jehovah is a strong refuge.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is capable of unlimited application in preaching and devotion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nehemiah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "READING THE LAW WITH TEARS AND JOY",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE JOY OF THE LORDNehemiah 8:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE JOY OF THE LORD",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Judaism, in its formal and ceremonial aspect, was a religion of gladness. The feast was the great act of worship. It is not to be wondered at, that Christianity, the perfecting of that ancient system, has been less markedly felt to be a religion of joy; for it brings with it far deeper and more solemn views about man in his nature, condition, responsibilities, destinies, than ever prevailed before, under any system of worship. And yet all deep religion ought to be joyful, and all strong religion assuredly will be so.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Here, in the incident before us, there has come a time in Nehemiah’s great enterprise, when the law, long forgotten, long broken by the captives, is now to be established again as the rule of the newly-founded commonwealth. Naturally enough there comes a remembrance of many sins in the past history of the people; and tears not unnaturally mingle with the thankfulness that again they are a nation, having a divine worship and a divine law in their midst. The leader of them, knowing for one thing that if the spirits of his people once began to flag, they could not face nor conquer the difficulties of their position, said to them, ‘This day is holy unto the Lord: this feast that we are keeping is a day of devout worship; therefore mourn not, nor weep: go your way; eat the fat, and drink the sweet, and send portions unto them for whom nothing is prepared; neither be ye sorry, for the joy of the Lord is your strength.’ You will make nothing of it by indulgence in lamentation and in mourning. You will have no more power for obedience, you will not be fit for your work, if you fall into a desponding state. Be thankful and glad; and remember that the purest worship is the worship of God-fixed joy, ‘the joy of the Lord is your strength.’ And that is as true, brethren! with regard to us, as it ever was in these old times; and we, I think, need the lesson contained in this saying of Nehemiah’ s, because of some prevalent tendencies amongst us, no less than these Jews did. Take some simple thoughts suggested by this text which are both important in themselves and needful to be made emphatic because so often forgotten in the ordinary type of Christian character. They are these. Religious Joy is the natural result of faith. It is a Christian duty. It is an important element in Christian strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Joy in the Lord is the natural result of Christian Faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Joy in the Lord is the natural result of Christian Faith.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is a natural adaptation or provision in the Gospel, both by what it brings to us and by what it takes away from us, to make a calm, and settled, and deep gladness, the prevalent temper of the Christian spirit. In what it gives us, I say, and in what it takes away from us. It gives us what we call well a sense of acceptance with God, it gives us God for the rest of our spirits, it gives us the communion with Him which in proportion as it is real, will be still, and in proportion as it is still, will be all bright and joyful. It takes away from us the fear that lies before us, the strifes that lie within us, the desperate conflict that is waged between a man’s conscience and his inclinations, between his will and his passions, which tears the heart asunder, and always makes sorrow and tumult wherever it comes. It takes away the sense of sin. It gives us, instead of the torpid conscience, or the angrily-stinging conscience-a conscience all calm from its accusations, with all the sting drawn out of it:-for quiet peace lies in the heart of the man that is trusting in the Lord. The Gospel works joy, because the soul is at rest in God; joy, because every function of the spiritual nature has found now its haven and its object; joy, because health has come, and the healthy working of the body or of the spirit is itself a gladness; joy, because the dim future is painted {where it is painted at all} with shapes of light and beauty, and because the very vagueness of these is an element in the greatness of its revelation. The joy that is in Christ is deep and abiding. Faith in Him naturally works gladness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I do not forget that, on the other side, it is equally true that the Christian faith has as marked and almost as strong an adaptation to produce a solemn ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sorrow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-solemn, manly, noble, and strong. ‘As sorrowful, yet always rejoicing,’ is the rule of the Christian life. If we think of what our faith does; of the light that it casts upon our condition, upon our nature, upon our responsibilities, upon our sins, and upon our destinies, we can easily see how, if gladness be one part of its operation, no less really and truly is sadness another. Brethren! all great thoughts have a solemn quiet in them, which not unfrequently merges into a still sorrow. There is nothing more contemptible in itself, and there is no more sure mark of a trivial nature and a trivial round of occupations, than unshaded gladness, that rests on no deep foundations of quiet, patient grief; grief, because I know what I am and what I ought to be; grief, because I have learnt the ‘exceeding sinfulness of sin’; grief, because, looking out upon the world, I see, as other men do not see, hell-fire burning at the back of the mirth and the laughter, and know what it is that men are hurrying to! Do you remember who it was that stood by the side of the one poor dumb man, whose tongue He was going to loose, and looking up to heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sighed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " before He could say, ‘Be opened’? Do you remember that of Him it is said, ‘God hath anointed Thee with the oil of gladness above Thy fellows’; and also, ‘a Man of sorrows, and acquainted with grief’? And do you not think that both these characteristics are to be repeated in the operations of His Gospel upon every heart that receives it? And if, by the hopes it breathes into us, by the fears that it takes away from us, by the union with God that it accomplishes for us, by the fellowship that it implants in us, it indeed anoints us all ‘with the oil of gladness’; yet, on the other hand, by the sense of mine own sin that it teaches me; by the conflict with weakness which it makes to be the law of my life; by the clear vision which it gives me of ‘the law of my members warring against the law of my mind, and bringing me into subjection’; by the intensity which it breathes into all my nature, and by the thoughts that it presents of what sin leads to, and what the world at present is, the Gospel, wheresoever it comes, will infuse a wise, valiant sadness as the very foundation of character. Yes, joy, but sorrow too! the joy of the Lord, but sorrow as we look on our own sin and the world’s woe! the head anointed with the oil of gladness, but also crowned with thorns!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These two are not contradictory. These two states of mind, both of them the natural operations of any deep faith, may co-exist and blend into one another, so as that the gladness is sobered, and chastened, and made manly and noble; and that the sorrow is like some thundercloud, all streaked with bars of sunshine, that pierce into its deepest depths. The joy lives in the midst of the sorrow; the sorrow springs from the same root as the gladness. The two do not clash against each other, or reduce the emotion to a neutral indifference, but they blend into one another; just as, in the Arctic regions, deep down beneath the cold snow, with its white desolation and its barren death, you will find the budding of the early spring flowers and the fresh green grass; just as some kinds of fire burn below the water; just as, in the midst of the barren and undrinkable sea, there may be welling up some little fountain of fresh water that comes from a deeper depth than the great ocean around it, and pours its sweet streams along the surface of the salt waste. Gladness, because I love, for love ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gladness; gladness, because I trust, for trust ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gladness; gladness, because I obey, for obedience is a meat that others know not of, and light comes when we do His will! But sorrow, because still I am wrestling with sin; sorrow, because still I have not perfect fellowship; sorrow, because mine eye, purified by my living with God, sees earth, and sin, and life, and death, and the generations of men, and the darkness beyond, in some measure as God sees them! And yet, the sorrow is surface, and the joy is central; the sorrow springs from circumstance, and the gladness from the essence of the thing;-and therefore the sorrow is transitory, and the gladness is perennial. For the Christian life is all like one of those sweet spring showers in early April, when the rain-drops weave for us a mist that hides the sunshine; and yet the hidden sun is in every sparkling drop, and they are all saturated and steeped in its light. ‘The joy of the Lord’ is the natural result and offspring of all Christian faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. And now, secondly, the ‘joy of the Lord’ or rejoicing in God, is a matter of Christian duty. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. And now, secondly, the ‘joy of the Lord’ or rejoicing in God, is a matter of Christian duty.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is a commandment here, and it is a command in the New Testament as well. ‘Neither be ye sorry, for the joy of the Lord is your strength.’ I need not quote to you the frequent repetitions of the same injunction which the Apostle Paul gives us, ‘Rejoice in the Lord always, and again I say, Rejoice’; ‘Rejoice evermore,’ and the like. The fact that this joy is enjoined us suggests to us a thought or two, worth looking at.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You may say with truth, ‘My emotions of joy and sorrow are not under my own control: I cannot help being glad and sad as circumstances dictate.’ But yet here it lies, a commandment. It is a duty, a thing that the Apostle enjoins; in which, of course, is implied, that somehow or other it is to a large extent within one’s own power, and that even the indulgence in this emotion, and the degree to which a Christian life shall be a cheerful life, is dependent in a large measure on our own volitions, and stands on the same footing as our obedience to God’s other commandments.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "can",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to a very great extent control even our own emotions; but then, besides, we can do more than that. It may be quite true, that you cannot help feeling sorrowful in the presence of sorrowful thoughts, and glad in the presence of thoughts that naturally kindle gladness. But I will tell you what you can do or refrain from doing-you can either go and stand in the light, or you can go and stand in the shadow. You can either fix your attention upon, and make the predominant subject of your religious contemplations, a truth which shall make you glad and strong, or a half-truth, which shall make you sorrowful, and therefore weak. Your meditations may either centre mainly upon your own selves, your faults and failings, and the like; or they may centre mainly upon God and His love, Christ and His grace, the Holy Spirit and His communion. You may either fill your soul with joyful thoughts, or though a true Christian, a real, devout, God-accepted believer, you may be so misapprehending the nature of the Gospel, and your relation to it, its promises and precepts, its duties and predictions, as that the prevalent tinge and cast of your religion shall be solemn and almost gloomy, and not lighted up and irradiated with the felt sense of God’s presence-with the strong, healthy consciousness that you are a forgiven and justified man, and that you are going to be a glorified one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And thus far {and it is a long way} by the selection or the rejection of the appropriate and proper subjects which shall make the main portion of our religious contemplation, and shall be the food of our devout thoughts, we can determine the complexion of our religious life. Just as you inject colouring matter into the fibres of some anatomical preparation; so a Christian may, as it were, inject into all the veins of his religious character and life, either the bright tints of gladness or the dark ones of self-despondency; and the result will be according to the thing that he has put into them. If your thoughts are chiefly occupied with God, and what He has done and is for you, then you will have peaceful joy. If, on the other hand, they are bent ever on yourself and your own unbelief, then you will always be sad. You can make your choice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christian men, the joy of the Lord is a duty. It is so because, as we have seen, it is the natural effect of faith, because we can do much to regulate our emotions directly, and much more to determine them by determining what set of thoughts shall engage us. A wise and strong faith is our duty. To keep our emotional nature well under control of reason and will is our duty. To lose thoughts of ourselves in God’s truth about Himself is our duty. If we do these things, we cannot fail to have Christ’s joy remaining in us, and making ours full. If we have not that blessed possession abiding with us, which He lived and died to give us, there is something wrong in us somewhere.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It seems to me that this is a truth which we have great need, my friends, to lay to heart. It is of no great consequence that we should practically confute the impotent old sneer about religion as being a gloomy thing. One does not need to mind much what some people say on that matter. The world would call ‘the joy of the Lord’ gloom, just as much as it calls ‘godly sorrow’ gloom. But we are losing for ourselves a power and an energy of which we have no conception, unless we feel that joy is a duty, and unless we believe that not to be joyful in the Lord is, therefore, more than a misfortune, it is a fault.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I do not forget that the comparative absence of this happy, peaceful sense of acceptance, harmony, oneness with God, springs sometimes from temperament, and depends on our natural disposition. Of course the natural character determines to a large extent the perspective of our conceptions of Christian truth, and the colouring of our inner religious life. I do not mean to say, for a moment, that there is one uniform type to which all must be conformed, or they sin. There is indeed one type, the perfect manhood of Jesus, but it is all comprehensive, and each variety of our fragmentary manhood finds its own perfecting, and not its transmutation to another fashion of man, in being conformed to Him. Some of us are naturally fainthearted, timid, sceptical of any success, grave, melancholy, or hard to stir to any emotion. To such there will be an added difficulty in making quiet confident joy any very familiar guest in their home or in their place of prayer. But even such should remember that the ‘powers of the world to come,’ the energies of the Gospel, are given to us for the very express purpose of overcoming, as well as of hallowing, natural dispositions. If it be our duty to rejoice in the Lord, it is no sufficient excuse to urge for not responding to the reiterated call, ‘I myself am disposed to sadness.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Whilst making all allowances for the diversities of character, which will always operate to diversify the cast of the inner life in each individual, we think that, in the great majority of instances, there are two things, both faults, which have a great deal more to do with the absence of joy from much Christian experience, than any unfortunate natural tendency to the dark side of things. The one is, an actual deficiency in the depth and reality of our faith; and the other is, a misapprehension of the position which we have a right to take and are bound to take.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is an actual deficiency in our faith. Oh, brethren! it is not to be wondered at that Christians do not find that the Lord with them is the Lord their strength and joy, as well as the Lord ‘their righteousness’; when the amount of their fellowship with Him is so small, and the depth of it so shallow, as we usually find it. The first true vision that a sinful soul has of God, the imperfect beginnings of religion, usually are accompanied with intense self-abhorrence, and sorrowing tears of penitence. A further closer vision of the love of God in Jesus Christ brings with it ‘joy and peace in believing.’ But the prolongation of these throughout life requires the steadfast continuousness of gaze towards Him. It is only where there is much faith and consequent love that there is much joy. Let us search our own hearts. If there is but little heat around the bulb of the thermometer, no wonder that the mercury marks a low degree. If there is but small faith, there will not be much gladness. The road into Giant Despair’s castle is through doubt, which doubt comes from an absence, a sinful absence, in our own experience, of the felt presence of God, and the felt force of the verities of His Gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But then, besides that, there is another fault: not a fault in the sense of crime or sin, but a fault {and a great one} in the sense of error and misapprehension. We as Christians do not take the position which we have a right to take and that we are bound to take. Men venture themselves upon God’s word as they do on doubtful ice, timidly putting a light foot out, to feel if it will bear them, and always having the tacit fear, ‘Now, it is going to crack!’ You must cast yourselves on God’s Gospel with all your weight, without any hanging back, without any doubt, without even the shadow of a suspicion that it will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "give",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-that the firm, pure floor will give, and let you through into the water! A Christian shrink from saying what the Apostle said, ‘I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in whom I have believed, and am persuaded that He is able to keep that which I have committed to Him until that day’! A Christian fancy that salvation is a future thing, and forget that it is a present thing! A Christian tremble to profess ‘assurance of hope,’ forgetting that there is no hope strong enough to bear the stress of a life’s sorrows, which is not a conviction certain as one’s own existence! Brethren! understand that the Gospel is a Gospel which brings a present salvation; and try to feel that it is not presumption, but simply acting out the very fundamental principle of it, when you are not afraid to say, ‘I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that my Redeemer is yonder, and I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that He loves me!’ Try to feel, I say, that by faith you have a right to take that position, ‘Now, we ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that we are the sons of God’; that you have a right to claim for yourselves, and that you are falling beneath the loftiness of the gift that is given to you unless you do claim for yourselves, the place of sons, accepted, loved, sure to be glorified at God’s right hand. Am I teaching presumption? am I teaching carelessness, or a dispensing with self-examination? No, but I am saying this: If a man have once felt, and feel, in however small and feeble a degree, and depressed by whatsoever sense of daily transgressions, if he feel, faint like the first movement of an imprisoned bird in its egg, the feeble pulse of an almost imperceptible and fluttering faith beat-then that man has a right to say, ‘God is mine!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As one of our great teachers, little remembered now said, ‘Let me take my personal salvation for granted’-and what? and ‘be idle?’ No; ‘and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from it.’ Ay, brethren! a Christian is not to be for ever asking himself, ‘Am I a Christian?’ He is not to be for ever looking into himself for marks and signs that he is. He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to look into himself to discover sins, that he may by God’s help cast them out, to discover sins that shall teach him to say with greater thankfulness, ‘What a redemption this is which I possess!’ but he is to base his convictions that he is God’s child upon something other than his own characteristics and the feebleness of his own strength. He is to have ‘joy in the Lord’ whatever may be his sorrow from outward things. And I believe that if Christian people would lay that thought to heart, they would understand better how the natural operation of the Gospel is to make them glad, and how rejoicing in the Lord is a Christian duty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " And now with regard to the other thought that still remains to be considered, namely, that rejoicing in the Lord is a source of strength,-I have already anticipated, fragmentarily, nearly all that I could have said here in a more systematic form. All gladness has something to do with our efficiency; for it is the prerogative of man that his force comes from his mind, and not from his body. That old song about a sad heart tiring in a mile, is as true in regard to the Gospel, and the works of Christian people, as in any other case. If we have hearts full of light, and souls at rest in Christ, and the wealth and blessedness of a tranquil gladness lying there, and filling our being; work will be easy, endurance will be easy, sorrow will be bearable, trials will not be so very hard, and above all temptations we shall be lifted, and set upon a rock. If the soul is full, and full of joy, what side of it will be exposed to the assault of any temptation? If the appeal be to fear, the gladness that is there is an answer. If the appeal be to passion, desire, wish for pleasure of any sort, there is no need for any more-the heart is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "full",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And so the gladness which rests in Christ will be a gladness which will fit us for all service and for all endurance, which will be unbroken by any sorrow, and, like the magic shield of the old legends, invisible, impenetrable, in its crystalline purity will stand before the tempted heart, and will repel all the ‘fiery darts of the wicked.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘The joy of the Lord is your strength,’ my brother! Nothing else is. No vehement resolutions, no sense of his own sinfulness, nor even contrite remembrance of past failures, ever yet made a man strong. It made him weak that he might become strong, and when it had done that it had done its work. For strength there must be hope, for strength there must be joy. If the arm is to smite with vigour, it must smite at the bidding of a calm and light heart. Christian work is of such a sort as that the most dangerous opponent to it is simple despondency and simple sorrow. ‘The joy of the Lord is your strength.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Well, then! there are two questions: How comes it that so much of the world’s joy is weakness? and how comes it that so much of the world’s notion of religion is gloom and sadness? Answer them for yourselves, and remember: you are weak unless you are glad; you are not glad and strong unless your faith and hope are fixed in Christ, and unless you are working from and not towards the sense of pardon, from and not towards the conviction of acceptance with God!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Nehemiah 8:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Eat the fat, and drink the sweet — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Feast before the Lord, as the duty of the day requires you to do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Send portions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — For the relief of your poor brethren, who otherwise must mourn while you rejoice. Concerning this duty and practice, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For this day is holy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Being the first new moon in the year, and the feast of trumpets, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and the beginning of this joyful month, in which so many days of thanksgiving are to be observed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the joy of the Lord is your strength — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, rejoicing in God, in the manner prescribed in his word, or serving him with cheerfulness and thankfulness, (which is always your duty, but now especially,) will give you that strength, both of body and mind, which you greatly need, that you may perform all the duties required of you, and oppose the designs of your enemies against you. But dejection of mind, and excessive grief, if you indulge it, will both offend God and damp your spirits, and will even weaken your very bodies, and make you unfit for God’s service, and an easy prey to your enemies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:9-12 It was a good sign that their hearts were tender, when they heard the words of the law. The people were to send portions to those for whom nothing was prepared. It is the duty of a religious feast, as well as of a religious fast, to draw out the soul to the hungry; God's bounty should make us bountiful. We must not only give to those that offer themselves, but send to those out of sight. Their strength consisted in joy in the Lord. The better we understand God's word, the more comfort we find in it; the darkness of trouble arises from the darkness of ignorance.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The \"sending of portions\" to the poor is not distinctly mentioned in any but the later historical Scriptures (compare the margin reference). The practice naturally grew out of this injunction of the Law ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ne 8:9-15. The People Comforted.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9, 10. This day is holy unto the Lord … mourn not, nor weep—A deep sense of their national sins, impressively brought to their remembrance by the reading of the law and its denunciations, affected the hearts of the people with penitential sorrow. But notwithstanding the painful remembrances of their national sins which the reading of the law awakened, the people were exhorted to cherish the feelings of joy and thankfulness associated with a sacred festival (see on [489]Le 23:24). By sending portions of it to their poorer brethren (De 16:11, 14; Es 9:19), they would also enable them to participate in the public rejoicings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Eat the fat, and drink the sweet; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " feast before the Lord, as the duty of the day obligeth you to do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Send portions unto them for whom nothing is prepared; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the relief of your poor brethren, who else must mourn whilst you rejoice. See of this duty and practice ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 16:11,14 Es 9:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",14 Es 9:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This day is holy unto our Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being the feast of trumpets, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 23:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the beginning of this joyful month, wherein so many days of feasting and thanksgiving were to be observed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The joy of the Lord is your strength, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. rejoicing in God in the manner prescribed in his word, or serving him with cheerfulness and thankfulness, which is your duty always, but now especially, will give you that strength both of mind and body which you greatly need, both to perform all the duties required of you, and to endure and oppose all the crafty counsels and malicious designs of your enemies against you; whereas this dejection of mind, and excessive grief, if you indulge it, will both offend God, and damp your spirits, and weaken your very bodies, and make you unfit for God’s service, or for your own necessary occasions, and so an easy prey to your enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then he said unto them,.... Nehemiah the Tirshatha or governor: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "go your way; to their own houses, and refresh themselves; it being noon, and they had stood many hours attentive to the reading and expounding of the law: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "eat the fat, and drink the sweet: not a common meal, but a feast, consisting of the richest provisions, the best of food and liquors ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and send portions unto them for whom nothing is prepared; for the poor, who had no food at home provided for them; the widow, fatherless, and stranger, who at festivals were to partake of the entertainment, Deuteronomy 16:11 ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and send portions unto them for whom nothing is prepared; for the poor, who had no food at home provided for them; the widow, fatherless, and stranger, who at festivals were to partake of the entertainment, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 16:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for this day is holy unto our Lord: neither be you sorry; confirming what the Levites had said and exhorted to, Nehemiah 8:9 ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for this day is holy unto our Lord: neither be you sorry; confirming what the Levites had said and exhorted to, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for the joy of the Lord is your strength; to rejoice, as the Lord commanded them on such days as these, was a means both of increasing their bodily strength and their inward strength, and of fitting them the more to perform their duty to God and men with cheerfulness, which sorrow and heaviness made unfit for; and the joy which has the Lord for its object, and comes from him, is the cause of renewing spiritual strength, so as to run and not be weary, walk and not faint, in the ways of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the joy of the Lord is your strength; to rejoice, as the Lord commanded them on such days as these, was a means both of increasing their bodily strength and their inward strength, and of fitting them the more to perform their duty to God and men with cheerfulness, which sorrow and heaviness made unfit for; and the joy which has the Lord for its object, and comes from him, is the cause of renewing spiritual strength, so as to run and not be weary, walk and not faint, in the ways of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then he said unto them, Go your way, eat the fat, and drink the sweet, and send portions unto them for whom nothing is {f} prepared: for this day is holy unto our Lord: neither be ye sorry; for the {g} joy of the LORD is your strength.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then he said unto them, Go your way, eat the fat, and drink the sweet, and send portions unto them for whom nothing is ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prepared: for ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "this",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " day ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " holy unto our Lord: neither be ye sorry; for the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " joy of the LORD is your strength.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) That is, remember the poor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Rejoice in the Lord, and he will give you strength.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then he said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Who issued the command, we are not told. Clearly either Nehemiah or Ezra. Some think Nehemiah because as governor he would be the person to issue authoritative directions. But more probably Ezra is intended; for (1) Ezra’s name is most conspicuous throughout this whole episode; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nehemiah 8:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; (2) the language used is that of the teacher of the Law rather than that of the practical governor.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eat the fat, and drink the sweet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A proverbial expression, meaning that the occasion was not one of fasting and grief. LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φάγετε λιπάσματα καὶ πίετε γλυκάσματα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Vulg. ‘comedite pinguia et bibite mulsum.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "send portions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Doubtless with the thought of remembering the poor and needy more especially, as according to the law of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the Feast of Tabernacles is described, ‘And thou shalt rejoice in thy feast, thou, and thy son, and thy daughter, and thy manservant, and the Levite, and the stranger, and the fatherless and the widow that are within thy gates.’ But the allusion seems primarily to be to the custom of interchanging ‘portions’ on festal occasions, e.g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘a day of gladness and feasting, and a good day, and of sending portions to one another,’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘days of feasting and gladness, and of sending portions one to another and gifts to the poor.’ Nabal’s churlishness was the violation of an almost sacred rule, 1 Samuel 25, cf. R. Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Relig. of Semites",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For this custom of open-handed distribution on the occasion of great sacrificial feasts, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 39:17-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither be ye sorry",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "grieved.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μὴ διαπέσητε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Vulg. ‘no-lite contristari’. The R.V. gives the same rendering as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nehemiah 8:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 8:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the joy of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "your strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. marg. ‘Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stronghold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’. This joy of the Lord is not the joy of the Lord over Israel; but Israel’s joy in her Lord. Israel’s joy at her great festivals is based on her confidence that the Lord ever protects her. Gladness in Him is in proportion to the faith in the protection which He gives. The English version is that of the Vulgate, ‘gaudium etenim Domini est fortitudo nostra.’ The LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι ἐστὶ κύριος ἰσχὺς ἡμῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " omitted to render the somewhat unusual word for ‘joy,’ which elsewhere occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 16:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The rendering ‘stronghold’ in the R.V. marg. gives the more common meaning, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘He is their stronghold in the time of trouble.’ He that rejoices in Jehovah has a strong fortress from which he can repel all adversaries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then he said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either Ezra or Nehemiah, but probably the former, to whom it appertained to give religious directions",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": ". Eat the fat and drink the sweet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"Go and enjoy yourselves, eat and drink of the best - let there be no fasting, nor even abstinence, on such a day as this.\" But at the same time ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "send portions unto them for whom nothing is prepared",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Make the poor partakers of your joy. \"The stranger, the fatherless, and the widow\" should have their part in the feast (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And for yourselves, remember that ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the joy of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " religious joy, constitutes ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "your",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nehemiah 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said to them (viz., Nehemiah as governor and head of the community, though the fact that his address is mentioned does not exclude the participation of Ezra and the Levites): \"Go, eat the fat, and drink the sweet, and send gifts to them for whom nothing is prepared, for this day is holy to our Lord; neither be ye sorry, for joy in Jahve is your refuge.\" משׁמנּים, fatnesses (λιπάσματα, lxx), fat pieces of meat, not \"rich cakes\" (Bertheau); comp. שׁמנים משׁתּה, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ממתּקּים, sweetened drinks. The sense is: Make glad repasts on good feast-day food and drink; and send portions to the poor who have prepared nothing, that they too may rejoice on this festival. מנות, gifts, are portions of food; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hence we see that it was customary with the Israelites to send portions of food and drink, on festivals, to the houses of the poor, that they too might share in the joy of the day. נכון לאן for נכון אין לאשׁר (see rem. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 15:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to them for whom nothing is prepared, who have not the means to prepare a feast-day meal. Because the day is holy to the Lord, they are to desire it with holy joy. יהוה חדות is a joy founded on the feeling of communion with the Lord, on the consciousness that we have in the Lord a God long-suffering and abundant in goodness and truth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This joy is to be to them מעוז, a strong citadel or refuge, because the Almighty is their God; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      }
    ]
  }
]