[{"num":8,"verse":"13 The flood ceaseth. 16 Noah is commanded to come forth of the Ark with his. 20 He sacrificeth to the Lord. 22 God promiseth that all things should continue in their first order."},{"num":1,"verse":"Now God remembered Noah and every beast, and all the cattle that were with him in the Ark: therefore God made a wind to pass upon the earth, and the waters ceased."},{"num":2,"verse":"The fountains also of the deep and the windows of heaven were stopped, and the rain from heaven was restrained."},{"num":3,"verse":"And the waters returned from above the earth, going and returning: and after the end of the hundred and fiftieth day the waters abated."},{"num":4,"verse":"And in the seventh month, in the seventeenth day of the month, the Ark rested upon the mountains of Ararat."},{"num":5,"verse":"And the waters were going and decreasing until the tenth month: in the tenth month, and in the first day of the month, were the tops of the mountains seen."},{"num":6,"verse":"¶ So after forty days, Noah opened the window of the Ark which he had made,"},{"num":7,"verse":"And sent forth a raven, which went out, going forth and returning, until the waters were dried up upon the earth."},{"num":8,"verse":"Again he sent a dove from him, that he might see if the waters were diminished from off the earth."},{"num":9,"verse":"But the dove found no rest for the sole of her foot: therefore she returned unto him into the Ark (for the waters were upon the whole earth) and he put forth his hand, and received her, and took her to him into the Ark."},{"num":10,"verse":"And he abode yet another seven days, and again he sent forth the dove out of the Ark."},{"num":11,"verse":"And the dove came to him in the evening, and lo in her mouth was an olive leaf that she had plucked: whereby Noah knew that the waters were abated from off the earth."},{"num":12,"verse":"Notwithstanding, he waited yet another seven days, and sent forth the dove, which returned not again unto him anymore."},{"num":13,"verse":"¶ And in the six hundred and one year, in the first day of the first month, the waters were dried up from off the earth: and Noah removed the covering of the Ark, and looked, and behold, the upper part of the ground was dry."},{"num":14,"verse":"And in the second month, in the seven and twentieth day of the month, was the earth dry."},{"num":15,"verse":"¶ Then God spake to Noah, saying,"},{"num":16,"verse":"Go forth of the Ark, thou, and thy wife, and thy sons, and thy sons’ wives with thee."},{"num":17,"verse":"Bring forth with thee every beast that is with thee, of all flesh, both fowl and cattle, and everything that creepeth and moveth upon the earth, that they may breed abundantly in the earth, and bring forth fruit and increase upon the earth."},{"num":18,"verse":"So Noah came forth, and his sons, and his wife, and his sons’ wives with him."},{"num":19,"verse":"Every beast, every creeping thing, and every fowl, all that moveth upon the earth, after their kinds, went out of the Ark."},{"num":20,"verse":"¶ Then Noah built an altar to the Lord, and took of every clean beast, and of every clean fowl, and offered burnt offerings upon the altar."},{"num":21,"verse":"And the Lord smelled a savor of rest, and the Lord said in his heart, I will henceforth curse the ground no more for man’s cause: for the imagination of man’s heart is evil, even from his youth: neither will I smite anymore all things living, as I have done."},{"num":22,"verse":"Hereafter seed time and harvest, and cold and heat, and Summer and Winter, and day and night shall not cease, so long as the earth remaineth."}]