[{"header":"God Remembers Noah"},{"num":8,"verse":"Elohim remembered Noah and all the wild and domestic animals with him in the ship. So Elohim made a wind blow over the earth, and the water started to go down. "},{"num":2,"verse":"The deep springs and the sky had been shut, and the rain had stopped pouring. "},{"num":3,"verse":"The water began to recede from the land. At the end of 150 days the water had decreased. "},{"num":4,"verse":"On the seventeenth day of the seventh month, the ship came to rest in the mountains of Ararat. "},{"num":5,"verse":"The water kept decreasing until the tenth month. On the first day of the tenth month, the tops of the mountains appeared."},{"num":6,"verse":"After 40 more days Noah opened the window he had made in the ship "},{"num":7,"verse":"and sent out a raven. It kept flying back and forth until the water on the land had dried up. "},{"num":8,"verse":"Next, he sent out a dove to see if the water was gone from the surface of the ground. "},{"num":9,"verse":"The dove couldn’t find a place to land because the water was still all over the earth. So it came back to Noah in the ship. He reached out and brought the dove back into the ship. "},{"num":10,"verse":"He waited seven more days and again sent the dove out of the ship. "},{"num":11,"verse":"The dove came to him in the evening, and in its beak was a freshly plucked olive leaf. Then Noah knew that the water was gone from the earth. "},{"num":12,"verse":"He waited seven more days and sent out the dove again, but it never came back to him."},{"num":13,"verse":"By the first day of the first month of Noah’s six hundred and first year, the water on the land had dried up. Noah opened the top of the ship, looked out, and saw the surface of the ground. "},{"num":14,"verse":"By the twenty-seventh day of the second month the land was dry."},{"num":15,"verse":"Then Elohim spoke to Noah, "},{"num":16,"verse":"“Come out of the ship with your wife, your sons, and your sons’ wives. "},{"num":17,"verse":"Bring out every animal that’s with you: birds, domestic animals, and every creature that crawls on the earth. Be fertile, increase in number, and spread over the earth.”"},{"num":18,"verse":"So Noah came out with his sons, his wife, and his sons’ wives. "},{"num":19,"verse":"Every animal, crawling creature, and bird—everything that moves on the earth—came out of the ship, one kind after another."},{"num":20,"verse":"Noah built an altar to Yahweh. On it he made a burnt offering of each type of clean animal and clean bird. "},{"num":21,"verse":"Yahweh smelled the soothing aroma. Yahweh said to himself, “I will never again curse the ground because of humans, even though from birth their hearts are set on nothing but evil. I will never again kill every living creature as I have just done."}]