[{"header":"God’s First Complaint: Against His People—A Despised Love"},{"num":1,"verse":"A declaration: a message from the Lord to Israel by Malachi."},{"num":2,"verse":"“I’ve loved you,” says the Lord. “But you ask, ‘How have you loved us?’"},{"num":3,"verse":"hated Esau, turned his mountains into a wasteland, and gave his inheritance to desert jackals. "},{"num":4,"verse":"Even though Edom may claim, ‘We were crushed, but we will return and rebuild the ruins,’ this is what the Lord of the Heavenly Armies says: “They may rebuild, but I’ll demolish. People will call them, ‘The Wicked Land,’ and, ‘The People With Whom the Lord is Forever Angry.’ "},{"num":5,"verse":"Your own eyes will see this, and you will say, ‘Great is the Lord even beyond the borders of Israel!’”"},{"header":"God’s Second Complaint: Against His Priests—A Despised Offering"},{"num":6,"verse":"“A son honors his father and a servant his master. So if I’m a father, where is my honor? And if I’m a master, where is my respect?” says the Lord of the Heavenly Armies to you priests who are despising my name. “But you ask, ‘How have we despised your name?’ "},{"num":7,"verse":"By presenting defiled food on my altar. And you ask, ‘How have we defiled you?’ By saying, ‘The Table of the Lord is contemptible.’ "},{"num":8,"verse":"When you bring blind animals for sacrifice, is that not wrong? And when you sacrifice crippled or diseased animals, is that not wrong? Offer that to your governor—would he be pleased with you or receive you favorably?” asks the Lord of the Heavenly Armies. "},{"num":9,"verse":"“And now, go ahead and implore God by saying, ‘Be gracious to us.’ Will he receive you favorably and accept offerings like that from your hand?” asks the Lord of the Heavenly Armies."},{"header":"Useless Offerings and Useless Altar Fires"},{"num":10,"verse":"“Oh, that one of you would shut the Temple doors and not light useless fires on the altar! I’m not pleased with you,” says the Lord of the Heavenly Armies, “and I’ll accept no offerings from you. "},{"num":11,"verse":"Even so, from where the sun rises to where it sets my name will be great among the Gentiles. Incense will be brought to me everywhere, along with pure offerings, because my name will be great among the Gentiles,” says the Lord of the Heavenly Armies. "},{"num":12,"verse":"“But you are profaning my name by saying that the Table of the Lord is defiled and that its fruit and its food are contemptible."},{"num":13,"verse":"“And you say, ‘What a burden!’ and sniff contemptuously at it,” says the Lord of the Heavenly Armies, “when you present maimed, crippled, and diseased animals, and when you bring the offering. Should I accept this from your hand?” asks the Lord. "},{"num":14,"verse":"“Cursed is the deceiver who has an acceptable male in his flock, and vows to give it, but sacrifices a mutilated one to the Lord. Indeed, I am a great king,” says the Lord of the Heavenly Armies, “and my name is feared among the Gentiles.”"}]