[{"header":"The Courtyards of the Lord’s New Temple"},{"num":42,"verse":"Then the man led me out toward the north to the outer courtyard. He brought me to the side rooms opposite both the open area and the northern building. "},{"num":2,"verse":"The building that faced north was 175 feet long and 87½ feet wide. "},{"num":3,"verse":"Opposite the inner courtyard was an area that was 35 feet wide, and opposite the pavement of the outer courtyard were corridors facing corridors on all three stories. "},{"num":4,"verse":"In front of the side rooms was a walkway, 17½ feet wide and 175 feet long. The doors of these side rooms faced north."},{"num":5,"verse":"The side rooms on the third story were narrower than those on the first or second stories of the building because the corridors took space away from them. "},{"num":6,"verse":"The rooms were in three stories. They didn’t have pillars like the pillars in the courtyards. That is why the rooms on the third story were set farther back than those on the first and second stories. "},{"num":7,"verse":"There was a wall which ran parallel to the side rooms and the outer courtyard. It ran alongside the side rooms for 87½ feet. "},{"num":8,"verse":"The row of rooms in the outer courtyard was 87½ feet long. The rooms that faced the temple were 175 feet long. "},{"num":9,"verse":"These lower side rooms had an entrance on the east side. A person was able to enter the outer courtyard through them."},{"num":10,"verse":"There were side rooms parallel to the wall of the courtyard on the south side. They faced the open area and the building. "},{"num":11,"verse":"There was a walkway in front of them like the one that was in front of the side rooms on the north side. These side rooms were as long and as wide as the northern rooms. They had the same exits, dimensions, and doors. "},{"num":12,"verse":"The doors to the south rooms were the same as the doors to the north rooms. There was a doorway at the other end of the walkway that was parallel to the corresponding wall that ran eastward. People entered through that doorway."},{"num":13,"verse":"Then the man said to me, “The northern and southern side rooms that face the open area are holy rooms. These rooms are where the priests who come near the Lord eat the holiest offerings. Because these rooms are holy, the priests keep the holiest offerings there: the grain offerings, the offerings for sin, and the guilt offerings. "},{"num":14,"verse":"Once the priests enter the holy place, they must not go out of the holy place into the outer courtyard until they leave behind the clothes that they wore as they served. These clothes are holy. The priests must put on other clothes. Then they can go into the area that is for the people.”"},{"num":15,"verse":"When the man had finished measuring the inner part of the temple area, he led me out through the east gate. Then he measured all the way around the outer area. "},{"num":16,"verse":"He measured the east side with a measuring stick. It was 875 feet long according to the measuring stick. "},{"num":17,"verse":"He measured the north side. It was 875 feet long according to the measuring stick. "},{"num":18,"verse":"He measured the south side. It was 875 feet long according to the measuring stick. "},{"num":19,"verse":"He came around to the west side and measured it. It was 875 feet long according to the measuring stick. "},{"num":20,"verse":"So he measured all four sides. There was a wall all around it. The wall was 875 feet long and 875 feet wide. It separated what was holy from what was unholy."}]