[{"num":42,"verse":"¶ Then he brought me forth into the outer court, the way toward the north; and he brought me into the chamber that was over against the space which was in front of the building toward the north."},{"num":2,"verse":"In front of the north door the length was one hundred cubits, and the breadth was fifty cubits."},{"num":3,"verse":"Over against the twenty cubits which were in the inner court, and over against the pavement which was in the outer court, were the chambers in three stories."},{"num":4,"verse":"And in front of the chambers was a walk of ten cubits breadth inward, a way of one cubit; and their doors toward the north."},{"num":5,"verse":"Now the upper chambers were shorter; for the galleries took away from the others, from the lower ones and from the middle ones."},{"num":6,"verse":"For they were in three stories, but did not have pillars as the pillars of the courts; therefore they were narrower than the lowest and the middlemost from the ground."},{"num":7,"verse":"And the wall that was without over against the chambers, toward the outer court in front of the chambers, was fifty cubits long."},{"num":8,"verse":"For the length of the chambers that were in the outer court was fifty cubits; and before the front of the temple were one hundred cubits."},{"num":9,"verse":"And under these chambers was the entry to the temple on the east side, to enter in to it from the outer court."},{"num":10,"verse":"All along the wall of the court toward the east, over against the separate place, and in front of the building were chambers."},{"num":11,"verse":"And the way before them was like the appearance of the chambers which were toward the north, as long as they, and as broad as they; and all their goings out were both according to their fashions, and according to their doors."},{"num":12,"verse":"And according to the doors of the chambers that were toward the south was a door in the head of the way, even the way directly in front of the wall toward the east, as one enters into them."},{"num":13,"verse":"Then he said unto me, The north chambers and the south chambers, which are before the separate place, they are holy chambers, where the priests that approach unto the LORD shall eat the holy offerings; there they shall lay the holy offerings, and the present, and that which was offered as sin, and as guilt; for the place is holy."},{"num":14,"verse":"When the priests enter therein, then they shall not go out of the holy place into the outer court, but there they shall lay their garments in which they minister; for they are holy; and shall put on other garments, and in this manner shall approach unto that which is of the people."},{"num":15,"verse":"¶ Now when he had made an end of measuring the inner house, he brought me forth by the way of the gate facing toward the east and measured it round about."},{"num":16,"verse":"He measured the east side with the measuring reed, five hundred reeds with the measuring reed round about."},{"num":17,"verse":"He measured the north side, five hundred reeds with the measuring reed round about."},{"num":18,"verse":"He measured the south side, five hundred reeds with the measuring reed."},{"num":19,"verse":"He turned about to the west side, and measured five hundred reeds with the measuring reed."},{"num":20,"verse":"He measured it by the four sides: it had a wall round about, five hundred reeds long, and five hundred broad, to make a separation between the sanctuary and the profane place."}]