[{"num":42,"verse":"Then he [the angelic being] brought me forth into the khatzer hakhatzonah, the way toward the north; and he brought me into the lishka that was opposite the Gizrah, and which was opposite the Binyan toward the north."},{"num":2,"verse":"Before the length of a hundred cubits was the Petach HaTzafon, and the width was fifty cubits."},{"num":3,"verse":"Opposite the twenty cubits of the khatzer hapenimah, and opposite the ritzpah which was for the khatzer hakhitzonah, was atik (balcony) against atik in three stories."},{"num":4,"verse":"And before the leshakhot was a mahalach (walkway) ten cubits in width leading inward, a way of one cubit; and their doors toward the north."},{"num":5,"verse":"Now the upper leshakhot were narrow; for the atikim took space from these, from the lower, and from the middlemost of the Binyan."},{"num":6,"verse":"For they were in three stories, but had not ammudim like the ammudim of the khatzerot; therefore they were set back from the ground more than the lowest and the middlemost."},{"num":7,"verse":"And the wall that was outside over against the leshakhot, toward the khatzer hakhitzonah on the forepart of the leshakhot, the length thereof was fifty cubits."},{"num":8,"verse":"For the length of the leshakhot that were in the khatzer hakhitzonah was fifty cubits; and, hineh, before the Heikhal were a hundred cubits."},{"num":9,"verse":"And from below these leshakhot was the entrance on the east side, as one goeth into them from the khatzer hakhitzonah."},{"num":10,"verse":"In the thickness of the wall of the khatzer toward the east, facing the Gizrah, and over against the Binyan, were leshakhot (side rooms)."},{"num":11,"verse":"And the derech before them was like the appearance of the leshakhot which were toward the north, as long as they, and as wide as they; and all their exits were both according to their arrangements, and according to their doorways."},{"num":12,"verse":"And according to the doorways of the leshakhot that were toward the south was a petach in the rosh of the derech, even the derech directly before the wall toward the east, as one entereth into them."},{"num":13,"verse":"Then said he [the angelic being] unto me, The leshakhot hatzafon and the leshakhot hadarom, which are before the Gizrah, they are leshakhot hakodesh, where the Kohanim that approach unto Hashem shall eat the kadshei hakadashim; there shall they put the kadshei hakadashim, and the minchah, and the chattat, and the asham (trespass offering); for the place is kadosh."},{"num":14,"verse":"When the Kohanim enter therein, then shall they not go out of the Kodesh into the khatzer hakhitzonah, but there they shall lay their garments wherein they minister; for they are kodesh; and shall put on begadim acherim (other garments); then shall they approach the precinct of the people."},{"num":15,"verse":"Now when he [the angelic being] had made an end of measuring the Beis HaPenimi, he brought me forth toward the sha’ar whose view is toward the east, and measured it all around."},{"num":16,"verse":"He measured the eastern side with the measuring rod, five hundred rods, with the keneh hamiddah (measuring rod) all around."},{"num":17,"verse":"He measured the northern side, five hundred rods, with the keneh hamiddah all around."},{"num":18,"verse":"He measured the southern side, five hundred rods, with the keneh hamiddah."},{"num":19,"verse":"He turned about to the western side, and measured five hundred rods with the keneh hamiddah."},{"num":20,"verse":"He measured it by the four sides; it had a wall all around, five hundred rods long, and five hundred wide, lehavdil (to make a separation) between the Kodesh (Holy Precinct, area) and the Chol (Common Precinct, area)."}]