[{"header":"Instructions for the nazirite"},{"num":6,"verse":"The Lord spoke to Moses:"},{"num":2,"verse":"Speak to the Israelites and say to them: If a man or a woman makes a binding promise to be a nazirite in order to be dedicated to the Lord,"},{"num":3,"verse":"that person must refrain from wine and brandy. He or she may not drink wine vinegar or brandy vinegar, nor drink any grape juice or eat grapes, whether fresh or dried."},{"num":4,"verse":"While a nazirite, the person may not eat anything produced from the grapevine, not even its seeds or skin."},{"num":5,"verse":"For the term of the nazirite promise, no razor may be used on the head until the period of dedication to the Lord is fulfilled. The person is to be holy, letting his or her hair grow untrimmed."},{"num":6,"verse":"The period of dedication to the Lord also requires that the person not go near a corpse,"},{"num":7,"verse":"whether father, mother, brother, or sister. Nazirites should not defile themselves because of the death of these people, because they bear the sign of their dedication to God on their heads."},{"num":8,"verse":"While a nazirite, the person is holy to the Lord."},{"num":9,"verse":"If someone suddenly dies nearby, defiling the head of the nazirite, he or she will shave the head on the day of cleansing; they will shave it on the seventh day."},{"num":10,"verse":"On the eighth day the person will bring two turtledoves or two young doves to the priest at the entrance of the meeting tent."},{"num":11,"verse":"The priest will offer one for a purification offering and the other as an entirely burned offering. He will seek reconciliation for the person on account of the guilt acquired from the corpse, and he will make the head holy again on that same day."},{"num":12,"verse":"The person will be rededicated to the Lord as a nazirite and bring a one-year-old male lamb for a compensation offering. The previous period will be invalid, because the nazirite promise was defiled."},{"num":13,"verse":"This is the Instruction for the nazirite. When the term as a nazirite is completed, the person will be brought to the entrance of the meeting tent"},{"num":14,"verse":"and offer a gift to the Lord, consisting of a flawless one-year-old male lamb as an entirely burned offering, a flawless one-year-old female lamb as a purification offering, one flawless ram as a well-being sacrifice,"},{"num":15,"verse":"and a basket of loaves of unleavened bread made with fine flour and mixed with oil, and unleavened wafers spread with oil, along with their grain offering and their drink offering."},{"num":16,"verse":"The priest will come close to the Lord and offer the purification and entirely burned offerings."},{"num":17,"verse":"The ram he will offer as a well-being sacrifice to the Lord with the basket of unleavened bread; then the priest will offer the grain offering and the drink offering."},{"num":18,"verse":"The nazirite will shave his ordained head at the meeting tent’s entrance, take the hair from his ordained head, and put it in the fire under the well-being sacrifice."},{"num":19,"verse":"The priest will take the shoulder from the ram after it is boiled, one piece of unleavened bread from the basket, and one unleavened wafer, and place them in the hands of the nazirite after the ordained head is shaved."},{"num":20,"verse":"Then the priest will raise them as an uplifted offering before the Lord; they are holy to the priest, with the breast of the uplifted offering and the thigh of the gift offering. After this the nazirite may drink wine."},{"num":21,"verse":"This is the instruction for the nazirite who takes the solemn promise. That person’s offering to the Lord will be in accordance with the nazirite promise, in addition to whatever else the person may have offered. The person must do just as they have promised, in adherence with the nazirite promise."},{"header":"Priestly blessing"},{"num":22,"verse":"The Lord spoke to Moses:"},{"num":23,"verse":"Tell Aaron and his sons: You will bless the Israelites as follows. Say to them:"},{"num":27,"verse":"They will place my name on the Israelites, and I will bless them."}]