[{"header":"The Nazirites"},{"num":6,"verse":"The Lord spoke to Moses, saying: "},{"num":2,"verse":"Speak to the Israelites and say to them: When either men or women make a special vow, the vow of a nazirite, to separate themselves to the Lord, "},{"num":3,"verse":"they shall separate themselves from wine and strong drink; they shall drink no wine vinegar or other vinegar, and shall not drink any grape juice or eat grapes, fresh or dried. "},{"num":4,"verse":"All their days as nazirites they shall eat nothing that is produced by the grape-vine, not even the seeds or the skins."},{"num":5,"verse":"All the days of their nazirite vow no razor shall come upon the head; until the time is completed for which they separate themselves to the Lord, they shall be holy; they shall let the locks of the head grow long."},{"num":6,"verse":"All the days that they separate themselves to the Lord they shall not go near a corpse. "},{"num":7,"verse":"Even if their father or mother, brother or sister, should die, they may not defile themselves; because their consecration to God is upon the head. "},{"num":8,"verse":"All their days as nazirites they are holy to the Lord."},{"num":9,"verse":"If someone dies very suddenly nearby, defiling the consecrated head, then they shall shave the head on the day of their cleansing; on the seventh day they shall shave it. "},{"num":10,"verse":"On the eighth day they shall bring two turtle-doves or two young pigeons to the priest at the entrance of the tent of meeting, "},{"num":11,"verse":"and the priest shall offer one as a sin-offering and the other as a burnt-offering, and make atonement for them, because they incurred guilt by reason of the corpse. They shall sanctify the head that same day, "},{"num":12,"verse":"and separate themselves to the Lord for their days as nazirites, and bring a male lamb a year old as a guilt-offering. The former time shall be void, because the consecrated head was defiled."},{"num":13,"verse":"This is the law for the nazirites when the time of their consecration has been completed: they shall be brought to the entrance of the tent of meeting, "},{"num":14,"verse":"and they shall offer their gift to the Lord, one male lamb a year old without blemish as a burnt-offering, one ewe lamb a year old without blemish as a sin-offering, one ram without blemish as an offering of well-being, "},{"num":15,"verse":"and a basket of unleavened bread, cakes of choice flour mixed with oil, and unleavened wafers spread with oil, with their grain-offering and their drink-offerings. "},{"num":16,"verse":"The priest shall present them before the Lord and offer their sin-offering and burnt-offering, "},{"num":17,"verse":"and shall offer the ram as a sacrifice of well-being to the Lord, with the basket of unleavened bread; the priest also shall make the accompanying grain-offering and drink-offering. "},{"num":18,"verse":"Then the nazirites shall shave the consecrated head at the entrance of the tent of meeting, and shall take the hair from the consecrated head and put it on the fire under the sacrifice of well-being. "},{"num":19,"verse":"The priest shall take the shoulder of the ram, when it is boiled, and one unleavened cake out of the basket, and one unleavened wafer, and shall put them in the palms of the nazirites, after they have shaved the consecrated head. "},{"num":20,"verse":"Then the priest shall elevate them as an elevation-offering before the Lord; they are a holy portion for the priest, together with the breast that is elevated and the thigh that is offered. After that the nazirites may drink wine."},{"num":21,"verse":"This is the law for the nazirites who take a vow. Their offering to the Lord must be in accordance with the nazirite vow, apart from what else they can afford. In accordance with whatever vow they take, so they shall do, following the law for their consecration."},{"header":"The Priestly Benediction"},{"num":22,"verse":"The Lord spoke to Moses, saying: "},{"num":23,"verse":"Speak to Aaron and his sons, saying, Thus you shall bless the Israelites: You shall say to them,"},{"num":27,"verse":"So they shall put my name on the Israelites, and I will bless them."}]