[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) It would be better to adopt the slightly different reading indicated by the rendering of the LXX., and translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As for Ephraim, what has he to do with, &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here again, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Hebrew for “thy fruit” contains a play on the name Ephraim. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (says Jehovah) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "am to thee an evergreen tree of life and protection, and from me is thy fruit found.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 14:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephraim shall say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are not in the Hebrew. The clause is therefore translated thus by Bishop Horsley, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephraim! What have I to do any more with idols, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“an exultation,” says he, “of Jehovah over idols. Ephraim! even he is returned to me. I have no more contest to carry on with idols. They are completely overthrown. My sole Godhead is confessed.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have heard him, and observed him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is I, not his idols, who have heard his petitions and watched over him to preserve him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am like a green fir-tree — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If these be understood as the words of God, the meaning is, It is I, who am ever-existing, and have it in my power to give my people blessings at all times; as the fir is ever green and flourishing, and affords its shelter, not only in the summer, but in the winter too, when all the rest of the trees are stripped of their leaves and can afford no shelter at all. In other words, As a weary traveller finds rest and safety under a green, thick, and flourishing tree, so there are safety and refreshment under the protection of Jehovah. But some understand these as the words of Ephraim, or Israel, acknowledging that he is in a flourishing condition; and then God reminds him in the next words, that his fruitfulness and prosperity are wholly owing to the divine blessing. Thus the church of God, and all the members thereof, how much soever they may abound in the fruits of righteousness, and in the comforts connected therewith, must confess, that from Christ the true and living vine ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fruit found; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and they must not fail to give him the glory thereof, remembering, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without him they can do nothing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "excellent or praiseworthy; nothing that will ultimately promote the glory of God, or their own salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:4-8 Israel seeks God's face, and they shall not seek it in vain. His anger is turned from them. Whom God loves, he loves freely; not because they deserve it, but of his own good pleasure. God will be to them all they need. The graces of the Spirit are the hidden manna, hidden in the dew; the grace thus freely bestowed on them shall not be in vain. They shall grow upward, and be more flourishing; shall grow as the lily. The lily, when come to its height, is a lovely flower, Mt 6:28,29. They shall grow downward, and be more firm. With the flower of the lily shall be the strong root of the cedar of Lebanon. Spiritual growth consists most in the growth of the root, which is out of sight. They shall also spread as the vine, whose branches extend very widely. When believers abound in good works, then their branches spread. They shall be acceptable both to God and man. Holiness is the beauty of a soul. The church is compared to the vine and the olive, which bring forth useful fruits. God's promises pertain to those only that attend on his ordinances; not such as flee to this shadow only for shelter in a hot gleam, but all who dwell under it. When a man is brought to God, all who dwell under his shadow fare the better. The sanctifying fruits shall appear in his life. Thus believers grow up into the experience and fruitfulness of the gospel. Ephraim shall say, God will put it into his heart to say it, What have I to do any more with idols! God's promises to us are more our security and our strength for mortifying sin, than our promises to God. See the power of Divine grace. God will work such a change in him, that he shall loathe the idols as much as ever he loved them. See the benefit of sanctified afflictions. Ephraim smarted for his idolatry, and this is the fruit, even the taking away his sin, Isa 27:9. See the nature of repentance; it is a firm and fixed resolution to have no more to do with sin. The Lord meets penitents with mercy, as the father of the prodigal met his returning son. God will be to all true converts both a delight and a defence; they shall sit under his shadow with delight. And as the root of a tree; From me is thy fruit found: from Him we receive grace and strength to enable us to do our duty.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ephraim shall say, what have I to do anymore with idols? - So Isaiah fortells, \"The idols He shall utterly abolish\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Aforetime Ephraim said obstinately, in the midst of God's chastisements; \"I will go after my lovers, who give me my bread and my water, my wool and my flax, mine oil and my drink\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now she shall renounce them wholly and forever. This is entire conversion, to part wholly with everything which would dispute the allegiance with God, to cease to look to any created thing or being, for what is the gift of the Creator alone. So the Apostle says, \"what concord hath Christ with Belial?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This verse exhibits in few, vivid, words, converted Ephraim speaking with God, and God answering; Ephraim renouncing his sins, and God accepting him; Ephraim glorying in God's goodness, and God reminding him that he holds all from Himself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have heard and observed him - God answers the profession and accepts it. I, (emphatic) \"I Myself have heard and have answered,\" as He says, \"Before they call I will answer\" Isaiah 65:24. Whereas God, before, had hid His face from them, or had \"observed\" Hosea 13:7 them, only as the object of His displeasure, and as ripe for destruction, now He reverses this, and \"observes\" them, in order to forecome the wishes of their hearts before they are expressed, to watch over them and survey and provide for all their needs. To this, Ephraim exulting in God's goodness, answers, \"I\" am \"like a green fir tree,\" i. e., ever-green, ever-fresh. The \"berosh,\" (as Jerome, living in Palestine, thought) one of the large genus of the \"pine\" or \"fir,\" or (as others translated) the cypress , was a tall stately tree Isaiah 55:13; in whose branches the stork could make its nest Psalm 104:17; its wood precious enough to be employed in the temple (1 Kings 5:22, 24 (1 Kings 5:8, 1 Kings 5:10, English); 6:15, 34); fine enough to be used in all sorts of musical instruments 2 Samuel 6:5; strong and pliant enough to be used for spears Nahum 2:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I have heard and observed him - God answers the profession and accepts it. I, (emphatic) \"I Myself have heard and have answered,\" as He says, \"Before they call I will answer\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Whereas God, before, had hid His face from them, or had \"observed\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " them, only as the object of His displeasure, and as ripe for destruction, now He reverses this, and \"observes\" them, in order to forecome the wishes of their hearts before they are expressed, to watch over them and survey and provide for all their needs. To this, Ephraim exulting in God's goodness, answers, \"I\" am \"like a green fir tree,\" i. e., ever-green, ever-fresh. The \"berosh,\" (as Jerome, living in Palestine, thought) one of the large genus of the \"pine\" or \"fir,\" or (as others translated) the cypress , was a tall stately tree ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; in whose branches the stork could make its nest ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; its wood precious enough to be employed in the temple (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 5:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 24 (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", English); 6:15, 34); fine enough to be used in all sorts of musical instruments ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 6:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; strong and pliant enough to be used for spears ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It was part of the glory of Lebanon Isaiah 37:24; Isaiah 60:13. A Greek historian says that Lebanon \"was full of cedars and pines and cypresses, of wonderful beauty and size\" . A modern traveler says, of \"the cypress groves of Lebanon\" ; \"Each tree is in itself a study for the landscape painter - some, on account of their enormous stems and branches. Would you see trees in all their splendor and beauty, then enter these wild groves, that have never been touched by the pruning knife of art.\" This tree, in its majestic beauty, tenacity of life, and undying verdure, winter and summer, through the perpetual supply of sap, pictures the continual life of the soul through the unbroken supply of the grace of God. Created beauty must, at best, be but a faint image of the beauty of the soul in grace, for this is from the indwelling of God the Holy Spirit.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It was part of the glory of Lebanon ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A Greek historian says that Lebanon \"was full of cedars and pines and cypresses, of wonderful beauty and size\" . A modern traveler says, of \"the cypress groves of Lebanon\" ; \"Each tree is in itself a study for the landscape painter - some, on account of their enormous stems and branches. Would you see trees in all their splendor and beauty, then enter these wild groves, that have never been touched by the pruning knife of art.\" This tree, in its majestic beauty, tenacity of life, and undying verdure, winter and summer, through the perpetual supply of sap, pictures the continual life of the soul through the unbroken supply of the grace of God. Created beauty must, at best, be but a faint image of the beauty of the soul in grace, for this is from the indwelling of God the Holy Spirit.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From Me is thy fruit found - Neither the pine nor the cypress bear any fruit, useful for food. It is probable then that here too the prophet fills out one image by another and says that restored Israel, the Church of God, or the soul in grace, should not only have beauty and majesty, but what is not, in the way of nature, found united therewith, fruitfulness also. From Me is thy fruit found; as our Lord says, \"I am the vine, ye are the branches\" John 15:5. Human nature, by itself, can as little bear fruit well-pleasing to God, as the pine or cypress can bear fruit for human use. As it were a miracle in nature, were these trees to bring forth such fruit, so, for man to bring forth fruits of grace, is a miracle of grace. The presence of works of grace attests the immediate working of God the Holy Spirit, as much as any miracle in nature. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From Me is thy fruit found - Neither the pine nor the cypress bear any fruit, useful for food. It is probable then that here too the prophet fills out one image by another and says that restored Israel, the Church of God, or the soul in grace, should not only have beauty and majesty, but what is not, in the way of nature, found united therewith, fruitfulness also. From Me is thy fruit found; as our Lord says, \"I am the vine, ye are the branches\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 15:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Human nature, by itself, can as little bear fruit well-pleasing to God, as the pine or cypress can bear fruit for human use. As it were a miracle in nature, were these trees to bring forth such fruit, so, for man to bring forth fruits of grace, is a miracle of grace. The presence of works of grace attests the immediate working of God the Holy Spirit, as much as any miracle in nature. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. Ephraim shall say—being brought to penitence by God's goodness, and confessing and abhorring his past madness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have heard … and observed him—I Jehovah have answered and regarded him with favor; the opposite of God's \"hiding His face from\" one (De 31:17). It is the experience of God's favor, in contrast to God's wrath heretofore, that leads Ephraim to abhor his past idolatry. Jehovah heard and answered: whereas the idols, as Ephraim now sees, could not hear, much less answer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am … a green fir—or cypress; ever green, winter and summer alike; the leaves not falling off in winter.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From me is thy fruit found—\"From Me,\" as the root. Thou needest go no farther than Me for the supply of all thy wants; not merely the protection implied by the shadow of the cypress, but that which the cypress has not, namely, fruit, all spiritual and temporal blessings. It may be also implied, that whatever spiritual graces Ephraim seeks for or may have, are not of themselves, but of God (Ps 1:3; Joh 15:4, 5, 8; Jas 1:17). God's promises to us are more our security for mortifying sin than our promises to God (Isa 27:9).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephraim; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not the whole body of Ephraim, but converted Ephraim, those who, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 14:1,2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", were sensible of sin, confessed it, and sued for pardon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What have I to do any more with idols?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. I have no more to do with them, nor ever will; they have been, first my sin, and next my sorrows, and my sorrows have been multiplied by hasting after other gods; I will no more do so: and with detestation against idols doth Ephraim speak, as the question implieth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have heard him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and observed him: some refer these words to Ephraim, owning what he had found and observed in God; what grace and mercy in pardon, deliverance from miseries, and comfortable revival of his state. Others refer it to God, and make it a gracious promise from God of hearing prayers, and taking especial care of converted Ephraim; either way suits the words and matter, and I leave it to your choice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am like a green fir tree:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these words also, as the former, are either Israel’s giving praise to God, who had on Israel’s return changed his dead, withered state into a flourishing, lovely, and beautiful state: others say it is God’s promise to be to Ephraim as such a tree is to a weary traveller, who may with delight and safety sit under the shadow of it; a tree, say some, that grows with very thick boughs, that rain or heat pierceth not, and whose smell drives away wild beasts; so there is safety and refreshment under the protection of the Lord, under his shadow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From me is thy fruit found:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this also is differently interpreted: Israel confesseth that the fruit of God’s grace is seen from what Israel now is and doth: others say, God promiseth the fruits of comfort Israel enjoys, and still shall enjoy, from God, and his grace toward Israel. I determine neither, but sure I am such is the correspondence of God’s grace to the converted, that they cannot more readily acknowledge what God hath done for them, nor more readily engage to do what God adviseth and requireth, than God is ready to encourage them by gracious, and rich, and suitable promises. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ephraim shall say, what have I to do any more with idols?.... This is to be understood, not of apostate Ephraim, as in the times of the prophet, who was so wedded and glued to the idols, that there was no hope of getting him from them; and therefore is bid to let him alone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but of Ephraim Israel returning to God at his call, under the influence of his grace, in the latter day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Idols are the same with the works of their hands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and to be interpreted, not of graven or molten images, to the worship of which the Jews have not been addicted since their captivity to this day; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but of the idols of their hearts, their impiety, their unbelief, their rejection of the Messiah, which, at the time of their conversion, they will loath, abhor, and mourn over; likewise the traditions of their elders, they are now zealous and tenacious of, and prefer even to the written word; but will now relinquish them, and embrace the Gospel of Christ; as well as the idol of their own righteousness they have always endeavoured to establish; but shall now renounce, and receive Christ as the Lord their righteousness. The like to this is to be found in common in all truly penitent and converted sinners; who, being made sensible of the exceeding sinfulness of sin, detest and abhor it, and declare they will have nothing to do with it; not but that it continues in them, and has to do with them, and they with that; yet not so as to live and walk in it; to yield their members as instruments of it; to serve and obey it as their master; to make provision for it, and to have the course of their lives under the direction and power of it; and so likewise, being convinced of the imperfection and insufficiency of their own righteousness to justify them, they will have nothing to do with that in the business of justification before God, and acceptance with him: now these are the words of the Lord, affirming what Ephraim should say, as Kimchi rightly observes; he promises for him, as he well might, since it is he that gives repentance to Israel, and works in his people principles of grace, and enables them both to will and to do, to make such holy resolutions, and perform them. Some render the words, \"O Ephraim, what have I to do\" (i)? &c. and take them to be words of God concerning himself, declaring he would have nothing to do with idols, nor suffer them in his service, nor should they; for \"what concord hath Christ with Belial?\" or \"what agreement hath the temple of God with idols?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the former sense is much best; rather what Schmidt suggests is more agreeable, who, rendering the words in the same way, makes them to be the words of a believing Gentile returning and dwelling under the shadow of Israel; so he interprets ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and takes this to be the language of such an one throughout. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"they of the house of Israel shall say, what is it to us to serve idols any more?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have heard him; says the Lord; Ephraim bemoaning himself, repenting of his sins, and confessing them; his prayers for pardon and acceptance, and the resolutions made by him in the strength of divine grace, Hosea 14:2; see Jeremiah 31:18; and this is what his idols he once served could not do, who had ears, but heard not; but the Lord not only heard, but answered, and granted his request. So the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I have heard him; says the Lord; Ephraim bemoaning himself, repenting of his sins, and confessing them; his prayers for pardon and acceptance, and the resolutions made by him in the strength of divine grace, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and this is what his idols he once served could not do, who had ears, but heard not; but the Lord not only heard, but answered, and granted his request. So the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I by my Word will receive the prayer of Israel, and will have mercy on him:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and observed him; looked at him, and on him; with an eye of pity and compassion; with a favourable and propitious look, as the Lord does towards those that are poor, and of a contrite spirit; observed the ways and steps he took in returning to him; marked his tears and humiliations, groans and moans, and took notice of his wants in order to supply them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I am like a green fir tree: these are the words of the Lord continued; though some take them to be the words of Ephraim; or, as Schmidt, of the Gentile believer, like those of David, Psalm 52:8; but they best agree with Christ, who may be compared to such a tree, as he is to many others in Scripture; because a choice one, as he is to his Father, and to all believers, chosen and precious, lovely and beloved; a tall tree, so Christ is highly exalted as Mediator, higher than the kings of the earth, above the angels in heaven, yea, higher than the heavens. The boughs of this tree, as Jarchi and Kimchi observe, bend downward so low as to be laid hold on; Christ, though the high and lofty One, dwells with humble souls, and suffers himself to be laid hold upon by the faith of everyone that comes to him. Pliny says (k), that this tree is of a cheerful aspect, smooth, and scarce any knots upon it; and its leaves so thick that a shower of rain will not pass through it: Christ is most amiable, and altogether lovely to look at in his person and fulness; and he looks in a loving smiling manner upon his people; he is without any knot of sin or corruption in him, as to principle or practice; and is a delightful shade from the wrath of God, or rage of man, from the heat of a fiery law, and the darts of Satan: and as this tree, as here, is ever green, so he is always the same; he ever lives, and his people in him, and by him; his fulness always continues to supply them. Once more, the fir tree is the habitation of the stork, an unclean creature by the law of God; so Christ is the dwelling place of sinners, he receives them, and converses with them, Psalm 104:17. The Septuagint version renders it, \"as a thick juniper tree\": which naturalists say (l) has such a virtue in it, as by the smell to drive away serpents. So the old serpent the devil was drove away by Christ in the wilderness, in the garden, and on the cross; and resisting by faith, holding out his blood and righteousness, causes him to flee from the saints, The Arabic version is, \"as the fruitful cypress tree\"; which is of a good smell, and its wood very durable; and so may be expressive of the savour of Christ, his righteousness and sacrifice, the graces of his Spirit, and of his duration. Some take this to be a promise that Ephraim should be as a green fir tree, so Aben Ezra; with which agrees the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I am like a green fir tree: these are the words of the Lord continued; though some take them to be the words of Ephraim; or, as Schmidt, of the Gentile believer, like those of David, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 52:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but they best agree with Christ, who may be compared to such a tree, as he is to many others in Scripture; because a choice one, as he is to his Father, and to all believers, chosen and precious, lovely and beloved; a tall tree, so Christ is highly exalted as Mediator, higher than the kings of the earth, above the angels in heaven, yea, higher than the heavens. The boughs of this tree, as Jarchi and Kimchi observe, bend downward so low as to be laid hold on; Christ, though the high and lofty One, dwells with humble souls, and suffers himself to be laid hold upon by the faith of everyone that comes to him. Pliny says (k), that this tree is of a cheerful aspect, smooth, and scarce any knots upon it; and its leaves so thick that a shower of rain will not pass through it: Christ is most amiable, and altogether lovely to look at in his person and fulness; and he looks in a loving smiling manner upon his people; he is without any knot of sin or corruption in him, as to principle or practice; and is a delightful shade from the wrath of God, or rage of man, from the heat of a fiery law, and the darts of Satan: and as this tree, as here, is ever green, so he is always the same; he ever lives, and his people in him, and by him; his fulness always continues to supply them. Once more, the fir tree is the habitation of the stork, an unclean creature by the law of God; so Christ is the dwelling place of sinners, he receives them, and converses with them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Septuagint version renders it, \"as a thick juniper tree\": which naturalists say (l) has such a virtue in it, as by the smell to drive away serpents. So the old serpent the devil was drove away by Christ in the wilderness, in the garden, and on the cross; and resisting by faith, holding out his blood and righteousness, causes him to flee from the saints, The Arabic version is, \"as the fruitful cypress tree\"; which is of a good smell, and its wood very durable; and so may be expressive of the savour of Christ, his righteousness and sacrifice, the graces of his Spirit, and of his duration. Some take this to be a promise that Ephraim should be as a green fir tree, so Aben Ezra; with which agrees the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I by my word will make him as the beautiful fir tree;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to which sometimes the saints are compared; see Isaiah 41:19; and this being a tree that bears no fruit, it follows, to make up that defect in the metaphor, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and to which sometimes the saints are compared; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and this being a tree that bears no fruit, it follows, to make up that defect in the metaphor, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "from me is thy fruit found; from Christ are all the spiritual blessings of grace, peace, pardon, righteousness, adoption, a right and meetness for eternal life, and that itself; all the fruits and graces of the Spirit, as faith, hope, love, &c. and all good works, which spring from union with him, are done in his strength, and influenced by his grace and example; see Philippians 1:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from me is thy fruit found; from Christ are all the spiritual blessings of grace, peace, pardon, righteousness, adoption, a right and meetness for eternal life, and that itself; all the fruits and graces of the Spirit, as faith, hope, love, &c. and all good works, which spring from union with him, are done in his strength, and influenced by his grace and example; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i)    \"Ephraim, vel O quid mihi amplius\", &c. Montanus, Junius & Tremellius, Tigurine version, Castalio, Cocceius, Schmidt, Burkius. (k) Nat. Hist. l. 16. c. 10. (l) Varinus apud Rivet. in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i)    \"Ephraim, vel O quid mihi amplius\", &c. Montanus, Junius & Tremellius, Tigurine version, Castalio, Cocceius, Schmidt, Burkius. (k) Nat. Hist. l. 16. c. 10. (l) Varinus apud Rivet. in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Ephraim shall say, What have I to do any more with idols? I {g} have heard him, and observed him: I am like a green fir tree. From me is thy fruit found.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ephraim ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "shall say",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", What have I to do any more with idols? I ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " have heard ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "him",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and observed him: I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " like a green fir tree. From me is thy fruit found.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) God shows how prompt he is to hear his own when they repent, and to offer himself as a protection and safeguard for them, as a most sufficient fruit and benefit.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephraim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What have I to do any more with idols",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So the Targum and the Syriac. The objection is that the ellipsis is unique, and hence Archbishop Seeker proposed to follow the Septuagint (reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lo",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "li",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephraim—what hath he to do",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. Prof. Robertson Smith is dissatisfied with this, but his objection simply is that the third member of the verse is unsuitable in the mouth of Jehovah, the evergreen tree being ‘in Semitic symbolism the image of receptivity, of divinely nourished life, not of quickening power’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Prophets of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 411). But why should the whole verse be given to the same speaker, especially if we reject the idea that the prefixed Ephraim indicates Israel as the speaker? It is surely very difficult to assign the fourth member to Israel, as if it meant that Ephraim or Israel bore fruit to Jehovah. On the whole, it seems best to adopt the Septuagint reading, and to assign all but the third member of the verse to Jehovah. There is a special force in the restoration of the name Ephraim, if we look at the closing words of the verse. [Pusey and before him the Lutheran divine Manger assign the four lines of which the verse consists alternately to Ephraim and Jehovah.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have heard him and observed him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I respond and look on him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The pronoun is emphatically expressed—‘I on my part.’ ‘Respond’ reminds us of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The idea is that Jehovah’s treatment of Israel corresponds to Israel’s treatment of him (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ‘To look upon’ anyone is to be favourable to him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:132",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the opposite is ‘to hide the face from’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am like a green fir tree",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The precise kind of tree meant by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b’rôsh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is uncertain; but Hosea, as a N. Israelite, is evidently thinking of the splendid forests of Lebanon. Most have supposed a reference to the sherbin-tree, a small kind of cypress resembling the cedar; Tristram prefers the Aleppo pine, a tree quite as characteristic of Lower Lebanon as the cedar. Certainly it is very alien to the spirit of the prophets to compare Jehovah to a tree (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Keil refers to the ‘tree of life’; but even this is never identified with Jehovah (though Sept. identifies it with Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Is not this short clause a naïve self-gratulation on the part of Israel? Here, as in the previous clause, the personal pronoun is expressed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From me is thy fruit found",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Israel cannot be the speaker here (see above). The clause contains a warning for Israel in his prosperity not to forget the Giver. Probably there is a play upon the name Ephraim ‘fruitfulness’ (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ephraim shall say, What have I to do any more with idols?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is full, final, and for over a renunciation of idolatry on the part of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I have heard him, and observed him: I am like a green fir tree",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "From me is thy fruit found.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is God's promise, that his eye is fixed on Israel in order to look after him, care for him, and provide for him, and to protect and prosper him; while the figure of a green fir tree is the pledge of shelter and security. But, though the fir tree is evergreen, it is fruitless; and therefore it is added that God will prove the Source of fruitfulness, and supply all that his people shall or can ever need. Hosea 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"I will heal their apostasy, will love them freely: for my wrath has turned away from it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I will be like dew for Israel: it shall blossom like the lily, and strike its roots like Lebanon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Its shoots shall go forth, and its splendour shall become like the olive-tree, and its smell like Lebanon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They that dwell in its shadow shall give life to corn again; and shall blossom like the vine: whose glory is like the wine of Lebanon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ephraim: What have I further with the idols? I hear, and look upon him: I, like a bursting cypress, in me is thy fruit found.\" The Lord promises first of all to heal their apostasy, i.e., all the injuries which have been inflicted by their apostasy from Him, and to love them with perfect spontaneity (nedâbhâh an adverbial accusative, promta animi voluntate), since His anger, which was kindled on account of its idolatry, had now turned away from it (mimmennū, i.e., from Israel). The reading mimmennı̄ (from me), which the Babylonian Codices have after the Masora, appears to have originated in a misunderstanding of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This love of the Lord will manifest itself in abundant blessing. Jehovah will be to Israel a refreshing, enlivening dew (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), through which it will blossom splendidly, strike deep roots, and spread its shoots far and wide. \"Like the lily:\" the fragrant white lily, which is very common in Palestine, and grows without cultivation, and \"which is unsurpassed in its fecundity, often producing fifty bulbs from a single root\" (Pliny h. n. xxi. 5). \"Strike roots like Lebanon,\" i.e., not merely the deeply rooted forest of Lebanon, but the mountain itself, as one of the \"foundations of the earth\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The deeper the roots, the more the branches spread and cover themselves with splendid green foliage, like the evergreen and fruitful olive-tree (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 52:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The smell is like Lebanon, which is rendered fragrant by its cedars and spices (Sol 4:11). The meaning of the several features in the picture has been well explained by Rosenmller thus: \"The rooting indicates stability: the spreading of the branches, propagation and the multitude of inhabitants; the splendour of the olive, beauty and glory, and that constant and lasting; the fragrance, hilarity and loveliness.\" In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a somewhat different turn is given to the figure. The comparison of the growth and flourishing of Israel to the lily and to a tree, that strikes deep roots and spreads its green branches far and wide, passes imperceptibly into the idea that Israel is itself the tree beneath whose shade the members of the nation flourish with freshness and vigour. ישׁוּבוּ is to be connected adverbially with יהיּוּ. Those who sit beneath the shade of Israel, the tree that is bursting into leaf, will revive corn, i.e., cause it to return to life, or produce it for nourishment, satiety, and strengthening. Yea, they themselves will sprout like the vine, whose remembrance is, i.e., which has a renown, like the wine of Lebanon, which has been celebrated from time immemorial (cf. Plin. h. n. xiv. 7; Oedmann, Verbm. Sammlung aus der Naturkunde, ii. p. 193; and Rosenmller, Bibl. Althk. iv. 1, p. 217). The divine promise closes in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with an appeal to Israel to renounce idols altogether, and hold fast by the Lord alone as the source of its life. Ephraim is a vocative, and is followed immediately by what the Lord has to say to Ephraim, so that we may supply memento in thought. מה־לּי עוד לע, what have I yet to do with idols? (for this phrase, compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); that is to say, not \"I have now to contend with thee on account of the idols (Schmieder), nor \"do not place them by my side any more\" (Ros.); but, \"I will have nothing more to do with idols,\" which also implies that Ephraim is to have nothing more to do with them. To this there is appended a notice of what God has done and will do for Israel, to which greater prominence is given by the emphatic אני: I, I hearken (‛ânı̄thı̄ a prophetic perfect), and look upon him. שׁוּר, to look about for a person, to be anxious about him, or care for him, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The suffix refers to Ephraim. In the last clause, God compares Himself to a cypress becoming green, not only to denote the shelter which He will afford to the people, but as the true tree of life, on which the nation finds its fruits - a fruit which nourishes and invigorates the spiritual life of the nation. The salvation which this promise sets before the people when they shall return to the Lord, is indeed depicted, according to the circumstances and peculiar views prevailing under the Old Testament, as earthly growth and prosperity; but its real nature is such, that it will receive a spiritual fulfilment in those Israelites alone who are brought to belief in Jesus Christ. ",
        "children": []
      }
    ]
  }
]