[{"header":"Jesus Grants The Twelve Power Over Demons And Every Disease"},{"num":10,"verse":"And having summoned His twelve disciples, He gave them authority over unclean spirits so as to be casting them out, and to be curing every disease and every infirmity. "},{"num":2,"verse":"Now the names of the twelve apostles are these— first, Simon (the one being called Peter) and Andrew (his brother), and James (the son of Zebedee) and John (his brother), "},{"num":3,"verse":"Philip and Bartholomew, Thomas and Matthew (the tax-collector), James (the son of Alphaeus) and Thaddaeus, "},{"num":4,"verse":"Simon (the Cananaean) and Judas the Iscariot (the one also having handed Him over)."},{"header":"Jesus Instructs The Twelve On Where To Go, What To Say, What To Do, How To Live"},{"num":5,"verse":"Jesus sent out these twelve, having instructed them, saying— “Do not go into the path of Gentiles, and do not enter into a city of Samaritans. "},{"num":6,"verse":"But be proceeding instead to the lost sheep of the house of Israel. "},{"num":7,"verse":"And while proceeding, be proclaiming, saying that ‘The kingdom of the heavens has drawn near’. "},{"num":8,"verse":"Be curing ones being sick, raising dead ones, cleansing lepers, casting out demons. You received freely— give freely. "},{"num":9,"verse":"Do not acquire gold nor silver nor copper [money] for your [money] belts— "},{"num":10,"verse":"not a [traveler’s] bag for the journey, nor two tunics, nor sandals, nor a staff. For the worker is worthy of his food. "},{"num":11,"verse":"And into whatever city or village you enter, search-out who is worthy in it, and stay there until you go forth. "},{"num":12,"verse":"And while entering into the house, greet it. "},{"num":13,"verse":"And if the house is worthy let your peace come upon it, but if it is not worthy let your peace return to you. "},{"num":14,"verse":"And whoever does not welcome you nor listen-to your words— shake-out the dust from your feet while going outside of that house or city. "},{"num":15,"verse":"Truly I say to you, it will be more-tolerable for the land of Sodom and Gomorrah on the day of judgment than for that city."},{"header":"Jesus Pre-Warns The Twelve About The Persecution They Will Face In The Future"},{"num":16,"verse":"“Behold— I am sending you out as sheep in the midst of wolves. Therefore be shrewd as the snakes, and innocent as the doves. "},{"num":17,"verse":"And beware of people. For they will hand you over to councils and whip you in their synagogues. "},{"num":18,"verse":"And you will even be brought before governors and kings for My sake— for a testimony to them and to the Gentiles. "},{"num":19,"verse":"But whenever they hand you over, do not be anxious-about how or what you should speak. For what you should speak will be given to you in that hour. "},{"num":20,"verse":"For you are not the ones speaking, but the Spirit of your Father is the One speaking in you. "},{"num":21,"verse":"And brother will hand-over brother to death, and a father his child. And children will rise-up-in-rebellion against parents and they will put them to death. "},{"num":22,"verse":"And you will be being hated by all because of My name. But the one having endured to the end, this one will be saved. "},{"num":23,"verse":"But whenever they persecute you in this city, flee to another. For truly I say to you— you will by no means finish the cities of Israel until the Son of Man comes."},{"header":"Proclaim The Truth Boldly; Do Not Fear Them. God Will Watch Over You"},{"num":24,"verse":"“A disciple is not above the teacher, nor is a slave above his master. "},{"num":25,"verse":"It is enough for the disciple that he become like his teacher, and the slave like his master. If they called the Household-Master Beelzebul, how much more His household-members! "},{"num":26,"verse":"So do not fear them. For nothing has been covered which will not be revealed, and is secret which will not be known. "},{"num":27,"verse":"What I am saying to you in the darkness, speak in the light. And what you are hearing in your ear, proclaim upon the housetops. "},{"num":28,"verse":"And do not be fearing anything from the ones killing the body but not being able to kill the soul. But be fearing instead the One being able to destroy both soul and body in Gehenna. "},{"num":29,"verse":"Are not two sparrows sold for an assarion? And one of them will not fall on the ground apart from your Father. "},{"num":30,"verse":"But even the hairs of your head have all been numbered! "},{"num":31,"verse":"So do not be fearing. You are more valuable than many sparrows."},{"header":"Jesus Instructs Them About His Mission: I Came To Divide The World Over Myself"},{"num":32,"verse":"“Everyone therefore who will confess Me in front of people, I also will confess him in front of My Father in the heavens. "},{"num":33,"verse":"But whoever denies Me in front of people, I also will deny him in front of My Father in the heavens. "},{"num":34,"verse":"Do not suppose that I came to cast peace over the earth. I did not come to cast peace, but a sword. "},{"num":35,"verse":"For I came to cause-a-separation— a man against his father, and a daughter against her mother, and a daughter-in-law against her mother-in-law. "},{"num":36,"verse":"And the enemies of the person will be his household-members. "},{"num":37,"verse":"The one loving father or mother above Me is not worthy of Me. And the one loving son or daughter above Me is not worthy of Me. "},{"num":38,"verse":"And he who is not taking his cross and following after Me is not worthy of Me. "},{"num":39,"verse":"The one having found his life will lose it, and the one having lost his life for My sake will find it. "},{"num":40,"verse":"The one welcoming you is welcoming Me. And the one welcoming Me is welcoming the One having sent Me forth. "},{"num":41,"verse":"The one welcoming a prophet in the name of a prophet will receive the reward of a prophet. And the one welcoming a righteous one in the name of a righteous one will receive the reward of a righteous one. "},{"num":42,"verse":"And whoever gives one of these little ones only a cup of cold water to drink in the name of a disciple— truly I say to you he will by no means lose his reward”."}]