[{"num":1,"verse":"Jesus called his twelve disciples to him and gave them authority to expel evil spirits and heal all kinds of disease and infirmity. The names of the twelve apostles were: First, Simon, called Peter, with his brother Andrew; James, and his brother John, sons of Zebedee; Philip and Bartholomew, Thomas, and Matthew the tax-collector, James, the son of Alphaeus, and Thaddaeus, Simon the Patriot, and Judas Iscariot, who later turned traitor."},{"num":5,"verse":"These were the twelve whom Jesus sent out, with the instructions: “Don’t turn off into any of the heathen roads, and don’t go into any Samaritan town. Concentrate on the lost sheep of the house of Israel. As you go proclaim that the kingdom of Heaven has arrived. Heal the sick, raise the dead, cure the lepers, drive out devils—give, as you have received, without any charge whatever."},{"num":9,"verse":"“Don’t take any gold or silver or even coppers to put in your purse; nor a knapsack for the journey, nor even a change of clothes, or sandals or a staff—the workman is worth his keep!"},{"num":11,"verse":"“Wherever you go, whether it is into a town or a village, find out someone who is respected, and stay with him until you leave. As you enter his house give it your blessing. If the house deserves it, the peace of your blessing will come to it. But if it doesn’t, your peace will return to you."},{"num":14,"verse":"“And if no one will welcome you or even listen to what you have to say, leave that house or town, and once outside it shake off the dust of that place from your feet. Believe me, Sodom and Gomorrah will fare better in the day of judgment than that town.”"},{"header":"He warns them of troubles that lie ahead"},{"num":16,"verse":"“Here I am sending you out like sheep with wolves all round you; so be as wise as serpents and yet as harmless as doves. But be on your guard against men. For they will take you to the court and flog you in their synagogues. You will be brought into the presence of governors and kings because of me—to give your witness to them and to the heathen."},{"num":19,"verse":"“But when they do arrest you, never worry about how you are to speak or what you are to say. You will be told at the time what you are to say. For it will not be really you who are speaking but the Spirit of your Father speaking through you."},{"num":21,"verse":"“Brothers are going to betray their brothers to death, and fathers their children. Children are going to betray their parents and have them executed. You yourselves will be universally hated because of my name. But the man who endures to the very end will be safe and sound."},{"num":23,"verse":"“But when they persecute you in one town make your escape to the next. Believe me, you will not have covered the towns of Israel before the Son of Man arrives. The disciple is not superior to his teacher any more than the servant is superior to his master, for what is good enough for the teacher is good enough for the disciple as well, and the servant will not fare better than his master. If men call the master of the household the ‘Prince of Evil’, what sort of names will they give to his Servants? But never let them frighten you, for there is nothing covered up which is not going to be exposed nor anything private which will not be made public. The things I tell you in the dark you must say in the daylight, and the things you hear in your private ear you must proclaim from the house-tops."},{"header":"They should reverence God but have no fear of man"},{"num":28,"verse":"“Never be afraid of those who can kill the body but are powerless to kill the soul! Far better to stand in awe of the one who has the power to destroy body and soul in the fires of destruction!"},{"num":29,"verse":"“Two sparrows sell for a farthing, don’t they? Yet not a single sparrow falls to the ground without your Father’s knowledge. The very hairs of your head are all numbered. Never be afraid, then—you are far more valuable than sparrows."},{"num":32,"verse":"“Every man who publicly acknowledges me I shall acknowledge in the presence of my Father in Heaven, but the man who disowns me before men I shall disown before my Father in Heaven."},{"header":"The Prince of Peace comes to bring division"},{"num":34,"verse":"“Never think I have come to bring peace upon the earth. No, I have not come to bring peace but a sword! For I have come to set a man against his own father, a daughter against her own mother, and a daughter-in-law against her mother-in-law. A man’s enemies will be those who live in his own house."},{"num":37,"verse":"“Anyone who puts his love for father or mother above his love for me does not deserve to be mine, and he who loves son or daughter more than me is not worthy of me, and neither is the man who refuses to take up his cross and follow my way. The man who has found his own life will lose it, but the man who has lost it for my sake will find it."},{"num":40,"verse":"“Whoever welcomes you, welcomes me; and whoever welcomes me is welcoming the one who sent me."},{"num":41,"verse":"“Whoever welcomes a prophet just because he is a prophet will get a prophet’s reward. And whoever welcomes a good man just because he is a good man will get a good man’s reward. Believe me, anyone who gives even a drink of water to one of these little ones, just because he is my disciple, will by no means lose his reward.”"}]