[[],[{"type":"header","content":"Famine and War"},{"type":"prose","content":"There was a famine in David’s time. It went on year after year after year—three years. David went to  seeking the reason. said, “This is because there is blood on Saul and his house, from the time he massacred the Gibeonites.”"}],[{"type":"prose","content":"So the king called the Gibeonites together for consultation. (The Gibeonites were not part of Israel; they were what was left of the Amorites, and protected by a treaty with Israel. But Saul, a fanatic for the honor of Israel and Judah, tried to kill them off.)"}],[{"type":"prose","content":"David addressed the Gibeonites: “What can I do for you? How can I compensate you so that you will bless ’s legacy of land and people?”"}],[{"type":"prose","content":"The Gibeonites replied, “We don’t want any money from Saul and his family. And it’s not up to us to put anyone in Israel to death.”But David persisted: “What are you saying I should do for you?”"}],[{"type":"prose","content":"Then they told the king, “The man who tried to get rid of us, who schemed to wipe us off the map of Israel—well, let seven of his sons be handed over to us to be executed—hanged before  at Gibeah of Saul, the holy mountain.”And David agreed, “I’ll hand them over to you.”"}],[{"type":"prose","content":"The king spared Mephibosheth son of Jonathan, the son of Saul, because of the promise David and Jonathan had spoken before . But the king selected Armoni and Mephibosheth, the two sons that Rizpah daughter of Aiah had borne to Saul, plus the five sons that Saul’s daughter Merab had borne to Adriel son of Barzillai the Meholathite. He turned them over to the Gibeonites who hanged them on the mountain before —all seven died together. Harvest was just getting underway, the beginning of the barley harvest, when they were executed."}],[{"type":"prose","content":"Rizpah daughter of Aiah took rough burlap and spread it out for herself on a rock from the beginning of the harvest until the heavy rains started. She kept the birds away from the bodies by day and the wild animals by night."}],[{"type":"prose","content":"David was told what she had done, this Rizpah daughter of Aiah and concubine of Saul. He then went and got the remains of Saul and Jonathan his son from the leaders at Jabesh Gilead (who had rescued them from the town square at Beth Shan where the Philistines had hung them after striking them down at Gilboa). He gathered up their remains and brought them together with the dead bodies of the seven who had just been hanged. The bodies were taken back to the land of Benjamin and given a decent burial in the tomb of Kish, Saul’s father.They did everything the king ordered to be done. That cleared things up: from then on God responded to Israel’s prayers for the land."}],[{"type":"prose","content":"War broke out again between the Philistines and Israel. David and his men went down to fight. David became exhausted. Ishbi-Benob, a warrior descended from Rapha, with a spear weighing nearly eight pounds and outfitted in brand-new armor, announced that he’d kill David. But Abishai son of Zeruiah came to the rescue, struck the Philistine, and killed him.Then David’s men swore to him, “No more fighting on the front lines for you! Don’t snuff out the lamp of Israel!”"}],[{"type":"prose","content":"Later there was another skirmish with the Philistines at Gob. That time Sibbecai the Hushathite killed Saph, another of the warriors descended from Rapha."}],[{"type":"prose","content":"At yet another battle with the Philistines at Gob, Elhanan son of Jaar, the weaver of Bethlehem, killed Goliath the Gittite whose spear was as big as a flagpole."}],[{"type":"prose","content":"Still another fight broke out in Gath. There was a giant there with six fingers on his hands and six toes on his feet—twenty-four fingers and toes! He was another of those descended from Rapha. He insulted Israel, and Jonathan son of Shimeah, David’s brother, killed him."}],[{"type":"prose","content":"These four were descended from Rapha in Gath. And they all were killed by David and his soldiers."}]]