[{"header":"Chapter 21"},{"num":1,"verse":"Gibeonite Vengeance. During the reign of David there was a famine for three successive years. Therefore, David consulted the Lord, who said: “Saul and his family have incurred bloodguilt because he put the Gibeonites to death.”"},{"num":2,"verse":"Thereupon the king summoned the Gibeonites and conferred with them. (Now the Gibeonites were not Israelites; rather they were a remnant of the Amorites. Although the Israelites had sworn to spare them, Saul had sought to exterminate them in his zeal for the people of Israel and Judah.)"},{"num":3,"verse":"David said to the Gibeonites: “What can I do for you? How shall I atone for our treatment of you so that you may bless the heritage of the Lord?”"},{"num":4,"verse":"The Gibeonites replied: “We have no right to demand silver or gold from Saul and his family, nor do we have the right to put anyone to death.” “Then what do you want me to do for you?” asked David."},{"num":5,"verse":"They said to the king: “We cannot forget that man who destroyed us and planned to annihilate us so that we would never be able to have a place in the territory of Israel."},{"num":6,"verse":"Please hand over to us seven of his male descendants, so that we may dismember them before the Lord at Gibeon on the mountain of the Lord.” The king replied: “I will hand them over to you.”"},{"num":7,"verse":"However, the king spared Meribbaal, the son of Jonathan, son of Saul, because of the oath of the Lord that bound together David and Saul’s son Jonathan."},{"num":8,"verse":"But the king took Armoni and Meribbaal, the two sons that Rizpah, the daughter of Aiah, had borne to Saul, and the five sons of Saul’s daughter Merab whom she had borne to Adriel, the son of Barzillai of Meholah."},{"num":9,"verse":"He surrendered them into the hands of the Gibeonites, who dismembered them on the mountain before the Lord. All seven of them perished together. They were put to death during the first days of the harvest, just as the barley harvest was beginning."},{"num":10,"verse":"Then Rizpah, the daughter of Aiah, took sackcloth and spread it out on a rock for herself, from the beginning of the harvest until the rain fell from the heavens upon the bodies. She kept the birds of the sky away from the bodies by day and the wild beasts by night."},{"num":11,"verse":"When David was informed about what Aiah’s daughter Rizpah, the concubine of Saul, had done,"},{"num":12,"verse":"he went forth and took the bones of Saul and the bones of his son Jonathan from the people of Jabesh-gilead, who had absconded with them from the public square of Beth-shan, where the Philistines had hung them up after they had killed Saul on Gilboa."},{"num":13,"verse":"After David had removed from there the bones of Saul and the bones of his son Jonathan, he also gathered up the bones of those who had been slain and dismembered."},{"num":14,"verse":"The bones of Saul and his son Jonathan were buried at Zela, in the territory of Benjamin, in the tomb of Saul’s father Kish. After all of the king’s commands had been carried out, God answered prayers that were offered up on behalf of the country."},{"num":15,"verse":"Exploits in Philistine Wars. Once again the Philistines went to war against Israel. David went down with his men to fight against the Philistines, but he began to grow weary."},{"num":16,"verse":"Ishbi-benob one of the descendants of the Rephaim, whose bronze spear weighed three hundred shekels and who was wielding new weapons, boasted that he would have no difficulty in slaying David."},{"num":17,"verse":"However, Abishai, the son of Zeruiah, came to David’s rescue, attacking the Philistine and slaying him. Then David’s men swore to him this oath: “Never again must you go forth with us to engage in battle, lest the lamp of Israel be extinguished.”"},{"num":18,"verse":"After this, war again broke out with the Philistines in Gob. On that occasion, Sibbecai of Husha killed Saph, one of the Rephaim."},{"num":19,"verse":"Shortly afterward there was another battle with the Philistines at Gob, and Elhanan, the son of Jair from Bethlehem killed Goliath of Gath, the shaft of whose spear was like a weaver’s beam."},{"num":20,"verse":"There was yet another battle which took place at Gath, where a giant appeared with six fingers on each hand and six toes on each foot—twenty-four in all. He too was descended from the Rephaim."},{"num":21,"verse":"When he started to taunt Israel, Jonathan, the son of David’s brother Shimei, killed him."},{"num":22,"verse":"These four giants were descendants of the Rephaim in Gath, and they fell at the hands of David and his servants."}]