[{"header":"Nebuchadnezzar's Dream"},{"num":2,"verse":"In the second year that Nebuchadnezzar was king, he had a dream. It worried him so much that he couldn't sleep, "},{"num":2,"verse":"so he sent for his fortunetellers, magicians, sorcerers, and wizards to come and explain the dream to him. When they came and stood before the king, "},{"num":3,"verse":"he said to them, “I'm worried about a dream I've had. I want to know what it means.”"},{"num":4,"verse":"They answered the king in Aramaic, “May Your Majesty live forever! Tell us your dream, and we will explain it to you.”"},{"num":5,"verse":"The king said to them, “I have made up my mind that you must tell me the dream and then tell me what it means. If you can't, I'll have you torn limb from limb and make your houses a pile of ruins. "},{"num":6,"verse":"But if you can tell me both the dream and its meaning, I will reward you with gifts and great honor. Now then, tell me what the dream was and what it means.”"},{"num":7,"verse":"They answered the king again, “If Your Majesty will only tell us what the dream was, we will explain it.”"},{"num":8,"verse":"At that, the king exclaimed, “Just as I thought! You are trying to gain time, because you see that I have made up my mind "},{"num":9,"verse":"to give all of you the same punishment if you don't tell me the dream. You have agreed among yourselves to go on telling me lies because you hope that in time things will change. Tell me what the dream was, and then I will know that you can also tell me what it means.”"},{"num":10,"verse":"The advisers replied, “There is no one on the face of the earth who can tell Your Majesty what you want to know. No king, not even the greatest and most powerful, has ever made such a demand of his fortunetellers, magicians, and wizards. "},{"num":11,"verse":"What Your Majesty is asking for is so difficult that no one can do it for you except the gods, and they do not live among human beings.”"},{"num":12,"verse":"At that, the king flew into a rage and ordered the execution of all the royal advisers in Babylon. "},{"num":13,"verse":"So the order was issued for all of them to be killed, including Daniel and his friends."},{"header":"God Shows Daniel What the Dream Means"},{"num":14,"verse":"Then Daniel went to Arioch, commander of the king's bodyguard, who had been ordered to carry out the execution. Choosing his words carefully, "},{"num":15,"verse":"he asked Arioch why the king had issued such a harsh order. So Arioch told Daniel what had happened."},{"num":16,"verse":"Daniel went at once and obtained royal permission for more time, so that he could tell the king what the dream meant. "},{"num":17,"verse":"Then Daniel went home and told his friends Hananiah, Mishael, and Azariah what had happened. "},{"num":18,"verse":"He told them to pray to the God of heaven for mercy and to ask him to explain the mystery to them so that they would not be killed along with the other advisers in Babylon. "},{"num":19,"verse":"Then that same night the mystery was revealed to Daniel in a vision, and he praised the God of heaven:"},{"header":"Daniel Tells the King the Dream and Explains It"},{"num":24,"verse":"So Daniel went to Arioch, whom the king had commanded to execute the royal advisers. He said to him, “Don't put them to death. Take me to the king, and I will tell him what his dream means.”"},{"num":25,"verse":"At once Arioch took Daniel into King Nebuchadnezzar's presence and told the king, “I have found one of the Jewish exiles who can tell Your Majesty the meaning of your dream.”"},{"num":26,"verse":"The king said to Daniel (who was also called Belteshazzar), “Can you tell me what I dreamed and what it means?”"},{"num":27,"verse":"Daniel replied, “Your Majesty, there is no wizard, magician, fortuneteller, or astrologer who can tell you that. "},{"num":28,"verse":"But there is a God in heaven, who reveals mysteries. He has informed Your Majesty what will happen in the future. Now I will tell you the dream, the vision you had while you were asleep."},{"num":29,"verse":"“While Your Majesty was sleeping, you dreamed about the future; and God, who reveals mysteries, showed you what is going to happen. "},{"num":30,"verse":"Now, this mystery was revealed to me, not because I am wiser than anyone else, but so that Your Majesty may learn the meaning of your dream and understand the thoughts that have come to you."},{"num":31,"verse":"“Your Majesty, in your vision you saw standing before you a giant statue, bright and shining, and terrifying to look at. "},{"num":32,"verse":"Its head was made of the finest gold; its chest and arms were made of silver; its waist and hips of bronze, "},{"num":33,"verse":"its legs of iron, and its feet partly of iron and partly of clay. "},{"num":34,"verse":"While you were looking at it, a great stone broke loose from a cliff without anyone touching it, struck the iron and clay feet of the statue, and shattered them. "},{"num":35,"verse":"At once the iron, clay, bronze, silver, and gold crumbled and became like the dust on a threshing place in summer. The wind carried it all away, leaving not a trace. But the stone grew to be a mountain that covered the whole earth."},{"num":36,"verse":"“This was the dream. Now I will tell Your Majesty what it means. "},{"num":37,"verse":"Your Majesty, you are the greatest of all kings. The God of heaven has made you emperor and given you power, might, and honor. "},{"num":38,"verse":"He has made you ruler of all the inhabited earth and ruler over all the animals and birds. You are the head of gold. "},{"num":39,"verse":"After you there will be another empire, not as great as yours, and after that a third, an empire of bronze, which will rule the whole earth. "},{"num":40,"verse":"And then there will be a fourth empire, as strong as iron, which shatters and breaks everything. And just as iron shatters everything, it will shatter and crush all the earlier empires. "},{"num":41,"verse":"You also saw that the feet and the toes were partly clay and partly iron. This means that it will be a divided empire. It will have something of the strength of iron, because there was iron mixed with the clay. "},{"num":42,"verse":"The toes—partly iron and partly clay—mean that part of the empire will be strong and part of it weak. "},{"num":43,"verse":"You also saw that the iron was mixed with the clay. This means that the rulers of that empire will try to unite their families by intermarriage, but they will not be able to, any more than iron can mix with clay. "},{"num":44,"verse":"At the time of those rulers the God of heaven will establish a kingdom that will never end. It will never be conquered, but will completely destroy all those empires and then last forever. "},{"num":45,"verse":"You saw how a stone broke loose from a cliff without anyone touching it and how it struck the statue made of iron, bronze, clay, silver, and gold. The great God is telling Your Majesty what will happen in the future. I have told you exactly what you dreamed, and have given you its true meaning.”"},{"header":"The King Rewards Daniel"},{"num":46,"verse":"Then King Nebuchadnezzar bowed to the ground and gave orders for sacrifices and offerings to be made to Daniel. "},{"num":47,"verse":"The king said, “Your God is the greatest of all gods, the Lord over kings, and the one who reveals mysteries. I know this because you have been able to explain this mystery.” "},{"num":48,"verse":"Then he gave Daniel a high position, presented him with many splendid gifts, put him in charge of the province of Babylon, and made him the head of all the royal advisers. "},{"num":49,"verse":"At Daniel's request the king put Shadrach, Meshach, and Abednego in charge of the affairs of the province of Babylon; Daniel, however, remained at the royal court."}]