[{"header":"Nebuchadnezzar’s Dream"},{"num":2,"verse":"During Nebuchadnezzar’s second year as king, he had some dreams. Those dreams bothered him, and he could not sleep. "},{"num":2,"verse":"So the king called for his fortune-tellers, magicians, wizards and wise men. The king wanted those men to tell him what he had dreamed. So they came in and stood in front of the king."},{"num":3,"verse":"Then the king said to them, “I had a dream that bothers me. I want to know what the dream means.”"},{"num":4,"verse":"Then the wise men answered the king in the Aramaic language. They said, “Our king, live forever! We are your servants. Please tell us your dream. Then we will tell you what it means.”"},{"num":5,"verse":"Then King Nebuchadnezzar said to them, “No! You must tell me the dream. And then you must tell me what it means. If you don’t do these things, I will have you torn apart. And I will turn your houses into piles of stones. "},{"num":6,"verse":"But if you tell me my dream and its meaning, I will reward you. I will give you gifts and great honor. So tell me the dream, and tell me what it means.”"},{"num":7,"verse":"Again the wise men said to the king, “Please, tell us the dream. And we will tell you what it means.”"},{"num":8,"verse":"King Nebuchadnezzar answered, “Now I know that you are trying to get more time. You know that I meant what I said. "},{"num":9,"verse":"If you don’t tell me my dream, you will be punished. You have all agreed to tell me lies and wicked things. You are hoping things will change. Now, tell me the dream. Then I will know you can tell me what it really means!”"},{"num":10,"verse":"The wise men answered the king. They said, “No one on earth can do what the king asks! Not even a great and powerful king has ever asked the fortune-tellers, magicians or wise men to do this. "},{"num":11,"verse":"The king is asking something that is too hard. Only the gods could tell the king this. But the gods do not live among people.”"},{"num":12,"verse":"When the king heard that, he became very angry. He gave an order for all the wise men of Babylon to be killed. "},{"num":13,"verse":"So King Nebuchadnezzar’s order was announced. All the wise men were to be put to death. Men were sent to look for Daniel and his friends to kill them."},{"num":14,"verse":"Arioch was the commander of the king’s guards. He was going to put to death the wise men of Babylon. But Daniel spoke to him with wisdom and skill. "},{"num":15,"verse":"Daniel asked, “Why did the king order such a terrible punishment?” Then Arioch explained everything to Daniel. "},{"num":16,"verse":"When Daniel heard the story, he went to King Nebuchadnezzar. Daniel asked him to give him some more time. Then he would tell the king what he had dreamed and what it meant."},{"num":17,"verse":"So Daniel went to his house. He explained the whole story to his friends Hananiah, Mishael and Azariah. "},{"num":18,"verse":"Daniel asked his friends to pray to the God of heaven. Daniel asked them to pray that God would show them mercy and help them understand this secret. Then Daniel and his friends would not be put to death with the other wise men of Babylon."},{"num":19,"verse":"During the night God explained the secret to Daniel in a vision. Then Daniel praised the God of heaven. "},{"num":20,"verse":"Daniel said:"},{"header":"The Meaning of the Dream"},{"num":24,"verse":"Then Daniel went to Arioch. King Nebuchadnezzar had chosen Arioch to put to death the wise men of Babylon. Daniel said to Arioch, “Don’t put the wise men of Babylon to death. Take me to the king. I will tell him what his dream means.”"},{"num":25,"verse":"So very quickly Arioch took Daniel to the king. Arioch said to the king, “I have found a man among the captives from Judah. He can tell the king what his dream means.”"},{"num":26,"verse":"The king asked Daniel (also called Belteshazzar) a question. He asked, “Are you able to tell me what I dreamed and what it means?”"},{"num":27,"verse":"Daniel answered, “No person can explain to the king the secret he has asked about. No wise man, magician or fortune-teller can do this. "},{"num":28,"verse":"But there is a God in heaven who explains secret things. God has shown King Nebuchadnezzar what will happen at a later time. This is your dream. This is the vision you saw while lying on your bed: "},{"num":29,"verse":"My king, as you were lying there, you thought about things to come. God, who can tell people about secret things, showed you what is going to happen. "},{"num":30,"verse":"God also told this secret to me. It is not because I have greater wisdom than other men. It is so that you, my king, may know what it means. In that way you will understand what went through your mind."},{"num":31,"verse":"“My king, in your dream you saw a large statue in front of you. It was huge, shiny and frightening. "},{"num":32,"verse":"The head of the statue was made of pure gold. Its chest and arms were made of silver. Its middle and the upper part of its legs were made of bronze. "},{"num":33,"verse":"The lower part of the legs were made of iron. Its feet were made partly of iron and partly of baked clay. "},{"num":34,"verse":"While you were looking at the statue, you saw a rock cut free. But no human being touched the rock. It hit the statue on its feet of iron and clay and smashed them. "},{"num":35,"verse":"Then the iron, clay, bronze, silver and gold broke to pieces at the same time. They became like chaff on a threshing floor in the summertime. The wind blew them away, and there was nothing left. Then the rock that hit the statue became a very large mountain. It filled the whole earth."},{"num":36,"verse":"“That was your dream. Now we will tell the king what it means. "},{"num":37,"verse":"My king, you are the greatest king. God of heaven has given you a kingdom. He has given you power, strength and glory. "},{"num":38,"verse":"God has given you power over people, wild animals and birds. Wherever they live, God has made you ruler over them all. King Nebuchadnezzar, you are the head of gold on that statue."},{"num":39,"verse":"“Another kingdom will come after you. But that kingdom will not be as great as yours. Next a third kingdom will rule over the earth. That is the bronze part. "},{"num":40,"verse":"Then there will be a fourth kingdom, strong as iron. Iron crushes and smashes things to pieces. In the same way the fourth kingdom will smash and crush all the other kingdoms."},{"num":41,"verse":"“You saw that the statue’s feet and toes were partly baked clay and partly iron. That means the fourth kingdom will be a divided kingdom. It will have some of the strength of iron in it. As you saw, iron was mixed with clay. "},{"num":42,"verse":"The toes of the statue were partly iron and partly clay. So the fourth kingdom will be partly strong like iron and partly breakable like clay. "},{"num":43,"verse":"You saw the iron mixed with clay. But iron and clay don’t mix completely together. In the same way the people of the fourth kingdom will be a mixture. Those people will not be united as one people."},{"num":44,"verse":"“During the time of those kings, the God of heaven will set up another kingdom. It will never be destroyed. And it will not be given to another group of people. This kingdom will crush all the other kingdoms. It will bring them to an end. But that kingdom itself will continue forever."},{"num":45,"verse":"“King Nebuchadnezzar, you saw a rock cut from a mountain. But no human being touched it. The rock broke the iron, bronze, clay, silver and gold to pieces. In this way the great God showed you what will happen. The dream is true, and you can trust this explanation.”"},{"num":46,"verse":"Then King Nebuchadnezzar fell facedown on the ground in front of Daniel. The king honored him. He ordered that an offering and incense be presented to Daniel. "},{"num":47,"verse":"Then the king said to Daniel, “Truly I know your God is the greatest of all gods. And he is the Lord of all the kings. He tells people about things they cannot know. I know this is true. You were able to tell these secret things to me.”"},{"num":48,"verse":"Then the king gave Daniel an important position in his kingdom. And he gave many gifts to Daniel. Nebuchadnezzar made him ruler over the whole area of Babylon. And he put Daniel in charge of all the wise men of Babylon. "},{"num":49,"verse":"Daniel asked the king to make Shadrach, Meshach and Abednego important leaders over the area of Babylon. And the king did as Daniel asked. Daniel himself became one of the important people who stayed at the royal court."}]