[{"num":2,"verse":"And in the second year of the reign of Nevuchadnetzar, Nevuchadnetzar dreamed chalomot (dreams), wherewith his ruach was troubled, and his sleep left him."},{"num":2,"verse":"Then the king commanded to call the magicians, and the enchanters, and the sorcerers, and the Kasdim (Chaldeans) for to show the king his chalomot. So they came and stood before the king."},{"num":3,"verse":"And the king said unto them, I have dreamed a chalom (dream) and my ruach was troubled to have da’as of the chalom (dream)."},{"num":4,"verse":"Then spoke the Kasdim (Chaldeans) to the king in Aramaic, O king, live for ever; tell thy servants the chalom (dream), and we will show the pesher (interpretation, explanation)."},{"num":5,"verse":"The king answered and said to the Kasdim (Chaldeans), The decision from me is firm; if ye will not give me da’as of the chalom (dream), with the pesher (interpretation, explanation) thereof, ye shall be cut in pieces, and your houses shall be made a pile of rubble;"},{"num":6,"verse":"But if ye show the chalom (dream), and the pesher (interpretation, explanation) thereof, ye shall receive of me gifts and rewards and great honor; therefore show me the chalom (dream), and the pesher (interpretation, explanation) thereof."},{"num":7,"verse":"They answered again and said, Let the king tell his servants the chalom (dream), and we will show the pesher (interpretation, explanation) of it."},{"num":8,"verse":"The king answered and said, I have da’as of certainty that ye would gain time, because ye see the decision from me is firm."},{"num":9,"verse":"But if ye will not give me da’as of the chalom (dream), there is but one decree for you; for ye have prepared lying and corrupt words to speak before me, till the tide is turned; therefore tell me the chalom (dream), and I shall have da’as that ye can show me the pesher (interpretation, explanation) thereof."},{"num":10,"verse":"The Kasdim (Chaldeans) answered before the king, and said, There is not a man upon the earth that can show the king’s matter; therefore there is no melech, no matter how rav (great) or powerful, that asked such things of any magician, or enchanter, or Kasdai (Chaldean)."},{"num":11,"verse":"And it is a rare thing that the king requireth, and there is none other that can show it before the king, except the g-ds, whose dwelling is not with basar (flesh)."},{"num":12,"verse":"For this cause the king was angry and very furious, and commanded to destroy all the chachamim (wise men) of Babylon."},{"num":13,"verse":"And the decree went forth that the chachamim should be slain; and they sought Daniel and his chaverim to be slain."},{"num":14,"verse":"Then Daniel answered with counsel and wisdom to Aryoch the captain of the king’s guard, which was gone forth to slay the chachamim of Babylon;"},{"num":15,"verse":"He answered and said to Aryoch the king’s captain, Why is the decree so hasty from the king? Then Aryoch made the thing known to Daniel."},{"num":16,"verse":"Then Daniel went in, and desired of the king that he would give him time, and that he would show the king the pesher (interpretation, explanation)."},{"num":17,"verse":"Then Daniel went to his bais, and made the decree known to Chananyah, Mishael, and Azaryah, his chaverim,"},{"num":18,"verse":"That they would plead for rachamim from the G-d of Shomayim concerning this raz (mystery, secret); that Daniel and his chaverim should not perish with the rest of the chachamim of Babylon."},{"num":19,"verse":"Then was the raz revealed unto Daniel in a chazon of the lailah. Then Daniel said a brakhah to the G-d of Shomayim."},{"num":20,"verse":"Daniel answered and said, Baruch hashem Elohim l’olam va’ed; for chochmah (wisdom) and gevurah (might) are His;"},{"num":21,"verse":"And He changeth the times and the zmanim (seasons); He removeth melachim, and setteth up melachim; He giveth chochmah unto the chachamim, and da’as to them that know binah;"},{"num":22,"verse":"He revealeth the deep and secret things; He knoweth what is in the choshech, and the light dwelleth with Him."},{"num":23,"verse":"I thank Thee, and praise Thee, O Thou G-d of my fathers, Who hast given me chochmah and gevurah, and hast given unto me da’as now of what we desired of Thee; for Thou hast now made known unto us the king’s matter."},{"num":24,"verse":"Therefore Daniel went in unto Aryoch, whom the king had appointed to destroy the chachamim of Babylon; he went and said thus unto him: Destroy not the chachamim of Babylon; bring me in before the king, and I will show unto the king the pesher (interpretation, explanation)."},{"num":25,"verse":"Then Aryoch brought in Daniel before the king in haste, and said thus unto him, I have found a man of the Bnei Golus of Yehudah, that will give da’as unto the king of the pesher (interpretation, explanation)."},{"num":26,"verse":"The king answered and said to Daniel whose name was Beltshatzar, Art thou able to give da’as unto me of the chalom (dream) which I have seen, and the pesher (interpretation, explanation) thereof?"},{"num":27,"verse":"Daniel answered in the presence of the king and said, The raz which the king hath demanded cannot the wise men, the enchanters, the magicians, the soothsayers, show unto the king;"},{"num":28,"verse":"But there is a G-d in Shomayim that revealeth razim, and maketh known to the king Nevuchadnetzar what shall be in the acharit hayamim. Thy chalom (dream), and the visions of thy head upon thy bed, are these:"},{"num":29,"verse":"As for thee, O king, thy thoughts came into thy mind upon thy bed, what should come to pass hereafter; and He that revealeth razim (secrets) maketh known to thee what shall come to pass."},{"num":30,"verse":"But as for me, this raz is not revealed to me for any chochmah that I have more than any living, but in order that the pesher (interpretation, explanation) may be known to the king, and that thou mightest understand the thoughts of thy heart."},{"num":31,"verse":"Thou, O king, sawest, and behold a great tzelem (image, idol, statue). This great tzelem, whose brightness was extraordinary, stood before thee; and the form thereof was awesome."},{"num":32,"verse":"This tzelem’s head was of fine gold, his chest and his arms of silver, his middle and his thighs of bronze,"},{"num":33,"verse":"His legs of iron, his feet part of iron and part of clay."},{"num":34,"verse":"Thou sawest till that an even (stone [Moshiach; see Tehillim 118:22; Yeshayah 53:3, Tehillim 2:9]) was cut out without hands, which struck the tzelem upon his feet that were of iron and clay, and broke them to pieces."},{"num":35,"verse":"Then was the iron, the clay, the bronze, the silver, and the gold, broken to pieces together, and became like the chaff of the summer threshingfloors; and the wind carried them away, that no trace was found of them; and the even (stone) that struck the tzelem became a great mountain, and filled kol ha’aretz."},{"num":36,"verse":"This is the chalom (dream); and we will tell the pesher thereof before the king."},{"num":37,"verse":"Thou, O king, art a king of kings; for the G-d of Shomayim hath given thee a kingdom, power, and strength, and glory."},{"num":38,"verse":"And wheresoever the children of men dwell, the beasts of the field and the fowls of the heaven hath He given into thine hand, and hath made thee shalit (ruler) over them all. Thou art this head of gold."},{"num":39,"verse":"And after thee shall arise another kingdom inferior to thee, and another third kingdom of bronze, which shall bear rule over kol ha’aretz."},{"num":40,"verse":"And the fourth mamlachah shall be strong as iron; forasmuch as iron breaketh in pieces and subdueth all things; and as iron that breaketh all these, shall it break in pieces and crush."},{"num":41,"verse":"And whereas thou sawest the feet and toes, part of potters’ clay and part of iron, the mamlachah shall be divided; but there shall be in it of the strength of the iron, forasmuch as thou sawest the iron mixed with baked clay."},{"num":42,"verse":"And as the toes of the feet were part of iron, and part of clay, so the mamlachah shall be partly strong, and partly fragile."},{"num":43,"verse":"And whereas thou sawest iron mixed with baked clay, so the zera of the people will be a mixture and will not remain united, even as iron is not mixed with clay."},{"num":44,"verse":"And in the days of these melachim shall the G-d of Shomayim set up a kingdom, which shall never be destroyed; and the kingdom shall not be left to other people, but it shall break in pieces and consume all these mamlechot (kingdoms), and it shall stand for ever [Lk 1:32-33]."},{"num":45,"verse":"Forasmuch as thou sawest that the even (stone) was cut out of the mountain without hands, and that it broke in pieces the iron, the bronze, the clay, the silver, and the gold, the great G-d hath made known to the king what shall come to pass after this; and the chalom (dream) is certain, and the pesher (interpretation, explanation) thereof trustworthy."},{"num":46,"verse":"Then the king Nevuchadnetzar fell upon his face, prostrate before Daniel, and paid him honor and ordered that a minchah and incense be presented to him."},{"num":47,"verse":"The king answered unto Daniel, and said, Of a surety it is, that your G-d is G-d of g-ds, and L-rd of melachim, and a revealer of razim (secrets), seeing thou couldest reveal this raz."},{"num":48,"verse":"Then the king exalted Daniel to a high position, and gave him many great mattanot (gifts), and made him shalit (ruler) over the whole province of Babylon, and placed him in charge of all the chachamim of Babylon."},{"num":49,"verse":"Then Daniel requested of the king, and he set Shadrach, Meshach, and Abednego, over the affairs of the province of Babylon, but Daniel remained at the royal court."}]