[{"num":23,"verse":"Sarah lived 127 years; this was the length of the life of Sarah."},{"num":2,"verse":"And Sarah died in Kiriath-arba, that is, Hebron, in the land of Canaan. And Abraham went to mourn for Sarah and to weep for her."},{"num":3,"verse":"And Abraham stood up from before his dead and said to the sons of Heth,"},{"num":4,"verse":"I am a stranger and a sojourner with you; give me property for a burial place among you, that I may bury my dead out of my sight."},{"num":5,"verse":"And the Hittites replied to Abraham,"},{"num":6,"verse":"Listen to us, my lord; you are a mighty prince among us. Bury your dead in any tomb or grave of ours that you choose; none of us will withhold from you his tomb or hinder you from burying your dead."},{"num":7,"verse":"And Abraham stood up and bowed himself to the people of the land, the Hittites."},{"num":8,"verse":"And he said to them, If you are willing to grant my dead a burial out of my sight, listen to me and ask Ephron son of Zohar for me,"},{"num":9,"verse":"That he may give me the cave of Machpelah, which he owns—it is at the end of his field. For the full price let him give it to me here in your presence as a burial place to which I may hold fast among you."},{"num":10,"verse":"Now Ephron was present there among the sons of Heth; so, in the hearing of all who went in at the gate of his city, Ephron the Hittite answered Abraham, saying,"},{"num":11,"verse":"No, my lord, hear me; I give you the field, and the cave that is in it I give you. In the presence of the sons of my people I give it to you. Bury your dead."},{"num":12,"verse":"Then Abraham bowed himself down before the people of the land."},{"num":13,"verse":"And he said to Ephron in the presence of the people of the land, But if you will give it, I beg of you, hear me. I will give you the price of the field; accept it from me, and I will bury my dead there."},{"num":14,"verse":"Ephron replied to Abraham, saying,"},{"num":15,"verse":"My lord, listen to me. The land is worth 400 shekels of silver; what is that between you and me? So bury your dead."},{"num":16,"verse":"So Abraham listened to what Ephron said and acted upon it. He weighed to Ephron the silver which he had named in the hearing of the Hittites: 400 shekels of silver, according to the weights current among the merchants."},{"num":17,"verse":"So the field of Ephron in Machpelah, which was to the east of Mamre [Hebron]—the field and the cave which was in it, and all the trees that were in the field and in all its borders round about—was made over"},{"num":18,"verse":"As a possession to Abraham in the presence of the Hittites, before all who went in at his city gate."},{"num":19,"verse":"After this, Abraham buried Sarah his wife in the cave of the field of Machpelah to the east of Mamre, that is, Hebron, in the land of Canaan."},{"num":20,"verse":"The field and the cave in it were conveyed to Abraham for a permanent burial place by the sons of Heth."}]