[{"header":"A Burial Place for Sarah"},{"num":23,"verse":"Sarah lived for 127 years. That’s how long Sarah’s life was. "},{"num":2,"verse":"She died in Kiriath-arba (that is, in Hebron) in the land of Canaan. Abraham went in to mourn for Sarah and to weep for her. "},{"num":3,"verse":"Then Abraham stood up from beside his dead wife and addressed the Hittites. He said, "},{"num":4,"verse":"“I am an alien and an outsider among you. Give me a cemetery among you where I can bury my dead away from my presence.”"},{"num":5,"verse":"The Hittites responded to Abraham, "},{"num":6,"verse":"“Listen to us, sir. You are a mighty prince among us. Bury your dead in the choicest of our burial tombs. None of us would refuse you his tomb for burying your dead.”"},{"num":7,"verse":"Abraham rose and bowed before the Hittites, the people of the land, "},{"num":8,"verse":"and addressed them, “If you are willing that I should bury my dead out of my sight, listen to me and make a request of Zohar’s son Ephron on my behalf. "},{"num":9,"verse":"Give me the cave of Machpelah that belongs to him, at the end of his field. He should sell it to me in your presence at full price for a burial site.”"},{"num":10,"verse":"Now since Ephron the Hittite had taken a seat there among the Hittites, he responded publicly to Abraham where the Hittites and everyone who was entering the gate of his city could hear him: "},{"num":11,"verse":"“No, sir. Listen to me! I’ll give you the field, and I’ll give you the cave that’s in it. I give it to you publicly, in the sight of my people. Bury your dead.”"},{"num":12,"verse":"Abraham bowed before the people of the land "},{"num":13,"verse":"and then addressed Ephron so all the people of the land could hear him: “Please listen to me! I’m willing to pay the price of the field. Accept it from me, so I may bury my dead there.”"},{"num":14,"verse":"So Ephron answered Abraham, "},{"num":15,"verse":"“Sir, listen to me! The land is worth 400 shekels of silver, but what’s that between us? You may bury your dead.”"},{"num":16,"verse":"Abraham agreed with Ephron, so he weighed out to Ephron the money to which he had agreed publicly while the Hittites were listening: 400 shekels of silver at the current merchant rate."},{"num":17,"verse":"That’s how Ephron’s field in Machpelah, east of Mamre—the field, the cave that was in it, and all the trees that were within the boundaries of the field—came to be deeded "},{"num":18,"verse":"to Abraham in the presence of all the Hittites and everyone who was entering the city gate. "},{"num":19,"verse":"After this, Abraham buried his wife Sarah in the cave at the field of Machpelah, east of Mamre (that is, in Hebron) in the land of Canaan. "},{"num":20,"verse":"And so the field with its cave was deeded by the Hittites to Abraham as a burial site."}]