[{"num":1,"verse":"When Sarah was 127 years old, she died in Hebron in the land of Canaan; there Abraham mourned and wept for her. "},{"num":3,"verse":"Then, standing beside her body, he said to the men of Heth:"},{"num":4,"verse":"“Here I am, a visitor in a foreign land, with no place to bury my wife. Please sell me a piece of ground for this purpose.”"},{"num":5,"verse":"“Certainly,” the men replied, “for you are an honored prince of God among us; it will be a privilege to have you choose the finest of our sepulchres, so that you can bury her there.”"},{"num":7,"verse":"Then Abraham bowed low before them and said, "},{"num":8,"verse":"“Since this is your feeling in the matter, be so kind as to ask Ephron, Zohar’s son, "},{"num":9,"verse":"to sell me the cave of Mach-pelah, down at the end of his field. I will of course pay the full price for it, whatever is publicly agreed upon, and it will become a permanent cemetery for my family.”"},{"num":10,"verse":"Ephron was sitting there among the others, and now he spoke up, answering Abraham as the others listened, speaking publicly before all the citizens of the town: "},{"num":11,"verse":"“Sir,” he said to Abraham, “please listen to me. I will give you the cave and the field without any charge. Here in the presence of my people, I give it to you free. Go and bury your dead.”"},{"num":12,"verse":"Abraham bowed again to the men of Heth, "},{"num":13,"verse":"and replied to Ephron, as all listened: “No, let me buy it from you. Let me pay the full price of the field, and then I will bury my dead.”"},{"num":14,"verse":"“Well, the land is worth 400 pieces of silver,” Ephron said, “but what is that between friends? Go ahead and bury your dead.”"},{"num":16,"verse":"So Abraham paid Ephron the price he had suggested—400 pieces of silver, as publicly agreed. "},{"num":17,"verse":"This is the land he bought: Ephron’s field at Mach-pelah, near Mamre, and the cave at the end of the field, and all the trees in the field. They became his permanent possession, by agreement in the presence of the men of Heth at the city gate. "},{"num":19,"verse":"So Abraham buried Sarah there, in the field and cave deeded to him by the men of Heth as a burial plot."}]