[{"num":3,"verse":"¶ Likewise, ye wives, be in subjection to your own husbands, so that also those who do not obey the Word, may be won without a word by the conversation of their wives,"},{"num":2,"verse":"considering your chaste conversation which is in fear."},{"num":3,"verse":"Let their adorning not be outward with ostentatious hairdos and wearing of gold nor in composition of apparel,"},{"num":4,"verse":"but let the interior adorning of the heart be without corruption, and of an agreeable spirit and peaceful, which is precious in the sight of God."},{"num":5,"verse":"For after this manner in the old time the holy women also, who waited upon God, adorned themselves, being in subjection unto their own husbands,"},{"num":6,"verse":"as Sara obeyed Abraham, calling him lord, of whom ye are made daughters, doing well and not being afraid of any terror."},{"num":7,"verse":"Likewise, ye husbands, dwell with them wisely, giving honour unto the woman, as unto a more fragile vessel and as being heirs together of the grace of life, that your prayers not be hindered."},{"num":8,"verse":"¶ And finally, be ye all of one consent, of one affection, loving each other fraternally, merciful, courteous,"},{"num":9,"verse":"not rendering evil for evil or curse for curse, but to the contrary, blessing, knowing that ye are called, that ye should possess a blessing by inheritance."},{"num":10,"verse":"For he that desires to love life and see the good days, let him refrain his tongue from evil and his lips that they speak no guile;"},{"num":11,"verse":"let him separate himself from evil and do good; let him seek peace and follow it."},{"num":12,"verse":"For the eyes of the Lord are over the righteous, and his ears are open unto their prayers; but the face of the Lord is against those that do evil."},{"num":13,"verse":"And who is he that can harm you, if ye are followers of that which is good?"},{"num":14,"verse":"But also if ye suffer anything for righteousness’ sake, blessed are ye; therefore, be not afraid of their terror neither be troubled,"},{"num":15,"verse":"but sanctify the Lord God in your hearts, and be ready always to respond to every man that asks you a reason of the hope that is in you with meekness and reverence,"},{"num":16,"verse":"¶ having a good conscience, so in that which they murmur against you as of evildoers, those that blaspheme your good conversation in the Christ may be confused."},{"num":17,"verse":"For it is better (if the will of God so desires) that ye suffer for doing good than for doing evil."},{"num":18,"verse":"¶ For the Christ also has once suffered for sins, the just for the unjust, that he might bring us to God, being put to death in the flesh, but made alive in spirit,"},{"num":19,"verse":"in which he also went and preached unto the imprisoned spirits,"},{"num":20,"verse":"which in the time past were disobedient, when once the patience of God waited in the days of Noah, while the ark was being made ready, wherein few, that is, eight souls were saved by water."},{"num":21,"verse":"¶ Unto the figure of which the baptism that does now correspond saves us (not taking away the uncleanness of the flesh, but giving testimony of a good conscience before God) by the resurrection of Jesus, the Christ,"},{"num":22,"verse":"who is at the right hand of God, having ascended into heaven, unto whom the angels and the authorities and powers are subject."}]