[{"num":3,"verse":"Wives, follow the lead of your own husbands. Suppose some of them don’t believe God’s word. Then let them be won to Christ without words by seeing how their wives behave. "},{"num":2,"verse":"Let them see how pure you are. Let them see that your lives are full of respect for God. "},{"num":3,"verse":"Fancy hairstyles don’t make you beautiful. Wearing gold jewelry or fine clothes doesn’t make you beautiful. "},{"num":4,"verse":"Instead, your beauty comes from inside you. It is the beauty of a gentle and quiet spirit. Beauty like this doesn’t fade away. God places great value on it. "},{"num":5,"verse":"This is how the holy women of the past used to make themselves beautiful. They put their hope in God. And they followed the lead of their own husbands. "},{"num":6,"verse":"Sarah was like that. She obeyed Abraham. She called him her master. Do you want to be like her? Then do what is right. And don’t give in to fear."},{"num":7,"verse":"Husbands, consider the needs of your wives. They are weaker than you. So treat them with respect. Honor them as those who will share with you the gracious gift of life. Then nothing will stand in the way of your prayers."},{"header":"Suffering for Doing Good"},{"num":8,"verse":"Finally, I want all of you to agree with one another. Be understanding. Love one another. Be kind and tender. Be humble. "},{"num":9,"verse":"Don’t pay back evil with evil. Don’t pay back unkind words with unkind words. Instead, pay back evil with kind words. This is what you have been chosen to do. You will receive a blessing by doing this. "},{"num":10,"verse":"Scripture says,"},{"num":13,"verse":"Who is going to hurt you if you really want to do good? "},{"num":14,"verse":"But suppose you do suffer for doing what is right. Even then you will be blessed. Scripture says, “Don’t fear what others say they will do to hurt you. Don’t be afraid.” (Isaiah 8:12) "},{"num":15,"verse":"But make sure that in your hearts you honor Christ as Lord. Always be ready to give an answer to anyone who asks you about the hope you have. Be ready to give the reason for it. But do it gently and with respect. "},{"num":16,"verse":"Live so that you don’t have to feel you’ve done anything wrong. Some people may say evil things about your good conduct as believers in Christ. If they do, they will be put to shame for speaking like this about you. "},{"num":17,"verse":"God may want you to suffer for doing good. That’s better than suffering for doing evil. "},{"num":18,"verse":"Christ also suffered once for sins. The one who did what is right suffered for those who don’t do right. He suffered to bring you to God. His body was put to death. But the Holy Spirit brought him back to life. "},{"num":19,"verse":"After that, Christ went and made an announcement to the spirits in prison. "},{"num":20,"verse":"Long ago these spirits did not obey. That was when God was patient while Noah was building the ark. And only a few people went into the ark. In fact, there were only eight. Those eight people were saved through water. "},{"num":21,"verse":"The water of the flood is a picture. It is a picture of the baptism that now saves you too. This baptism has nothing to do with removing dirt from your body. Instead, it promises God that you will keep a clear sense of right and wrong. This baptism saves you by the same power that raised Jesus Christ from the dead. "},{"num":22,"verse":"He has gone into heaven. He is at God’s right hand. Angels, authorities and powers are under his control."}]