[{"num":15,"verse":"Some time later the word of Adonai came to Avram in a vision: “Don’t be afraid, Avram. I am your protector; your reward will be very great.” "},{"num":2,"verse":"Avram replied, “Adonai, God, what good will your gifts be to me if I continue childless; and Eli‘ezer from Dammesek inherits my possessions? "},{"num":3,"verse":"You haven’t given me a child,” Avram continued, “so someone born in my house will be my heir.” "},{"num":4,"verse":"But the word of Adonai came to him: “This man will not be your heir. No, your heir will be a child from your own body.” "},{"num":5,"verse":"Then he brought him outside and said, “Look up at the sky, and count the stars — if you can count them! Your descendants will be that many!” "},{"num":6,"verse":"He believed in Adonai, and he credited it to him as righteousness."},{"num":7,"verse":"(vi) Then he said to him, “I am Adonai, who brought you out from Ur-Kasdim to give you this land as your possession.” "},{"num":8,"verse":"He replied, “Adonai, God, how am I to know that I will possess it?” "},{"num":9,"verse":"He answered him, “Bring me a three-year-old cow, a three-year-old female goat, a three-year-old ram, a dove and a young pigeon.” "},{"num":10,"verse":"He brought him all these, cut the animals in two and placed the pieces opposite each other; but he didn’t cut the birds in half. "},{"num":11,"verse":"Birds of prey swooped down on the carcasses, but Avram drove them away."},{"num":12,"verse":"As the sun was about to set, a deep sleep fell on Avram; horror and great darkness came over him. "},{"num":13,"verse":"Adonai said to Avram, “Know this for certain: your descendants will be foreigners in a land that is not theirs. They will be slaves and held in oppression there four hundred years. "},{"num":14,"verse":"But I will also judge that nation, the one that makes them slaves. Afterwards, they will leave with many possessions. "},{"num":15,"verse":"As for you, you will join your ancestors in peace and be buried at a good old age. "},{"num":16,"verse":"Only in the fourth generation will your descendants come back here, because only then will the Emori be ripe for punishment.”"},{"num":17,"verse":"After the sun had set and there was thick darkness, a smoking fire pot and a flaming torch appeared, which passed between these animal parts. "},{"num":18,"verse":"That day Adonai made a covenant with Avram: “I have given this land to your descendants — from the Vadi of Egypt to the great river, the Euphrates River — "},{"num":19,"verse":"the territory of the Keni, the K’nizi, the Kadmoni, "},{"num":20,"verse":"the Hitti, the P’rizi, the Refa’im, "},{"num":21,"verse":"the Emori, the Kena‘ani, the Girgashi and the Y’vusi.”"}]