[{"header":"The Abrahamic Covenant"},{"num":15,"verse":"After this the word of the Lord came to Abram in a vision, saying,"},{"num":2,"verse":"But Abram said, “Lord God, what will You give me, seeing I am childless and the heir of my house is Eliezer of Damascus?” "},{"num":3,"verse":"Abram said, “Since You have not given me any children, my heir is a servant born in my house.”"},{"num":4,"verse":"Then the word of the Lord came to him, saying, “This man will not be your heir, but a son that is from your own body will be your heir.” "},{"num":5,"verse":"He brought him outside and said, “Look up toward heaven and count the stars, if you are able to count them.” And He said to him, “So will your descendants be.”"},{"num":6,"verse":"Abram believed the Lord, and He credited it to him as righteousness."},{"num":7,"verse":"He also said to him, “I am the Lord who brought you out of Ur of the Chaldeans to give you this land to possess it.”"},{"num":8,"verse":"But Abram said, “Lord God, how may I know that I will possess it?”"},{"num":9,"verse":"So He said to him, “Bring Me a three-year-old heifer, a three-year-old female goat, a three-year-old ram, a turtledove, and a young pigeon.”"},{"num":10,"verse":"Then Abram brought all of these to Him and cut them in two and laid each piece opposite the other, but he did not cut the birds in half. "},{"num":11,"verse":"When the birds of prey came down on the carcasses, Abram drove them away."},{"num":12,"verse":"As the sun was going down, a deep sleep fell on Abram, and terror and a great darkness fell on him. "},{"num":13,"verse":"Then He said to Abram, “Know for certain that your descendants will live as strangers in a land that is not theirs, and they will be enslaved and mistreated for four hundred years. "},{"num":14,"verse":"But I will judge the nation that they serve, and afterward they will come out with great possessions. "},{"num":15,"verse":"As for you, you will go to your fathers in peace and you will be buried at a good old age. "},{"num":16,"verse":"In the fourth generation, your descendants will return here, for the iniquity of the Amorites is not yet complete.”"},{"num":17,"verse":"When the sun went down and it was dark, a smoking fire pot with a flaming torch passed between these pieces. "},{"num":18,"verse":"On that same day the Lord made a covenant with Abram, saying, “To your descendants I have given this land, from the river of Egypt to the great Euphrates River— "},{"num":19,"verse":"the land of the Kenites, the Kenizzites, the Kadmonites, "},{"num":20,"verse":"the Hittites, the Perizzites, the Rephaites, "},{"num":21,"verse":"the Amorites, the Canaanites, the Girgashites, and the Jebusites.”"}]