[{"header":"God Makes a Covenant With Abram"},{"num":15,"verse":"Some time later, Abram had a vision. The Lord said to him,"},{"num":2,"verse":"But Abram said, “Lord and King, what can you give me? I still don’t have any children. My servant Eliezer comes from Damascus. When I die, he will get everything I own.” "},{"num":3,"verse":"Abram continued, “You haven’t given me any children. So this servant of mine will get everything I own.”"},{"num":4,"verse":"Then a message from the Lord came to Abram. The Lord said, “When you die, what you have will not go to this man. You will have a son of your own. He will get everything you have.” "},{"num":5,"verse":"The Lord took Abram outside and said, “Look up at the sky. Count the stars, if you can.” Then he said to him, “That’s how many children will be born into your family.”"},{"num":6,"verse":"Abram believed the Lord. The Lord was pleased with Abram because he believed. So Abram’s faith made him right with the Lord."},{"num":7,"verse":"He also said to Abram, “I am the Lord. I brought you out of Ur in the land of Babylon. I will give you this land to have as your very own.”"},{"num":8,"verse":"But Abram said, “Lord and King, how can I know I will have this land as my own?”"},{"num":9,"verse":"So the Lord said to him, “Bring me a young cow, a goat and a ram. Each must be three years old. Bring a dove and a young pigeon along with them.”"},{"num":10,"verse":"Abram brought all of them to the Lord. Abram cut them in two and placed the halves opposite each other. But he didn’t cut the birds in half. "},{"num":11,"verse":"Then large birds came down to eat the dead bodies of the animals and birds. But Abram chased the large birds away."},{"num":12,"verse":"As the sun was going down, Abram fell into a deep sleep. A thick and scary darkness covered him. "},{"num":13,"verse":"Then the Lord said to him, “You can be sure of what I am about to tell you. For 400 years, your family who comes after you will be strangers in another country. They will become slaves there and will be treated badly. "},{"num":14,"verse":"But I will punish the nation that makes them slaves. After that, they will leave with many possessions. "},{"num":15,"verse":"But you will die in peace. You will join the members of your family who have already died. And you will be buried when you are very old. "},{"num":16,"verse":"Your children’s grandchildren will come back here. That’s because the sin of the Amorites has not yet reached the point where I must punish them.”"},{"num":17,"verse":"The sun set and it became dark. Then a burning torch and a pot filled with smoking coals appeared. They passed between the pieces of the animals that had been cut in two. "},{"num":18,"verse":"On that day the Lord made a covenant with Abram. He said, “I am giving this land to your family who comes after you. It reaches from the River of Egypt to the great Euphrates River. "},{"num":19,"verse":"It includes the land of the Kenites, Kenizzites, Kadmonites, "},{"num":20,"verse":"Hittites, Perizzites and Rephaites. "},{"num":21,"verse":"The Amorites, Canaanites, Girgashites and Jebusites also live there.”"}]