[{"header":"The Lord’s Covenant Promise to Abram"},{"num":15,"verse":"Some time later, the Lord spoke to Abram in a vision and said to him, “Do not be afraid, Abram, for I will protect you, and your reward will be great.”"},{"num":2,"verse":"But Abram replied, “O Sovereign Lord, what good are all your blessings when I don’t even have a son? Since you’ve given me no children, Eliezer of Damascus, a servant in my household, will inherit all my wealth."},{"num":3,"verse":"You have given me no descendants of my own, so one of my servants will be my heir.”"},{"num":4,"verse":"Then the Lord said to him, “No, your servant will not be your heir, for you will have a son of your own who will be your heir.”"},{"num":5,"verse":"Then the Lord took Abram outside and said to him, “Look up into the sky and count the stars if you can. That’s how many descendants you will have!”"},{"num":6,"verse":"And Abram believed the Lord, and the Lord counted him as righteous because of his faith."},{"num":7,"verse":"Then the Lord told him, “I am the Lord who brought you out of Ur of the Chaldeans to give you this land as your possession.”"},{"num":8,"verse":"But Abram replied, “O Sovereign Lord, how can I be sure that I will actually possess it?”"},{"num":9,"verse":"The Lord told him, “Bring me a three-year-old heifer, a three-year-old female goat, a three-year-old ram, a turtledove, and a young pigeon.”"},{"num":10,"verse":"So Abram presented all these to him and killed them. Then he cut each animal down the middle and laid the halves side by side; he did not, however, cut the birds in half."},{"num":11,"verse":"Some vultures swooped down to eat the carcasses, but Abram chased them away."},{"num":12,"verse":"As the sun was going down, Abram fell into a deep sleep, and a terrifying darkness came down over him."},{"num":13,"verse":"Then the Lord said to Abram, “You can be sure that your descendants will be strangers in a foreign land, where they will be oppressed as slaves for 400 years."},{"num":14,"verse":"But I will punish the nation that enslaves them, and in the end they will come away with great wealth."},{"num":15,"verse":"(As for you, you will die in peace and be buried at a ripe old age.)"},{"num":16,"verse":"After four generations your descendants will return here to this land, for the sins of the Amorites do not yet warrant their destruction.”"},{"num":17,"verse":"After the sun went down and darkness fell, Abram saw a smoking firepot and a flaming torch pass between the halves of the carcasses."},{"num":18,"verse":"So the Lord made a covenant with Abram that day and said, “I have given this land to your descendants, all the way from the border of Egypt to the great Euphrates River—"},{"num":19,"verse":"the land now occupied by the Kenites, Kenizzites, Kadmonites,"},{"num":20,"verse":"Hittites, Perizzites, Rephaites,"},{"num":21,"verse":"Amorites, Canaanites, Girgashites, and Jebusites.”"}]