[{"num":24,"verse":"And when Balaam saw that it pleased the Lord that he should bless Israel, he went not as he had gone before, that he should seek false divining by chittering of birds, but he (ad)dressed his face against the desert, (And when Balaam saw that it pleased the Lord when he blessed Israel, he went not as he had gone before, to seek out false divining by the twittering of birds, but he directed his face towards the wilderness,)"},{"num":2,"verse":"and he raised up his eyes, and he saw Israel dwelling in tents by his lineages (and he raised up his eyes, and he saw the Israelites living in their tents, tribe by tribe). And when the Spirit of God fell upon him,"},{"num":3,"verse":"and when the parable was taken (and when he had received his prophecy), he said, Balaam, the son of Beor, said, (yea,) a man, whose eye is stopped, said,"},{"num":4,"verse":"the hearer of God’s words said, which beheld the revelation of Almighty God, which falleth down, and his eyes be opened so, (yea, the hearer of God’s words said, who beheld the revelation of Almighty God, and who falleth down, but his eyes still be open,)"},{"num":5,"verse":"How fair be thy tabernacles, Jacob, and thy tents, Israel!"},{"num":6,"verse":"as valleys full of trees, and moist gardens beside floods, as tabernacles which the Lord hath set (up), as cedar trees beside waters; (like valleys full of trees, and watered gardens beside the river, like aloes planted by the Lord, and cedar trees beside the water;)"},{"num":7,"verse":"water shall flow (out) of his bucket, and his seed shall be into many waters, that is, peoples. The king of him shall be taken away for Agag, and the realm of him shall be done away. (water shall flow out of his bucket, and his descendants shall be like many waters, that is, they shall become many people. His king shall be greater than Agag, and his kingdom shall prevail.)"},{"num":8,"verse":"God led him out of Egypt, whose strength is like an unicorn; the sons of Israel shall waste, or devour, (the) heathen men, their enemies; and they shall break the bones of them, and pierce (them through) with (their) arrows."},{"num":9,"verse":"He rested, and slept as a lion, and as a lioness, whom no man shall dare raise. He that blesseth thee, shall be blessed; and he that curseth, shall be areckoned into cursing. (He rested, and slept like a lion, and like a lioness, whom no man shall dare raise up. He who blesseth thee, shall be blessed; and he who curseth thee, shall be cursed.)"},{"num":10,"verse":"And Balak was wroth against Balaam, and he said, when his hands were wrung together, I called thee to curse mine enemies, whom, on the contrary, thou hast blessed thrice (but who, instead, thou hast now blessed three times!)."},{"num":11,"verse":"Turn again to thy place; forsooth I deemed to honour thee greatly, but the Lord deprived thee from [thine] honour (that was) disposed. (Return to thy place; I had intended to greatly reward thee, but the Lord hath now deprived thee of the reward which I had ordained for thee.)"},{"num":12,"verse":"Balaam answered to Balak, Whether I said not to thy messengers, which thou sentest to me, (Balaam answered to Balak, Did I not say to thy messengers, whom thou sentest to me,)"},{"num":13,"verse":"Though Balak shall give to me his house full of silver and of gold, I shall not be able to pass [over] the word of my Lord God, that I bring forth of mine heart anything, either of good or of evil, but whatever thing the Lord shall say, I shall speak that? (Even if Balak shall give me all the gold and silver in his house, I shall not change the word of the Lord my God, so that I bring forth something out of my own heart, either good or bad, nay, but whatever thing the Lord shall say, that I shall speak?)"},{"num":14,"verse":"Nevertheless I shall go to my people, and I shall give counsel to thee, what thy people shall do in the last time to this people. (Nevertheless, I shall now return to my people, but first I shall give thee counsel, what these people shall do to thy people in the days to come.)"},{"num":15,"verse":"Therefore when a parable was taken (And so when he had received his prophecy), he said again, Balaam, the son of Beor, said, (yea,) a man, whose eye is stopped, said,"},{"num":16,"verse":"the hearer of God’s words said, which knoweth the doctrine of the Highest, and seeth the revelation of Almighty God, which falleth down, and hath open eyes (yea, the hearer of God’s words said, who knoweth the doctrine of the Highest, and seeth the revelation of Almighty God, and who falleth down, but his eyes still be open,)"},{"num":17,"verse":"I shall see him, but not now; I shall behold him, but not nigh; a star shall be born of Jacob, and a rod shall rise (out) of Israel; and he shall smite the dukes of Moab, and he shall waste all the sons of Seth; (I shall see him, but not now; I shall behold him, but not near; a star shall be born in Jacob, and a sceptre shall rise up out of Israel; and he shall strike down Moab’s leaders, and he shall destroy all the sons of strife;)"},{"num":18,"verse":"and Idumea shall be his possession, the heritage of Seir shall befall to his enemies; soothly Israel shall do strongly, (and Edom shall become his possession, yea, the inheritance of Seir shall befall to their enemies; and Israel shall be victorious,)"},{"num":19,"verse":"of Jacob shall be he that shall be lord, and shall lose the relics, or (the) remnants, of the city. (for out of Jacob shall come he who shall be their lord, and he shall destroy those who last remain in the city of Ar.)"},{"num":20,"verse":"And when he had seen Amalek, he took a parable, and said, Amalek is the beginning of heathen men, whose last things shall be lost. (And in a vision he saw the Amalekites, and when he had received his prophecy, he said, Amalek was the first in all the heathen, but its end shall be utter destruction.)"},{"num":21,"verse":"Also he saw Kenites, and when a parable was taken, he said, Soothly thy dwelling place is strong, but if thou shalt set thy nest in a stone, (And he also saw the Kenites, and when he had received his prophecy, he said, Thy dwelling place is strong, and thou shalt set thy nest in a stone,)"},{"num":22,"verse":"and shalt be chosen of the generation of Kenites, how long shalt thou be able to dwell? soothly Assur shall take thee. (and shalt be the chosen of the generation of Kenites, but how long shalt thou be able to live there? for Assyria shall take thee captive.)"},{"num":23,"verse":"And when a parable was taken, or showed to him, he said again (And when he had received his prophecy, he said), Alas! who shall live, when the Lord shall do these things?"},{"num":24,"verse":"They shall come in great ships from Italy (They shall come in great ships from Chittim), (and) they shall overcome Assyria, and they shall destroy Eber, and at the last also they themselves shall perish."},{"num":25,"verse":"And Balaam rose, and turned again into his place; and Balak went again by the way in which he came. (And then Balaam rose up, and returned to his home; and Balak returned by the way by which he came.)"}]