[{"header":"Good Stewards of God’s Grace"},{"num":4,"verse":"Therefore, since Christ has suffered for us in the flesh, arm yourselves likewise with the same mind, for he who has suffered in the flesh has ceased from sin, "},{"num":2,"verse":"so that he no longer should live the rest of his time in the flesh serving human desires, but the will of God. "},{"num":3,"verse":"For in earlier times of our lives it may have sufficed us to do what the Gentiles like to do, when we walked in immorality: lusts, drunkenness, carousing, debauchery, and abominable idolatries. "},{"num":4,"verse":"They are surprised that you do not join them in the same excess of wild living, and so they speak evil of you. "},{"num":5,"verse":"They will give account to Him who is ready to judge the living and the dead. "},{"num":6,"verse":"For this reason the gospel was preached also to those who are dead, so that even though they might be judged according to men in the flesh, they might live according to God in the spirit."},{"num":7,"verse":"The end of all things is near. Therefore be solemn and sober so you can pray. "},{"num":8,"verse":"Above all things, have unfailing love for one another, because love covers a multitude of sins. "},{"num":9,"verse":"Show hospitality to one another without complaining. "},{"num":10,"verse":"As everyone has received a gift, even so serve one another with it, as good stewards of the manifold grace of God. "},{"num":11,"verse":"If anyone speaks, let him speak as the oracles of God. If anyone serves, let him serve with the strength that God supplies, so that God in all things may be glorified through Jesus Christ, to whom be praise and dominion forever and ever. Amen."},{"header":"Suffering as a Christian"},{"num":12,"verse":"Beloved, do not be surprised at the fiery ordeal that is taking place among you to test you, as though some strange thing happened to you. "},{"num":13,"verse":"But rejoice insofar as you share in Christ’s sufferings, so that you may rejoice and be glad also in the revelation of His glory. "},{"num":14,"verse":"If you are reproached because of the name of Christ, you are blessed, because the Spirit of glory and of God rests upon you. On their part He is blasphemed, but on your part He is glorified. "},{"num":15,"verse":"Let none of you suffer as a murderer, or a thief, or an evildoer, or even as a busybody. "},{"num":16,"verse":"Yet if anyone suffers as a Christian, let him not be ashamed, but let him glorify God because of it. "},{"num":17,"verse":"For the time has come for judgment to begin at the house of God, and if it begins first with us, what shall the end be for those who do not obey the gospel of God? "},{"num":18,"verse":"And"},{"num":19,"verse":"So then, let those who suffer according to the will of God entrust their souls to a faithful Creator, while continuing to do good."}]