[{"header":"The Tribes East of the Jordan"},{"num":32,"verse":"The people of Reuben and Gad had large flocks and herds. When they saw that the lands of Jazer and Gilead were good for the animals, "},{"num":2,"verse":"they came to Moses, Eleazar the priest, and the leaders of the people. "},{"num":3,"verse":"They said, “We, your servants, have flocks and herds. The Lord has captured for the Israelites a land that is good for animals—the land around Ataroth, Dibon, Jazer, Nimrah, Heshbon, Elealeh, Sebam, Nebo, and Beon. "},{"num":5,"verse":"If it pleases you, we would like this land to be given to us. Don’t make us cross the Jordan River.”"},{"num":6,"verse":"Moses told the people of Gad and Reuben, “Shall your brothers go to war while you stay behind? "},{"num":7,"verse":"You will discourage the Israelites from going over to the land the Lord has given them. "},{"num":8,"verse":"Your ancestors did the same thing. I sent them from Kadesh Barnea to look at the land. "},{"num":9,"verse":"They went as far as the Valley of Eshcol, and when they saw the land, they discouraged the Israelites from going into the land the Lord had given them. "},{"num":10,"verse":"The Lord became very angry that day and made this promise: "},{"num":11,"verse":"‘None of the people who came from Egypt and who are twenty years old or older will see the land that I promised to Abraham, Isaac, and Jacob. These people have not followed me completely. "},{"num":12,"verse":"Only Caleb son of Jephunneh the Kenizzite and Joshua son of Nun followed the Lord completely.’"},{"num":13,"verse":"“The Lord was angry with Israel, so he made them wander in the desert for forty years. Finally all the people who had sinned against the Lord died, "},{"num":14,"verse":"and now you are acting just like your ancestors! You sinful people are making the Lord even more angry with Israel. "},{"num":15,"verse":"If you quit following him, it will add to their stay in the desert, and you will destroy all these people.”"},{"num":16,"verse":"Then the Reubenites and Gadites came up to Moses and said, “We will build pens for our animals and cities for our children here. "},{"num":17,"verse":"Then our children will be in strong, walled cities, safe from the people who live in this land. Then we will prepare for war. We will help the other Israelites get their land, "},{"num":18,"verse":"and we will not return home until every Israelite has received his land. "},{"num":19,"verse":"We won’t take any of the land west of the Jordan River; our part of the land is east of the Jordan.”"},{"num":20,"verse":"So Moses told them, “You must do these things. You must go before the Lord into battle "},{"num":21,"verse":"and cross the Jordan River armed, until the Lord forces out the enemy. "},{"num":22,"verse":"After the Lord helps us take the land, you may return home. You will have done your duty to the Lord and Israel, and you may have this land as your own."},{"num":23,"verse":"“But if you don’t do these things, you will be sinning against the Lord; know for sure that you will be punished for your sin. "},{"num":24,"verse":"Build cities for your children and pens for your animals, but then you must do what you promised.”"},{"num":25,"verse":"The Gadites and Reubenites said to Moses, “We are your servants, and we will do what you, our master, command. "},{"num":26,"verse":"Our children, wives, and all our cattle will stay in the cities of Gilead, "},{"num":27,"verse":"but we, your servants, will prepare for battle. We will go over and fight for the Lord, as you, our master, have said.”"},{"num":28,"verse":"So Moses gave orders about them to Eleazar the priest, to Joshua son of Nun, and to the leaders of the tribes of Israel. "},{"num":29,"verse":"Moses said to them, “If the Gadites and Reubenites prepare for battle and cross the Jordan River with you, to go before the Lord and help you take the land, give them the land of Gilead for their own. "},{"num":30,"verse":"But if they do not go over armed, they will not receive it; their land will be in Canaan with you.”"},{"num":31,"verse":"The Gadites and Reubenites answered, “We are your servants, and we will do as the Lord said. "},{"num":32,"verse":"We will cross over into Canaan and go before the Lord ready for battle. But our land will be east of the Jordan River.”"},{"num":33,"verse":"So Moses gave that land to the tribes of Gad, Reuben, and East Manasseh. (Manasseh was Joseph’s son.) That land had been the kingdom of Sihon, king of the Amorites, and the kingdom of Og, king of Bashan, as well as all the cities and the land around them."},{"num":34,"verse":"The Gadites rebuilt the cities of Dibon, Ataroth, Aroer, "},{"num":35,"verse":"Atroth Shophan, Jazer, Jogbehah, "},{"num":36,"verse":"Beth Nimrah, and Beth Haran. These were strong, walled cities. And they built sheep pens."},{"num":37,"verse":"The Reubenites rebuilt Heshbon, Elealeh, Kiriathaim, "},{"num":38,"verse":"Nebo, Baal Meon, and Sibmah. They renamed Nebo and Baal Meon when they rebuilt them."},{"num":39,"verse":"The descendants of Makir son of Manasseh went and captured Gilead and forced out the Amorites who were there. "},{"num":40,"verse":"So Moses gave Gilead to the family of Makir son of Manasseh, and they settled there. "},{"num":41,"verse":"Jair son of Manasseh went out and captured the small towns there, and he called them the Towns of Jair. "},{"num":42,"verse":"Nobah went and captured Kenath and the small towns around it; then he named it Nobah after himself."}]