[{"header":"The Birth of Jesus"},{"num":2,"verse":"About that time Emperor Augustus gave orders for the names of all the people to be listed in record books. "},{"num":2,"verse":"These first records were made when Quirinius was governor of Syria."},{"num":3,"verse":"Everyone had to go to their own hometown to be listed. "},{"num":4,"verse":"So Joseph had to leave Nazareth in Galilee and go to Bethlehem in Judea. Long ago Bethlehem had been King David’s hometown, and Joseph went there because he was from David’s family."},{"num":5,"verse":"Mary was engaged to Joseph and traveled with him to Bethlehem. She was soon going to have a baby, "},{"num":6,"verse":"and while they were there, "},{"num":7,"verse":"she gave birth to her first-born son. She dressed him in baby clothes and laid him on a bed of hay, because there was no room for them in the inn."},{"header":"The Shepherds"},{"num":8,"verse":"That night in the fields near Bethlehem some shepherds were guarding their sheep. "},{"num":9,"verse":"All at once an angel came down to them from the Lord, and the brightness of the Lord’s glory flashed around them. The shepherds were frightened. "},{"num":10,"verse":"But the angel said, “Don’t be afraid! I have good news for you, which will make everyone happy. "},{"num":11,"verse":"This very day in King David’s hometown a Savior was born for you. He is Christ the Lord. "},{"num":12,"verse":"You will know who he is, because you will find him dressed in baby clothes and lying on a bed of hay.”"},{"num":13,"verse":"Suddenly many other angels came down from heaven and joined in praising God. They said:"},{"num":15,"verse":"After the angels had left and gone back to heaven, the shepherds said to each other, “Let’s go to Bethlehem and see what the Lord has told us about.” "},{"num":16,"verse":"They hurried off and found Mary and Joseph, and they saw the baby lying on a bed of hay."},{"num":17,"verse":"When the shepherds saw Jesus, they told his parents what the angel had said about him. "},{"num":18,"verse":"Everyone listened and was surprised. "},{"num":19,"verse":"But Mary kept thinking about all this and wondering what it meant."},{"num":20,"verse":"As the shepherds returned to their sheep, they were praising God and saying wonderful things about him. Everything they had seen and heard was just as the angel had said."},{"num":21,"verse":"Eight days later Jesus' parents did for him what the Law of Moses commands. And they named him Jesus, just as the angel had told Mary when he promised she would have a baby."},{"header":"Simeon Praises the Lord"},{"num":22,"verse":"The time came for Mary and Joseph to do what the Law of Moses says a mother is supposed to do after her baby is born."},{"num":23,"verse":"just as the Law of the Lord says, “Each first-born baby boy belongs to the Lord.” "},{"num":24,"verse":"The Law of the Lord also says that parents have to offer a sacrifice, giving at least a pair of doves or two young pigeons. So that is what Mary and Joseph did."},{"num":25,"verse":"At this time a man named Simeon was living in Jerusalem. Simeon was a good man. He loved God and was waiting for God to save the people of Israel. God’s Spirit came to him "},{"num":26,"verse":"and told him that he would not die until he had seen Christ the Lord."},{"num":27,"verse":"When Mary and Joseph brought Jesus to the temple to do what the Law of Moses says should be done for a new baby, the Spirit told Simeon to go into the temple. "},{"num":28,"verse":"Simeon took the baby Jesus in his arms and praised God,"},{"num":33,"verse":"Jesus' parents were surprised at what Simeon had said. "},{"num":34,"verse":"Then he blessed them and told Mary, “This child of yours will cause many people in Israel to fall and others to stand. The child will be like a warning sign. Many people will reject him, "},{"num":35,"verse":"and you, Mary, will suffer as though you had been stabbed by a dagger. But all this will show what people are really thinking.”"},{"header":"Anna Speaks about the Child Jesus"},{"num":36,"verse":"The prophet Anna was also there in the temple. She was the daughter of Phanuel from the tribe of Asher, and she was very old. In her youth she had been married for seven years, but her husband died. "},{"num":37,"verse":"And now she was eighty-four years old. Night and day she served God in the temple by praying and often going without eating."},{"num":38,"verse":"At that time Anna came in and praised God. She spoke about the child Jesus to everyone who hoped for Jerusalem to be set free."},{"header":"The Return to Nazareth"},{"num":39,"verse":"After Joseph and Mary had done everything that the Law of the Lord commands, they returned home to Nazareth in Galilee. "},{"num":40,"verse":"The child Jesus grew. He became strong and wise, and God blessed him."},{"header":"The Boy Jesus in the Temple"},{"num":41,"verse":"Every year Jesus' parents went to Jerusalem for Passover. "},{"num":42,"verse":"And when Jesus was twelve years old, they all went there as usual for the celebration. "},{"num":43,"verse":"After Passover his parents left, but they did not know that Jesus had stayed on in the city. "},{"num":44,"verse":"They thought he was traveling with some other people, and they went a whole day before they started looking for him. "},{"num":45,"verse":"When they could not find him with their relatives and friends, they went back to Jerusalem and started looking for him there."},{"num":46,"verse":"Three days later they found Jesus sitting in the temple, listening to the teachers and asking them questions. "},{"num":47,"verse":"Everyone who heard him was surprised at how much he knew and at the answers he gave."},{"num":48,"verse":"When his parents found him, they were amazed. His mother said, “Son, why have you done this to us? Your father and I have been very worried, and we have been searching for you!”"},{"num":49,"verse":"Jesus answered, “Why did you have to look for me? Didn’t you know that I would be in my Father’s house?” "},{"num":50,"verse":"But they did not understand what he meant."},{"num":51,"verse":"Jesus went back to Nazareth with his parents and obeyed them. His mother kept on thinking about all that had happened."},{"num":52,"verse":"Jesus became wise, and he grew strong. God was pleased with him and so were the people."}]