[{"num":2,"verse":"But it came to pass in those days that a decree went out from Caesar Augustus, that a census should be made of all the habitable world."},{"num":2,"verse":"The census itself first took place when Cyrenius had the government of Syria."},{"num":3,"verse":"And all went to be inscribed in the census roll, each to his own city:"},{"num":4,"verse":"and Joseph also went up from Galilee out of the city Nazareth to Judaea, to David's city, the which is called Bethlehem, because he was of the house and family of David,"},{"num":5,"verse":"to be inscribed in the census roll with Mary who was betrothed to him [as his] wife, she being great with child."},{"num":6,"verse":"And it came to pass, while they were there, the days of her giving birth [to her child] were fulfilled,"},{"num":7,"verse":"and she brought forth her first-born son, and wrapped him up in swaddling-clothes and laid him in the manger, because there was no room for them in the inn."},{"num":8,"verse":"And there were shepherds in that country abiding without, and keeping watch by night over their flock."},{"num":9,"verse":"And lo, an angel of [the] Lord was there by them, and [the] glory of [the] Lord shone around them, and they feared [with] great fear."},{"num":10,"verse":"And the angel said to them, Fear not, for behold, I announce to you glad tidings of great joy, which shall be to all the people;"},{"num":11,"verse":"for to-day a Saviour has been born to you in David's city, who is Christ [the] Lord."},{"num":12,"verse":"And this is the sign to you: ye shall find a babe wrapped in swaddling-clothes, and lying in a manger."},{"num":13,"verse":"And suddenly there was with the angel a multitude of the heavenly host, praising God and saying,"},{"num":14,"verse":"Glory to God in the highest, and on earth peace, good pleasure in men."},{"num":15,"verse":"And it came to pass, as the angels departed from them into heaven, that the shepherds said to one another, Let us make our way then now as far as Bethlehem, and let us see this thing that is come to pass, which the Lord has made known to us."},{"num":16,"verse":"And they came with haste, and found both Mary and Joseph, and the babe lying in the manger;"},{"num":17,"verse":"and having seen [it] they made known about the country the thing which had been said to them concerning this child."},{"num":18,"verse":"And all who heard [it] wondered at the things said to them by the shepherds."},{"num":19,"verse":"But Mary kept all these things [in her mind], pondering [them] in her heart."},{"num":20,"verse":"And the shepherds returned, glorifying and praising God for all things which they had heard and seen, as it had been said to them."},{"num":21,"verse":"And when eight days were fulfilled for circumcising him, his name was called Jesus, which was the name given by the angel before he had been conceived in the womb."},{"num":22,"verse":"And when the days were fulfilled for their purifying according to the law of Moses, they brought him to Jerusalem to present [him] to the Lord"},{"num":23,"verse":"(as it is written in the law of [the] Lord: Every male that opens the womb shall be called holy to the Lord),"},{"num":24,"verse":"and to offer a sacrifice according to what is said in the law of [the] Lord: A pair of turtle doves, or two young pigeons."},{"num":25,"verse":"And behold, there was a man in Jerusalem whose name was Simeon; and this man was just and pious, awaiting the consolation of Israel, and [the] Holy Spirit was upon him."},{"num":26,"verse":"And it was divinely communicated to him by the Holy Spirit, that he should not see death before he should see [the] Lord's Christ."},{"num":27,"verse":"And he came in the Spirit into the temple; and as the parents brought in the child Jesus that they might do for him according to the custom of the law,"},{"num":28,"verse":"*he* received him into his arms, and blessed God, and said,"},{"num":29,"verse":"Lord, now thou lettest thy bondman go, according to thy word, in peace;"},{"num":30,"verse":"for mine eyes have seen thy salvation,"},{"num":31,"verse":"which thou hast prepared before the face of all peoples;"},{"num":32,"verse":"a light for revelation of [the] Gentiles and [the] glory of thy people Israel."},{"num":33,"verse":"And his father and mother wondered at the things which were said concerning him."},{"num":34,"verse":"And Simeon blessed them, and said to Mary his mother, Lo, this [child] is set for the fall and rising up of many in Israel, and for a sign spoken against;"},{"num":35,"verse":"(and even a sword shall go through thine own soul;) so that [the] thoughts may be revealed from many hearts."},{"num":36,"verse":"And there was a prophetess, Anna, daughter of Phanuel, of [the] tribe of Asher, who was far advanced in years, having lived with [her] husband seven years from her virginity,"},{"num":37,"verse":"and herself a widow up to eighty-four years; who did not depart from the temple, serving night and day with fastings and prayers;"},{"num":38,"verse":"and she coming up the same hour gave praise to the Lord, and spoke of him to all those who waited for redemption in Jerusalem."},{"num":39,"verse":"And when they had completed all things according to the law of [the] Lord, they returned to Galilee to their own city Nazareth."},{"num":40,"verse":"And the child grew and waxed strong [in spirit], filled with wisdom, and God's grace was upon him."},{"num":41,"verse":"And his parents went yearly to Jerusalem at the feast of the passover."},{"num":42,"verse":"And when he was twelve years old, and they went up [to Jerusalem] according to the custom of the feast"},{"num":43,"verse":"and had completed the days, as they returned, the boy Jesus remained behind in Jerusalem, and his parents knew not [of it];"},{"num":44,"verse":"but, supposing him to be in the company that journeyed together, they went a day's journey, and sought him among their relations and acquaintances:"},{"num":45,"verse":"and not having found him they returned to Jerusalem seeking him."},{"num":46,"verse":"And it came to pass, after three days they found him in the temple, sitting in the midst of the teachers and hearing them and asking them questions."},{"num":47,"verse":"And all who heard him were astonished at his understanding and answers."},{"num":48,"verse":"And when they saw him they were amazed: and his mother said to him, Child, why hast thou dealt thus with us? behold, thy father and I have sought thee distressed."},{"num":49,"verse":"And he said to them, Why [is it] that ye have sought me? did ye not know that I ought to be [occupied] in my Father's business?"},{"num":50,"verse":"And they understood not the thing that he said to them."},{"num":51,"verse":"And he went down with them and came to Nazareth, and he was in subjection to them. And his mother kept all these things in her heart."},{"num":52,"verse":"And Jesus advanced in wisdom and stature, and in favour with God and men."}]