[{"header":"Jesus Is Born"},{"num":2,"verse":"In those days a decree went out from Caesar Augustus that all the world should be registered. "},{"num":2,"verse":"This was the first census taken while Quirinius was governing Syria. "},{"num":3,"verse":"And everyone went to register, each to his own town. "},{"num":4,"verse":"And Joseph also went up from Galilee, out of the town of Nazareth, into Judea, to the town of David, which is called Bethlehem, because he was from the house and family line of David. "},{"num":5,"verse":"He went to be registered with Mary, his wife, who was pledged to him in marriage and was expecting a child."},{"num":6,"verse":"And so it was that while they were there, the time came for her to give birth. "},{"num":7,"verse":"And she gave birth to her firstborn son, wrapped him in swaddling cloths, and laid him in a manger, because there was no room for them in the inn."},{"num":8,"verse":"There were in the same country shepherds staying out in the fields, keeping watch over their flock at night. "},{"num":9,"verse":"An angel of the Lord appeared to them, and the glory of the Lord shone around them, and they were terrified! "},{"num":10,"verse":"But the angel said to them, “Do not be afraid. For behold, I bring you good news of great joy, which will be for all people: "},{"num":11,"verse":"Today in the town of David, a Savior was born for you. He is Christ the Lord. "},{"num":12,"verse":"And this will be a sign for you: You will find a baby wrapped in swaddling cloths and lying in a manger.” "},{"num":13,"verse":"Suddenly, there was with the angel a multitude from the heavenly army, praising God and saying, "},{"num":14,"verse":"“Glory to God in the highest, and on earth peace, good will toward mankind.”"},{"num":15,"verse":"When the angels went away from them into heaven, the shepherds said to one another, “Now let’s go to Bethlehem and see this thing that has happened, which the Lord has made known to us.” "},{"num":16,"verse":"So they hurried off and found Mary and Joseph, and the baby, who was lying in the manger. "},{"num":17,"verse":"When they had seen him, they told others the message they had been told about this child. "},{"num":18,"verse":"And all who heard it were amazed by what the shepherds said to them. "},{"num":19,"verse":"But Mary treasured up all these things, pondering them in her heart. "},{"num":20,"verse":"And the shepherds returned, glorifying and praising God for all the things that they had heard and seen, which were just as they had been told."},{"header":"The Presentation in the Temple"},{"num":21,"verse":"After eight days passed, when the child was circumcised, he was named Jesus, the name given by the angel before he was conceived in the womb."},{"num":22,"verse":"When the time came for their purification according to the law of Moses, they brought him up to Jerusalem to present him to the Lord. "},{"num":23,"verse":"(As it is written in the law of the Lord, “Every firstborn male will be called holy to the Lord.”) "},{"num":24,"verse":"And they came to offer a sacrifice according to what was said in the law of the Lord, “A pair of turtledoves or two young pigeons.”"},{"num":25,"verse":"Now there was a man in Jerusalem whose name was Simeon. This man was righteous and devout, waiting for the comfort of Israel, and the Holy Spirit was on him. "},{"num":26,"verse":"It had been revealed to him by the Holy Spirit that he would not see death before he had seen the Lord’s Christ. "},{"num":27,"verse":"Moved by the Spirit he went into the temple courts. When the parents brought in the child Jesus to do for him what was customary according to the law, "},{"num":28,"verse":"Simeon took him into his arms and praised God. He said,"},{"num":33,"verse":"Joseph and the child’s mother were amazed at the things that were spoken about him. "},{"num":34,"verse":"Then Simeon blessed them and said to Mary his mother, “Listen carefully, this child is appointed for the falling and rising of many in Israel and for a sign that is spoken against, "},{"num":35,"verse":"so that the thoughts of many hearts may be revealed. And a sword will pierce your own soul too.”"},{"num":36,"verse":"Anna, a prophetess, was there. She was a daughter of Phanuel, of the tribe of Asher. She was very old. She had lived with her husband for seven years after her marriage, "},{"num":37,"verse":"and then she was a widow of eighty-four years. She did not leave the temple complex, since she was worshipping with fasting and prayers night and day. "},{"num":38,"verse":"Standing nearby at that very hour, she gave thanks to the Lord. She kept speaking about the child to all who were waiting for the redemption of Jerusalem."},{"num":39,"verse":"When they had accomplished everything according to the law of the Lord, they returned to Galilee, to their own town, Nazareth. "},{"num":40,"verse":"The child grew and became strong. He was filled with wisdom, and God’s favor was on him."},{"header":"The Boy Jesus in the Temple Courts"},{"num":41,"verse":"Every year his parents traveled to Jerusalem for the Passover Festival. "},{"num":42,"verse":"When he was twelve years old, they went up according to the custom of the Festival. "},{"num":43,"verse":"When the days had ended, as they were returning, the boy Jesus stayed behind in Jerusalem. His parents did not know it. "},{"num":44,"verse":"Since they thought he was in their group, they went a day’s journey. Then they began to look for him among their relatives and friends. "},{"num":45,"verse":"When they did not find him, they returned to Jerusalem, searching for him."},{"num":46,"verse":"After three days they found him in the temple courts, sitting among the teachers, listening to them and asking them questions. "},{"num":47,"verse":"And all who heard him were amazed at his understanding and his answers. "},{"num":48,"verse":"When his parents saw him, they were astonished. His mother said to him, “Son, why have you treated us this way? See, your father and I have been anxiously looking for you.”"},{"num":49,"verse":"He said to them, “Why were you looking for me? Did you not know that I must be taking care of my Father’s business?” "},{"num":50,"verse":"They did not understand what he was telling them."},{"num":51,"verse":"He went down with them and came to Nazareth. He was always obedient to them. And his mother treasured up all these things in her heart. "},{"num":52,"verse":"Jesus grew in wisdom and stature, and in favor with God and with people."}]