[{"header":"The Birth of Jesus"},{"num":2,"verse":"At that time, Augustus Caesar sent an order to all people in the countries that were under Roman rule. The order said that they must list their names in a register. "},{"num":2,"verse":"This was the first registration taken while Quirinius was governor of Syria. "},{"num":3,"verse":"And everyone went to their own towns to be registered."},{"num":4,"verse":"So Joseph left Nazareth, a town in Galilee. He went to the town of Bethlehem in Judea. This town was known as the town of David. Joseph went there because he was from the family of David. "},{"num":5,"verse":"Joseph registered with Mary because she was engaged to marry him. (Mary was now pregnant.) "},{"num":6,"verse":"While Joseph and Mary were in Bethlehem, the time came for her to have the baby. "},{"num":7,"verse":"She gave birth to her first son. There were no rooms left in the inn. So she wrapped the baby with cloths and laid him in a box where animals are fed."},{"header":"Some Shepherds Hear About Jesus"},{"num":8,"verse":"That night, some shepherds were in the fields nearby watching their sheep. "},{"num":9,"verse":"An angel of the Lord stood before them. The glory of the Lord was shining around them, and suddenly they became very frightened. "},{"num":10,"verse":"The angel said to them, “Don’t be afraid, because I am bringing you some good news. It will be a joy to all the people. "},{"num":11,"verse":"Today your Savior was born in David’s town. He is Christ, the Lord. "},{"num":12,"verse":"This is how you will know him: You will find a baby wrapped in cloths and lying in a feeding box.”"},{"num":13,"verse":"Then a very large group of angels from heaven joined the first angel. All the angels were praising God, saying:"},{"num":15,"verse":"Then the angels left the shepherds and went back to heaven. The shepherds said to each other, “Let us go to Bethlehem and see this thing that has happened. We will see this thing the Lord told us about.”"},{"num":16,"verse":"So the shepherds went quickly and found Mary and Joseph. "},{"num":17,"verse":"And the shepherds saw the baby lying in a feeding box. Then they told what the angels had said about this child. "},{"num":18,"verse":"Everyone was amazed when they heard what the shepherds said to them. "},{"num":19,"verse":"Mary hid these things in her heart; she continued to think about them. "},{"num":20,"verse":"Then the shepherds went back to their sheep, praising God and thanking him for everything that they had seen and heard. It was just as the angel had told them."},{"num":21,"verse":"When the baby was eight days old, he was circumcised, and he was named Jesus. This name had been given by the angel before the baby began to grow inside Mary."},{"header":"Jesus Is Presented in the Temple"},{"num":22,"verse":"The time came for Mary and Joseph to do what the law of Moses taught about being made pure. They took Jesus to Jerusalem to present him to the Lord. "},{"num":23,"verse":"It is written in the law of the Lord: “Give every firstborn male to the Lord.” "},{"num":24,"verse":"Mary and Joseph also went to offer a sacrifice, as the law of the Lord says: “You must sacrifice two doves or two young pigeons.”"},{"header":"Simeon Sees Jesus"},{"num":25,"verse":"A man named Simeon lived in Jerusalem. He was a good man and very religious. He was waiting for the time when God would help Israel. The Holy Spirit was in him. "},{"num":26,"verse":"The Holy Spirit told Simeon that he would not die before he saw the Christ promised by the Lord. "},{"num":27,"verse":"The Spirit led Simeon to the Temple. Mary and Joseph brought the baby Jesus to the Temple to do what the law said they must do. "},{"num":28,"verse":"Then Simeon took the baby in his arms and thanked God:"},{"num":33,"verse":"Jesus’ father and mother were amazed at what Simeon had said about him. "},{"num":34,"verse":"Then Simeon blessed them and said to Mary, “Many in Israel will fall and many will rise because of this child. He will be a sign from God that many people will not accept. "},{"num":35,"verse":"The things they think in secret will be made known. And the things that will happen will make your heart sad, too.”"},{"header":"Anna Sees Jesus"},{"num":36,"verse":"Anna, a prophetess, was there at the Temple. She was from the family of Phanuel in the tribe of Asher. Anna was very old. She had once been married for seven years. "},{"num":37,"verse":"Then her husband died and she lived alone. She was now 84 years old. Anna never left the Temple. She worshiped God by going without food and praying day and night. "},{"num":38,"verse":"She was standing there at that time, thanking God. She talked about Jesus to all who were waiting for God to free Jerusalem."},{"header":"Joseph and Mary Return Home"},{"num":39,"verse":"Joseph and Mary finished doing everything that the law of the Lord commanded. Then they went home to Nazareth, their own town in Galilee. "},{"num":40,"verse":"The little child began to grow up. He became stronger and wiser, and God’s blessings were with him."},{"header":"Jesus As a Boy"},{"num":41,"verse":"Every year Jesus’ parents went to Jerusalem for the Passover Feast. "},{"num":42,"verse":"When Jesus was 12 years old, they went to the feast as they always did. "},{"num":43,"verse":"When the feast days were over, they went home. The boy Jesus stayed behind in Jerusalem, but his parents did not know it. "},{"num":44,"verse":"Joseph and Mary traveled for a whole day. They thought that Jesus was with them in the group. Then they began to look for him among their family and friends, "},{"num":45,"verse":"but they did not find him. So they went back to Jerusalem to look for him there. "},{"num":46,"verse":"After three days they found him. Jesus was sitting in the Temple with the religious teachers, listening to them and asking them questions. "},{"num":47,"verse":"All who heard him were amazed at his understanding and wise answers. "},{"num":48,"verse":"When Jesus’ parents saw him, they were amazed. His mother said to him, “Son, why did you do this to us? Your father and I were very worried about you. We have been looking for you.”"},{"num":49,"verse":"Jesus asked, “Why did you have to look for me? You should have known that I must be where my Father’s work is!” "},{"num":50,"verse":"But they did not understand the meaning of what he said."},{"num":51,"verse":"Jesus went with them to Nazareth and obeyed them. His mother was still thinking about all that had happened. "},{"num":52,"verse":"Jesus continued to learn more and more and to grow physically. People liked him, and he pleased God."}]