[{"num":2,"verse":"· de In en · ho those ekeinos days hēmera a  decree dogma went exerchomai out  from para Caesar Kaisar Augustus for  all pas the ho world oikoumenē to  be  registered apographō. "},{"num":2,"verse":"This houtos registration apographē first prōtos took ginomai place  while  Quirinius Kyrēnios was  governing hēgemoneuō · ho Syria Syria. "},{"num":3,"verse":"And kai everyone pas went poreuō to  be  registered apographō,  each hekastos to eis · ho his heautou own  town polis. "},{"num":4,"verse":"So de Joseph Iōsēph also kai went anabainō up  from apo · ho Galilee Galilaia,  from ek the  town polis of  Nazareth Nazareth,  to eis · ho Judea Ioudaia,  to eis the  city polis of  David Dauid,  which hostis is  called kaleō Bethlehem Bēthleem,  because dia · ho he autos was eimi of ek the  house oikos and kai lineage patria of  David Dauid, "},{"num":5,"verse":"to  be  registered apographō with syn Mary Mariam,  who ho was  pledged mnēsteuō in  marriage  to  him autos, and  who  was eimi expecting a child. "},{"num":6,"verse":"And de while en · ho they autos were eimi there ekei,  the ho days hēmera were  completed pimplēmi for  her autos to ho give  birth tiktō, "},{"num":7,"verse":"and kai she  gave tiktō birth  to  a ho son hyios,  her autos · ho firstborn prōtotokos.  · kai She  wrapped sparganoō him autos in  swaddling  cloths  and kai laid anaklinō him autos in en a  manger phatnē,  because dioti there  was eimi no ou place topos for  them autos in en the ho inn katalyma. "},{"num":8,"verse":"· kai There  were eimi shepherds poimēn in en that autos · ho region chōra · ho who  were  living agrauleō out  in  the  fields  and kai keeping phylassō night-watch phylakē ho · ho over epi · ho their autos flock poimnē. "},{"num":9,"verse":"· kai An  angel angelos of  the  Lord kyrios suddenly  appeared ephistēmi to  them autos,  and kai the  glory doxa of  the  Lord kyrios shone perilampō around  them autos,  and kai they  were  terribly megas afraid phobeomai. "},{"num":10,"verse":"But kai the ho angel angelos said legō to  them autos, “ Do  not mē be  afraid phobeomai;  for gar behold idou,  I  announce euangelizō to  you hymeis good  news  of a  great megas joy chara which hostis will  be eimi for  all pas the ho people laos, "},{"num":11,"verse":"because hoti this  very  day sēmeron there  has  been  born tiktō to  you hymeis,  in en the  city polis of  David Dauid, a  savior sōtēr who hos is eimi Messiah Christos, the  Lord kyrios. "},{"num":12,"verse":"And kai this houtos is  the ho sign sēmeion for  you hymeis:  you  will  find heuriskō a  baby brephos wrapped sparganoō in  swaddling  cloths  and kai lying keimai in en a  manger phatnē.” "},{"num":13,"verse":"And kai suddenly exaiphnēs there  was ginomai,  with syn the ho angel angelos, a  multitude plēthos of  the  heavenly ouranios host stratia,  praising aineō · ho God theos and kai saying legō, "},{"num":14,"verse":"“ Glory doxa to  God theos in en the  highest hypsistos heaven,  and kai peace eirēnē on epi earth gē among en those anthrōpos whom  he  has  favored eudokia!” "},{"num":15,"verse":"· kai When hōs the ho angels angelos departed aperchomai from apo them autos into eis · ho heaven ouranos,  the ho shepherds poimēn began  to  speak laleō to pros one allēlōn another , “ Well dē,  let  us  go dierchomai across  to heōs Bethlehem Bēthleem and kai see  · ho this houtos thing rhēma that ho has  taken ginomai place ,  which hos the ho Lord kyrios has  made  known gnōrizō to  us hēmeis.” "},{"num":16,"verse":"So kai they  came erchomai in  haste speudō and kai found aneuriskō · ho Mary Mariam and kai · ho Joseph Iōsēph,  and kai the ho baby brephos lying keimai in en the ho manger phatnē. "},{"num":17,"verse":"And de when they had seen him,  they  made  it  known gnōrizō concerning peri the ho message rhēma that ho had  been  spoken laleō to  them autos about peri · ho this houtos child paidion. "},{"num":18,"verse":"And kai all pas who ho heard akouō marveled thaumazō about peri what ho had  been  told laleō to pros them autos by hypo the ho shepherds poimēn. "},{"num":19,"verse":"· ho · de Mary Mariam remembered syntēreō all pas that ho had  been  said rhēma,  pondering symballō them houtos in en · ho her autos heart kardia. "},{"num":20,"verse":"Then kai the ho shepherds poimēn returned hypostrephō,  glorifying doxazō and kai praising aineō · ho God theos for epi all pas that hos they  had  heard akouō and kai seen,  just kathōs as  it  had  been  told laleō to pros them autos. "},{"num":21,"verse":"· kai When hote eight oktō days hēmera had  gone pimplēmi by  and it was time  to ho circumcise peritemnō him autos,  · kai his autos name onoma was  called kaleō · ho Jesus Iēsous,  the ho name  he  was  called kaleō by hypo the ho angel angelos before pro he autos · ho was  conceived syllambanō in en the ho womb koilia. "},{"num":22,"verse":"And kai when hote the ho days hēmera were  completed pimplēmi for ho their autos purification katharismos according kata to  the ho law nomos of  Moses Mōysēs,  they  brought anagō him autos up  to eis Jerusalem Hierosolyma to  present paristēmi to  the ho Lord kyrios"},{"num":23,"verse":"( as kathōs it  is  written graphō in en the  law nomos of  the  Lord kyrios: “ Every pas male arsēn who  first  opens dianoigō the  womb mētra will  be  called kaleō holy hagios to  the ho Lord kyrios”) "},{"num":24,"verse":"and kai to ho offer didōmi a  sacrifice thusia according kata to  what ho is  said legō in en the ho law nomos of  the  Lord kyrios, “A  pair zeugos of  turtledoves trygōn or ē two dyo young nossos pigeons peristera.” "},{"num":25,"verse":"Now kai there  was eimi a  man anthrōpos in en Jerusalem Ierousalēm,  whose hos name onoma was  Simeon Symeōn,  and kai · ho this houtos man anthrōpos was  righteous dikaios and kai devout eulabēs,  waiting prosdechomai expectantly  for  the  consolation paraklēsis of ho Israel Israēl,  and kai the  Holy hagios Spirit pneuma was eimi upon epi him autos. "},{"num":26,"verse":"And kai it  had  been eimi revealed chrēmatizō to  him autos by hypo the ho Holy hagios Spirit pneuma · ho that he would  not mē see  death thanatos before prin ē he had seen  the ho Lord’ s kyrios Christ Christos. "},{"num":27,"verse":"So kai he  came erchomai in en the ho Spirit pneuma into eis the ho temple hieron,  and kai when en · ho the ho parents paidion brought eisagō in  the ho child goneus Jesus Iēsous,  to ho do poieō for peri him autos according kata to  the ho custom ethizō of  the ho Law nomos, "},{"num":28,"verse":"· kai he autos received dechomai him autos in eis his ho arms ankalē and kai blessed eulogeō · ho God theos and kai said legō, "},{"num":29,"verse":"“ Now nyn,  Master despotēs,  you  are  dismissing apolyō · ho your sy servant  in en peace eirēnē,  according kata to  · ho your sy word rhēma; "},{"num":30,"verse":"because hoti my egō eyes ophthalmos have seen  · ho · ho your sy salvation, "},{"num":31,"verse":"which hos you  have  prepared hetoimazō in kata the  presence prosōpon of  all pas · ho peoples laos, "},{"num":32,"verse":"a  light phōs for eis revelation apokalypsis to  the  Gentiles ethnos,  and kai for  glory doxa for  your sy people laos Israel Israēl.” "},{"num":33,"verse":"· kai · ho His autos father patēr and kai · ho mother mētēr were eimi amazed thaumazō at epi the ho things  that  were  being  said laleō about peri him autos. "},{"num":34,"verse":"Then kai Simeon Symeōn blessed eulogeō them autos and kai said legō to pros Mary Mariam · ho his autos mother mētēr, “ Take idou note ,  this houtos child  is  appointed keimai for eis the  fall ptōsis and kai rising anastasis of  many polys in en · ho Israel Israēl,  and kai for eis a  sign sēmeion that  will  be  opposed antilegō"},{"num":35,"verse":"( and de a  sword rhomphaia will  pierce dierchomai your sy own autos · ho soul psychē also kai),  that hopōs thoughts dialogismos of ek many polys hearts kardia may  be  revealed apokalyptō.” "},{"num":36,"verse":"Now kai there  was eimi a  prophetess prophētis,  Anna Hanna, the  daughter thugatēr of  Phanuel Phanouēl,  of ek the  tribe phylē of  Asher Asēr.  She houtos was  advanced probainō in en years hēmera polys,  having  lived zaō with meta her  husband anēr seven etos years hepta from apo · ho her autos virginity parthenia, "},{"num":37,"verse":"and kai then  she autos was a  widow chēra until heōs she was  eighty-four ogdoēkonta years etos old.  She hos did  not ou leave aphistēmi the ho temple hieron,  worshipping latreuō night nyx and kai day hēmera with  fasting nēsteia and kai prayer deēsis. "},{"num":38,"verse":"· kai At  that  very autos · ho hour hōra she  came ephistēmi up  and  began  to  give anthomologeomai thanks  to ho God theos and kai continued  to  speak laleō of peri him autos to  all pas who ho were  waiting prosdechomai expectantly  for  the  redemption lytrōsis of  Jerusalem Ierousalēm. "},{"num":39,"verse":"And kai when hōs they  had  completed teleō everything pas · ho according kata to  the ho law nomos of  the  Lord kyrios,  they  returned epistrephō to eis · ho Galilee Galilaia,  to eis their  own heautou town polis,  Nazareth Nazareth. "},{"num":40,"verse":"And de the ho child paidion grew auxanō and kai became  strong krataioō,  filled plēroō with  wisdom sophia;  and kai the  favor charis of  God theos was eimi upon epi him autos. "},{"num":41,"verse":"Now kai his autos parents goneus went poreuō · ho year  by kata year etos to eis Jerusalem Ierousalēm for  the ho feast heortē of ho Passover pascha"},{"num":42,"verse":"And kai when hote he  was ginomai twelve dōdeka years etos old,  when  they autos went anabainō up  according kata to  the ho custom ethos of  the ho feast heortē"},{"num":43,"verse":"and kai had  completed teleioō the ho days hēmera,  as en · ho they autos were  returning hypostrephō,  the ho boy pais Jesus Iēsous stayed hypomenō behind  in en Jerusalem Ierousalēm,  and kai his autos parents goneus did  not ou know ginōskō · ho it. "},{"num":44,"verse":"Thinking nomizō · de him autos to  be eimi in en the ho caravan synodia,  they  went erchomai a day’ s hēmera journey hodos,  but kai then  began  looking anazēteō for  him autos among en their ho relatives syngenēs and kai · ho acquaintances gnōstos. "},{"num":45,"verse":"· kai When  they  did  not mē find heuriskō him,  they  went hypostrephō back  to eis Jerusalem Ierousalēm to  look anazēteō for  him autos. "},{"num":46,"verse":"Then kai after meta three treis days hēmera they  found heuriskō him autos in en the ho temple hieron,  seated kathezomai in en the  midst mesos of  the ho teachers didaskalos,  · kai listening akouō to  them autos and kai asking eperōtaō them autos questions. "},{"num":47,"verse":"And de all pas who ho heard akouō him autos were existēmi amazed  at epi · ho his  understanding synesis and kai · ho his autos answers apokrisis. "},{"num":48,"verse":"And kai when they saw  him autos,  they  were  astounded ekplēssō,  and kai his autos mother mētēr said legō to pros him autos,  · ho “ Child teknon,  why tis did  you  treat poieō us hēmeis like houtōs this ?  Look idou,  · ho your sy father patēr and  I kagō have  been  terribly  worried odynaō trying  to  find zēteō you sy.” "},{"num":49,"verse":"And kai he  said legō to pros them autos, “ Why tis is it  that hoti you  were  looking zēteō for  me egō?  Did  you  not ou know oida that hoti I egō would  have dei to  be eimi in en · ho · ho my egō Father’ s patēr house?” "},{"num":50,"verse":"But kai they autos did  not ou understand syniēmi the ho saying rhēma that hos he  spoke laleō to  them autos. "},{"num":51,"verse":"Then kai he  went katabainō down  with meta them autos and kai came erchomai to eis Nazareth Nazareth and kai was eimi obedient hypotassō to  them autos.  And kai · ho his autos mother mētēr treasured diatēreō all pas that ho was  said rhēma in en · ho her autos heart kardia. "},{"num":52,"verse":"And kai Jesus Iēsous advanced prokoptō in en · ho wisdom sophia and kai in  stature hēlikia,  and kai in  favor charis with para God theos and kai man anthrōpos. "}]