[{"num":24,"verse":"The divisions of the descendants of Aharon were as follows:"},{"num":2,"verse":"But Nadav and Avihu died before their father and had no children; therefore El‘azar and Itamar functioned as the cohanim. "},{"num":3,"verse":"David, together with Tzadok from the descendants of El‘azar, and Achimelekh from the descendants of Itamar, arranged them in divisions for service. "},{"num":4,"verse":"There were more men who were chiefs found among the descendants of El‘azar than among the descendants of Itamar; therefore there were sixteen divisions of the descendants of El‘azar, headed by clan leaders, and eight divisions of the descendants of Itamar, according to their clans. "},{"num":5,"verse":"They were assigned [periods of service] by lot, the one group equally with the other, since both the descendants of El‘azar and the descendants of Itamar had officers of the sanctuary and officers of God. "},{"num":6,"verse":"Sh’ma‘yah the son of N’tan’el the secretary, one of the L’vi’im, recorded them in the presence of the king, the officers, Tzadok the cohen, Achimelekh the son of Evyatar, and the clan leaders of the cohanim and of the L’vi’im — with two clan divisions taken from El‘azar for each one from Itamar."},{"num":19,"verse":"These are the divisions and the sequence in which they served in the house of Adonai, in accordance with the rule they were given through Aharon their ancestor, as Adonai the God of Isra’el had ordered him."},{"num":20,"verse":"The rest of the descendants of Levi: of the descendants of ‘Amram, Shuva’el; of the descendants of Shuva’el, Yechd’yah. "},{"num":21,"verse":"Of Rechavyahu: of the descendants of Rechavyahu, Yishiyah the chief. "},{"num":22,"verse":"Of the Yitz’hari, Shlomot; of the descendants of Shlomot, Yachat. "},{"num":23,"verse":"Of the sons [of Hevron]: Yeriyahu, Amaryahu second, Yachzi’el third and Y’kam‘am fourth. "},{"num":24,"verse":"The descendants of ‘Uzi’el: Mikhah; of the descendants of Mikhah, Shamir. "},{"num":25,"verse":"The brother of Mikhah: Yishiyah; of the descendants of Yishiyah, Z’kharyahu."},{"num":26,"verse":"The sons of M’rari: Machli and Mushi. The descendants of his son Ya‘aziyahu, "},{"num":27,"verse":"that is, the descendants of M’rari through his descendant Ya‘aziyahu: Shoham, Zakur and ‘Ivri. "},{"num":28,"verse":"Of Machli: El‘azar, who had no sons. "},{"num":29,"verse":"Of Kish: the descendants of Kish, Yerachme’el. "},{"num":30,"verse":"And the sons of Mushi: Machli, ‘Eder and Yerimot."},{"num":31,"verse":"These likewise cast lots, as had their kinsmen the descendants of Aharon, in the presence of David the king, Tzadok, Achimelekh, and the clan leaders of the cohanim and of the L’vi’im; with the senior and junior clans casting lots equally."}]