[{"header":"Chapter 24"},{"num":1,"verse":"The Priestly Divisions. There were also divisions for the sons of Aaron. The sons of Aaron were Nadab, Abihu, Eleazar, and Ithamar. "},{"num":2,"verse":"Nadab and Abihu died before their father, leaving no sons; therefore only Eleazar and Ithamar served as priests. "},{"num":3,"verse":"David, with Zadok, a descendant of Eleazar, and Ahimelech, a descendant of Ithamar, apportioned them their offices in the priestly service. "},{"num":4,"verse":"But since the sons of Eleazar were found to be more numerous by male heads than those of Ithamar, the former were divided into sixteen groups, and the latter into eight groups, each under its family heads. "},{"num":5,"verse":"Their functions were assigned impartially by lot, for there were officers of the holy place, and officers of God, descended both from Eleazar and from Ithamar. "},{"num":6,"verse":"The scribe Shemaiah, son of Nethanel, a Levite, recorded them in the presence of the king, and of the officials, of Zadok the priest, and of Ahimelech, son of Abiathar, and of the heads of the ancestral houses of the priests and of the Levites, listing two successive family groups from Eleazar before each one from Ithamar."},{"num":7,"verse":"The first lot fell to Jehoiarib, the second to Jedaiah, "},{"num":8,"verse":"the third to Harim, the fourth to Seorim, "},{"num":9,"verse":"the fifth to Malchijah, the sixth to Mijamin, "},{"num":10,"verse":"the seventh to Hakkoz, the eighth to Abijah, "},{"num":11,"verse":"the ninth to Jeshua, the tenth to Shecaniah, "},{"num":12,"verse":"the eleventh to Eliashib, the twelfth to Jakim, "},{"num":13,"verse":"the thirteenth to Huppah, the fourteenth to Ishbaal, "},{"num":14,"verse":"the fifteenth to Bilgah, the sixteenth to Immer, "},{"num":15,"verse":"the seventeenth to Hezir, the eighteenth to Happizzez, "},{"num":16,"verse":"the nineteenth to Pethahiah, the twentieth to Jehezkel, "},{"num":17,"verse":"the twenty-first to Jachin, the twenty-second to Gamul, "},{"num":18,"verse":"the twenty-third to Delaiah, the twenty-fourth to Maaziah. "},{"num":19,"verse":"This was the appointed order of their service when they functioned in the house of the Lord according to the precepts given them by Aaron, their father, as the Lord, the God of Israel, had commanded him."},{"num":20,"verse":"Other Levites. Of the remaining Levites, there were Shubael, of the sons of Amram, and Jehdeiah, of the sons of Shubael; "},{"num":21,"verse":"Isshiah, the chief, of the sons of Rehabiah; "},{"num":22,"verse":"Shelomith of the Izharites, and Jahath of the sons of Shelomith. "},{"num":23,"verse":"The sons of Hebron were Jeriah, the chief, Amariah, the second, Jahaziel, the third, Jekameam, the fourth. "},{"num":24,"verse":"The sons of Uzziel were Micah; Shamir, of the sons of Micah; "},{"num":25,"verse":"Isshiah, the brother of Micah; and Zechariah, a descendant of Isshiah. "},{"num":26,"verse":"The sons of Merari were Mahli, Mushi, and the sons of his son Uzziah. "},{"num":27,"verse":"The sons of Merari through his son Uzziah: Shoham, Zaccur, and Ibri. "},{"num":28,"verse":"The sons of Mahli were Eleazar, who had no sons, "},{"num":29,"verse":"and Jerahmeel, of the sons of Kish. "},{"num":30,"verse":"The sons of Mushi were Mahli, Eder, and Jerimoth."},{"num":31,"verse":"They too, in the same manner as their kinsmen, the sons of Aaron, cast lots in the presence of King David, Zadok, Ahimelech, and the heads of the priestly and levitical families; the more important family did so in the same way as the less important one."}]