[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mark",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "WORKS WHICH HALLOW THE SABBATH",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE ANGER AND GRIEF OF JESUSMark 3:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE ANGER AND GRIEF OF JESUS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our Lord goes into the synagogue at Capernaum, where He had already wrought more than one miracle, and there He finds an object for His healing power, in a poor man with a withered hand; and also a little knot of His enemies. The scribes and Pharisees expect Christ to heal the man. So much had they learned of His tenderness and of His power.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But their belief that He could work a miracle did not carry them one step towards a recognition of Him as sent by God. They have no eye for the miracle, because they expect that He is going to break the Sabbath. There is nothing so blind as formal religionism. This poor man’s infirmity did not touch their hearts with one little throb of compassion. They had rather that he had gone crippled all his days than that one of their Rabbinical Sabbatarian restrictions should be violated. There is nothing so cruel as formal religionism. They only think that there is a trap laid-and perhaps they had laid it-into which Christ is sure to go.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, as our Evangelist tells us, they sat there stealthily watching Him out of their cold eyes, whether He would heal on the Sabbath day, that they might accuse Him. Our Lord bids the man stand out into the middle of the little congregation. He obeys, perhaps, with some feeble glimmer of hope playing round his heart. There is a quickened attention in the audience; the enemies are watching Him with gratification, because they hope He is going to do what they think to be a sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then He reduces them all to silence and perplexity by His question-sharp, penetrating, unexpected: ‘Is it lawful to do good on the Sabbath day, or to do evil? You are ready to blame Me as breaking your Sabbatarian regulations if I heal this man. What if I do not heal him? Will that be doing nothing? Will not that be a worse breach of the Sabbath day than if I heal him?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He takes the question altogether out of the region of pedantic Rabbinism, and bases His vindication upon the two great principles that mercy and help hallow any day, and that not to do good when we can is to do harm, and not to save life is to kill.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " They are silenced. His arrow touches them; they do not speak because they cannot answer; and they will not yield. There is a struggle going on in them, which Christ sees, and He fixes them with that steadfast look of His; of which our Evangelist is the only one who tells us what it expressed, and by what it was occasioned. ‘He looked round about on them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with anger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ Mark the combination of emotions, anger and grief. And mark the reason for both; ‘the hardness,’ or as you will see, if you use the Revised Version, ‘the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hardening",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ of their hearts-a process which He saw going on before Him as He looked at them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now I do not need to follow the rest of the story, how He turns away from them because He will not waste any more words on them, else He had done more harm than good. He heals the man. They hurry from the synagogue to prove their zeal for the sanctifying of the Sabbath day by hatching a plot on it for murdering Him. I leave all that, and turn to the thoughts suggested by this look of Christ as explained by the Evangelist.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Consider then, first, the solemn fact of Christ’s anger. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Consider then, first, the solemn fact of Christ’s anger.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is the only occasion, so far as I remember, upon which that emotion is attributed to Him. Once, and once only, the flash came out of the clear sky of that meek and gentle heart. He was once angry; and we may learn the lesson of the possibilities that lay slumbering in His love. He was only once angry, and we may learn the lesson that His perfect and divine charity ‘is not easily provoked.’ These very words from Paul’s wonderful picture may teach us that the perfection of divine charity does not consist in its being incapable of becoming angry at all, but only in its not being angry except upon grave and good occasion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ’s anger was part of the perfection of His manhood. The man that cannot be angry at evil lacks enthusiasm for good. The nature that is incapable of being touched with generous and righteous indignation is so, generally, either because it lacks fire and emotion altogether, or because its vigour has been dissolved into a lazy indifference and easy good nature which it mistakes for love. Better the heat of the tropics, though sometimes the thunderstorms may gather, than the white calmness of the frozen poles. Anger is not weakness, but it is strength, if there be these three conditions, if it be evoked by a righteous and unselfish cause, if it be kept under rigid control, and if there be nothing in it of malice, even when it prompts to punishment. Anger is just and right when it is not produced by the mere friction of personal irritation {like electricity by rubbing}, but is excited by the contemplation of evil. It is part of the marks of a good man that he kindles into wrath when he sees ‘the oppressor’s wrong.’ If you went out hence to-night, and saw some drunken ruffian beating his wife or ill-using his child, would you not do well to be angry? And when nations have risen up, as our own nation did seventy years ago in a paroxysm of righteous indignation, and vowed that British soil should no more bear the devilish abomination of slavery, was there nothing good and great in that wrath? So it is one of the strengths of man that he shall be able to glow with indignation at evil.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Only all such emotion must be kept well in hand must never be suffered to degenerate into passion. Passion is always weak, emotion is an element of strength.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘The gods approveThe depth and not the tumult of the soul.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘The gods approve",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The depth and not the tumult of the soul.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But where a man does not let his wrath against evil go sputtering off aimlessly, like a box of fireworks set all alight at once, then it comes to be a strength and a help to much that is good.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The other condition that makes wrath righteous and essential to the perfection of a man, is that there shall be in it no taint of malice. Anger may impel to punish and not be malicious, if its reason for punishment is the passionless impulse of justice or the reformation of the wrong-doer. Then it is pure and true and good. Such wrath is a part of the perfection of humanity, and such wrath was in Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But, still further, Christ’s anger was part of His revelation of God. What belongs to perfect man belongs to God in whose image man was made. People are very often afraid of attributing to the divine nature that emotion of wrath, very unnecessarily, I think, and to the detriment of all their conceptions of the divine nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is no reason why we should not ascribe emotion to Him. Passions God has not; emotions the Bible represents Him as having. The god of the philosopher has none. He is a cold, impassive Somewhat, more like a block of ice than a god. But the God of the Bible has a heart that can be touched, and is capable of something like what we call in ourselves emotion. And if we rightly think of God as Love, there is no more reason why we should not think of God as having the other emotion of wrath; for as I have shown you, there is nothing in wrath itself which is derogatory to the perfection of the loftiest spiritual nature. In God’s anger there is no self-regarding irritation, no passion, no malice. It is the necessary displeasure and aversion of infinite purity at the sight of man’s impurity. God’s anger is His love thrown back upon itself from unreceptive and unloving hearts. Just as a wave that would roll in smooth, unbroken, green beauty into the open door of some sea-cave is dashed back in spray and foam from some grim rock, so the love of God, meeting the unloving heart that rejects it, and the purity of God meeting the impurity of man, necessarily become that solemn reality, the wrath of the most high God. ‘A God all mercy were a God unjust.’ The judge is condemned when the culprit is acquitted; and he that strikes out of the divine nature the capacity for anger against sin, little as he thinks it, is degrading the righteousness and diminishing the love of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh, dear brethren, I beseech you do not let any easygoing gospel that has nothing to say to you about God’s necessary aversion from, and displeasure with, and chastisement of, your sins and mine, draw you away from the solemn and wholesome belief that there is that in God which must hate and war against and chastise our evil, and that if there were not, He would be neither worth loving nor worth trusting. And His Son, in His tears and in His tenderness, which were habitual, and also in that lightning flash which once shot across the sky of His nature, was revealing Him to us. The Gospel is not only the revelation of God’s righteousness for faith, but is also ‘the revelation of His wrath against all ungodliness and unrighteousness of men.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘It is hard for thee to kick against the pricks.’ The ox, with the yoke on his neck, lashes out with his obstinate heels against the driver’s goad. He does not break the goad, but only embrues his own limbs. Do not you do that!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. And now, once more, let me ask you to look at the compassion which goes with our Lord’s anger here; ‘being grieved at the hardness of their hearts.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. And now, once more, let me ask you to look at the compassion which goes with our Lord’s anger here; ‘being grieved at the hardness of their hearts.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The somewhat singular word rendered here ‘grieved,’ may either simply imply that this sorrow co-existed with the anger, or it may describe the sorrow as being sympathy or compassion. I am disposed to take it in the latter application, and so the lesson we gather from these words is the blessed thought that Christ’s wrath was all blended with compassion and sympathetic sorrow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He looked upon these scribes and Pharisees sitting there with hatred in their eyes; and two emotions, which many men suppose as discrepant and incongruous as fire and water, rose together in His heart: wrath, which fell on the evil; sorrow, which bedewed the doers of it. The anger was for the hardening, the compassion was for the hardeners.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If there be this blending of wrath and sorrow, the combination takes away from the anger all possibility of an admixture of these questionable ingredients, which mar human wrath, and make men shrink from attributing so turbid and impure an emotion to God. It is an anger which lies harmoniously in the heart side by side with the tenderest pity-the truest, deepest sorrow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, if Christ’s sorrow flowed out thus along with His anger when He looked upon men’s evil, then we understand in how tragic a sense He was ‘a Man of sorrows and acquainted with grief.’ The pain and the burden and the misery of His earthly life had no selfish basis. They were not like the pain and the burdens and the misery that so many of us howl out so loudly about, arising from causes affecting ourselves. But for Him-with His perfect purity, with His deep compassion, with His heart that was the most sensitive heart that ever beat in a human breast, because it was the only perfectly pure one that ever beat there-for Him to go amongst men was to be wounded and bruised and hacked by the sharp swords of their sins.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Everything that He touched burned that pure nature, which was sensitive to evil, like an infant’s hand to hot iron. His sorrow and His anger were the two sides of the medal. His feelings in looking on sin were like a piece of woven stuff with a pattern on either side, on one the fiery threads-the wrath; on the other the silvery tints of sympathetic pity. A warp of wrath, a woof of sorrow, dew and flame married and knit together.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And may we not draw from this same combination of these two apparently discordant emotions in our Lord, the lesson of what it is in men that makes them the true subjects of pity? Ay, these scribes and Pharisees had very little notion that there was anything about them to compassionate. But the thing which in the sight of God makes the true evil of men’s condition is not their circumstances but their sins. The one thing to weep for when we look at the world is not its misfortunes, but its wickedness. Ah! brother, that is the misery of miseries; that is the one thing worth crying about in our own lives, or in anybody else’s. From this combination of indignation and pity, we may learn how we should look upon evil. Men are divided into two classes in their way of looking at wickedness in this world. One set are rigid and stern, and crackling into wrath; the other set placid and good-natured, and ready to weep over it as a misfortune and a calamity, but afraid or unwilling to say: ‘These poor creatures are to be blamed as well as pitied.’ It is of prime importance that we all should try to take both points of view, looking on sin as a thing to be frowned at, but also looking on it as a thing to be wept over; and to regard evil-doers as persons that deserve to be blamed and to be chastised, and made to feel the bitterness of their evil, and not to interfere too much with the salutary laws that bring down sorrow upon men’s heads if they have been doing wrong, but, on the other hand, to take care that our sense of justice does not swallow up the compassion that weeps for the criminal as an object of pity. Public opinion and legislation swing from the one extreme to the other. We have to make an effort to keep in the centre, and never to look round in anger, unsoftened by pity, nor in pity, enfeebled by being separated from righteous indignation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Let me now deal briefly with the last point that is here, namely, the occasion for both the sorrow and the anger, ‘Being grieved at the hardening of the hearts.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Let me now deal briefly with the last point that is here, namely, the occasion for both the sorrow and the anger, ‘Being grieved at the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "hardening",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the hearts.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "As I said at the beginning of these remarks, ‘hardness,’ the rendering of our Authorised Version, is not quite so near the mark as that of the Revised Version, which speaks not so much of a condition as of a process: ‘He was grieved at the hardening of their hearts,’ which He saw going on there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And what was hardening their hearts? It was He. Why were their hearts being hardened? Because they were looking at Him, His graciousness, His goodness, and His power, and were steeling themselves against Him, opposing to His grace and tenderness their own obstinate determination. Some little gleams of light were coming in at their windows, and they clapped the shutters up. Some tones of His voice were coming into their ears, and they stuffed their fingers into them. They half felt that if they let themselves be influenced by Him it was all over, and so they set their teeth and steadied themselves in their antagonism.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And that is what some of you are doing now. Jesus Christ is never preached to you, even although it is as imperfectly as I do it, but that you either gather yourselves into an attitude of resistance, or, at least, of mere indifference till the flow of the sermon’s words is done; or else open your hearts to His mercy and His grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh, dear brethren, will you take this lesson of the last part of my text, that nothing so tends to harden a man’s heart to the gospel of Jesus Christ as religious formalism? If Jesus Christ were to come in here now, and stand where I am standing, and look round about upon this congregation, I wonder how many a highly respectable and perfectly proper man and woman, church and chapel-goer, who keeps the Sabbath day, He would find on whom He had to look with grief not unmingled with anger, because they were hardening their hearts against Him now. I am sure there are some of such among my present audience. I am sure there are some of you about whom it is true that ‘the publicans and the harlots will go into the Kingdom of God before you,’ because in their degradation they may be nearer the lowly penitence and the consciousness of their own misery and need, which will open their eyes to see the beauty and the preciousness of Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brother, let no reliance upon any external attention to religious ordinances; no interest, born of long habit of hearing sermons; no trust in the fact of your being communicants, blind you to this, that all these things may come between you and your Saviour, and so may take you away into the outermost darkness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Dear brother or sister, you are a sinner. ‘The God in whose hand thy breath is, and whose are all thy ways, thou hast not glorified.’ You have forgotten Him; you have lived to please yourselves. I charge you with nothing criminal, with nothing gross or sensual; I know nothing about you in such matters; but I know this-that you have a heart like mine, that we have all of us the one character, and that we all need the one gospel of that Saviour ‘who bare our sins in His own body on the tree,’ and died that whosoever trusts in Him may live here and yonder. I beseech you, harden not your hearts, but to-day hear His voice, and remember the solemn words which not I, but the Apostle of Love, has spoken: ‘He that believeth on the Son hath everlasting life, he that believeth not the Son shall not see life, but the wrath of God abideth upon him.’ Flee to that sorrowing and dying Saviour, and take the cleansing which He gives, that you may be safe on the sure foundation when God shall arise to do His strange work of judgment, and may never know the awful meaning of that solemn word-’the wrath of the Lamb.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-5 This man's case was piteous; he had a withered hand, which disabled him from working for his living; and those that are so, are the most proper objects of charity. Let those be helped that cannot help themselves. But stubborn infidels, when they can say nothing against the truth, yet will not yield. We hear what is said amiss, and see what is done amiss; but Christ looks at the root of bitterness in the heart, the blindness and hardness of that, and is grieved. Let hard-hearted sinners tremble to think of the anger with which he will look upon them shortly, when the day of his wrath comes. The great healing day now is the sabbath, and the healing place the house of prayer; but the healing power is of Christ. The gospel command is like that recorded here: though our hands are withered, yet, if we will not stretch them out, it is our own fault that we are not healed. But if we are healed, Christ, his power and grace, must have all the glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With anger - With a severe and stern countenance; with indignation at their hypocrisy and hardness of heart. This was not, however, a spiteful or revengeful passion; it was caused by excessive \"grief\" at their state: \"being grieved for the hardness of their hearts.\" It was not hatred of the \"men\" whose hearts were so hard; it was hatred of the sin which they exhibited, joined with the extreme grief that neither his teaching nor the law of God, nor any means which could be used, overcame their confirmed wickedness. Such anger is not unlawful, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". However, in this instance, our Lord has taught us that anger is never lawful except when it is tempered with grief or compassion for those who have offended.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hardness of their hearts - The heart, figuratively the seat of feeling or affection, is said to be tender when it is easily affected by the sufferings of others - by our own sin and danger - by the love and commands of God; when we are easily made to feel on the great subjects pertaining to our interest, Ezekiel 11:19-20. It is hard when nothing moves it; when a man is alike insensible to the sufferings of others, to the dangers of his own condition, and to the commands, the love, and the threatenings of God. It is most tender in youth, or when we have committed fewest crimes. It is made hard by indulgence in sin, by long resisting the offers of salvation, or by opposing any great and affecting appeals which God may make to us by his Spirit or providence, by affliction, or by a revival of religion. Hence, it is that the most favorable period for securing an interest in Christ, or for becoming a Christian, is in youth the first, the tenderest, and the best days of life. Nay, in the days of childhood, in the Sabbath-school, God may be found, and the soul prepared to die. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hardness of their hearts - The heart, figuratively the seat of feeling or affection, is said to be tender when it is easily affected by the sufferings of others - by our own sin and danger - by the love and commands of God; when we are easily made to feel on the great subjects pertaining to our interest, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:19-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is hard when nothing moves it; when a man is alike insensible to the sufferings of others, to the dangers of his own condition, and to the commands, the love, and the threatenings of God. It is most tender in youth, or when we have committed fewest crimes. It is made hard by indulgence in sin, by long resisting the offers of salvation, or by opposing any great and affecting appeals which God may make to us by his Spirit or providence, by affliction, or by a revival of religion. Hence, it is that the most favorable period for securing an interest in Christ, or for becoming a Christian, is in youth the first, the tenderest, and the best days of life. Nay, in the days of childhood, in the Sabbath-school, God may be found, and the soul prepared to die. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 3",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mr 3:1-12. The Healing of a Withered Hand on the Sabbath Day, and Retirement of Jesus to Avoid Danger. ( = Mt 12:9-21; Lu 6:6-11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on [1411]Mt 12:9-21.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 5. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 3:1\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he had looked round about on them,.... In the several parts of the synagogue; for there were many of them on every side of him; which he might do, to observe their countenances, which might justly fall, upon such a close question put to them, and what answer they would return to him: and his look upon them was ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with anger, with a stern countenance, which showed indignation at them, though without sin, or any desire of revenge, for the evil they were meditating against him; for at the same time he had pity and compassion for them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "being grieved for the hardness of their hearts: or \"the blindness of their hearts\", as the Vulgate Latin, Arabic, and Ethiopic versions render it; being troubled in his human soul, both at their inhumanity and cruelty to a miserable object, whose cure, in their opinion, would have been a breach of the sabbath; and to himself, having a malicious design against him, should he perform it; and at their stupidity and ignorance of the law of God, the nature and design of the sabbath, and of their duty to God, and their fellow creatures: wherefore as one not to be intimidated by their evil designs against him, or prevented thereby from doing good, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he saith unto the man, stretch forth thine hand; that is, the lame one; and such power went along with his words, as at once effected a cure: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he stretched it out, and his hand was restored whole as the other. This last clause, \"whole as the other\", is not in the Vulgate Latin, nor in the Syriac, Arabic, Persic, and Ethiopic versions; and may be added from Matthew 12:13; see the note there; since it is wanting in the Alexandrian copy, and in Beza's most ancient copy, and in others. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he stretched it out, and his hand was restored whole as the other. This last clause, \"whole as the other\", is not in the Vulgate Latin, nor in the Syriac, Arabic, Persic, and Ethiopic versions; and may be added from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see the note there; since it is wanting in the Alexandrian copy, and in Beza's most ancient copy, and in others. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when he had looked round about on them {c} with anger, being grieved for the {d} hardness of their hearts, he saith unto the man, Stretch forth thine hand. And he stretched it out: and his hand was restored whole as the other.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when he had looked round about on them ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with anger, being grieved for the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hardness of their hearts, he saith unto the man, Stretch forth thine hand. And he stretched ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " out: and his hand was restored whole as the other.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Men are angry when they have wrong done to them, but not without sin: but Christ is angry without sin, and he is not sorry for the injury that is done to him as much as he is for their wickedness; and therefore he had pity upon them, and because of that he is said to have been grieved.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) As though their heart had been closed up and had grown together, so that wholesome doctrine had no effect upon them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "περιβλεψάμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", having made a swift, indignant (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μετʼ ὀργῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") survey of His foes.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συλλυπούμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": this ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "present",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the previous participle aorist, implying habitual pity for men in such a condition of blindness. This is a true touch of Mk.’s in his portraiture of Christ.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς καρδίας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": singular, as if the whole class had but one heart, which was the fact so far as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "type",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of heart (hardened) was concerned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with anger",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not merely did He look upon them, He “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "looked round",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” upon them, surveyed each face with “an all-embracing gaze of grief and anger.” Feelings of “grief” and “anger” are here ascribed to Him, who was “very God and very Man,” just as in another place we read that “He wept” before the raising of Lazarus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and “slept” before He stilled the storm (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 4:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and was an hungred (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and was “exceeding sorrowful even unto death” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word here used occurs nowhere else in the New Testament, and implies “a feeling of compassion for,” even in the midst of anger at, their conduct.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word thus rendered denotes literally (1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the process by which the extremities of fractured bones are re-united by a callus;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " then (2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "callousness, hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St Paul uses the word in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", saying, “I would not have you ignorant, brethren, … ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see margin) in part is happened to Israel;” and again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 4:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Having the understanding darkened … because of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of their heart” (see margin again). The verb, which = “to petrify,” “to harden into stone,” occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whole as the other",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is one of the instances where our Lord may be said to have wrought a miracle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without a word",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the employment of any external means",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It also forms one of seven miracles wrought on the Sabbath-day. The other six were, (1) The demoniac at Capernaum (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (2) Simon’s wife’s mother (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 1:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (3) the impotent man at the pool of Bethesda (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (4) the woman with a spirit of infirmity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (5) the man who had the dropsy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); (6) the man born blind (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Περιβλεψάμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "looking round",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The expressions of Christ’s countenance teach us many lessons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 10:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συλλυπουμένος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "being grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") In the case of the Pharisees, their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grief",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was malignant; Jesus ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grieves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with holy affection, individually for individuals. Along with His just grief was combined just anger; see note ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πώρωσει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The habitual disposition of the heart renders the perception of the truth, and of its conclusions, either difficult or easy.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πωρωσις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which destroys the use of the senses, for instance, the sight and the touch. It is blindness, not to sec; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hardness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not to perceive; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When he had looked round about on them with anger, being",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "grieved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "συλλυπούμενος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - the word has a touch of \"condolence\" in it - at the hardening of their heart. All this is very characteristic of St. Mark, who is careful to notice the visible expression of our Lord's feelings in his looks. The account is evidently from an eye-witness, or from one who had it from an eye-witness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "He looked round about on them with anger.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He was indignant at their blindness of heart, and their unbelief, which led them to attack the miracles of mercy wrought by him on the sabbath day as though they were a violation of the law of the sabbath. We see here how plainly there were in Christ the passions and affections common to the human nature, only restrained and subordinated to reason. Hero is the difference between the anger of fallen man and the anger of the sinless One. With fallen man, auger is the desire of retaliating, of punishing those by whom you consider yourself unjustly treated. Hence, in other men, anger springs from self-love; in Christ it sprang from the love of God. He loved God above all things; hence he was distressed and irritated on account of the wrongs done to God by sins and sinners. So that his anger was a righteous zeal for the honour of God; and hence it was mingled with grief, because, in their blindness and obstinacy, they would not acknowledge him to be the Messiah, but misrepresented his kindnesses wrought on the sick on the sabbath day, and found fault with them as evil. Thus our Lord, by showing grief and sorrow, makes it plain that his anger did not spring from the desire of revenge. He was indeed angry at the sin, while he grieved over and with the sinners, as those whom he loved, and for whose sake he came into the world that he might  redeem and save them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Stretch forth thy hand. And he stretched it forth: and his hand was restored",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words \"whole as the other\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "הללאְ ץה שׁץו שׁםהגִץֻ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are not found in the best uncials. They were probably inserted from St. Matthew. In this instance our Lord performed no outward act. \"He spake, and it was done.\" The Divine power wrought the miracle concurrently with the act of faith on the part of the man in obeying the command. Mark 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Being grieved (συλλυπούμενος)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Why the compound verb, with the preposition σύν, together with? Herodotus (vi., 39) uses the word of condoling with another's misfortune. Plato (\"Republic,\" 4:62) says, \"When any one of the citizens experiences good or evil, the whole state will either rejoice or sorrow with him (ξυλλυπήσεται). The σύν, therefore implies Christ's condolence with the moral misfortune of these hardhearted ones. Compare the force of con, in condolence. Latin, con, with, dolere, to grieve.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hardness (πωρώσει)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From πῶρος, a kind of marble, and thence used of a callus on fractured bones. Πώρωσις is originally the process by which the extremities of fractured bones are united by a callus. Hence of callousness, or hardness in general. The word occurs in two other passages in the New Testament, Romans 11:25; Ephesians 4:18, where the A. V. wrongly renders blindness, following the Vulgate caecitas. It is somewhat strange that it does not adopt that rendering here (Vulgate, caecitate) which is given by both Wyc. and Tynd. The Rev. in all the passages rightly gives hardening, which is better than hardness, because it hints at the process going on. Mark only records Christ's feeling on this occasion. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From πῶρος, a kind of marble, and thence used of a callus on fractured bones. Πώρωσις is originally the process by which the extremities of fractured bones are united by a callus. Hence of callousness, or hardness in general. The word occurs in two other passages in the New Testament, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the A. V. wrongly renders blindness, following the Vulgate caecitas. It is somewhat strange that it does not adopt that rendering here (Vulgate, caecitate) which is given by both Wyc. and Tynd. The Rev. in all the passages rightly gives hardening, which is better than hardness, because it hints at the process going on. Mark only records Christ's feeling on this occasion. ",
            "children": []
          }
        ]
      }
    ]
  }
]