[{"num":14,"verse":"Let not your levavot be troubled [14:27]. You have emunah (faith) in Hashem. Also in me have emunah (faith). [SHEMOT 14:21; TEHILLIM 4:5]"},{"num":2,"verse":"In the Beis Avi there are many me’onot (dwelling places, permanent residences, homes, cf 14:23); if it were not so, would I have told you that I go to prepare a makom (place) for you?"},{"num":3,"verse":"And if I go and prepare a makom for you, I am coming again and will receive you to myself, that where I am, there you may be also."},{"num":4,"verse":"And where I go you have da’as of HaDerech. [TEHILLIM 1:6]"},{"num":5,"verse":"T’oma says to Rebbe, Melech HaMoshiach, Adoni, we do not have da’as of where you are going; how are we able to have da’as of HaDerech?"},{"num":6,"verse":"Rebbe, Melech HaMoshiach says to him, I am HaDerech, HaEmes, and HaChayyim. No one comes to HaAv except through me [1Sm 3:7]."},{"num":7,"verse":"If you have had da’as of me, also you will have had da’as of Avi. And from now on, you have had da’as of Him and have seen Him."},{"num":8,"verse":"Philippos says to him, Adoni, show us [Elohim] HaAv and it is enough for us."},{"num":9,"verse":"Rebbe, Melech HaMoshiach says to Philippos, So long a time with you I am and you have not had da’as of me, Philippos? The one having seen me has seen [Elohim] HaAv [Col. 1:15; YESHAYAH 9:5(6); Prov 30:4] How do you say, Show us HaAv?"},{"num":10,"verse":"Do you not have emunah (faith) that Ani Hu in HaAv and HaAv is in me? The dvarim which I speak to you I do not speak on my own, but HaAv dwelling in me does His pe’ulot."},{"num":11,"verse":"In me have emunah, that Ani Hu in HaAv and HaAv is in me; but if not, have emunah because of the pe’ulot themselves."},{"num":12,"verse":"Omein, omein, I say to you, the one believing in me the pe’ulot which I do he will do, and gedolot than these will he do, because I am going to HaAv."},{"num":13,"verse":"And whatever you ask b’Shem of me I will do, that HaAv may receive kavod in HaBen."},{"num":14,"verse":"If anything you ask me b’Shem of me, I will do it."},{"num":15,"verse":"If you have ahavah for me, you will be shomer mitzvot regarding my commandments. [Ps 103:18]"},{"num":16,"verse":"And I will ask HaAv and another Melitz Yosher [Advocate, Counselor, Helper in Court, 14:26; 15:26; 16:7] He will give you that He may be with you l’Olam,"},{"num":17,"verse":"The Ruach HaEmes, which the Olam Hazeh is not able to receive, because it does not see Him nor have da’as of Him. But you have da’as of Him, because He remains with you and He will be in you."},{"num":18,"verse":"I will not leave you yetomim (orphans). I am coming to you. [MELACHIM ALEF 6:13]"},{"num":19,"verse":"Yet a little time and the Olam Hazeh no longer sees me, but you see me. Because Ani Chai, so you will live also."},{"num":20,"verse":"On Yom Hahu (that day) you will have da’as that I am in HaAv of me and you are in me and I am in you."},{"num":21,"verse":"The one having the mitzvot of me and being shomer mitzvot, that one is the one having ahavah for me. And the one having ahavah for me will receive ahavah from HaAv of me, and I will have ahavah for him and I will manifest myself to him."},{"num":22,"verse":"Yehuda (not the one from K’riot) says to Rebbe, Melech HaMoshiach, Adoni, and what has transpired that to us you are about to manifest yourself and not to the Olam Hazeh?"},{"num":23,"verse":"In reply, Rebbe, Melech HaMoshiach said to him, If anyone has ahavah for me, of my dvar he will be shomer and HaAv of me will have ahavah for him and to him we will come and with him we will make a ma’on [see 14:2, me’onot, pl.] [MISHLE 8:17; YECHEZKEL 37:27]."},{"num":24,"verse":"The one not having ahavah (agape) for me is not shomer regarding the dvarim of me, and the dvar which you hear is not mine but that of HaAv Who sent me. [DEVARIM 18:18]"},{"num":25,"verse":"These things I have told you while abiding with you."},{"num":26,"verse":"But the Melitz Yosher (Praklit, Advocate, Counselor, Helper in Court), the Ruach Hakodesh which HaAv will send b’Shem of me, He will teach you all things and will remind you of all things which I told you."},{"num":27,"verse":"Shalom Hashem I leave with you, my Shalom I give to you, [BAMIDBAR 6:26; TEHILLIM 85:8; MALACHI 2:6] not as the Olam Hazeh gives, I give to you; let not your levavot be troubled [14:1], nor let them be ones of morech lev (cowardliness, Rv 21:8). [CHAGGAI 2:9 TARGUM HASHIVIM]"},{"num":28,"verse":"You heard me say to you, I am going [14:12], and I am coming to you [14:18]. If you were having ahavah for me, you would have simcha, because I go to HaAv, for HaAv is greater than me [Yn 1:1, 14]."},{"num":29,"verse":"And now I have told you before it happens, that when it happens, you may have emunah (faith)."},{"num":30,"verse":"No longer many things I will speak with you, for the Sar HaOlam Hazeh is coming; and in me he has nothing."},{"num":31,"verse":"But in order that HaOlam may have da’as that I have ahavah for HaAv, as HaAv gave me mitzvah, so I do. Arise, let us go from here."}]