[{"header":"Bear One Another’s Burdens"},{"num":6,"verse":"Brothers, if a man is caught in any transgression, you who are spiritual should restore such a one in the spirit of meekness, watching yourselves, lest you also be tempted. "},{"num":2,"verse":"Bear one another’s burdens, and so fulfill the law of Christ. "},{"num":3,"verse":"For if someone thinks himself to be something when he is nothing, he deceives himself. "},{"num":4,"verse":"But let each one examine his own work, and then he will have rejoicing in himself alone, and not in another. "},{"num":5,"verse":"For each one shall bear his own burden. "},{"num":6,"verse":"Let him who is taught in the word share all good things with him who teaches."},{"num":7,"verse":"Be not deceived. God is not mocked. For whatever a man sows, that will he also reap. "},{"num":8,"verse":"For the one who sows to his own flesh will from the flesh reap corruption, but the one who sows to the Spirit will from the Spirit reap eternal life. "},{"num":9,"verse":"And let us not grow weary in doing good, for in due season we shall reap, if we do not give up. "},{"num":10,"verse":"Therefore, as we have opportunity, let us do good to all people, especially to those who are of the household of faith."},{"header":"Final Warning and Benediction"},{"num":11,"verse":"You see what large letters I have written to you with my own hand."},{"num":12,"verse":"It is those who desire to make a good showing in the flesh that try to compel you to be circumcised, only that they may not be persecuted for the cross of Christ. "},{"num":13,"verse":"For they themselves who are circumcised do not keep the law. But they desire to have you circumcised, so that they may boast in your flesh. "},{"num":14,"verse":"God forbid that I should boast, except in the cross of our Lord Jesus Christ, by whom the world is crucified to me, and I to the world. "},{"num":15,"verse":"For in Christ Jesus neither circumcision nor uncircumcision means anything, but a new creation. "},{"num":16,"verse":"Peace and mercy be on all who walk according to this rule and upon the Israel of God."},{"num":17,"verse":"From now on let no one trouble me, for I bear in my body the marks of the Lord Jesus."},{"num":18,"verse":"Brothers, the grace of our Lord Jesus Christ be with your spirit. Amen."}]