[{"header":"Some practical wisdom"},{"num":6,"verse":"Even if a man should be detected in some sin, my brothers, the spiritual ones among you should quietly set him back on the right path, not with any feeling of superiority but being yourselves on guard against temptation."},{"num":2,"verse":"Carry each other’s burdens and so live out the law of Christ. ...."},{"num":3,"verse":"If a man thinks he is “somebody”, he is deceiving himself, for that very thought proves that he is nobody. Let every man learn to assess properly the value of his own work and he can then be glad when he has done something worth doing without dependence on the approval of others."},{"num":5,"verse":"For every man must “shoulder his own pack”."},{"num":6,"verse":"The man under Christian instruction should be willing to contribute towards the livelihood of his teacher."},{"header":"The inevitability of life’s harvest"},{"num":7,"verse":"Don’t be under any illusion: you cannot make a fool of God! A man’s harvest in life will depend entirely on what he sows. If he sows for his own lower nature his harvest will be the decay and death of his own nature. But if he sows for the Spirit he will reap the harvest of everlasting life by that Spirit. Let us not grow tired of doing good, for, unless we throw in our hand, the ultimate harvest is assured. Let us then do good to all men as opportunity offers, especially to those who belong to the Christian household."},{"header":"A final appeal, in my own hand-writing"},{"num":11,"verse":"Look at these huge letters I am making in writing these words to you with my own hand!"},{"num":12,"verse":"These men who are always urging you to be circumcised—what are they after? They want to present a pleasing front to the world and they want to avoid being persecuted for the cross of Christ. For even those who have been circumcised do not themselves keep the Law. But they want you circumcised so that they may be able to boast about your submission to their ruling."},{"num":14,"verse":"Yet God forbid that I should boast about anything or anybody except the cross of our Lord Jesus Christ, which means that the world is a dead thing to me and I am a dead man to the world. But in Christ it is not circumcision or uncircumcision that counts but the power of new birth. To all who live by this principle, to the true Israel of God, may there be peace and mercy!"},{"num":17,"verse":"Let no one interfere with me after this. I carry on my scarred body the marks of my owner, the Lord Jesus."},{"num":18,"verse":"The grace of our Lord Jesus Christ, my brothers, be with your spirit."}]