[{"num":6,"verse":"My spiritual brothers and sisters, if one of our faithful has fallen into a trap and is snared by sin, don’t stand idle and watch his demise. Gently restore him, being careful not to step into your own snare. "},{"num":2,"verse":"Shoulder each other’s burdens, and then you will live as the law of the Anointed teaches us. "},{"num":3,"verse":"Don’t take this opportunity to think you are better than those who slip because you aren’t; then you become the fool and deceive even yourself. "},{"num":4,"verse":"Examine your own works so that if you are proud, it will be because of your own accomplishments and not someone else’s. "},{"num":5,"verse":"Each person has his or her own burden to bear and story to write."},{"num":6,"verse":"Remember to share what you have with your mentor in the Word."},{"num":7,"verse":"Make no mistake: God can’t be mocked. What you give is what you get. What you sow, you harvest. "},{"num":8,"verse":"Those who sow seeds into their flesh will only harvest destruction from their sinful nature. But those who sow seeds into the Spirit shall harvest everlasting life from the Spirit. "},{"num":9,"verse":"May we never tire of doing what is good and right before our Lord because in His season we shall bring in a great harvest if we can just persist. "},{"num":10,"verse":"So seize any opportunity the Lord gives you to do good things and be a blessing to everyone, especially those within our faithful family."},{"num":11,"verse":"Look at how giant these letters are now that I am writing with my own hand!"},{"num":12,"verse":"The troublemakers who are putting pressure on you to be circumcised are trying to impress the flesh. They want to avoid the persecution that comes from preaching the cross of the Anointed One, the Liberating King. "},{"num":13,"verse":"But even those who receive circumcision can’t keep the law—although they think they can—and they hope to influence which way you go with your own skin so they can have bragging rights over your flesh."},{"num":14,"verse":"May I never put anything above the cross of our Lord Jesus the Anointed. Through Him, the world has been crucified to me and I to this world. "},{"num":15,"verse":"Let me be clear: circumcision won’t save you—uncircumcision won’t either for that matter—for both amount to nothing. God’s new creation is what counts, and it counts for everything. "},{"num":16,"verse":"May peace and mercy come to all of you who live by this rule and to the Israel of God."},{"num":17,"verse":"In the future, don’t let anyone cause trouble for me because I bear in my body the marks that wounded Jesus."},{"num":18,"verse":"May the grace of our Lord Jesus, the Anointed One, infuse your spirit with His, brothers and sisters. Amen."}]