[{"header":"Zacchaeus"},{"num":19,"verse":"Jesus was going through Jericho, "},{"num":2,"verse":"where a man named Zacchaeus lived. He was in charge of collecting taxes and was very rich. "},{"num":3,"verse":"Jesus was heading his way, and Zacchaeus wanted to see what he was like. But Zacchaeus was a short man and could not see over the crowd. So he ran ahead and climbed up into a sycamore tree."},{"num":5,"verse":"When Jesus got there, he looked up and said, “Zacchaeus, hurry down! I want to stay with you today.” "},{"num":6,"verse":"Zacchaeus hurried down and gladly welcomed Jesus."},{"num":7,"verse":"Everyone who saw this started grumbling, “This man Zacchaeus is a sinner! And Jesus is going home to eat with him.”"},{"num":8,"verse":"Later that day Zacchaeus stood up and said to the Lord, “I will give half of my property to the poor. And I will now pay back four times as much to everyone I have ever cheated.”"},{"num":9,"verse":"Jesus said to Zacchaeus, “Today you and your family have been saved, because you are a true son of Abraham. "},{"num":10,"verse":"The Son of Man came to look for and to save people who are lost.”"},{"header":"A Story about Ten Servants"},{"num":11,"verse":"The crowd was still listening to Jesus as he was getting close to Jerusalem. Many of them thought that God’s kingdom would soon appear, "},{"num":12,"verse":"and Jesus told them this story:"},{"header":"Jesus Enters Jerusalem"},{"num":28,"verse":"When Jesus had finished saying all this, he went on toward Jerusalem. "},{"num":29,"verse":"As he was getting near Bethphage and Bethany on the Mount of Olives, he sent two of his disciples on ahead. "},{"num":30,"verse":"He told them, “Go into the next village, where you will find a young donkey that has never been ridden. Untie the donkey and bring it here. "},{"num":31,"verse":"If anyone asks why you are doing that, just say, ‘The Lord needs it.’”"},{"num":32,"verse":"They went off and found everything just as Jesus had said. "},{"num":33,"verse":"While they were untying the donkey, its owners asked, “Why are you doing that?”"},{"num":34,"verse":"They answered, “The Lord needs it.”"},{"num":35,"verse":"Then they led the donkey to Jesus. They put some of their clothes on its back and helped Jesus get on. "},{"num":36,"verse":"And as he rode along, the people spread clothes on the road in front of him. "},{"num":37,"verse":"When Jesus was starting down the Mount of Olives, his large crowd of disciples were happy and praised God because of all the miracles they had seen. "},{"num":38,"verse":"They shouted,"},{"num":39,"verse":"Some Pharisees in the crowd said to Jesus, “Teacher, make your disciples stop shouting!”"},{"num":40,"verse":"But Jesus answered, “If they keep quiet, these stones will start shouting.”"},{"num":41,"verse":"When Jesus came closer and could see Jerusalem, he cried "},{"num":42,"verse":"and said:"},{"header":"Jesus in the Temple"},{"num":45,"verse":"When Jesus entered the temple, he started chasing out the people who were selling things. "},{"num":46,"verse":"He told them, “The Scriptures say, ‘My house should be a place of worship.’ But you have made it a place where robbers hide!”"},{"num":47,"verse":"Each day, Jesus kept on teaching in the temple. So the chief priests, the teachers of the Law of Moses, and some other important people tried to have him killed. "},{"num":48,"verse":"But they could not find a way to do it, because everyone else was eager to listen to him."}]