[{"header":"Zacchaeus"},{"num":19,"verse":"Jesus entered Jericho and was passing through. "},{"num":2,"verse":"A man named Zacchaeus was there. He was a chief tax collector, and he was rich. "},{"num":3,"verse":"He was trying to see who Jesus was, but since he was short, he could not see because of the crowd. "},{"num":4,"verse":"He ran on ahead and climbed up into a sycamore tree to see Jesus, because he was about to pass by that way. "},{"num":5,"verse":"When Jesus came to the place, he looked up and said to him, “Zacchaeus, hurry and come down, for I must stay at your house today.” "},{"num":6,"verse":"He came down quickly and welcomed Jesus joyfully. "},{"num":7,"verse":"When the people saw it, they were all grumbling because he went to be a guest of a sinful man."},{"num":8,"verse":"Zacchaeus stood up and said to the Lord, “Look, Lord, I am going to give half of my possessions to the poor. And if I have cheated anyone out of anything, I will pay back four times as much.”"},{"num":9,"verse":"Jesus said to him, “Today, salvation has come to this house, because he too is a son of Abraham. "},{"num":10,"verse":"For the Son of Man came to seek and to save the lost.”"},{"header":"Parable of the Ten Minas"},{"num":11,"verse":"As they were listening to these things, Jesus went on to tell a parable, because he was near Jerusalem, and the people thought that the kingdom of God was going to appear at once. "},{"num":12,"verse":"So he said, “A man of noble birth traveled to a distant country to receive a kingdom for himself and then to return. "},{"num":13,"verse":"He called ten of his servants and gave them ten minas. ‘Conduct business until I return,’ he said to them."},{"num":14,"verse":"“But his subjects hated him and sent a delegation after him, saying, ‘We do not want this man to be king over us.’"},{"num":15,"verse":"“When he returned after receiving the kingdom, he summoned the servants to whom he had given the money. He wanted to find out what they had gained by conducting business."},{"num":16,"verse":"“The first one came to him and said, ‘Master, your mina has earned ten more minas.’"},{"num":17,"verse":"“He said to him, ‘Well done, good servant! Because you were faithful in a very small matter, you will have authority over ten cities.’"},{"num":18,"verse":"“The second one came and said, ‘Master, your mina has produced five more minas.’"},{"num":19,"verse":"“So he said to him, ‘You will be over five cities.’"},{"num":20,"verse":"“And another one came and said, ‘Master, here is your mina that I laid away in a piece of cloth. "},{"num":21,"verse":"For I was afraid of you, since you are a demanding man. You take what you did not deposit and reap what you did not sow.’"},{"num":22,"verse":"“He said to him, ‘You wicked servant, I will judge you with your own words! You knew that I am a demanding man, taking what I did not deposit and reaping what I did not sow. "},{"num":23,"verse":"Then why did you not put my money in the bank? Then, when I returned, I could have collected it with interest!’"},{"num":24,"verse":"“He said to those standing there, ‘Take the mina away from him and give it to the one who has the ten minas.’"},{"num":25,"verse":"“But they said to him, ‘Master, he already has ten minas!’"},{"num":26,"verse":"“‘I tell you that to everyone who has, more will be given, but from the one who does not have, even what he has will be taken away. "},{"num":27,"verse":"Now as for those enemies of mine who did not want me to be king over them, bring them here and kill them in front of me.’”"},{"header":"Jesus’ Triumphal Entry Into Jerusalem"},{"num":28,"verse":"After Jesus had said these things, he went on ahead, going up to Jerusalem. "},{"num":29,"verse":"As he came near to Bethphage and Bethany, at the place called the Mount of Olives, he sent two of his disciples ahead, "},{"num":30,"verse":"saying, “Go to the village ahead of you. When you enter it, you will find a colt tied, on which no one has ever sat. Untie it and bring it here. "},{"num":31,"verse":"And if anyone asks you, ‘Why are you untying it?’ you will say this: ‘The Lord needs it.’”"},{"num":32,"verse":"Those who were sent ahead went and found things just as he had told them. "},{"num":33,"verse":"As they were untying the colt, its owners said to them, “Why are you untying the colt?”"},{"num":34,"verse":"They said, “The Lord needs it.”"},{"num":35,"verse":"Then they brought the colt to Jesus. They threw their robes on the colt and set Jesus on it. "},{"num":36,"verse":"As he went along, people spread their robes on the road. "},{"num":37,"verse":"As he was approaching the slope of the Mount of Olives, the whole crowd of disciples began to praise God joyfully, with a loud voice, for all the miracles they had seen, "},{"num":38,"verse":"saying, “Blessed is the King who comes in the name of the Lord! Peace in heaven and glory in the highest!”"},{"num":39,"verse":"Some of the Pharisees from the crowd said to him, “Teacher, rebuke your disciples!”"},{"num":40,"verse":"He replied, “I tell you, if these people would be silent, the stones would cry out.”"},{"num":41,"verse":"As he came near, he saw the city and wept over it. "},{"num":42,"verse":"He said, “If you, yes you, had only known on this day the things that would bring peace to you. But now, it is hidden from your eyes. "},{"num":43,"verse":"In fact, the days will come upon you when your enemies will build an embankment against you, surround you, and hem you in on every side. "},{"num":44,"verse":"Within your walls, they will dash you and your children to the ground. And within your walls, they will not leave one stone on top of another, because you did not recognize the time when God came to help you.”"},{"header":"Jesus Cleanses His Father’s House"},{"num":45,"verse":"Jesus entered the temple courts and began to drive out those who were selling things there. "},{"num":46,"verse":"He told them, “It is written, ‘My house will be a house of prayer,’ but you have made it a ‘den of robbers’!”"},{"num":47,"verse":"Every day he was teaching in the temple courts, but the chief priests, the experts in the law, and the leaders of the people continued to look for a way to put him to death. "},{"num":48,"verse":"They could not find any way to do it, because all the people were clinging to him and listening."}]