[{"header":"Jesus and Zacchaeus"},{"num":19,"verse":"Jesus went on into Jericho and was passing through. "},{"num":2,"verse":"There was a chief tax collector there named Zacchaeus, who was rich. "},{"num":3,"verse":"He was trying to see who Jesus was, but he was a little man and could not see Jesus because of the crowd. "},{"num":4,"verse":"So he ran ahead of the crowd and climbed a sycamore tree to see Jesus, who was going to pass that way. "},{"num":5,"verse":"When Jesus came to that place, he looked up and said to Zacchaeus, “Hurry down, Zacchaeus, because I must stay in your house today.”"},{"num":6,"verse":"Zacchaeus hurried down and welcomed him with great joy. "},{"num":7,"verse":"All the people who saw it started grumbling, “This man has gone as a guest to the home of a sinner!”"},{"num":8,"verse":"Zacchaeus stood up and said to the Lord, “Listen, sir! I will give half my belongings to the poor, and if I have cheated anyone, I will pay back four times as much.”"},{"num":9,"verse":"Jesus said to him, “Salvation has come to this house today, for this man, also, is a descendant of Abraham. "},{"num":10,"verse":"The Son of Man came to seek and to save the lost.”"},{"header":"The Parable of the Gold Coins(B)"},{"num":11,"verse":"While the people were listening to this, Jesus continued and told them a parable. He was now almost at Jerusalem, and they supposed that the Kingdom of God was just about to appear. "},{"num":12,"verse":"So he said, “There was once a man of high rank who was going to a country far away to be made king, after which he planned to come back home. "},{"num":13,"verse":"Before he left, he called his ten servants and gave them each a gold coin and told them, ‘See what you can earn with this while I am gone.’ "},{"num":14,"verse":"Now, his own people hated him, and so they sent messengers after him to say, ‘We don't want this man to be our king.’"},{"num":15,"verse":"“The man was made king and came back. At once he ordered his servants to appear before him, in order to find out how much they had earned. "},{"num":16,"verse":"The first one came and said, ‘Sir, I have earned ten gold coins with the one you gave me.’ "},{"num":17,"verse":"‘Well done,’ he said; ‘you are a good servant! Since you were faithful in small matters, I will put you in charge of ten cities.’ "},{"num":18,"verse":"The second servant came and said, ‘Sir, I have earned five gold coins with the one you gave me.’ "},{"num":19,"verse":"To this one he said, ‘You will be in charge of five cities.’ "},{"num":20,"verse":"Another servant came and said, ‘Sir, here is your gold coin; I kept it hidden in a handkerchief. "},{"num":21,"verse":"I was afraid of you, because you are a hard man. You take what is not yours and reap what you did not plant.’ "},{"num":22,"verse":"He said to him, ‘You bad servant! I will use your own words to condemn you! You know that I am a hard man, taking what is not mine and reaping what I have not planted. "},{"num":23,"verse":"Well, then, why didn't you put my money in the bank? Then I would have received it back with interest when I returned.’ "},{"num":24,"verse":"Then he said to those who were standing there, ‘Take the gold coin away from him and give it to the servant who has ten coins.’ "},{"num":25,"verse":"But they said to him, ‘Sir, he already has ten coins!’ "},{"num":26,"verse":"‘I tell you,’ he replied, ‘that to those who have something, even more will be given; but those who have nothing, even the little that they have will be taken away from them. "},{"num":27,"verse":"Now, as for those enemies of mine who did not want me to be their king, bring them here and kill them in my presence!’”"},{"header":"The Triumphant Approach to Jerusalem(E)"},{"num":28,"verse":"After Jesus said this, he went on in front of them toward Jerusalem. "},{"num":29,"verse":"As he came near Bethphage and Bethany at the Mount of Olives, he sent two disciples ahead "},{"num":30,"verse":"with these instructions: “Go to the village there ahead of you; as you go in, you will find a colt tied up that has never been ridden. Untie it and bring it here. "},{"num":31,"verse":"If someone asks you why you are untying it, tell him that the Master needs it.”"},{"num":32,"verse":"They went on their way and found everything just as Jesus had told them. "},{"num":33,"verse":"As they were untying the colt, its owners said to them, “Why are you untying it?”"},{"num":34,"verse":"“The Master needs it,” they answered, "},{"num":35,"verse":"and they took the colt to Jesus. Then they threw their cloaks over the animal and helped Jesus get on. "},{"num":36,"verse":"As he rode on, people spread their cloaks on the road."},{"num":37,"verse":"When he came near Jerusalem, at the place where the road went down the Mount of Olives, the large crowd of his disciples began to thank God and praise him in loud voices for all the great things that they had seen: "},{"num":38,"verse":"“God bless the king who comes in the name of the Lord! Peace in heaven and glory to God!”"},{"num":39,"verse":"Then some of the Pharisees in the crowd spoke to Jesus. “Teacher,” they said, “command your disciples to be quiet!”"},{"num":40,"verse":"Jesus answered, “I tell you that if they keep quiet, the stones themselves will start shouting.”"},{"header":"Jesus Weeps over Jerusalem"},{"num":41,"verse":"He came closer to the city, and when he saw it, he wept over it, "},{"num":42,"verse":"saying, “If you only knew today what is needed for peace! But now you cannot see it! "},{"num":43,"verse":"The time will come when your enemies will surround you with barricades, blockade you, and close in on you from every side. "},{"num":44,"verse":"They will completely destroy you and the people within your walls; not a single stone will they leave in its place, because you did not recognize the time when God came to save you!”"},{"header":"Jesus Goes to the Temple(G)"},{"num":45,"verse":"Then Jesus went into the Temple and began to drive out the merchants, "},{"num":46,"verse":"saying to them, “It is written in the Scriptures that God said, ‘My Temple will be a house of prayer.’ But you have turned it into a hideout for thieves!”"},{"num":47,"verse":"Every day Jesus taught in the Temple. The chief priests, the teachers of the Law, and the leaders of the people wanted to kill him, "},{"num":48,"verse":"but they could not find a way to do it, because all the people kept listening to him, not wanting to miss a single word."}]