[{"header":"The chief tax-collector is converted to faith in Jesus"},{"num":1,"verse":"Then he went into Jericho and was making his way through it. And here we find a wealthy man called Zacchaeus, a chief collector of taxes, wanting to see what sort of person Jesus was. But the crowd prevented him from doing so, for he was very short. So he ran ahead and climbed up into a sycamore tree to get a view of Jesus as he was heading that way. When Jesus reached the spot, he looked up and saw the man and said, “Zacchaeus, hurry up and come down. I must be your guest today.”"},{"num":6,"verse":"So Zacchaeus hurriedly climbed down and gladly welcomed him. But the bystanders muttered their disapproval, saying, “Now he has gone to stay with a real sinner.”"},{"num":8,"verse":"But Zacchaeus himself stopped and said to the Lord, “Look, sir, I will give half my property to the poor. And if I have swindled anybody out of anything I will pay him back four times as much,”"},{"num":9,"verse":"Jesus said to him, “Salvation has come to this house today! Zacchaeus is a descendant of Abraham, and it was the lost the Son of Man came to seek—and to save.”"},{"header":"Life requires courage, and is hard on those who dare not use their gifts"},{"num":11,"verse":"Then as the crowd still listened attentively, Jesus went on to give them this parable, For the fact that he was nearing Jerusalem made them imagine that the kingdom of God was on the point of appearing."},{"num":12,"verse":"“Once upon a time a man of good family went abroad to accept a kingdom and then return. He summoned ten of his servants and gave them each ten pounds, with the words, ‘Use this money to trade with until I come back.’ But the citizens detested him and they sent a delegation after him, to say, ‘We will not have this man to be our king.’ Then later, when he had received his kingdom, he returned and gave orders for the servants to whom he had given the money to be called to him, so that he could find out what profit they had made. The first came into his presence, and said, ‘Sire, your ten pounds have made a hundred pounds more.’ ‘Splendid, my good fellow,’ he said, ‘since you have proved trustworthy over this small amount, I am going to put you in charge of ten towns.’ The second came in and said, ‘Sire, your ten pounds have made fifty pounds.’ and he said to him, ‘Good, you’re appointed governor of five towns.’ When the last came, he said, ‘Sire, here are your ten pounds, which I have been keeping wrapped up in a handkerchief. I have been scared—I know you’re a hard man, getting something for nothing and reaping where you never sowed.’ To which he replied, ‘You scoundrel, your own words condemn you! You knew perfectly well, did you, that I am a hard man who gets something for nothing and reaps where he never sowed? Then why didn’t you put my money into the bank, and then when I returned I could have had it back with interest?’ Then he said to those who were standing by, ‘Take away his ten pounds and give it to the fellow who has a hundred.’"},{"num":25,"verse":"“‘But, sire, he has a hundred pounds already,’ they said to him. ‘Yes,’ he replied, ‘and I tell you that the man who has something will get more given to him. But as for the man who has nothing, even his “nothing” will be taken away. And as for these enemies of mine who objected to my being their king, bring them here and execute them in my presence.’”"},{"num":28,"verse":"After these words, Jesus walked on ahead of them on his way to Jerusalem."},{"header":"Jesus arranges his own entrance into Jerusalem"},{"num":29,"verse":"Then as he was approaching Bethphage and Bethany, near the hill called the Mount of Olives, he sent off two of his disciples, telling them, “Go into the village just ahead of you, and there you will find a colt tied, on which no one has ever yet ridden. Untie it and bring it here. And if anybody asks you, ‘Why are you untying it?’ just say, ‘the Lord needs it.’”"},{"num":32,"verse":"So the messengers went off and found things just as he had told them. In fact, as they were untying the colt, the owners did say, “Why are you untying it?” and they replied, “The Lord needs it.” So they brought it to Jesus and, throwing their cloaks upon it, mounted Jesus on its back. Then as he rode along, people spread out their coats on the roadway. And as he approached the city, where the road slopes down from the Mount of Olives, the whole crowd of his disciples shouted praises to God for all the marvellous things that they had seen him do. “‘Blessed is the king who comes in the name of the Lord!’” they cried. “There is peace in Heaven and glory on high!”"},{"num":39,"verse":"There were some Pharisees in the crowd who said to Jesus, “Master, restrain your disciples!”"},{"num":40,"verse":"To which he replied, “I tell you that if they kept quiet, the very stones in the road would burst out cheering!”"},{"header":"The sight of the city moves him to tears"},{"num":41,"verse":"And as he came still nearer to the city, he caught sight of it and wept over it, saying, “Ah, if you only knew, even at this eleventh hour, on what your peace depends—but you cannot see it. The time is coming when your enemies will encircle you with ramparts, surrounding you and hemming you in on every side. And they will hurl you and all your children to the ground—yes, they will not leave you one stone standing upon another—all because you did not know when God Himself was visiting you!”"},{"num":45,"verse":"Then he went into the Temple, and proceeded to throw out the traders there."},{"num":46,"verse":"“It is written,” he told them,  “‘My house is a house of prayer’, but you have turned it into a ‘den of thieves!’”"},{"header":"Jesus teaches daily in the Temple"},{"num":47,"verse":"Then day after day he was teaching inside the Temple. The chief priests, the scribes and the national leaders were all the time trying to get rid of him, but they could not find any way to do it since all the people hung upon his words."}]