[{"header":"Chapter 27"},{"num":1,"verse":"The Altar for Burnt Offerings. You shall make an altar of acacia wood, on a square, five cubits long and five cubits wide; it shall be three cubits high. "},{"num":2,"verse":"At the four corners make horns that are of one piece with the altar. You shall then plate it with bronze. "},{"num":3,"verse":"Make pots for removing the ashes, as well as shovels, basins, forks, and fire pans; all these utensils you shall make of bronze. "},{"num":4,"verse":"Make for it a grating, a bronze network; make four bronze rings for it, one at each of its four corners. "},{"num":5,"verse":"Put it down around the altar, on the ground. This network is to be half as high as the altar. "},{"num":6,"verse":"You shall also make poles of acacia wood for the altar, and plate them with bronze. "},{"num":7,"verse":"These poles are to be put through the rings, so that they are on either side of the altar when it is carried. "},{"num":8,"verse":"Make the altar itself in the form of a hollow box. Just as it was shown you on the mountain, so it is to be made."},{"num":9,"verse":"Court of the Tabernacle. You shall also make a court for the tabernacle. On the south side the court shall have hangings, of fine linen twined, a hundred cubits long, "},{"num":10,"verse":"with twenty columns and twenty pedestals of bronze; the hooks and bands on the columns shall be of silver. "},{"num":11,"verse":"On the north side there shall be similar hangings, a hundred cubits long, with twenty columns and twenty pedestals of bronze; the hooks and bands on the columns shall be of silver. "},{"num":12,"verse":"On the west side, across the width of the court, there shall be hangings, fifty cubits long, with ten columns and ten pedestals. "},{"num":13,"verse":"The width of the court on the east side shall be fifty cubits. "},{"num":14,"verse":"On one side there shall be hangings to the extent of fifteen cubits, with three columns and three pedestals; "},{"num":15,"verse":"on the other side there shall be hangings to the extent of fifteen cubits, with three columns and three pedestals."},{"num":16,"verse":"At the gate of the court there shall be a variegated curtain, twenty cubits long, woven of violet, purple, and scarlet yarn and of fine linen twined. It shall have four columns and four pedestals."},{"num":17,"verse":"All the columns around the court shall have bands and hooks of silver, and pedestals of bronze. "},{"num":18,"verse":"The court is to be one hundred cubits long, fifty cubits wide, and five cubits high. Fine linen twined must be used, and the pedestals must be of bronze. "},{"num":19,"verse":"All the fittings of the tabernacle, whatever be their use, as well as all its tent pegs and all the tent pegs of the court, must be of bronze."},{"num":20,"verse":"Oil for the Lamps. You shall command the Israelites to bring you clear oil of crushed olives, to be used for the light, so that you may keep lamps burning always. "},{"num":21,"verse":"From evening to morning Aaron and his sons shall maintain them before the Lord in the tent of meeting, outside the veil which hangs in front of the covenant. This shall be a perpetual statute for the Israelites throughout their generations."}]