[{"header":"The Altar"},{"num":27,"verse":"“Make the altar of acacia wood. It will be as long and as wide as three steps, and as tall as a man’s chest. "},{"num":2,"verse":"Make horns for it on its four corners. They will be of one piece and covered with brass. "},{"num":3,"verse":"Make its pails for taking away its ashes, its tools for picking up the ashes, its pots, meat-hooks and fire-holders. Make all of these out of brass. "},{"num":4,"verse":"Make a net for it out of brass, with four rings of brass at its four corners. "},{"num":5,"verse":"Put it under the altar so that the net comes up to the center of the altar. "},{"num":6,"verse":"Make long, straight pieces of acacia wood for the altar. And cover them with brass. "},{"num":7,"verse":"Put the long pieces of wood through the rings on each side of the altar when it is carried. "},{"num":8,"verse":"Make the altar with pieces of wood so it is empty inside. Make it as it was shown to you on the mountain."},{"header":"The Open Spaces"},{"num":9,"verse":"“Make the open space of the meeting tent. On the south side there will be curtains for the open space. Make them of fine linen, as long as fifty long steps. "},{"num":10,"verse":"They will hang from twenty pillars which are put on twenty bases of brass. The hooks of the pillars and their rings will be made of silver. "},{"num":11,"verse":"Do the same for the north side. There will be curtains as long as fifty long steps, and twenty pillars with twenty bases of brass. The hooks of the pillars and their rings will be made of silver. "},{"num":12,"verse":"On the west side of the open space there will be curtains as long as twenty-five long steps. They will have ten pillars with ten bases. "},{"num":13,"verse":"And the east side of the open space will be as wide as twenty-five long steps."},{"num":14,"verse":"“The curtains for one side of the gate will be as long as seven steps. They will have three pillars with three bases. "},{"num":15,"verse":"On the other side there will be curtains as long as seven steps, with three pillars and three bases. "},{"num":16,"verse":"Have an able workman make a curtain out of fine linen for the gate of the open space. It will be blue, purple and red, and as long as ten long steps. It will have four pillars with four bases. "},{"num":17,"verse":"All the pillars around the open space will have silver hooks, silver rings, and their bases of brass. "},{"num":18,"verse":"The open space will be as long as fifty long steps, as wide as twenty-five long steps, and as high as a man raises his hand. It will have curtains of fine linen and the bases will be brass. "},{"num":19,"verse":"All the tools used in the meeting tent, all its nails, and all the nails for the open space will be made of brass."},{"header":"Care of the Lamp-Stand"},{"num":20,"verse":"“Tell the people of Israel to bring you clear oil of beaten olives for the light, so a lamp may burn all the time. "},{"num":21,"verse":"In the meeting tent, outside the curtain which is in front of the Law, Aaron and his sons will take care of it from evening until morning before the Lord. It will be a law forever for the people of Israel."}]