[{"num":2,"verse":"You sy,  then oun,  my egō child teknon,  be  strengthened endynamoō by en the ho grace charis that ho is  in en Christ Christos Jesus Iēsous, "},{"num":2,"verse":"and kai what hos you  have  heard akouō from para me egō in dia the  presence  of  many polys witnesses martys,  entrust paratithēmi these  things houtos to  faithful pistos men anthrōpos,  who hostis will eimi also kai be eimi able hikanos to  teach didaskō others heteros. "},{"num":3,"verse":"Share  in  suffering synkakopatheō as hōs a  good kalos soldier stratiōtēs of  Christ Christos Jesus Iēsous. "},{"num":4,"verse":"No  one oudeis serving in the military  gets  entangled emplekō in  the ho affairs pragmateia of ho daily  life bios so  that hina he  pleases areskō the ho one  who  enlisted stratologeō him. "},{"num":5,"verse":"Likewise kai,  if ean · de anyone tis competes  as  an  athlete athleō,  he  does  not ou receive  a  wreath stephanoō unless ean mē he  competes athleō lawfully nomimōs. "},{"num":6,"verse":"The ho hardworking kopiaō farmer geōrgos must dei be  the  first prōton to  receive metalambanō the ho fruit karpos. "},{"num":7,"verse":"Reflect  on noeō what hos I  am  saying legō,  for gar the ho Lord kyrios will  give didōmi you sy insight synesis in en all pas this. "},{"num":8,"verse":"Remember mnēmoneuō Jesus Iēsous Christ Christos,  risen egeirō from ek the  dead nekros,  from ek the  seed sperma of  David Dauid,  in  accordance  with kata · ho my egō gospel euangelion, "},{"num":9,"verse":"because  of en which hos I  am  suffering kakopatheō evil  even mechri to  the  point  of  imprisonment desmos as hōs a  serious  criminal kakourgos,  but alla the ho word logos of ho God theos is  not ou bound deō. "},{"num":10,"verse":"On  account  of dia this houtos I  am  enduring hypomenō all  things pas for  the  sake  of dia the ho elect eklektos,  that hina they autos also kai may  experience tynchanō the  salvation sōtēria that ho is  in en Christ Christos Jesus Iēsous with meta eternal aiōnios glory doxa. "},{"num":11,"verse":"Trustworthy pistos is  the ho saying logos,  for gar: “ If ei we  died  together synapothnēskō,  we  will  also kai live  together syzaō. "},{"num":12,"verse":"If ei we  endure hypomenō,  we  will  also kai reign  together symbasileuō.  If ei we  will  deny arneomai Christ,  he kakeinos will  also  deny arneomai us hēmeis. "},{"num":13,"verse":"If ei we  are  faithless apisteō,  he ekeinos remains menō faithful pistos,  for gar he  is dynamai not ou able dynamai to  deny arneomai himself heautou.” "},{"num":14,"verse":"Remind hypomimnēskō them of  these  things houtos,  solemnly  charging diamartyromai them  before enōpion · ho God theos not mē to  continue  fighting logomacheō about  words , which  results  in epi nothing oudeis beneficial chrēsimos but only  in epi the  ruin katastrophē of  those ho listening akouō. "},{"num":15,"verse":"Be  diligent spoudazō to  present paristēmi yourself seautou before ho God theos as  one  tried  and  true dokimos, an  unashamed anepaischuntos worker ergatēs,  correctly  handling orthotomeō the ho word logos of ho truth alētheia. "},{"num":16,"verse":"But de shun periistēmi the ho unholy bebēlos chatter kenophōnia,  for gar they  will  advance prokoptō into epi greater polys ungodliness asebeia"},{"num":17,"verse":"and kai · ho their autos talk logos will  spread nomē like hōs gangrene gangraina,  among  whom hos are eimi Hymenaeus Hymenaios and kai Philetus Philētos, "},{"num":18,"verse":"who hostis have  swerved astocheō from peri the ho truth alētheia,  saying legō the ho resurrection anastasis has  already ēdē occurred ginomai,  and kai they  are  upsetting anatrepō the ho faith pistis of  some tis. "},{"num":19,"verse":"Nevertheless mentoi,  the ho firm stereos foundation themelios of ho God theos stands  firm histēmi,  having echō · ho this houtos seal sphragis, “The  Lord kyrios knew ginōskō those ho who  were eimi his autos,”  and kai, “ Let  everyone pas naming onomazō the ho name onoma of kyrios the  Lord kyrios depart aphistēmi from apo unrighteousness adikia.”  · ho"},{"num":20,"verse":"And de in en a  large megas house oikia there  are eimi not ou only monon vessels skeuos of  gold chrysous and kai silver argyrous but alla also kai of  wood xylinos and kai clay ostrakinos,  that  is kai,  some hos for eis honor timē and de others hos for eis dishonor atimia. "},{"num":21,"verse":"If ean,  therefore oun,  someone tis cleanses ekkathairō himself heautou from apo these  things houtos, that person  will  be eimi a  vessel skeuos for eis honor timē,  having  been  sanctified hagiazō,  useful euchrēstos to  the ho master despotēs,  prepared hetoimazō for eis every pas good ergon work agathos. "},{"num":22,"verse":"· ho So de flee pheugō youthful neōterikos passions epithumia and de pursue diōkō righteousness dikaiosynē,  faith pistis,  love agapē,  peace eirēnē,  with meta those ho who  call  upon epikaleō the ho Lord kyrios out  of ek a  clean katharos heart kardia. "},{"num":23,"verse":"But de avoid paraiteomai the ho foolish mōros and kai uneducated apaideutos speculations zētēsis,  knowing oida that hoti they  breed gennaō quarrels machē. "},{"num":24,"verse":"But de it  is  necessary dei that a servant  of  the  Lord kyrios not ou be  quarrelsome machomai but alla be eimi gentle ēpios to pros all pas,  skilled  in  teaching didaktikos,  patient anexikakos even  in  the  midst  of  evil , "},{"num":25,"verse":"in en meekness prautēs instructing paideuō those ho who  oppose antidiatithēmi you,  if  perhaps mēpote God theos might  grant didōmi them autos · ho repentance metanoia leading  to eis a  knowledge epignōsis of  the  truth alētheia, "},{"num":26,"verse":"and kai they  might  return ananēphō to  soberness  out  of ek the ho snare pagis of  the ho devil diabolos ( having  been  captured  alive zōgreō by hypo him autos)  in  order  to eis do  · ho his ekeinos will thelēma. "}]