[{"header":"Conditions of Service"},{"num":2,"verse":"So, then, my child: you must be strong in the grace which is in King Jesus. "},{"num":2,"verse":"You heard the teaching I gave in public; pass it on to faithful people who will be capable of instructing others as well. "},{"num":3,"verse":"Take your share of suffering as one of King Jesus’ good soldiers. "},{"num":4,"verse":"No one who serves in the army gets embroiled in civilian activities, since they want to please the officer who enlisted them. "},{"num":5,"verse":"If you take part in athletic events, you don’t win the crown unless you compete according to the rules. "},{"num":6,"verse":"The farmer who does the work deserves the first share of the crops. "},{"num":7,"verse":"Think about what I say; the Lord will give you understanding in everything."},{"header":"God’s Word Is Not Tied Up"},{"num":8,"verse":"Remember Jesus the King, risen from the dead, from the seed of David, according to my gospel – "},{"num":9,"verse":"for which I suffer like a criminal, even being chained up! But God’s word is not tied up. "},{"num":10,"verse":"That’s why I put up with everything for the sake of God’s chosen ones, so that they too may obtain, with glory that lasts for ever, the salvation which is in King Jesus. "},{"num":11,"verse":"You can rely on this saying:"},{"header":"Foolish Words and the Word of Truth"},{"num":14,"verse":"Remind them about these things; and warn them, in God’s presence, not to quarrel about words. This doesn’t do any good; instead, it threatens to ruin people who listen to it. "},{"num":15,"verse":"Do your very best to present yourself before God as one who has passed the test – a workman who has no need to be ashamed, who can carve out a straight path for the word of truth. "},{"num":16,"verse":"Avoid pointless and empty chatter. It will push people further and further towards ungodliness, "},{"num":17,"verse":"and their talk will spread like a cancer. I’m thinking in particular of Hymenaeus and Philetus; "},{"num":18,"verse":"they have turned aside from the truth by saying that the resurrection has already happened. They are upsetting some people’s faith. "},{"num":19,"verse":"But God’s firm foundation stands, and it has this as its seal: ‘The Lord knows those who belong to him’, and ‘Everyone who uses the name of the Lord must leave wickedness behind.’"},{"header":"Vessels for God’s Use"},{"num":20,"verse":"In a great house there are vessels not only of gold and silver, but also of wood and pottery. Some of them are given special honour in the way they’re used; others are for menial purposes. "},{"num":21,"verse":"So if people purify themselves from dishonourable things, they will become vessels for honour, made holy, pleasing to the master of the house, fit for every good work."},{"num":22,"verse":"Run away from the passions of youth. Instead, chase after justice, faith, love and peace; you’ll be in the company of all who call on the Lord from a pure heart. "},{"num":23,"verse":"Avoid silly and unprofitable disputes, because you know that they produce fights; "},{"num":24,"verse":"and the Lord’s servant mustn’t be a fighter, but must be gentle to all people, able to teach, able to bear evil without resentment, "},{"num":25,"verse":"able to correct opponents with a meek spirit. It may be that God will give them repentance so that they can arrive at a knowledge of the truth, "},{"num":26,"verse":"and, in coming to their senses, escape the devil’s snare, after having been held captive by him and made to do his will."}]