[{"header":"Above all things be faithful"},{"num":1,"verse":"So, my son, be strong in the grace that Jesus Christ gives. Everything that you have heard me preach in public you should in turn entrust to reliable men, who will be able to pass it on to others."},{"num":3,"verse":"Put up with your share of hardship as a loyal soldier in Christ’s army. Remember: 1) That no soldier on active service gets himself entangled in business, or he will not please his commanding officer. 2) A man who enters an athletic contest wins no prize unless he keeps the rules laid down. 3) Only the man who works on the land has the right to the first share of its produce. Consider these three illustrations of mine and the Lord will help you to understand all that I mean."},{"num":8,"verse":"Remember always, as the centre of everything, Jesus Christ, a man of human ancestry, yet raised by God from the dead according to my Gospel. For preaching this I am having to endure being chained in prison as if I were some sort of a criminal. But they cannot chain the Word of God, and I can endure all these things for the sake of those whom God is calling, so that they too may receive the salvation of Jesus Christ, and its complement of glory after the world of time. I rely on this saying: If we died with him we shall also live with him: if we suffer with him we shall also reign with him. If we deny him he will also deny us: yet if we are faithless he always remains faithful. He cannot deny his own nature."},{"header":"Hold fast to the true: avoid dangerous error"},{"num":14,"verse":"Remind your people of things like this, and tell them as before God not to fight wordy battles, which help no one and may undermine the faith of some who hear them."},{"num":15,"verse":"For yourself, concentrate on winning God’s approval, on being a workman with nothing to be ashamed of, and who knows how to use the word of truth to the best advantage."},{"num":16,"verse":"But steer clear of these unchristian babblings, which in practice lead further and further away from Christian living. False teachings are as dangerous as blood-poisoning to the body, and spread like sepsis from a wound. Hymenaeus and Philetus are responsible for this sort of thing, and they are men who are palpable traitors to the truth, for they say that the resurrection has already occurred and, of course, badly upset some people’s faith."},{"num":19,"verse":"God’s solid foundation still stands, however, with this double inscription: ‘the Lord knows those who belong to him’, and Let every true Christian have no dealing with evil. In any big household there are naturally not only gold and silver vessels but wooden and earthenware ones as well. Some are used for the highest purposes and some for the lowest. If a man keeps himself clean from the contaminations of evil he will be a vessel used for honourable purposes, clean and serviceable for the use of the master of the household, all ready, in fact, for any good purpose."},{"header":"Be positively good—and patient"},{"num":22,"verse":"Turn your back on the turbulent desires of youth and give your positive attention to goodness, faith, love and peace in company with all those who approach God in sincerity. But have nothing to do with silly and ill-informed controversies which lead inevitably, as you know, to strife."},{"num":24,"verse":"And the Lord’s servant must not be a man of strife: he must be kind to all, ready and able to teach: he must have patience and the ability gently to correct those who oppose his message. He must always bear in mind the possibility that God will give them a different outlook, and that they may come to know the truth. They may come to their senses and be rescued from the power of the devil by the servant of the Lord and set to work for God’s purposes."}]