[{"num":2,"verse":"So, my son Timothy, be strong. Christ Jesus has blessed you so that you can be strong."},{"num":2,"verse":"You and many others heard what I taught. Now you must teach these things to men who can be trusted, men who will be able to teach them to other people also."},{"num":3,"verse":"Be patient in your trouble like a good soldier of Christ Jesus."},{"num":4,"verse":"A soldier who is fighting does not live the way other people do. He wants to please the one who chose him."},{"num":5,"verse":"A man runs a race. But he does not win if he does not obey the rules."},{"num":6,"verse":"A farmer works hard planting. He should be the first one to have the food that grows."},{"num":7,"verse":"Think about what I say and the Lord will help you understand everything."},{"num":8,"verse":"Keep your mind on Jesus Christ. He was raised from death. He was of the family of David. That is the good news I tell people."},{"num":9,"verse":"Because of that, I have trouble. I am even tied with chains like a bad man. But the word of God is not tied up."},{"num":10,"verse":"That is why I bear all my trouble for the sake of God's chosen people. I do it so that they also may be saved by Christ Jesus and be made great for ever."},{"num":11,"verse":"These are true words: If we died with Christ, we shall also live with him."},{"num":12,"verse":"If we bear all our troubles, we shall also rule with him. If we say we do not know him, then he will also say he does not know us."},{"num":13,"verse":"If we do not believe in him, he still is true, because he cannot say he is not what he is."},{"num":14,"verse":"Tell people these things again. Tell them before the Lord not to quarrel in their teaching. There is no good in doing that. It upsets the minds of those who listen to them."},{"num":15,"verse":"Try to show God that you are a good worker. Do nothing you would be ashamed of. Tell the true message in the right way."},{"num":16,"verse":"Have no part in foolish talk that does not come from God. That kind of talk will take people farther and farther away from God."},{"num":17,"verse":"Their teaching will spread like bad sickness. Hymenaeus and Philetus are two like that."},{"num":18,"verse":"These men say that the time when people are raised from death is past already. That is not true. And what they say is making some people stop believing."},{"num":19,"verse":"But the truth of God stands strong. It cannot change. These words are sure: `The Lord knows the people who belong to him' and, `Let all those who use the name of the Lord stop their wrong ways.'"},{"num":20,"verse":"In a large house there are many pots. They are not all made of gold and silver. Some are made of wood, and some of earth. Some are used for fine things and some are used for things that are not so fine."},{"num":21,"verse":"So if a person keeps himself clean from these things, he will be like a dish that is used for a fine work. It is kept as a better dish for the head man of the house, and it is ready for any good thing he wants to use it for."},{"num":22,"verse":"Have no part at all in the wrong things that young men like to do. Believe. Have love. Follow what is right. Live at peace. Do these things along with others who have a clean heart and talk to God."},{"num":23,"verse":"Keep out of foolish quarrels. You know that they start fights."},{"num":24,"verse":"The Lord's servant must not fight. But he must be kind to all people. He must be a good teacher to them. He must be patient with them."},{"num":25,"verse":"When he corrects those who are against him, he must do it in a gentle way. It may be that God will turn their hearts to know what is true."},{"num":26,"verse":"And they may get free again from the devil's trap. He has caught them to do what he wants them to do."}]