[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They could not cure him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This, then, would seem to have been the subject-matter of debate. The scribes were taunting the disciples, who had probably trusted to their use of the wonted formula of their Master’s name, and were now wrangling in their own defence. Neither scribes nor disciples had thought of gaining the spiritual power which might avail by the means which they both recognised as effective.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:14-21 The case of afflicted children should be presented to God by faithful and fervent prayer. Christ cured the child. Though the people were perverse, and Christ was provoked, yet care was taken of the child. When all other helps and succours fail, we are welcome to Christ, may trust in him, and in his power and goodness. See here an emblem of Christ's undertaking as our Redeemer. It encourages parents to bring children to Christ, whose souls are under Satan's power; he is able to heal them, and as willing as he is able. Not only bring them to Christ by prayer, but bring them to the word of Christ; to means by which Satan's strong-holds in the soul are beaten down. It is good for us to distrust ourselves and our own strength; but it is displeasing to Christ when we distrust any power derived from him, or granted by him. There was also something in the malady which rendered the cure difficult. The extraordinary power of Satan must not discourage our faith, but quicken us to more earnestness in praying to God for the increase of it. Do we wonder to see Satan's bodily possession of this young man from a child, when we see his spiritual possession of every son of Adam from the fall!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I brought him to thy disciples ... - That is, not to the apostles, for they had power over unclean spirits ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but to others of his followers who attempted to work miracles. It is probable that many of his disciples attempted this who were not personal attendants on his ministry, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 17:14-23. Healing of a Demoniac Boy—Second Explicit Announcement by Our Lord of His Approaching Death and Resurrection. ( = Mr 9:14-32; Lu 9:37-45).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The time of this section is sufficiently denoted by the events which all the narratives show to have immediately preceded it—the first explicit announcement of His death, and the transfiguration—both being between His third and His fourth and last Passover.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Healing of the Demoniac and Lunatic Boy (Mt 17:14-21).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the exposition of this portion, see on [1322]Mr 9:14-32.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second Announcement of His Death (Mt 17:22, 23).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 14-16. The same history is told us both by Mark and Luke, but with considerable difference; we have it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 9:17,18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And one of the multitude answered and said, Master, I have brought unto thee my son, which hath a dumb spirit; and wheresoever he taketh him, he teareth him: and he foameth, and gnasheth with his teeth, and pineth away: and I spake to thy disciples that they should cast him out, and they could not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As an introduction to this, Mark saith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 9:14-16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:14-16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that when our Saviour ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "came to his disciples, he saw a great multitude about them, and the scribes questioning with them. And straightway all the people, when they beheld him, were greatly amazed, and running to him saluted him. And he asked the scribes, What question ye with them?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke gives us this account, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 9:37-40",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:37-40",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And it came to pass, that on the next day, when they were come down from the hill, much people met him. And, behold, a man of the company cried out, saying, Master, I beseech thee, look upon my son: for he is mine only child. And, lo, a spirit taketh him, and he suddenly crieth out; and it teareth him that he foameth again, and bruising him hardly departeth from him. And I besought thy disciples to cast him out; and they could not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " When our Lord went up to the mountain where he was transfigured, he left at the foot of it the multitudes, and nine of his apostles, he took only three with him. How long he stayed there no evangelist tells us. The multitude and his disciples stayed waiting for his coming, probably not far of; some of the scribes were got to them, and they were arguing together. The day after our Lord, and Peter, James, and John, were come down from the mount, they go to the multitude, who received him with great passion, and saluted him. He begins to inquire what they were discoursing about; but was by and by interrupted with a certain man, who comes and falls down upon his knees before him, begging mercy for his son, who (as Matthew reports his condition) was lunatic and sore vexed, often falling into the fire, and often into the water. Mark saith, he had a dumb spirit, that it tore him, he often foamed and gnashed with his teeth. Luke saith, that it was the man’s only child, that he had a spirit, that he cried out, it tare him, he foamed, and was bruised by it, &c. By the description of this young man’s disease, it appeareth to have been what we call the falling sickness, wherein men fall down, foam, and beat themselves. With this disease the devil joined, so as at certain times of the moon this disease took him, and the devil acting with it, he was dumb, at least for the time, and fell sometimes into the fire, sometimes into the water, foamed, gnashed with his teeth, tore himself: this seems to have been his condition. The father (during Christ’s absence) had attempted a cure by his disciples, but the text saith they could not (the reason we shall hear afterward); upon this he crieth unto Christ for his help. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I brought him to thy disciples,.... To the nine, whilst Christ was with the other three upon the mountain: no doubt but his design was to bring him to Christ first; but he being absent, he applied to his disciples, and, desired them to make use of their power to heal him; and which they attempted, but without success: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they could not cure him. This he said, partly to show the malignity and stubbornness of the disease, and partly to accuse the disciples of weakness; when he himself was as much in fault as they, as the following words show. Here the Jew (w) insults, and charges with contradiction, that in one place it should be said, that Jesus gave his disciples power to cast out unclean spirits, and here all the disciples could not cast a spirit out of one little child: but without any reason; let it be observed, that \"all\" the disciples were not present, the three principal ones were with Christ; besides, this was not owing to want of power in them, which Christ had conferred on them, and which they often made use of with success: but partly to their own unbelief, and partly to the unbelief of the father of this child, and others with him, as appears from what follows: and it is clear from Mark, that when he came to Christ, he had but little faith; he says to him, \"if thou canst do anything, help us\"; and after Christ had talked with him about his faith, he could only say, \"Lord, I believe, help mine unbelief\". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) Vet. Nizzachon, p. 219, 220. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) Vet. Nizzachon, p. 219, 220. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I brought him to thy disciples, and they could not cure him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῖς μαθηταῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the nine left behind when Jesus and the three ascended the Mount. The fame of Jesus and His disciples as healers had reached the neighbourhood, wherever it was.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ ἠδυνήθησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the case baffled the men of the Galilean mission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Οὐκ ἠδυνήθησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were not able",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It was a disgrace for the disciples to be accused from another quarter. Observe the candour of St Matthew’s confession, implicating himself in this charge. It is wonderful that the devil did not injure the disciples; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 19:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I brought him to thy disciples.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He had come with the multitude, hoping to find Jesus, and, being disappointed, he had applied to the nine to relieve his misery. When the apostles were sent forth with commission to heal the sick, they returned with joy to report the success of their tour: they cast forth many devils; they noted with glad surprise that the very demons were subject to them in the Name of Jesus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 10:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was different now. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They could not cure him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " What means they used we know not; at any rate, they were ineffectual. The writers who record the failure must be allowed to be truthful and honest. There had been much to depress these disciples. Their Master was absent, gone they knew not whither; how long he would be away they could not tell; the boldest and most trusted of their company were no longer present to cheer them with sympathy, to repel attacks, to stand forth as champions. The scribes' uncompromising disbelief (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") had for the moment obscured their own perfect trust; the atmosphere of infidelity had affected their own breathing; the memory of Christ's words concerning his Passion and death recurred again with dispiriting effect, infusing doubt and disquiet; they bad for the time lost the ardour and confidence which had animated them in their first mission; retaining belief in Christ's claims, they felt a hesitation concerning their own  ability; and the conscious weakness in their exorcism nullified its power, and they could do no mighty work. Matthew 17:16",
        "children": []
      }
    ]
  }
]