[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jesus rebuked the devil.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "demon,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as elsewhere in these cases of possession.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The child was cured.—Better, the boy. Mark 9:21 implies, as indeed the Greek does here, that the sufferer had passed beyond the age of childhood. St. Mark gives the words of the rebuke, “Thou dumb and deaf spirit, I command thee, come out from him, and enter no more into him.” This was followed by a great cry and another convulsion; then he fell down, “as it were, dead,” and many cried out, “He is dead.” Then Jesus took him by the hand, and raised him up, and the work of healing was accomplished. Calmness, and peace, and self-possession were seen instead of the convulsive agony. The spiritual power of the Healer had overcome the force, whether morbid or demoniac, which was the cause of his sufferings. Our Lord’s words, it need hardly be said, assume it to have been the latter; and those who deny the reality of the possession must, in their turn, assume either that He shared the belief of the people, or accepted it because they were not able to receive any other explanation of the mysterious sufferings which they had witnessed. Each hypothesis presents difficulties of its own, and we may well be content to confess our inability to solve them. (See Note on Matthew 8:28.) Speaking generally, the language of the New Testament seems to recognise, if not in all diseases, yet at least in all that disturb the moral equilibrium of man’s nature, an infraction of the divine order, and therefore rightly sees in them the work, directly or indirectly, of the great antagonist of that order. All our Lord’s works of mercy are summed up by St. Peter in the words that “He went about doing good, and healing all that were oppressed of the devil” (Acts 10:38), and on this supposition the particular phenomena of each case were logically ascribed to demoniac forces.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The child was cured.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "boy.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " implies, as indeed the Greek does here, that the sufferer had passed beyond the age of childhood. St. Mark gives the words of the rebuke, “Thou dumb and deaf spirit, I command thee, come out from him, and enter no more into him.” This was followed by a great cry and another convulsion; then he fell down, “as it were, dead,” and many cried out, “He is dead.” Then Jesus took him by the hand, and raised him up, and the work of healing was accomplished. Calmness, and peace, and self-possession were seen instead of the convulsive agony. The spiritual power of the Healer had overcome the force, whether morbid or demoniac, which was the cause of his sufferings. Our Lord’s words, it need hardly be said, assume it to have been the latter; and those who deny the reality of the possession must, in their turn, assume either that He shared the belief of the people, or accepted it because they were not able to receive any other explanation of the mysterious sufferings which they had witnessed. Each hypothesis presents difficulties of its own, and we may well be content to confess our inability to solve them. (See Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 8:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Speaking generally, the language of the New Testament seems to recognise, if not in all diseases, yet at least in all that disturb the moral equilibrium of man’s nature, an infraction of the divine order, and therefore rightly sees in them the work, directly or indirectly, of the great antagonist of that order. All our Lord’s works of mercy are summed up by St. Peter in the words that “He went about doing good, and healing all that were oppressed of the devil” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and on this supposition the particular phenomena of each case were logically ascribed to demoniac forces.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:14-21 The case of afflicted children should be presented to God by faithful and fervent prayer. Christ cured the child. Though the people were perverse, and Christ was provoked, yet care was taken of the child. When all other helps and succours fail, we are welcome to Christ, may trust in him, and in his power and goodness. See here an emblem of Christ's undertaking as our Redeemer. It encourages parents to bring children to Christ, whose souls are under Satan's power; he is able to heal them, and as willing as he is able. Not only bring them to Christ by prayer, but bring them to the word of Christ; to means by which Satan's strong-holds in the soul are beaten down. It is good for us to distrust ourselves and our own strength; but it is displeasing to Christ when we distrust any power derived from him, or granted by him. There was also something in the malady which rendered the cure difficult. The extraordinary power of Satan must not discourage our faith, but quicken us to more earnestness in praying to God for the increase of it. Do we wonder to see Satan's bodily possession of this young man from a child, when we see his spiritual possession of every son of Adam from the fall!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus rebuked the devil - The word \"rebuke\" has the combined force of reproving and commanding. He reproved him for having afflicted the child, and he commanded him to come out of him. Mark Mar 9:25 has recorded the words which he used words implying reproof and command: \"Thou dumb and deaf spirit, I charge thee come out of him, and enter no more into him.\" And the spirit cried, and with a mighty convulsion came out, leaving the child apparently dead. Jesus lifted him up by the hand (Mark), and gave him to his father (Luke). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 17:14-23. Healing of a Demoniac Boy—Second Explicit Announcement by Our Lord of His Approaching Death and Resurrection. ( = Mr 9:14-32; Lu 9:37-45).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The time of this section is sufficiently denoted by the events which all the narratives show to have immediately preceded it—the first explicit announcement of His death, and the transfiguration—both being between His third and His fourth and last Passover.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Healing of the Demoniac and Lunatic Boy (Mt 17:14-21).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the exposition of this portion, see on [1322]Mr 9:14-32.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second Announcement of His Death (Mt 17:22, 23).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 17,18. Mark relates this part of the history much more largely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 9:19-27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:19-27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he answereth him, and saith, O faithless generation, how long shall I be with you? how long shall I suffer you? Bring him unto me. And they brought him unto him: and when he saw him, straightway the spirit tare him; and he fell on the ground, and wallowed foaming. And he asked his father, How long is it ago since this came unto him? And he said, Of a child. And oft times it hath cast him into the fire, and into the waters, to destroy him: but if thou canst do any thing, have compassion on us, and help us. Jesus said unto him, if thou canst believe, all things are possible to him that believeth. And straightway the father of the child cried out, and said with tears, Lord, I believe; help thou mine unbelief. When Jesus saw that the people came running together, he rebuked the foul spirit, saying unto him, Thou dumb and deaf spirit, I charge thee, come out of him, and enter no more into him. And the spirit cried, and rent him sore, and came out of him: and he was as one dead; insomuch that many said, He is dead. But Jesus took him by the hand, and lifted him up; and he arose.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke relates this shorter, but addeth nothing to what is in the other evangelists, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 9:41,42",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",42",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Jesus answered and said, O faithless and perverse generation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ here calls them so not with respect to justifying faith, but that faith which respected the Divine power as to working miracles. Every revelation of the Divine will is the object of faith; Christ had revealed to the Jews that he was sent of God, and furnished with such a power; this the Jews, and particularly the scribes, did not believe. The faith of the father of this child was but very weak in the case; no more, as we shall see afterwards, was the faith of the disciples; so as he may be understood to respect them all, though in different degrees. He calls them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "perverse, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because they had so often seen and experienced his power of this nature, yet their faith was not clear and strong. He biddeth that the young man should be brought to him, and it was done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when he saw him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "( saith Mark), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "straightway the spirit tare him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c. Our Saviour could easily have prevented this, but probably he suffered it that the miracle might be more evident. However, it letteth us see how hardly the devil parteth with his possession in us in any degree, and how ready he is to run to the length of his line in doing us mischief. Christ asked his father how long he had been so vexed; his father tells him, from a child. By this also the miracle was more illustrious, which probably was the reason why Christ propounded the question. No evils are too inveterate for Christ to remove. The father renewth his request, and in it showeth the weakness of his faith: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (saith he) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou canst do any thing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His coming to Christ, and crying to him, argued that he believed he could do something; his saying ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if thou canst do any thing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " speaks the weakness of his faith. Christ tells him, if he could believe, all things are possible. Nothing ties God’s hands but his creatures’ unbelief. It is said, that Christ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "could not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Capernaum ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "do many mighty works because of their unbelief.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Upon this the father cries out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lord, I believe; help thou mine unbelief.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Men may truly believe, and yet have a mixture of unbelief. God rewards a weak faith, to souls labouring under the sense of their weakness, and desiring an increase of strength. Christ rebukes the spirit (called a dumb and deaf spirit, because it made the person such that was thus affected with it). Christ commands the spirit out, and so to come out as never more to enter into him. The evil spirit roars, rends him, comes out, and leaveth him as one dead: which still confirmeth us in his malice to mankind; he will do what harm he can when he cannot do us the harm he would. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus rebuked the devil,.... The words may indeed be rendered, \"and Jesus rebuked him, and the devil departed out of him\"; so the Vulgate Latin, and the Oriental versions; but the sense our version gives is certainly right; for it was not the father of the child Christ rebuked for his unbelief; this he had done already; nor the lunatic himself, as some have thought, either for his unbelief, or because he was possessed by the devil, for some sins of his own; which is not likely, since he was so from a child, and perhaps not now in his right mind, and capable of any rebuke: besides, the Evangelists Mark, and Luke expressly say, that he \"rebuked the foul\", or \"unclean spirit\": for though it was a natural disease which attended this child, yet he was afflicted with it in a preternatural way, by the means of Satan; who, by divine permission; had a power of inflicting bodily diseases: and that this disease was effected by him, is clear from the manner of curing, by the dispossession of him; for when ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he departed out of him; at the command of Christ, whose power he could not withstand, but was obliged, whether he would or not, to obey; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the child was cured from that very hour; directly, immediately, and continued well, and in good health. Hence the word rendered lunatic, in Matthew 17:15 is in several Oriental versions, translated in the sense of \"demoniac\", or one possessed with a devil. The Arabic version renders it, \"he is with a demon\": the Persic thus, \"on whom a demon hath power\"; and the Ethiopic after this manner, \"an evil demon takes hold on him\". And it is usual with the Jews, to ascribe diseases to evil spirits; and perhaps this uncommon dispensation in the times of Christ, may give rise to such a notion; particularly, they ascribe this very same disease of the \"epileptic\", or \"falling sickness\", to the same cause, which they call (x) \"Kordicus\", or \"Cardiacus\", the \"Cardiac\" passion, which one of their commentators (y) explains thus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the child was cured from that very hour; directly, immediately, and continued well, and in good health. Hence the word rendered lunatic, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is in several Oriental versions, translated in the sense of \"demoniac\", or one possessed with a devil. The Arabic version renders it, \"he is with a demon\": the Persic thus, \"on whom a demon hath power\"; and the Ethiopic after this manner, \"an evil demon takes hold on him\". And it is usual with the Jews, to ascribe diseases to evil spirits; and perhaps this uncommon dispensation in the times of Christ, may give rise to such a notion; particularly, they ascribe this very same disease of the \"epileptic\", or \"falling sickness\", to the same cause, which they call (x) \"Kordicus\", or \"Cardiacus\", the \"Cardiac\" passion, which one of their commentators (y) explains thus. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"It is a disease which proceeds from the repletion of the vessels of the brain, whereby the understanding is confounded; wherefore it is one of the sorts , \"of the falling sickness\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Says another (z) of them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"It is , \"the name of a demon\", that rules over such, that drink much wine out of the vat.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To which others agree, saying (a), that one attended with this disorder, is one, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"whose understanding is confounded, , \"by means of a demon\", who rules over such, that drink new wine; and lo! the spirit's name is \"Kardiacus\".'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From whence it is clear, that with them, the disease and the demon go by the same name; and that the former is from the latter. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Misn. Gittin, c. 7. sect. 1.((y) Maimon. in ib. (z) Gloss. in T. Bab. Gittin, fol. 67. 2.((a) Bartenora & Yom Tob. in Misn. Gittin, c. 8. sect. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) Misn. Gittin, c. 7. sect. 1.((y) Maimon. in ib. (z) Gloss. in T. Bab. Gittin, fol. 67. 2.((a) Bartenora & Yom Tob. in Misn. Gittin, c. 8. sect. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jesus rebuked the devil; and he departed out of him: and the child was cured from that very hour.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐπετίμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He rebuked him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "demon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Fritzsche, Ewald), reproached him for having taken possession of the boy. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 8:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For this prolepsis in the reference of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which Vulgate, Theophylact, de Wette, Winer, Bleek, refer to the lunatic), see Fritzsche, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Conject",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 11 f.; Bornemann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad Xen. Symp",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". viii. 34.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὥρας ἐκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸ δαιμόνιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the first intimation in the narrative that it is a case of possession, and a hint as to the genesis of the theory of possession. Epilepsy presents to the eye the aspect of the body being in the possession of a foreign will, and all diseases with which the notion of demoniacal possession was associated have this feature in common. “Judaeis usitatissimum erat morbos quosdam graviores, eos praesertim, quibus vel distortum est corpus vel mens turbata et agitata phrenesi, malis spiritibus attribuere.” Lightfoot, Hor. Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπετίμησεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " naturally refers to the demon. This reference to an as yet unmentioned subject Weiss explains by the influence of Mk.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐπετίμησεν αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He rebuked it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as an enemy.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") sc. the devil.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") sc. the child.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus rebuked the devil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Some take the pronoun as masculine, and refer it to the diseased boy; but it is more natural that the rebuke should be addressed to the possessing demon. This is the first place where St. Matthew mentions the spiritual aspect of the malady. As the child was being brought to Jesus, a terrible scene ensued, which is described with its horrific details by St. Mark, who also gives Christ's conversation with the father, whereby he desired to arouse faith in his heart, and to draw that assurance from him which could not be obtained from the irresponsible sufferer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He departed out of him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In contrast to the faltering exorcism of the apostles, which the devil had disregarded, Jesus orders with the calmness of assured authority, and is at once obeyed. After a final act of defeated malice, the demon quitted his hold of the child. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Was cured from that very hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Never more to fall under the devil's influence, restored wholly in body and mind. There is something very mysterious in the sufferings of this poor boy, as there is in those of infants. It is plain that the description, \"epileptic mania,\" will not connote all the features of this case. The evangelists' narrative and Christ's words and actions conclusively prove that it had a demoniacal element, and that this was miraculously eliminated. For epilepsy, I believe, no cure is known. The suddenness and the permanence (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the relief further demonstrate the reality of the miracle. We learn also from this incident that all possessed persons were not morally evil, that often the possession appertained to the physical and psychical nature, and had no ethical relation. Matthew 17:18",
        "children": []
      }
    ]
  }
]