[{"header":"Job’s Character and Wealth"},{"num":1,"verse":"There was a man in the land of Uz whose name was Job; and that man was blameless and upright, and one who feared God [with reverence] and abstained from and turned away from evil [because he honored God]. "},{"num":2,"verse":"Seven sons and three daughters were born to him. "},{"num":3,"verse":"He also possessed 7,000 sheep, 3,000 camels, 500 yoke (pairs) of oxen, 500 female donkeys, and a very great number of servants, so that this man was the greatest [and wealthiest and most respected] of all the men of the east (northern Arabia). "},{"num":4,"verse":"His sons used to go [in turn] and feast in the house of each one on his day, and they would send word and invite their three sisters to eat and drink with them. "},{"num":5,"verse":"When the days of their feasting were over, Job would send [for them] and consecrate them, rising early in the morning and offering burnt offerings according to the number of them all; for Job said, “It may be that my sons have sinned and cursed God in their hearts.” Job did this at all [such] times."},{"num":6,"verse":"Now there was a day when the sons of God (angels) came to present themselves before the Lord, and Satan (adversary, accuser) also came among them. "},{"num":7,"verse":"The Lord said to Satan, “From where have you come?” Then Satan answered the Lord, “From roaming around on the earth and from walking around on it.” "},{"num":8,"verse":"The Lord said to Satan, “Have you considered and reflected on My servant Job? For there is none like him on the earth, a blameless and upright man, one who fears God [with reverence] and abstains from and turns away from evil [because he honors God].” "},{"num":9,"verse":"Then Satan answered the Lord, “Does Job fear God for nothing? "},{"num":10,"verse":"Have You not put a hedge [of protection] around him and his house and all that he has, on every side? You have blessed the work of his hands [and conferred prosperity and happiness upon him], and his possessions have increased in the land. "},{"num":11,"verse":"But put forth Your hand now and touch (destroy) all that he has, and he will surely curse You to Your face.” "},{"num":12,"verse":"Then the Lord said to Satan, “Behold, all that Job has is in your power, only do not put your hand on the man himself.” So Satan departed from the presence of the Lord."},{"header":"Satan Allowed to Test Job"},{"num":13,"verse":"Now there was a day when Job’s sons and daughters were eating and drinking wine in their oldest brother’s house, "},{"num":14,"verse":"and a messenger came to Job and said, “The oxen were plowing and the donkeys were feeding beside them, "},{"num":15,"verse":"and the Sabeans attacked and swooped down on them and took away the animals. They also killed the servants with the edge of the sword, and I alone have escaped to tell you.” "},{"num":16,"verse":"While he was still speaking, another [messenger] also came and said, “The fire of God (lightning) has fallen from the heavens and has burned up the sheep and the servants and consumed them, and I alone have escaped to tell you.” "},{"num":17,"verse":"While he was still speaking, another [messenger] also came and said, “The Chaldeans formed three bands and made a raid on the camels and have taken them away and have killed the servants with the edge of the sword, and I alone have escaped to tell you.” "},{"num":18,"verse":"While he was still speaking, another [messenger] also came and said, “Your sons and your daughters were eating and drinking wine in their oldest brother’s house, "},{"num":19,"verse":"and suddenly, a great wind came from across the desert, and struck the four corners of the house, and it fell on the young people and they died, and I alone have escaped to tell you.”"},{"num":20,"verse":"Then Job got up and tore his robe and shaved his head [in mourning for the children], and he fell to the ground and worshiped [God]. "},{"num":21,"verse":"He said,"},{"num":22,"verse":"Through all this Job did not sin nor did he blame God."}]