[{"header":"Job’s Happy Life"},{"num":1,"verse":"There was a man in the land of Uz whose name was Job. This man was blameless and upright, a man who feared God and turned away from evil. "},{"num":2,"verse":"Seven sons and three daughters were born to him. "},{"num":3,"verse":"His possessions included seven thousand sheep, three thousand camels, five hundred yoke of oxen, and five hundred female donkeys. He also had a very large retinue of servants. This man was the greatest of all the men of the East."},{"num":4,"verse":"His sons would regularly arrange feasts, each one in his own house on his assigned day, and they would invite their three sisters to eat and drink with them. "},{"num":5,"verse":"When the days of the feast were complete, Job would send for them and consecrate them. Early in the morning he would sacrifice a burnt offering for each of them. Job would say, “Perhaps my children have sinned and cursed God in their hearts.” Job did this regularly."},{"header":"Job’s First Test"},{"num":6,"verse":"There came a day when the sons of God came to present themselves before the Lord, and Satan also came into their midst. "},{"num":7,"verse":"The Lord said to Satan, “Where have you come from?”"},{"num":8,"verse":"Then the Lord said to Satan, “Have you considered my servant Job? There is no one like him on the earth, a man who is blameless and upright, who fears God and turns away from evil.”"},{"num":9,"verse":"Satan answered the Lord, “Is it without cause that Job fears God? "},{"num":10,"verse":"You have put a protective hedge around him and his household and everything that belongs to him, haven’t you? You have blessed the work of his hands. His livestock has spread throughout the land. "},{"num":11,"verse":"But just stretch out your hand and strike everything that is his, and he will certainly curse you to your face!”"},{"num":12,"verse":"So the Lord said to Satan, “Very well, then. Everything that he has is in your hand. But you may not stretch out your hand against the man himself.” So Satan left the presence of the Lord."},{"num":13,"verse":"One day when Job’s sons and daughters were eating and drinking wine in the house of their oldest brother, "},{"num":14,"verse":"a messenger came to Job and said, “The oxen were plowing and the female donkeys were grazing nearby, "},{"num":15,"verse":"when the Sabeans swooped down and took them away. They put the servants to death with the sword, and I am the only one who has escaped to tell you!”"},{"num":16,"verse":"While he was still speaking, another servant came and said, “The fire of God fell from the sky and burned up the flocks and the servants and consumed them, and I am the only one who has escaped to tell you!”"},{"num":17,"verse":"While he was still speaking, another servant came and said, “The Chaldeans formed three raiding parties and plundered the camels and took them away. They put the servants to death with the sword, and I am the only one who has escaped to tell you!”"},{"num":18,"verse":"While he was still speaking, another servant came and said, “Your sons and daughters were eating and were drinking wine in the house of their oldest brother. "},{"num":19,"verse":"Suddenly a powerful wind swept in from the wilderness and struck the four corners of the house, and it collapsed on the young people, and they died, and I am the only one who has escaped to tell you!”"},{"num":20,"verse":"Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshipped. "},{"num":21,"verse":"Then he said, “Naked I came from my mother’s womb, and naked I will return. The Lord gave and the Lord has taken away. May the name of the Lord be blessed.”"},{"num":22,"verse":"In all this, Job did not sin or blame God."}]