[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shaved off the one half of their beards.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—According to Oriental ideas, the extremest insult which could have been inflicted. “Cutting off a person’s beard is regarded by the Arabs as an indignity quite equal to flogging and branding among ourselves. Many would rather die than have their beard shaved off (Arvieux, quoted by Keil). It is remarkable that in none of David’s wars does he appear as the aggressor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-5 Nahash had been an enemy to Israel, yet had showed kindness to David. David therefore resolves gratefully to return it. If a Pharisee gives alms in pride, though God will not reward it, yet he that receives the alms ought to return thanks for it. Those who bear ill-will to their neighbours, are resolved not to believe that their neighbours bear any good-will to them. There is nothing so well meant, but it may be ill interpreted, and is wont to be so, by men who love nobody but themselves. The best men must not think it strange if they are thus misrepresented. Charity thinketh no evil. According to the usages of those days and countries, Hanun treated David's ambassadors in the most contemptuous manner. David showed much concern for his servants. Let us learn not to lay unjust reproaches to heart; they will wear off, and turn only to the shame of those who utter or do them; while the reputation wrongfully hurt in a little time grows again, as these beards did. God will bring forth thy righteousness as the light, therefore wait patiently for him, Ps 37:6,7.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", more concisely \"shaved.\" Cutting off a person's beard is regarded by the Arabs as an indignity equal to flogging and branding among ourselves. The loss of their long garments, so essential to Oriental dignity, was no less insulting than that of their beards. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. Hanun took David's servants, and shaved off the one half of their beards—From the long flowing dress of the Hebrews and other Orientals, the curtailment of their garments must have given them an aspect of gross indelicacy and ludicrousness. Besides, a knowledge of the extraordinary respect and value which has always been attached, and the gross insult that is implied in any indignity offered, to the beard in the East, will account for the shame which the deputies felt, and the determined spirit of revenge which burst out in all Israel on learning the outrage. Two instances are related in the modern history of Persia, of similar insults by kings of haughty and imperious temper, involving the nation in war; and we need not, therefore, be surprised that David vowed revenge for this wanton and public outrage.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shaved off the one half of their beards; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " partly that he might compel them to bear a part in their mourning, and that in such a way as was usual with them, but forbidden to the Israelites, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 19:27 Deu 14:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 14:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; which probably was not unknown to them; and partly to fasten this as a reproach upon them, and to make them ridiculous and contemptible. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Isaiah 20:4 47:2 50:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 47:2 50:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Even to their buttocks:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this was worse than the former, because the Israelites wore no breeches, and so their nakedness was hereby uncovered. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Isaiah 20:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wherefore Hanun took David's servants,.... His ambassadors: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shaved off one half of their beards; that is, he ordered them to be shaved off; than which a greater indignity could not have been well done to them and to David, whom they represented, since the Israelites shaved not their beards, and were very careful of preserving them; for had it been the custom to shave, they might have shaved off the other half, and then they would not have appeared so ridiculous; and with other people it has been reckoned a very great punishment as well could be inflicted, and as great an affront as could well be offered, to mar a man's beard, or shave it off in whole or in part (p). The Lacedemonians, as Plutarch (q) relates, when any fled from battle, used, by way of reproach, to shave off part of their beards, and let the other part grow long; and with the Indians, as Bishop Patrick observes from an ancient writer, the king used to order the greatest offenders to be shaven, as the heaviest punishment he could inflict upon them; but what comes nearest to the case here is what the same learned commentator quotes from Tavernier, who in his Indian Travels tells us, that the sophi of Persia caused an ambassador of Aurengzeb to have his beard shaved off, telling him he was not worthy to wear a beard, and thereupon commanded it should be shaved off; which affront offered him in the person of his ambassador was most highly resented by Aurengzeb, as this was by David: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and cut off their garments in the middle, even to their buttocks; and as they wore long garments in those countries, without any breeches or drawers under them, those parts by these means were exposed to view which modesty requires should be concealed (r); so that they must be put to the utmost shame and confusion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sent them away; in this ridiculous manner, scoffing and leering at them no doubt; that since they came with compliments of condolence, it was proper they should appear in the habit of mourners, with their beards shaved, and their garments rent; cutting of garments, and standing in them from morning tonight, was a punishment of soldiers with the Romans, when they offended (s). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Apollon. Vit. Philostrat. l. 7. c. 14. (q) In Agesitao. (r) \"Dimidiasque nates Gallica palla tegit\". Martial. (s) Valer. Maxim. l. 2. c. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Apollon. Vit. Philostrat. l. 7. c. 14. (q) In Agesitao. (r) \"Dimidiasque nates Gallica palla tegit\". Martial. (s) Valer. Maxim. l. 2. c. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Wherefore Hanun took David's servants, and shaved off the one half of their beards, and cut off their garments in the middle, even to their buttocks, and sent them away.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shaved off the one half of their beards",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Compare the story in Herodotus of the thief who made some guards drunk, and for an insult shaved their right cheeks (II. 121). No grosser insult could have been devised. The beard was and still is to an Oriental the badge of the dignity of manhood. It was only shaved as a sign of the deepest mourning. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 15:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 41:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Cutting off a person’s beard is regarded by the Arabs as an indignity equal to flogging and branding among ourselves. Many would rather die than have their beard shaved off.” D’Arvieux’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Customs of the Bedouin Arabs",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A similar occurrence is said to have taken place in modern times. “In 1764 Kerim Khan, a pretender to the Persian throne, sent ambassadors to Mir Mahenna, the prince of Bendervigk, on the Persian Gulf, to demand tribute from him; but he in return cut off the ambassadors’ beards. Kerim Khan was so enraged at this that he went the next year with a large army to make war upon this prince, and took the city, and almost the whole of his territory, to avenge the insult.” Niebuhr’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Description of Arabia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cut off their garments",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The ambassadors, who wore long dignified garments, were sent away in the shameful plight of captives. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hanun...  shaved off the one half of their beards.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " To an Oriental the beard was the mark of his being a free man, and to cut it off on one side was not merely an insult to David's ambassadors, but the treating them like slaves. Moreover, as only the priests wore underclothing, and as the ordinary dress of men consisted of a tunic and a loose flowing robe thrown over it, the cutting of this robe short up to the hip was a vile and abominable affront. Of course, Hanun intended this as a challenge to war, whereas David had meant peace and friendship. 2 Samuel 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He had the half of their beard shaved off, and their clothes cut off up to the seat, and in this state he sent them away. \"The half of the beard,\" i.e., the beard on one side. With the value universally set upon the beard by the Hebrews and other oriental nations, as being a man's greatest ornament,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Cutting off a persons' beard is regarded by the Arabs as an indignity quite equal to flogging and branding among ourselves. Many would rather die than have their beard shaved off\" (Arvieux, Sitten der Beduinen-araber). Niebuhr relates a similar occurrence as having taken place in modern times. In the years 1764, a pretender to the Persian throne, named Kerim Khan, sent ambassadors to Mir Mahenna, the prince of Bendervigk, on the Persian Gulf, to demand tribute from him; but he in return cut off the ambassadors' beards. Kerim Khan was so enraged at this, that he went the next year with a large army to make war upon this prince, and took the city, and almost the whole of his territory, to avenge the insult.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the cutting off of one-half of it was the greatest insult that could have been offered to the ambassadors, and through them to David their king. The insult was still further increased by cutting off the long dress which covered the body; so that as the ancient Israelites wore no trousers, the lower half of the body was quite exposed. מדויהם .deso, from מדוּ or מדוה, the long robe reaching down to the feet, from the root מדה  equals  מדד, to stretch, spread out, or measure.",
        "children": []
      }
    ]
  }
]