[[],[{"type":"header","content":"Prohibitions against Eating Blood"},{"type":"prose","content":"Then the LORD said to Moses,"}],[{"type":"prose","content":"“Give the following instructions to Aaron and his sons and all the people of Israel. This is what the LORD has commanded."}],[{"type":"prose","content":"“If any native Israelite sacrifices a bull or a lamb or a goat anywhere inside or outside the camp"}],[{"type":"prose","content":"instead of bringing it to the entrance of the Tabernacle to present it as an offering to the LORD, that person will be as guilty as a murderer. Such a person has shed blood and will be cut off from the community."}],[{"type":"prose","content":"The purpose of this rule is to stop the Israelites from sacrificing animals in the open fields. It will ensure that they bring their sacrifices to the priest at the entrance of the Tabernacle, so he can present them to the LORD as peace offerings."}],[{"type":"prose","content":"Then the priest will be able to splatter the blood against the LORD’s altar at the entrance of the Tabernacle, and he will burn the fat as a pleasing aroma to the LORD."}],[{"type":"prose","content":"The people must no longer be unfaithful to the LORD by offering sacrifices to the goat idols. This is a permanent law for them, to be observed from generation to generation."}],[{"type":"prose","content":"“Give them this command as well. If any native Israelite or foreigner living among you offers a burnt offering or a sacrifice"}],[{"type":"prose","content":"but does not bring it to the entrance of the Tabernacle to offer it to the LORD, that person will be cut off from the community."}],[{"type":"prose","content":"“And if any native Israelite or foreigner living among you eats or drinks blood in any form, I will turn against that person and cut him off from the community of your people,"}],[{"type":"prose","content":"for the life of the body is in its blood. I have given you the blood on the altar to purify you, making you right with the LORD. It is the blood, given in exchange for a life, that makes purification possible."}],[{"type":"prose","content":"That is why I have said to the people of Israel, ‘You must never eat or drink blood—neither you nor the foreigners living among you.’"}],[{"type":"prose","content":"“And if any native Israelite or foreigner living among you goes hunting and kills an animal or bird that is approved for eating, he must drain its blood and cover it with earth."}],[{"type":"prose","content":"The life of every creature is in its blood. That is why I have said to the people of Israel, ‘You must never eat or drink blood, for the life of any creature is in its blood.’ So whoever consumes blood will be cut off from the community."}],[{"type":"prose","content":"“And if any native-born Israelites or foreigners eat the meat of an animal that died naturally or was torn up by wild animals, they must wash their clothes and bathe themselves in water. They will remain ceremonially unclean until evening, but then they will be clean."}],[{"type":"prose","content":"But if they do not wash their clothes and bathe themselves, they will be punished for their sin.”"}]]