[{"num":9,"verse":"Elisha the prophet called one of the sons of the prophets, and said to him, “Put your belt on your waist, take this vial of oil in your hand, and go to Ramoth Gilead. "},{"num":2,"verse":"When you come there, find Jehu the son of Jehoshaphat the son of Nimshi, and go in, and make him rise up from among his brothers, and take him to an inner room. "},{"num":3,"verse":"Then take the vial of oil, and pour it on his head, and say, ‘Yahweh says, “I have anointed you king over Israel.”’ Then open the door, flee, and don’t wait.”"},{"num":4,"verse":"So the young man, even the young man, the prophet, went to Ramoth Gilead. "},{"num":5,"verse":"When he came, behold, the captains of the army were sitting. Then he said, “I have a message for you, captain.”"},{"num":6,"verse":"He arose, and went into the house. Then he poured the oil on his head, and said to him, “Yahweh, the God of Israel, says, ‘I have anointed you king over the people of Yahweh, even over Israel. "},{"num":7,"verse":"You must strike your master Ahab’s house, that I may avenge the blood of my servants the prophets, and the blood of all the servants of Yahweh, at the hand of Jezebel. "},{"num":8,"verse":"For the whole house of Ahab will perish. I will cut off from Ahab everyone who urinates against a wall, both him who is shut up and him who is left at large in Israel. "},{"num":9,"verse":"I will make Ahab’s house like the house of Jeroboam the son of Nebat, and like the house of Baasha the son of Ahijah. "},{"num":10,"verse":"The dogs will eat Jezebel on the plot of ground of Jezreel, and there shall be no one to bury her.’” Then he opened the door and fled."},{"num":11,"verse":"When Jehu came out to the servants of his lord, and one said to him, “Is all well? Why did this mad fellow come to you?”"},{"num":12,"verse":"They said, “That is a lie. Tell us now.”"},{"num":13,"verse":"Then they hurried, and each man took his cloak, and put it under him on the top of the stairs, and blew the trumpet, saying, “Jehu is king.”"},{"num":14,"verse":"So Jehu the son of Jehoshaphat the son of Nimshi conspired against Joram. (Now Joram was keeping Ramoth Gilead, he and all Israel, because of Hazael king of Syria; "},{"num":15,"verse":"but king Joram had returned to be healed in Jezreel of the wounds which the Syrians had given him, when he fought with Hazael king of Syria.) Jehu said, “If this is your thinking, then let no one escape and go out of the city, to go to tell it in Jezreel.” "},{"num":16,"verse":"So Jehu rode in a chariot and went to Jezreel, for Joram lay there. Ahaziah king of Judah had come down to see Joram. "},{"num":17,"verse":"Now the watchman was standing on the tower in Jezreel, and he spied the company of Jehu as he came, and said, “I see a company.”"},{"num":18,"verse":"So one went on horseback to meet him, and said, “the king says, ‘Is it peace?’”"},{"num":19,"verse":"Then he sent out a second on horseback, who came to them, and said, “The king says, ‘Is it peace?’”"},{"num":20,"verse":"The watchman said, “He came to them, and isn’t coming back. The driving is like the driving of Jehu the son of Nimshi, for he drives furiously.”"},{"num":21,"verse":"Joram said, “Get ready!”"},{"num":22,"verse":"When Joram saw Jehu, he said, “Is it peace, Jehu?”"},{"num":23,"verse":"Joram turned his hands, and fled, and said to Ahaziah, “This is treason, Ahaziah!”"},{"num":24,"verse":"Jehu drew his bow with his full strength, and struck Joram between his arms; and the arrow went out at his heart, and he sunk down in his chariot. "},{"num":25,"verse":"Then Jehu said to Bidkar his captain, “Pick him up, and throw him in the plot of the field of Naboth the Jezreelite; for remember how, when you and I rode together after Ahab his father, Yahweh laid this burden on him: "},{"num":26,"verse":"‘Surely I have seen yesterday the blood of Naboth, and the blood of his sons,’ says Yahweh; ‘and I will repay you in this plot of ground,’ says Yahweh. Now therefore take and cast him onto the plot of ground, according to Yahweh’s word.”"},{"num":27,"verse":"But when Ahaziah the king of Judah saw this, he fled by the way of the garden house. Jehu followed after him, and said, “Strike him also in the chariot!” They struck him at the ascent of Gur, which is by Ibleam. He fled to Megiddo, and died there. "},{"num":28,"verse":"His servants carried him in a chariot to Jerusalem, and buried him in his tomb with his fathers in David’s city. "},{"num":29,"verse":"In the eleventh year of Joram the son of Ahab, Ahaziah began to reign over Judah."},{"num":30,"verse":"When Jehu had come to Jezreel, Jezebel heard of it; and she painted her eyes, and adorned her head, and looked out at the window. "},{"num":31,"verse":"As Jehu entered in at the gate, she said, “Do you come in peace, Zimri, you murderer of your master?”"},{"num":32,"verse":"He lifted up his face to the window, and said, “Who is on my side? Who?”"},{"num":33,"verse":"He said, “Throw her down!”"},{"num":34,"verse":"When he had come in, he ate and drank. Then he said, “See now to this cursed woman, and bury her; for she is a king’s daughter.”"},{"num":35,"verse":"They went to bury her, but they found no more of her than the skull, the feet, and the palms of her hands. "},{"num":36,"verse":"Therefore they came back, and told him."},{"num":37,"verse":"and the body of Jezebel will be as dung on the face of the field on Jezreel’s land, so that they won’t say, “This is Jezebel.”’”"}]