[{"num":9,"verse":"And Elisha the prophet hath called to one of the sons of the prophets, and saith to him, `Gird up thy loins, and take this vial of oil in thy hand, and go to Ramoth-Gilead,"},{"num":2,"verse":"and thou hast gone in there, and see thou there Jehu son of Jehoshaphat, son of Nimshi, and thou hast gone in, and caused him to rise out of the midst of his brethren, and brought him in to the inner part of an inner-chamber,"},{"num":3,"verse":"and taken the vial of oil, and poured on his head, and said, Thus said Jehovah, I have anointed thee for king unto Israel; and thou hast opened the door, and fled, and dost not wait.'"},{"num":4,"verse":"And the young man goeth -- the young man the prophet -- to Ramoth-Gilead,"},{"num":5,"verse":"and cometh in, and lo, chiefs of the force are sitting, and he saith, `I have a word unto thee, O chief!' and Jehu saith, `Unto which of all of us?' and he saith, `Unto thee, O chief.'"},{"num":6,"verse":"And he riseth and cometh in to the house, and he poureth the oil on his head, and saith to him, `Thus said Jehovah, God of Israel, I have anointed thee for king unto the people of Jehovah, unto Israel,"},{"num":7,"verse":"and thou hast smitten the house of Ahab thy lord, and I have required the blood of My servants the prophets, and the blood of all the servants of Jehovah, from the hand of Jezebel;"},{"num":8,"verse":"and perished hath all the house of Ahab, and I have cut off to Ahab those sitting on the wall, and restrained, and left, in Israel,"},{"num":9,"verse":"and I have given up the house of Ahab like the house of Jeroboam son of Nebat, and as the house of Baasha son of Ahijah,"},{"num":10,"verse":"and Jezebel do the dogs eat in the portion of Jezreel, and there is none burying;' and he openeth the door and fleeth."},{"num":11,"verse":"And Jehu hath gone out unto the servants of his lord, and [one] saith to him, `Is there peace? wherefore came this madman unto thee?' and he saith unto them, `Ye have known the man and his talk.'"},{"num":12,"verse":"And they say, `False, declare, we pray thee, to us;' and he saith, `Thus and thus spake he unto me, saying, Thus said Jehovah, I have anointed thee for king unto Israel.'"},{"num":13,"verse":"And they haste and take each his garment, and put [it] under him at the top of the stairs, and blow with a trumpet, and say, `Reigned hath Jehu!'"},{"num":14,"verse":"And Jehu son of Jehoshaphat, son of Nimshi, conspireth against Joram -- (and Joram was keeping in Ramoth-Gilead, he and all Israel, from the presence of Hazael king of Aram,"},{"num":15,"verse":"and king Joram turneth back to be healed in Jezreel, of the wounds with which the Aramaeans smite him, in his fighting with Hazael king of Aram) -- and Jehu saith, `If it is your mind, let not an escaped one go out from the city, to go to declare [it] in Jezreel.'"},{"num":16,"verse":"And Jehu rideth, and goeth to Jezreel, for Joram is lying there, and Ahaziah king of Judah hath gone down to see Joram."},{"num":17,"verse":"And the watchman is standing on the tower in Jezreel, and seeth the company of Jehu in his coming, and saith, `A company I see;' and Joram saith, `Take a rider and send to meet them, and let him say, Is there peace?'"},{"num":18,"verse":"and the rider on the horse goeth to meet him, and saith, `Thus said the king, Is there peace?' and Jehu saith, `What -- to thee and to peace? turn round behind me.' And the watchman declareth, saying, `The messenger came unto them, and he hath not returned.'"},{"num":19,"verse":"And he sendeth a second rider on a horse, and he cometh in unto them, and saith, `Thus said the king, Is there peace?' and Jehu saith, `What -- to thee and to peace? turn round behind me.'"},{"num":20,"verse":"And the watchman declareth, saying, `He came unto them, and he hath not returned, and the driving [is] like the driving of Jehu son of Nimshi, for with madness he driveth.'"},{"num":21,"verse":"And Jehoram saith, `Harness;' and his chariot is harnessed, and Jehoram king of Israel goeth out, and Ahaziah king of Judah, each in his chariot, and they go out to meet Jehu, and find him in the portion of Naboth the Jezreelite."},{"num":22,"verse":"And it cometh to pass, at Jehoram's seeing Jehu, that he saith, `Is there peace, Jehu?' and he saith, `What [is] the peace, while the whoredoms of Jezebel thy mother, and her witchcrafts, are many?'"},{"num":23,"verse":"And Jehoram turneth his hands, and fleeth, and saith unto Ahaziah, `Deceit, O Ahaziah!'"},{"num":24,"verse":"And Jehu hath filled his hand with a bow, and smiteth Jehoram between his arms, and the arrow goeth out from his heart, and he boweth down in his chariot."},{"num":25,"verse":"And [Jehu] saith unto Bidkar his captain, `Lift up, cast him into the portion of the field of Naboth the Jezreelite -- for, remember, I and thou were riding together after Ahab his father, and Jehovah lifted upon him this burden:"},{"num":26,"verse":"Have I not the blood of Naboth and the blood of his sons seen yesternight -- the affirmation of Jehovah -- yea, I have recompensed to thee in this portion -- the affirmation of Jehovah; -- and now, lift up, cast him into the portion, according to the word of Jehovah.'"},{"num":27,"verse":"And Ahaziah king of Judah hath seen, and fleeth the way of the garden-house, and Jehu pursueth after him, and saith, `Smite him -- also him -- in the chariot,' in the going up to Gur, that [is] Ibleam, and he fleeth to Megiddo, and dieth there,"},{"num":28,"verse":"and his servants carry him in a chariot to Jerusalem, and bury him in his burying-place, with his fathers, in the city of David."},{"num":29,"verse":"And in the eleventh year of Joram son of Ahab reign did Ahaziah over Judah."},{"num":30,"verse":"And Jehu cometh in to Jezreel, and Jezebel hath heard, and putteth her eyes in paint and maketh right her head, and looketh out through the window."},{"num":31,"verse":"And Jehu hath come into the gate, and she saith, `Was there peace [to] Zimri -- slayer of his lord?'"},{"num":32,"verse":"And he lifteth up his face unto the window, and saith, `Who [is] with me? -- who?' and look out unto him do two [or] three eunuchs;"},{"num":33,"verse":"And he saith, `Let her go;' and they let her go, and [some] of her blood is sprinkled on the wall, and on the horses, and he treadeth her down."},{"num":34,"verse":"And he cometh in, and eateth, and drinketh, and saith, `Look after, I pray you, this cursed one, and bury her, for she [is] a king's daughter.'"},{"num":35,"verse":"And they go to bury her, and have not found of her except the skull, and the feet, and the palms of the hands."},{"num":36,"verse":"And they turn back, and declare to him, and he saith, `The word of Jehovah it [is], that He spake by the hand of this servant Elijah the Tishbite, saying, In the portion of Jezreel do the dogs eat the flesh of Jezebel,"},{"num":37,"verse":"and the carcase of Jezebel hath been as dung on the face of the field in the portion of Jezreel, that they say not, This [is] Jezebel.'"}]