[{"header":"Unsolved Murders"},{"num":21,"verse":"In the land that the Lord your God is giving you to possess, if a person who has been killed is found lying in the open country and it is not known who struck him down, "},{"num":2,"verse":"then your elders and your judges are to go out and measure the distance from the person who was killed to each of the surrounding towns."},{"num":3,"verse":"The elders of the city that is closest to the person who was killed are to take a heifer that has not been worked and has not pulled with a yoke. "},{"num":4,"verse":"The elders of that city are to bring the heifer down to a gully that has a flowing stream and that has not been plowed and sown, and they are to break the neck of the heifer there in the gully."},{"num":5,"verse":"Then the priests, the descendants of Levi, are to come near, because the Lord your God has chosen them to serve and to bless you in the name of the Lord, and every dispute and every case of assault is to be decided according to their ruling. "},{"num":6,"verse":"Then all the elders of the city closest to the person who was killed are to wash their hands over the heifer whose neck was broken in the gully."},{"num":7,"verse":"Then they are to testify by saying, “Our hands did not pour out this blood, and our eyes did not observe it. "},{"num":8,"verse":"Atone, Lord, for your people whom you have redeemed, and do not charge us with taking innocent life among your people Israel.” Then their bloodguilt will be atoned for."},{"num":9,"verse":"In this way you will purge away from among you the guilt of shedding the blood of an innocent person by doing what is right in the eyes of the Lord."},{"header":"Captive Wives"},{"num":10,"verse":"When you go out for battle against your enemies and the Lord your God gives them into your hands, if you take some of them as captives, "},{"num":11,"verse":"and you see in that group of captives a beautiful woman, and you are attracted to her and would like to take her as your wife, "},{"num":12,"verse":"then you will bring her into your house. She is to shave her head and trim her nails. "},{"num":13,"verse":"She also is to remove the clothing she wore when she was captured and to stay in your house and weep for her father and her mother for a month. After that you may come to her and become her husband and she will become your wife."},{"num":14,"verse":"Then if you are no longer pleased with her, you are to let her go as she desires. You must not sell her for money. You are not to deal with her as a slave, because you have humiliated her."},{"header":"Family Law"},{"num":15,"verse":"If a man has two wives, and one is loved and one is not loved, and both the loved one and the unloved one have borne children for him, and the firstborn son belongs to the unloved wife, "},{"num":16,"verse":"then on the day that he bequeaths what he owns to his sons, he cannot declare the son of the loved wife as his firstborn in preference to the son of the unloved wife, who is the true firstborn. "},{"num":17,"verse":"He must acknowledge the son of the unloved wife as the firstborn by giving him a double portion of everything that is recognized as his. Because that son is the beginning of his father’s virility, the legal right of the firstborn belongs to him."},{"num":18,"verse":"If a man has a stubborn and rebellious son who does not obey the voice of his father and his mother, and they discipline him, but he will not listen to them, "},{"num":19,"verse":"then his father and his mother are to take hold of him and bring him out to the elders of his city and to the gate of his hometown. "},{"num":20,"verse":"Then they will say to the elders of his city, “This son of ours is stubborn and rebellious. He does not obey us. He is a worthless glutton and a drunkard.” "},{"num":21,"verse":"Then all the men of his city are to stone him to death, and so you will purge the evil from among you, and all Israel will hear and fear."},{"header":"Miscellaneous Laws"},{"num":22,"verse":"If there is a man whose sin justly deserves a death sentence, and he is put to death, and you hang him on a tree, "},{"num":23,"verse":"his dead body is not to remain on the tree overnight. You must bury him on the same day, because a person left hanging on a tree is cursed by God. You are not to defile your ground that the Lord your God is giving you as an inheritance."}]