[{"header":"Atonement for Unsolved Murder"},{"num":21,"verse":"“If a murder victim is found fallen in the open country of the land that the Lord your God is about to give you to possess, and it is not known who killed him, "},{"num":2,"verse":"then let your elders and judges go out and measure the distance from the dead body to the neighboring cities. "},{"num":3,"verse":"Then the elders of the city nearest the body are to take a heifer that hasn’t been put to work or hasn’t pulled a yoke "},{"num":4,"verse":"and are to lead the heifer to a flowing stream in a valley that has never been tilled or planted. They are to break the heifer’s neck there. "},{"num":5,"verse":"Then the priests of the descendants of Levi are to step forward, because the Lord your God chose them to serve and pronounce blessings in his name. Every case of dispute and assault is to be subject to their ruling. "},{"num":6,"verse":"All the elders of the city nearest the dead body are to wash their hands over the heifer whose neck was broken in the valley, "},{"num":7,"verse":"and they are to make this declaration: ‘Our hands didn’t shed this blood, nor were we witnesses to the crime. "},{"num":8,"verse":"Make atonement for your people Israel, whom you have redeemed, Lord, and don’t charge the blood of an innocent man against them.’ Then the blood that has been shed will be atoned for. "},{"num":9,"verse":"This is how you will remove the guilt of innocent blood from among you, for you must do what is right in the sight of the Lord.”"},{"header":"Marriage to a War Captive"},{"num":10,"verse":"“If you go to battle against your enemies, and the Lord your God delivers them into your control, you may take some prisoners captive. "},{"num":11,"verse":"If you see among the prisoners a beautiful woman and you desire her, then you may take her as your wife. "},{"num":12,"verse":"Bring her to your house, but shave her head and trim her nails. "},{"num":13,"verse":"Remove her prisoner’s clothing and let her remain for a month in your house, mourning her parents. After that, you may become her husband and she is to become your wife. "},{"num":14,"verse":"If you aren’t pleased with her and you send her away, you must not sell her for money or mistreat her, since you will have dishonored her.”"},{"header":"Preferential Treatment Prohibited"},{"num":15,"verse":"“If a man has two wives where one is loved but the other is unloved, and both of them bear him sons, but the firstborn is the son of the unloved wife, "},{"num":16,"verse":"then when he bequeaths his possessions to his sons, he must not give preference to the firstborn of the beloved wife over the firstborn of the unloved wife. "},{"num":17,"verse":"Instead, he must acknowledge the firstborn of the unloved wife by giving him double of everything he owns, because he is really the first fruit of his father’s strength. The right of the firstborn belongs to him.”"},{"header":"Death to a Rebellious Son"},{"num":18,"verse":"“If a man has a stubborn son who does not obey his parents, and although they try to discipline him, he still refuses to pay attention to them, "},{"num":19,"verse":"then his parents are to seize him and bring him before the elders at the gate of his city. "},{"num":20,"verse":"Then they are to declare to the elders of their city: ‘Our son is stubborn and rebellious. He does not obey us. He lives wildly and is a drunkard.’ "},{"num":21,"verse":"Then all the men of his city are to stone him with boulders so that he dies. This is how you will remove this evil from among you. Then all Israel will hear of it and will be afraid.”"},{"header":"Burial of the Executed"},{"num":22,"verse":"“If a man is guilty of a capital offense, is executed, and then is impaled on a tree, "},{"num":23,"verse":"his body must not remain overnight on the tree. You must bury him that same day, because cursed of God is the one who has been hanged on a tree. Don’t defile your land that the Lord is about to give you as your inheritance.”"}]