[{"header":"Jehoahaz Son of Jehu, King of Israel"},{"num":13,"verse":"In the twenty-third year of Joash son of Ahaziah, king of Judah, Jehoahaz son of Jehu became king over Israel in Samaria for seventeen years. "},{"num":2,"verse":"He did evil in the eyes of the Lord. He walked in the sins which Jeroboam son of Nebat caused Israel to commit. He did not turn from them. "},{"num":3,"verse":"The Lord’s anger burned against Israel, so he gave them into the hand of Hazael king of Aram and into the hand of Ben Hadad son of Hazael, all his days. "},{"num":4,"verse":"Jehoahaz, however, sought the Lord’s favor, and the Lord listened to him, because he saw the oppression that the king of Aram was inflicting on Israel. "},{"num":5,"verse":"So the Lord appointed a deliverer for Israel, and they escaped from the power of the Arameans. Then the people of Israel lived in their own homes as they had before."},{"num":6,"verse":"But they did not turn from the sins which the house of Jeroboam caused Israel to commit. They walked in them, and there was even an Asherah pole standing in Samaria. "},{"num":7,"verse":"Nothing was left of Jehoahaz’s army except fifty charioteers, ten chariots, and ten thousand foot soldiers, for the king of Aram had destroyed them. He made them like dust at threshing time."},{"num":8,"verse":"As for the rest of the acts of Jehoahaz and everything he did and his mighty deeds, are they not written in the annals of the kings of Israel? "},{"num":9,"verse":"Jehoahaz rested with his fathers and they buried him in Samaria. Then his son Joash became king in his place."},{"header":"Joash (Jehoash) Son of Jehoahaz, King of Israel"},{"num":10,"verse":"In the thirty-seventh year of Joash king of Judah, Jehoash son of Jehoahaz became king over Israel in Samaria for sixteen years. "},{"num":11,"verse":"He did evil in the eyes of the Lord. He did not turn from all the sins which Jeroboam son of Nebat caused Israel to commit. He walked in them."},{"num":12,"verse":"As for the rest of Joash’s acts and all he did and his mighty deeds, how he fought with Amaziah king of Judah, are they not written in the annals of the kings of Israel? "},{"num":13,"verse":"Joash rested with his fathers. Then Jeroboam sat on his throne. Joash was buried in Samaria with the kings of Israel."},{"header":"Elisha’s Final Prophecy and Death"},{"num":14,"verse":"Now Elisha was suffering from the illness from which he would die, and Joash king of Israel went down to him. Then he wept over him and said, “My father! My father! Israel’s chariot and its charioteers!”"},{"num":15,"verse":"Elisha said to him, “Get a bow and arrow.” So he brought a bow and arrow to him."},{"num":16,"verse":"Then he told the king of Israel, “Take the bow in your hands!” So he took the bow in his hands. Then Elisha put his hand on the king’s hand."},{"num":17,"verse":"He said, “Open the window to the east.” So he opened it."},{"num":18,"verse":"Then Elisha said, “Take your arrows.” So he took the arrows."},{"num":19,"verse":"Then the man of God was furious with him and said, “You should have struck the ground five or six times! Then you would have completely destroyed Aram. But now, you will defeat Aram only three times.”"},{"num":20,"verse":"Then Elisha died, and they buried him."},{"num":21,"verse":"While a man was being buried, the people suddenly saw the raiders, so they threw the man into the tomb of Elisha. When the man touched the bones of Elisha, he came to life, and he got up on his feet."},{"num":22,"verse":"Hazael king of Aram had oppressed Israel all the days of Jehoahaz. "},{"num":23,"verse":"But the Lord was gracious to them and showed compassion for them, and he turned his attention to them because of his covenant with Abraham, Isaac, and Jacob. So until this time he has not been willing to destroy them, nor did he cast them from his presence."},{"num":24,"verse":"Then Hazael king of Aram died, and his son Ben Hadad became king in his place. "},{"num":25,"verse":"Jehoash son of Jehoahaz took action and recovered from Ben Hadad son of Hazael the cities which Hazael had taken from his father Jehoahaz in war. Three times Joash defeated him and recovered those Israelite cities."}]