[{"num":13,"verse":"3 Jehoahaz the son of Jehu is delivered into the hands of the Syrians. 4 He prayeth unto God, and is delivered. 9 Joash his son reigneth in his stead. 20 Elisha dieth. 24 Hazael dieth."},{"num":1,"verse":"In the three and twentieth year of Joash the son of Ahaziah king of Judah, Jehoahaz the son of Jehu began to reign over Israel in Samaria, and he reigned seventeen years."},{"num":2,"verse":"And he did evil in the sight of the Lord, and followed the sins of Jeroboam the son of Nebat, which made Israel to sin, and departed not therefrom."},{"num":3,"verse":"And the Lord was angry with Israel, and delivered them into the hand of Hazael king of Aram, and into the hand of Ben-Hadad the son of Hazael, all his days."},{"num":4,"verse":"And Jehoahaz besought the Lord, and the Lord heard him: for he saw the trouble of Israel, wherewith the king of Aram troubled them."},{"num":5,"verse":"(And the Lord gave Israel a deliverer, so that they came out from under the subjection of the Aramites. And the children of Israel dwelt in their tents as beforetime."},{"num":6,"verse":"Nevertheless, they departed not from the sins of the house of Jeroboam which made Israel sin, but walked in them, even the grove also remained still in Samaria)"},{"num":7,"verse":"For he had left of the people to Jehoahaz but fifty horsemen, and ten chariots, and ten thousand footmen, because the king of Aram had destroyed them, and made them like dust beaten to powder."},{"num":8,"verse":"Concerning the rest of the acts of Jehoahaz and all that he did, and his valiant deeds, are they not written in the book of the Chronicles of the kings of Israel?"},{"num":9,"verse":"And Jehoahaz slept with his fathers, and they buried him in Samaria, and Joash his son reigned in his stead."},{"num":10,"verse":"¶ In the seven and thirtieth year of Joash king of Judah began Jehoash the son of Jehoahaz to reign over Israel in Samaria, and reigned sixteen years."},{"num":11,"verse":"And did evil in the sight of the Lord: for he departed not from all the sins of Jeroboam the son of Nebat that made Israel to sin, but he walked therein."},{"num":12,"verse":"Concerning the rest of the acts of Joash, and all that he did, and his valiant deeds, and how he fought against Amaziah king of Judah, are they not written in the book of the Chronicles of the kings of Israel?"},{"num":13,"verse":"And Joash slept with his fathers, and Jeroboam sat upon his seat: and Joash was buried in Samaria among the kings of Israel."},{"num":14,"verse":"¶ When Elisha fell sick of his sickness whereof he died, Joash the king of Israel came down unto him, and wept upon his face, and said, O my father, my father, the chariot of Israel, and the horsemen of the same."},{"num":15,"verse":"Then Elisha said unto him, Take a bow and arrows. And he took unto him bow and arrows."},{"num":16,"verse":"And he said to the king of Israel, Put thine hand upon the bow. And he put his hand upon it. And Elisha put his hands upon the king’s hands,"},{"num":17,"verse":"And said, Open the window Eastward. And when he had opened it, Elisha said, Shoot. And he shot. And he said, Behold, the arrow of the Lord’s deliverance, and the arrow of deliverance against Aram: for thou shalt smite the Aramites in Aphek, till thou hast consumed them."},{"num":18,"verse":"Again he said, Take the arrows. And he took them. And he said unto the king of Israel, Smite the ground. And he smote thrice, and ceased."},{"num":19,"verse":"Then the man of God was angry with him, and said, Thou shouldest have smitten five or six times, so thou shouldest have smitten Aram, till thou hadst consumed it, where now thou shalt smite Aram but thrice."},{"num":20,"verse":"¶ So Elisha died, and they buried him. And certain bands of the Moabites came into the land that year."},{"num":21,"verse":"And as they were burying a man: behold, they saw the soldiers: therefore they cast the man into the sepulcher of Elisha. And when the man was down, and touched the bones of Elisha, he revived and stood upon his feet."},{"num":22,"verse":"¶ But Hazael king of Aram vexed Israel all the days of Jehoahaz."},{"num":23,"verse":"Therefore the Lord had mercy on them and pitied them, and had respect unto them, because of his covenant with Abraham, Isaac, and Jacob, and would not destroy them, neither cast he them from him as yet."},{"num":24,"verse":"So Hazael the King of Aram died: and Ben-Hadad his son reigned in his stead."},{"num":25,"verse":"Therefore Jehoash the son of Jehoahaz returned, and took out of the hand of Ben-Hadad the son of Hazael the cities which he had taken away by war out of the hand of Jehoahaz his father: for three times did Joash beat him, and restored the cities unto Israel."}]