[[],[{"type":"header","content":"Jehoahaz of Israel"}],[{"type":"prose","content":"In the twenty-third year of Joash son of Ahaziah king of Judah, Jehoahaz son of Jehu became king of Israel in Samaria—a rule of seventeen years. He lived an evil life before , walking step for step in the tracks of Jeroboam son of Nebat who led Israel into a life of sin, swerving neither left or right. Exasperated,  was furious with Israel and turned them over to Hazael king of Aram and Ben-Hadad son of Hazael. This domination went on for a long time."}],[{"type":"prose","content":"Then Jehoahaz prayed for a softening of ’s anger, and  listened. He realized how wretched Israel had become under the brutalities of the king of Aram. So  provided a savior for Israel who brought them out from under Aram’s oppression. The children of Israel were again able to live at peace in their own homes. But it didn’t make any difference: They didn’t change their lives, didn’t turn away from the Jeroboam-sins that now characterized Israel, including the sex-and-religion shrines of Asherah still flourishing in Samaria."}],[{"type":"prose","content":"Nothing was left of Jehoahaz’s army after Hazael’s oppression except for fifty cavalry, ten chariots, and ten thousand infantry. The king of Aram had decimated the rest, leaving behind him mostly chaff."}],[{"type":"prose","content":"The rest of the life and times of Jehoahaz, the record of his accomplishments, are written in . Jehoahaz died and was buried with his ancestors in Samaria. His son Jehoash succeeded him as king."},{"type":"header","content":"Jehoash of Israel"}],[{"type":"prose","content":"In the thirty-seventh year of Joash king of Judah, Jehoash son of Jehoahaz became king of Israel in Samaria—a reign of sixteen years. In ’s eyes he lived an evil life. He didn’t deviate one bit from the sins of Jeroboam son of Nebat, who led Israel into a life of sin. He plodded along in the same tracks, step after step."}],[{"type":"prose","content":"The rest of the life and times of Jehoash, the record of his accomplishments and his war against Amaziah king of Judah, are written in . Jehoash died and joined his ancestors. Jeroboam took over his throne. Jehoash was buried in Samaria in the royal cemetery."}],[{"type":"prose","content":"Elisha came down sick. It was the sickness of which he would soon die. Jehoash king of Israel paid him a visit. When he saw him he wept openly, crying, “My father, my father! Chariot and horsemen of Israel!”"}],[{"type":"prose","content":"Elisha told him, “Go and get a bow and some arrows.” The king brought him the bow and arrows."}],[{"type":"prose","content":"Then he told the king, “Put your hand on the bow.” He put his hand on the bow. Then Elisha put his hand over the hand of the king."}],[{"type":"prose","content":"Elisha said, “Now open the east window.” He opened it.Then he said, “Shoot!” And he shot.“The arrow of ’s salvation!” exclaimed Elisha. “The arrow of deliverance from Aram! You will do battle against Aram until there’s nothing left of it.”"}],[{"type":"prose","content":"“Now pick up the other arrows,” said Elisha. He picked them up.Then he said to the king of Israel, “Strike the ground.”The king struck the ground three times and then quit."}],[{"type":"prose","content":"The Holy Man became angry with him: “Why didn’t you hit the ground five or six times? Then you would beat Aram until he was finished. As it is, you’ll defeat him three times only.”"}],[{"type":"prose","content":"Then Elisha died and they buried him.Some time later, raiding bands of Moabites, as they often did, invaded the country. One day, some men were burying a man and spotted the raiders. They threw the man into Elisha’s tomb and got away. When the body touched Elisha’s bones, the man came alive, stood up, and walked out on his own two feet."}],[{"type":"prose","content":"Hazael king of Aram badgered and bedeviled Israel all through the reign of Jehoahaz. But  was gracious and showed mercy to them. He stuck with them out of respect for his covenant with Abraham, Isaac, and Jacob. He never gave up on them, never even considered discarding them, even to this day. Hazael king of Aram died. His son Ben-Hadad was the next king."}],[{"type":"prose","content":"Jehoash son of Jehoahaz turned things around and took back the cities that Ben-Hadad son of Hazael had taken from his father Jehoahaz. Jehoash went to war three times and defeated him each time, recapturing the cities of Israel."}]]