[{"header":"Jehoahaz Rules Israel"},{"num":13,"verse":"In the twenty-third year of Ahaziah’s son Joash the king of Judah, Jehoahaz the son of Jehu became the king of Israel at Samaria. He ruled for seventeen years. "},{"num":2,"verse":"Jehoahaz did what was sinful in the eyes of the Lord. He followed the sins of Jeroboam the son of Nebat, which made Israel sin. He did not turn from them. "},{"num":3,"verse":"So the anger of the Lord burned against Israel. He put them always under the power of King Hazael of Syria, and Ben-hadad the son of Hazael. "},{"num":4,"verse":"Then Jehoahaz begged for the Lord’s favor, and the Lord listened to him. For He saw the bad power held over Israel. He saw how the king of Syria made it hard for them. "},{"num":5,"verse":"So the Lord gave Israel someone to save them. And they were saved from the power of the Syrians. The people of Israel lived in their tents as before. "},{"num":6,"verse":"But they did not turn away from the sins of the family of Jeroboam, which made Israel sin. They walked in those sins. And the object of the false goddess Asherah was left standing in Samaria. "},{"num":7,"verse":"The king of Syria did not leave to Jehoahaz an army of more than fifty horsemen, ten war-wagons and 10,000 foot-soldiers. For the king of Syria had destroyed them and made them like the dust of beaten grain. "},{"num":8,"verse":"Now the rest of the acts of Jehoahaz, all he did and his strength, are written in the Book of the Chronicles of the Kings of Israel. "},{"num":9,"verse":"When Jehoahaz died, they buried him in Samaria. And his son Joash became king in his place."},{"header":"Jehoash Rules Israel"},{"num":10,"verse":"In the thirty-seventh year of Joash king of Judah, Jehoash the son of Jehoahaz became king of Israel in Samaria. He ruled for sixteen years. "},{"num":11,"verse":"And he did what was sinful in the eyes of the Lord. He did not turn away from all the sins of Jeroboam the son of Nebat, in which he made Israel sin. But he walked in those sins. "},{"num":12,"verse":"Jehoash did many things. With his strength he fought against Amaziah king of Judah. The rest of his acts are written in the Book of the Chronicles of the Kings of Israel. "},{"num":13,"verse":"Jehoash died, and Jeroboam sat on his throne. Jehoash was buried in Samaria with the kings of Israel."},{"header":"The Death of Elisha"},{"num":14,"verse":"Elisha became sick with the sickness of which he was to die. And Joash the king of Israel came down to him and cried over him, saying, “My father, my father, the war-wagons of Israel and its horsemen!” "},{"num":15,"verse":"Elisha said to him, “Take a bow and arrows.” So he took a bow and arrows. "},{"num":16,"verse":"Then he said to the king of Israel, “Put your hand on the bow.” So he put his hand on it. Then Elisha laid his hands on the king’s hands. "},{"num":17,"verse":"And he said, “Open the window toward the east,” and he opened it. Then Elisha said, “Shoot!” And he shot. Elisha said, “The Lord’s arrow of winning the battle! The arrow of winning the battle against Syria! For you will fight the Syrians at Aphek until you have destroyed them. "},{"num":18,"verse":"Then Elisha said, “Take the arrows,” and he took them. He said to the king of Israel, “Hit the ground,” and he hit it three times, and stopped. "},{"num":19,"verse":"So the man of God was angry with him and said, “You should have hit it five or six times. Then you would have fought Syria until you had destroyed it. But now you will win the fight against Syria only three times.”"},{"num":20,"verse":"Elisha died, and they buried him. Now groups of Moabite soldiers would come and fight in the land in the spring of the year. "},{"num":21,"verse":"As a man was being buried, some Moabite soldiers were seen, so the man was thrown into Elisha’s grave. When the man touched the bones of Elisha, he came alive and stood up on his feet."},{"header":"The War between Israel and Syria"},{"num":22,"verse":"Now King Hazael of Syria had made it hard for Israel all the days of Jehoahaz. "},{"num":23,"verse":"But the Lord showed them kindness and loving-pity and turned to them because of His agreement with Abraham, Isaac and Jacob. He would not destroy them or put them away from Him until now. "},{"num":24,"verse":"When King Hazael of Syria died, his son Ben-hadad became king in his place. "},{"num":25,"verse":"Then Jehoash the son of Jehoahaz took back from Hazael’s son Ben-hadad the cities he had taken in war from his father Jehoahaz. Three times Joash won in battle against him and took back the cities of Israel."}]