[{"num":2,"verse":"¶ And in the second year of the reign of Nebuchadnezzar, Nebuchadnezzar dreamed dreams, with which his spirit was troubled, and his sleep fled from him."},{"num":2,"verse":"Then the king commanded to call magicians, astrologers, enchanters, and Chaldeans, that they might show the king his dreams. So they came and presented themselves before the king."},{"num":3,"verse":"And the king said unto them, I have dreamed a dream, and my spirit was troubled to know the dream."},{"num":4,"verse":"Then the Chaldeans spoke to the king in Syriack, O king, live for ever; tell thy servants the dream, and we will show the interpretation."},{"num":5,"verse":"The king answered and said to the Chaldeans, The thing is gone from my memory; if ye will not make known unto me the dream with its interpretation, ye shall be cut in pieces, and your houses shall be made a dunghill."},{"num":6,"verse":"But if ye show the dream and its interpretation, ye shall receive of me gifts and rewards and great honour: therefore show me the dream, and its interpretation."},{"num":7,"verse":"They answered the second time and said, Let the king tell his servants the dream, and we will show the interpretation of it."},{"num":8,"verse":"The king answered and said, I know of certainty that ye would gain time because ye see the thing is gone from my memory."},{"num":9,"verse":"But if ye will not make known unto me the dream, there is but one decree for you for ye certainly prepare lying and corrupt words to speak before me, until the time is changed; therefore tell me the dream, and I shall know that ye can show me its interpretation."},{"num":10,"verse":"The Chaldeans answered before the king, and said, There is not a man upon the earth that can show the king’s matter; furthermore there is no king, prince, nor lord that asked such a thing of any magician or astrologer or Chaldean."},{"num":11,"verse":"Finally, the thing that the king requires is singular, and there is no one that can show it before the king except the angels of God, whose dwelling is not with flesh."},{"num":12,"verse":"For this cause the king was angry and very furious and commanded to destroy all the wise men of Babylon."},{"num":13,"verse":"And the decree went forth, and the wise men were taken to be slain, and they sought Daniel and his fellows to kill them."},{"num":14,"verse":"¶ Then Daniel spoke with counsel and wisdom to Arioch the captain of the king’s guard, who was gone forth to slay the wise men of Babylon."},{"num":15,"verse":"He spoke and said to Arioch the king’s captain, What is the reason for which this decree has gone forth from the king with such haste? Then Arioch made the thing known to Daniel."},{"num":16,"verse":"And Daniel went in, and asked the king that he give him time and that he would show the king the interpretation."},{"num":17,"verse":"Then Daniel went to his house and made the thing known to Hananiah, Mishael, and Azariah, his companions,"},{"num":18,"verse":"to petition mercies of the God of heaven concerning this mystery and that Daniel and his fellows should not perish with the rest of the wise men of Babylon."},{"num":19,"verse":"Then the mystery was revealed unto Daniel in a night vision for which Daniel blessed the God of heaven."},{"num":20,"verse":"And Daniel spoke and said, Blessed be the name of God from age to age for wisdom and might are his;"},{"num":21,"verse":"and it is he that changes the times and the opportunities; he removes kings and sets up kings; he gives wisdom unto the wise and knowledge unto those that know understanding:"},{"num":22,"verse":"He reveals that which is deep and hidden; he knows what is in darkness, and the light dwells with him."},{"num":23,"verse":"Unto thee, O God of my fathers, do I confess and give thee praise that thou hast given me wisdom and might and now hast shown me what we asked of thee, for thou hast shown us the king’s matter."},{"num":24,"verse":"¶ After this Daniel went in unto Arioch, whom the king had ordained to destroy the wise men of Babylon; he went and said thus unto him, Do not destroy the wise men of Babylon; bring me in before the king, and I will show unto the king the interpretation."},{"num":25,"verse":"Then Arioch brought Daniel in before the king in haste and said thus unto him, I have found a man of the captives of Judah that will make known unto the king the interpretation."},{"num":26,"verse":"The king answered and said to Daniel, whose name was Belteshazzar, Art thou able to make me understand the dream which I have seen and its interpretation?"},{"num":27,"verse":"Daniel answered in the presence of the king and said, The mystery which the king demands cannot be shown unto the king by wise men, astrologers, magicians, nor fortune-tellers."},{"num":28,"verse":"But there is a God in the heavens who reveals the mysteries, and he has made known to the king Nebuchadnezzar what shall happen at the end of days. Thy dream, and the visions of thy head upon thy bed, is this:"},{"num":29,"verse":"Thou, O king, in thy bed, thy thoughts rose up to know what should come to pass in the future; and he that reveals the mysteries showed thee what shall come to pass."},{"num":30,"verse":"And unto me this mystery has been revealed, not for any wisdom that is in me more than in all those living but that I notify the interpretation to the king and that thou might understand the thoughts of thy heart."},{"num":31,"verse":"¶ Thou, O king, didst see and behold a great image. This image, which was very large and whose glory was very sublime, stood before thee, and its form was terrible."},{"num":32,"verse":"The head of this image was of fine gold, its breasts and its arms of silver, its belly and its thighs of brass,"},{"num":33,"verse":"its legs of iron, its feet part of iron and part of baked clay."},{"num":34,"verse":"Thou didst see until a stone was cut out, not with hands, which smote the image upon its feet that were of iron and baked clay and broke them to pieces."},{"num":35,"verse":"Then was the iron, the baked clay, the brass, the silver, and the gold broken to pieces together and became like the chaff of the summer threshingfloors; and the wind carried them away that no place was found for them again; and the stone that smote the image was made into a great mountain that filled the whole earth."},{"num":36,"verse":"This is the dream, and we will tell its interpretation before the king."},{"num":37,"verse":"Thou, O king, art king of kings, for the God of heaven has given thee the kingdom, the power, and the strength, and the majesty."},{"num":38,"verse":"And everything that is inhabited by children of men, beasts of the field, and fowls of the heaven, he has given into thine hand, and has made thee ruler over them all. Thou art this head of gold."},{"num":39,"verse":"And after thee shall arise another kingdom inferior to thee, and another third kingdom of brass, which shall bear rule over all the land."},{"num":40,"verse":"And the fourth kingdom shall be strong as iron; and as iron breaks in pieces and subdues all things, and as iron that breaks all these things, it shall break in pieces and bruise."},{"num":41,"verse":"And whereas thou didst see the feet and toes, part of baked potters’ clay and part of iron, the kingdom shall be divisive; but there shall be in it some of the strength of the iron, such as thou didst see the iron mixed with baked clay."},{"num":42,"verse":"And as the toes of the feet were part of iron and part of baked clay, so the kingdom shall be partly strong, and partly fragile."},{"num":43,"verse":"Concerning that which thou didst see, the iron mixed with baked clay, they shall mingle themselves with the seed of men, but they shall not cleave one to another, even as iron does not mix with clay."},{"num":44,"verse":"And in the days of those kings the God of heaven shall raise up a kingdom which eternally shall never become corrupted, and this kingdom shall not be left to another people, but it shall break in pieces and consume all these kingdoms, and it shall stand for ever."},{"num":45,"verse":"In the manner which thou didst see that out of the mountain was cut one stone, not with hands, and that it broke in pieces the iron, the brass, the clay, the silver, and the gold; the great God has shown the king what shall come to pass hereafter; and the dream is true, and its interpretation sure."},{"num":46,"verse":"¶ Then the king Nebuchadnezzar fell upon his face and humbled himself before Daniel and commanded that they should sacrifice presents and sweet odours unto him."},{"num":47,"verse":"The king answered unto Daniel and said, Certainly the God that is your God is God of gods and the Lord of the kings and the revealer of the mysteries, seeing thou could reveal this mystery."},{"num":48,"verse":"Then the king magnified Daniel and gave him many and great gifts and made him governor over the whole province of Babylon and prince of the governors over all the wise men of Babylon."},{"num":49,"verse":"And Daniel requested of the king, and he set Shadrach, Meshach, and Abednego, over the affairs of the province of Babylon; but Daniel was at the gate of the king."}]