[{"header":"The Model Prayer"},{"num":11,"verse":"He was praying in a certain place, and when He finished, one of His disciples said to Him, “Lord, teach us to pray, just as John also taught his disciples.”"},{"num":2,"verse":"He said to them, “Whenever you pray, say:"},{"header":"Keep Asking, Searching, Knocking"},{"num":5,"verse":"He also said to them: “Suppose one of you has a friend and goes to him at midnight and says to him, ‘Friend, lend me three loaves of bread, "},{"header":"A House Divided"},{"num":14,"verse":"Now He was driving out a demon that was mute. When the demon came out, the man who had been mute, spoke, and the crowds were amazed. "},{"num":15,"verse":"But some of them said, “He drives out demons by Beelzebul, the ruler of the demons!” "},{"num":16,"verse":"And others, as a test, were demanding of Him a sign from heaven."},{"num":17,"verse":"Knowing their thoughts, He told them: “Every kingdom divided against itself is headed for destruction, and a house divided against itself falls. "},{"header":"An Unclean Spirit’s Return"},{"header":"True Blessedness"},{"num":27,"verse":"As He was saying these things, a woman from the crowd raised her voice and said to Him, “The womb that bore You and the one who nursed You are blessed!”"},{"num":28,"verse":"He said, “Even more, those who hear the word of God and keep it are blessed!”"},{"header":"The Sign of Jonah"},{"num":29,"verse":"As the crowds were increasing, He began saying: “This generation is an evil generation. It demands a sign, but no sign will be given to it except the sign of Jonah. "},{"header":"The Lamp of the Body"},{"header":"Religious Hypocrisy Denounced"},{"num":37,"verse":"As He was speaking, a Pharisee asked Him to dine with him. So He went in and reclined at the table. "},{"num":38,"verse":"When the Pharisee saw this, he was amazed that He did not first perform the ritual washing before dinner. "},{"num":39,"verse":"But the Lord said to him: “Now you Pharisees clean the outside of the cup and dish, but inside you are full of greed and evil. "},{"num":45,"verse":"One of the experts in the law answered Him, “Teacher, when You say these things You insult us too.”"},{"num":46,"verse":"Then He said: “Woe also to you experts in the law! You load people with burdens that are hard to carry, yet you yourselves don’t touch these burdens with one of your fingers."},{"num":53,"verse":"When He left there, the scribes and the Pharisees began to oppose Him fiercely and to cross-examine Him about many things; "},{"num":54,"verse":"they were lying in wait for Him to trap Him in something He said."}]