[{"header":"Jesus gives a model prayer"},{"num":11,"verse":"One day it happened that Jesus was praying in a certain place, and after he had finished, one of his disciples said, “Lord, teach us how to pray, as John used to teach his disciples.”"},{"num":2,"verse":"“When you pray,” returned Jesus, “you should say, ‘Father, may your name be honoured—may your kingdom come! Give us each day the bread we need, and forgive us our sins, for we forgive anyone who owes anything to us; and keep us clear of temptation.’”"},{"header":"The willingness of the Father to answer prayer"},{"num":5,"verse":"Then he added, “If any of you has a friend, and goes to him in the middle of the night and says, ‘Lend me three loaves, my dear fellow, for a friend of mine has just arrived after a journey and I have no food to put in front of him’; and then he answers from inside the house, ‘Don’t bother me with your troubles. The front door is locked and my children and I have gone to bed. I simply cannot get up now and give you anything!’ Yet, I tell you, that even if he won’t get up and give him what he wants simply because he is his friend, yet if he persists, he will rouse himself and give him everything he needs.”"},{"num":9,"verse":"And so I tell you, ask and it will be given you, search and you will find, knock and the door will be opened to you. The one who asks will always receive; the one who is searching will always find, and the door is opened to the man who knocks.”"},{"num":11,"verse":"“Some of you are fathers, and if your son asks you for some fish, would you give him a snake instead, or if he asks you for an egg, would you make him a present of a scorpion? So, if you, for all your evil, know how to give good things to your children, how much more likely is it that your Heavenly Father will give the Holy Spirit to those who ask him!”"},{"header":"Jesus shows the absurdity of “his being in league with the devil”"},{"num":14,"verse":"Another time, Jesus was expelling an evil spirit which was preventing a man from speaking, and as soon as the evil spirit left him, the dumb man found his speech, to the amazement of the crowds."},{"num":15,"verse":"But some of them said, “He expels these spirits because he is in league with Beelzebub, the chief of the evil spirits.”"},{"num":16,"verse":"Others among them, to test him, tried to get a sign from Heaven out of him. But he knew what they were thinking and told them, “Any kingdom divided against itself is doomed and a disunited household will collapse. And if Satan disagrees with Satan, how does his kingdom continue?—for I know you are saying that I expel evil spirits because I am in league with Beelzebub. But if I do expel devils because I am an ally of Beelzebub, who is your own sons’ ally when they do the same thing? They can settle that question for you. But if it is by the finger of God that I am expelling evil spirits, ‘then the kingdom of God has swept over you unawares’!"},{"num":21,"verse":"“When a strong man armed to the teeth guards his own house, his property is in peace. But when a stronger man comes and conquers him, he removes all the arms on which he pinned his faith and divides the spoils among his friends."},{"num":23,"verse":"“Anyone who is not with me is against me, and the man who does not gather with me is really scattering."},{"header":"The danger of a spiritual vacuum in a man’s soul"},{"num":24,"verse":"“When the evil spirit comes out of a man, it wanders through waterless places looking for rest, and when it fails to find any, it says, ‘I will go back to my house from which I came.’ When it arrives, it finds it cleaned and all in order. Then it goes and collects seven other spirits more evil than itself to keep it company, and they all go in and make themselves at home. The last state of that man is worse than the first.”"},{"header":"Jesus brings sentimentality down to earth"},{"num":27,"verse":"And while he was still saying this, a woman in the crowd called out and said, “Oh, what a blessing for a woman to have brought you into the world and nursed you!”"},{"num":28,"verse":"But Jesus replied, “Yes, but a far greater blessing to hear the word of God and obey it.”"},{"header":"His scathing judgment in his contemporary generation"},{"num":29,"verse":"Then as the people crowded closely around him, he continued, “This is an evil generation! It looks for a sign and it will be given no sign except that of Jonah. Just as Jonah was a sign to the people of Nineveh, so will the Son of Man be a sign to this generation. When the judgment comes, the Queen of the South will rise up with the men of this generation and she will condemn them. For she came from the ends of the earth to listen to the wisdom of Solomon, and there is more than the wisdom of Solomon with you now! The men of Nineveh will stand up at the judgment with this generation and will condemn it. For they did repent when Jonah preached to them, and there is something more than Jonah’s preaching with you now!”"},{"header":"The need for complete sincerity"},{"num":33,"verse":"“No one takes a lamp and puts it in a cupboard or under a bucket, but on a lamp-stand, so that those who come in can see the light.”"},{"num":34,"verse":"“The lamp of your body is your eye. When your eye is sound, your whole body is full of light, but when your eye is evil, your whole body is full of darkness. So be very careful that your light never becomes darkness. For if your whole body is full of light, with no part of it in shadow, it will all be radiant—it will be like having a bright lamp to give you light.”"},{"num":37,"verse":"While he was talking, a Pharisee invited him to dinner. So he went into his house and sat down at table. The Pharisee noticed with some surprise that he did not wash before the meal. But the Lord said to him, “You Pharisees are fond of cleaning the outside of your cups and dishes, but inside yourselves you are full of greed and wickedness! Have you no sense? Don’t you realise that the one who made the outside is the maker of the inside as well? If you would only make the inside clean by doing good to others, the outside things become clean as a matter of course! But alas for you Pharisees, for you pay out your tithe of mint and rue and every little herb, and lose sight of the justice and love of God. Yet these are the things you ought to have been concerned with—it need not mean leaving the lesser duties undone. Yes, alas for you Pharisees, who love the front seats in the synagogues and having men bow down to you in public! Alas for you, for you are like unmarked graves—men walk over your corruption without knowing it is there.”"},{"header":"Jesus denounces the learned for obscuring the truth"},{"num":45,"verse":"Then one of the experts in the Law said to him, “Master, when you say things like this, you are insulting us as well.” And he returned, “Yes, and I do blame you experts in the Law! For you pile up back-breaking burdens for men to bear, but you yourselves will not raise a finger to lift them. Alas for you, for you build memorial tombs for the prophets—the very men whom your fathers murdered. You show clearly enough how you approve your father’s actions. They did the actual killing and you put up a memorial to it. That is why the wisdom of God has said, ‘I will send them prophets and apostles; some they will kill and some they will persecute!’ So that the blood of all the prophets shed from the foundation of the earth, from Abel to Zachariah who died between the altar and the sanctuary, shall be charged to this generation!"},{"num":52,"verse":"“Alas for you experts in the Law, for you have taken away the key of knowledge. You have never gone in yourselves and you have hindered everyone else who was at the door!”"},{"num":53,"verse":"And when he left the house, the scribes and the Pharisees began to regard him with bitter animosity and tried to draw him out on a great many subjects, waiting to pounce on some incriminating remark."}]