[{"num":7,"verse":"1 A complaint for the small number of the righteous. 4 The wickedness of those times. 14 The prosperity of the Church."},{"num":1,"verse":"Woe is me, for I am as the Summer gatherings, and as the grapes of the vintage: there is no cluster to eat: my soul desired the first ripe fruits."},{"num":2,"verse":"The good man is perished out of the earth, and there is none righteous among men: they all lie in wait for blood: every man hunteth his brother with a net."},{"num":3,"verse":"To make good for the evil of their hands, the prince asked, and the judge judgeth for a reward: therefore the great man he speaketh out the corruption of his soul: so they wrapped it up."},{"num":4,"verse":"The best of them is as a brier, and the most righteous of them is sharper than a thorn-hedge: the day of thy watchmen and thy visitation cometh: then shall be their confusion."},{"num":5,"verse":"Trust ye not in a friend, neither put ye confidence in a counselor: keep the doors of thy mouth from her that lieth in thy bosom."},{"num":6,"verse":"For the son revileth the father: the daughter riseth up against her mother, the daughter-in-law against her mother-in-law, and a man’s enemies are the men of his own house."},{"num":7,"verse":"Therefore I will look unto the Lord: I will wait for God my Savior: my God will hear me."},{"num":8,"verse":"Rejoice not against me, O mine enemy: though I fall, I shall arise, when I shall sit in darkness, the Lord shall be a light unto me."},{"num":9,"verse":"I will bear the wrath of the Lord, because I have sinned against him, until he plead my cause, and execute judgment for me: then will he bring me forth to the light, and I shall see his righteousness."},{"num":10,"verse":"Then she that is mine enemy, shall look upon it, and shame shall cover her, which said unto me, Where is the Lord thy God? Mine eyes shall behold her: now shall she be trodden down as the mire of the streets."},{"num":11,"verse":"This is the day, that thy walls shall be built: this day shall drive far away the decree."},{"num":12,"verse":"In this day also they shall come unto thee from Assyria, and from the strong cities, and from the strongholds even unto the river, and from Sea to Sea, and from mountain to mountain."},{"num":13,"verse":"Notwithstanding the land shall be desolate because of them that dwell therein, and for the fruits of their inventions."},{"num":14,"verse":"Feed thy people with thy rod, the flock of thine heritage (which dwell solitary in the wood) as in the midst of Carmel: let them feed in Bashan and Gilead, as in old time."},{"num":15,"verse":"According to the days of thy coming out of the land of Egypt, will I show unto him marvelous things."},{"num":16,"verse":"The nations shall see, and be confounded for all their power: they shall lay their hand upon their mouth: their ears shall be deaf."},{"num":17,"verse":"They shall lick the dust like a serpent: they shall move out of their holes like worms: they shall be afraid of the Lord our God, and shall fear because of thee."},{"num":18,"verse":"Who is a God like unto thee, that taketh away iniquity, and passeth by the transgression of the remnant of his heritage! He retaineth not his wrath forever, because mercy pleaseth him."},{"num":19,"verse":"He will turn again, and have compassion upon us: he will subdue our iniquities, and cast all their sins into the bottom of the sea."},{"num":20,"verse":"Thou wilt perform thy truth to Jacob, and mercy to Abraham, as thou hast sworn unto our fathers in old time."}]