[{"num":7,"verse":"So the people of Kiriath Jearim got the Lord's Covenant Box and took it to the house of a man named Abinadab, who lived on a hill. They consecrated his son Eleazar to be in charge of it."},{"header":"Samuel Rules Israel"},{"num":2,"verse":"The Covenant Box of the Lord stayed in Kiriath Jearim a long time, some twenty years. During this time all the Israelites cried to the Lord for help."},{"num":3,"verse":"Samuel said to the people of Israel, “If you are going to turn to the Lord with all your hearts, you must get rid of all the foreign gods and the images of the goddess Astarte. Dedicate yourselves completely to the Lord and worship only him, and he will rescue you from the power of the Philistines.” "},{"num":4,"verse":"So the Israelites got rid of their idols of Baal and Astarte, and worshiped only the Lord."},{"num":5,"verse":"Then Samuel called for all the Israelites to meet at Mizpah, telling them, “I will pray to the Lord for you there.” "},{"num":6,"verse":"So they all gathered at Mizpah. They drew some water and poured it out as an offering to the Lord and fasted that whole day. They said, “We have sinned against the Lord.” (It was at Mizpah where Samuel settled disputes among the Israelites.)"},{"num":7,"verse":"When the Philistines heard that the Israelites had gathered at Mizpah, the five Philistine kings started out with their men to attack them. The Israelites heard about it and were afraid, "},{"num":8,"verse":"and said to Samuel, “Keep praying to the Lord our God to save us from the Philistines.” "},{"num":9,"verse":"Samuel killed a young lamb and burned it whole as a sacrifice to the Lord. Then he prayed to the Lord to help Israel, and the Lord answered his prayer. "},{"num":10,"verse":"While Samuel was offering the sacrifice, the Philistines moved forward to attack; but just then the Lord thundered from heaven against them. They became completely confused and fled in panic. "},{"num":11,"verse":"The Israelites marched out from Mizpah and pursued the Philistines almost as far as Bethcar, killing them along the way."},{"num":12,"verse":"Then Samuel took a stone, set it up between Mizpah and Shen, and said, “The Lord has helped us all the way”—and he named it “Stone of Help.” "},{"num":13,"verse":"So the Philistines were defeated, and the Lord prevented them from invading Israel's territory as long as Samuel lived. "},{"num":14,"verse":"All the cities which the Philistines had captured between Ekron and Gath were returned to Israel, and so Israel got back all its territory. And there was peace also between the Israelites and the Canaanites."},{"num":15,"verse":"Samuel ruled Israel as long as he lived. "},{"num":16,"verse":"Every year he would go around to Bethel, Gilgal, and Mizpah, and in these places he would settle disputes. "},{"num":17,"verse":"Then he would go back to his home in Ramah, where also he would serve as judge. In Ramah he built an altar to the Lord."}]