[{"num":7,"verse":"The men of Kiriath Jearim came to take the Lord’s ark and brought it into Abinadab’s house on the hill. They gave Abinadab’s son Eleazar the holy occupation of guarding the Lord’s ark."},{"header":"Israel Admits It Has Sinned"},{"num":2,"verse":"A long time passed after the ark came to stay at Kiriath Jearim. For 20 years the entire nation of Israel mournfully sought the Lord."},{"num":3,"verse":"Samuel told the entire nation of Israel, “If you are returning to the Lord wholeheartedly, get rid of the foreign gods you have, including the statues of the goddess Astarte. Make a commitment to the Lord, and serve only him. Then he will rescue you from the Philistines.”"},{"num":4,"verse":"So the Israelites got rid of the statues of Baal and Astarte and served only the Lord."},{"num":5,"verse":"Then Samuel said, “Gather all the Israelites together at Mizpah, and I will pray to the Lord for you.” "},{"num":6,"verse":"So the Israelites gathered together at Mizpah. They drew some water, poured it out in front of the Lord, and fasted that day. They confessed, “We have sinned against the Lord.” So Samuel judged Israel in Mizpah."},{"header":"The Philistines Defeated"},{"num":7,"verse":"When the Philistines heard that the Israelites had gathered at Mizpah, the Philistine rulers came to attack Israel. The Israelites heard ⌞about the Philistine plan⌟ and were afraid of them. "},{"num":8,"verse":"The Israelites said to Samuel, “Don’t turn a deaf ear to us! Don’t stop crying to the Lord our God for us! Ask him to save us from the Philistines!”"},{"num":9,"verse":"Then Samuel took a lamb, one still feeding on milk, and sacrificed it as a burnt offering to the Lord. Samuel cried to the Lord on behalf of Israel, and the Lord answered him. "},{"num":10,"verse":"While Samuel was sacrificing the burnt offering, the Philistines came to fight against Israel. On that day the Lord thundered loudly at the Philistines and threw them into such confusion that they were defeated by Israel. "},{"num":11,"verse":"Israel’s soldiers left Mizpah, pursued the Philistines, and killed them as far as Beth Car."},{"num":12,"verse":"Then Samuel took a rock and set it up between Mizpah and Shen. He named it Ebenezer [Rock of Help] and said, “Until now the Lord has helped us.”"},{"num":13,"verse":"The power of the Philistines was crushed, so they didn’t come into Israel’s territory again. The Lord restrained the Philistines as long as Samuel lived. "},{"num":14,"verse":"The cities between Ekron and Gath which the Philistines took from Israel were returned to Israel. And Israel recovered the territory controlled by these cities from the Philistines. There was also peace between Israel and the Amorites."},{"num":15,"verse":"Samuel judged Israel as long as he lived. "},{"num":16,"verse":"Every year he went around to Bethel, Gilgal, and Mizpah in order to judge Israel in all those places. "},{"num":17,"verse":"Then he would return home to Ramah. There, too, he judged Israel. And in Ramah he built an altar to the Lord."}]