[{"header":"Revival and Victory at Mizpah"},{"num":7,"verse":"The men of Kiriath Jearim came and brought up the ark of Yahweh, and they brought it to the house of Abinadab in Gibeah. They consecrated Eleazer his son to guard the ark of Yahweh. "},{"num":2,"verse":"From the day the ark stayed in Kiriath Jearim, days multiplied and became twenty years while all the house of Israel mourned after Yahweh. "},{"num":3,"verse":"And Samuel spoke to all the house of Israel, saying, “If with all your heart you are turning to Yahweh, remove the foreign gods and Ashtoreths from your midst. Commit your hearts to Yahweh and serve him alone. Then he will deliver you from the hand of the Philistines.” "},{"num":4,"verse":"So the Israelites removed the Baals and the Ashtoreths, and they served Yahweh alone."},{"num":5,"verse":"Then Samuel said, “Gather all Israel to Mizpah, and I will pray to Yahweh for you.” "},{"num":6,"verse":"So they gathered to Mizpah and drew water and poured it out before Yahweh. They fasted on that day and said there, “We have sinned against Yahweh!” So Samuel judged the Israelites at Mizpah. "},{"num":7,"verse":"Now when the Philistines heard that the Israelites had gathered at Mizpah, the rulers of the Philistines went up against Israel. And when the Israelites heard of it, they were afraid of the Philistines. "},{"num":8,"verse":"Then the Israelites said to Samuel, “You must not cease from crying out to Yahweh our God, so that he will deliver us from the hand of the Philistines.” "},{"num":9,"verse":"So Samuel took a single nursing lamb and sacrificed it as a whole burnt offering to Yahweh. Then Samuel cried out to Yahweh on behalf of Israel, and Yahweh answered him. "},{"num":10,"verse":"While Samuel was sacrificing the burnt offering, the Philistines drew near for the battle against Israel. But Yahweh thundered against the Philistines with a great noise on that day and threw them into confusion so that they were defeated before Israel. "},{"num":11,"verse":"Then the men of Israel went out from Mizpah and pursued the Philistines and they struck them down as far as below Beth Car."},{"num":12,"verse":"So Samuel took a single stone and put it between Mizpah and Shen, and he named it Ebenezer and said, “Up to here Yahweh has helped us.” "},{"num":13,"verse":"So the Philistines were subdued and they did not come into the territory of Israel again, and the hand of Yahweh was against the Philistines all the days of Samuel. "},{"num":14,"verse":"The towns which the Philistines had taken from Israel were returned to Israel from Ekron to Gath, and Israel delivered their territories from the hand of the Philistines. Then there was peace between Israel and the Amorites."},{"header":"The Circuit Ministry of Samuel"},{"num":15,"verse":"Samuel judged Israel all the days of his life. "},{"num":16,"verse":"He used to go on the circuit from year to year. He went around Bethel, Gilgal, and Mizpah, and he judged Israel in all these places. "},{"num":17,"verse":"Then he returned to Ramah, because his house was there, and there he judged Israel, and he built an altar to Yahweh there."}]