[{"num":7,"verse":"Therefore men of Kiriathjearim came, and led again the ark of the Lord, and brought it into the house of Abinadab in Gibeah. And they hallowed Eleazar his son, that he should keep the ark of the Lord. (And so some men of Kiriathjearim came, and took the Ark of the Lord, and they brought it to the house of Abinadab on the hill. And they consecrated his son Eleazar, so that he could be in charge of the Ark of the Lord.)"},{"num":2,"verse":"And it was done, from which day the ark of the Lord dwelled in Kiriathjearim, (that the) days were multiplied; for the twentieth year was now, after that Samuel began to teach the people; and all Israel rested after the Lord (and all Israel cried out to the Lord for help)."},{"num":3,"verse":"And Samuel spake to all the house of Israel, and said, If in all your heart ye turn again to the Lord, do ye away alien gods (do ye away foreign, or other, gods), (the) Baalim, and (the) Ashtaroth, from the midst of you; and make ye ready your hearts to the Lord, and serve ye him alone; and (then) he shall deliver you from the hand of the Philistines."},{"num":4,"verse":"Therefore the sons of Israel did away Baalim and Ashtaroth, and served the Lord alone. (And so the Israelites did away the Baalim and the Ashtaroth, and served the Lord alone.)"},{"num":5,"verse":"And Samuel said, Gather ye all Israel into Mizpah, that I pray the Lord for you (and I shall pray to the Lord for you)."},{"num":6,"verse":"And they came together into Mizpeh, and drew water, and poured it out in the Lord’s sight; and they fasted in that day, and said, Lord, we have sinned to thee (and said, Lord, we have sinned against thee). And Samuel deemed the sons of Israel in Mizpeh."},{"num":7,"verse":"And the Philistines heard that the sons of Israel were gathered together in Mizpeh; and the princes of Philistines went up to Israel. And when the sons of Israel had heard this, they dreaded of the face of (the) Philistines. (And the Philistines heard that the Israelites were gathered together in Mizpeh; and the princes of the Philistines came up against Israel. And when the Israelites had heard this, they feared to face the Philistines.)"},{"num":8,"verse":"And they said to Samuel/And Israel cried to Samuel, Cease thou not to cry for us to our Lord God, that he save us from the hand of Philistines. (And the Israelites cried to Samuel, Cease thou not to cry out to the Lord our God for us, so that he will save us from the hands of the Philistines.)"},{"num":9,"verse":"And Samuel took one sucking lamb, and offered it whole into burnt sacrifice to the Lord (And Samuel took a sucking lamb, and offered it whole for a burnt sacrifice to the Lord). And Samuel cried to the Lord for Israel; and the Lord heard him."},{"num":10,"verse":"And it was done, when Samuel offered the burnt sacrifice, that the Philistines began (to do) battle against Israel. And the Lord thundered with great thunder in that day upon the Philistines, and made them afeared; and they were slain of the sons of Israel (and they fled in panic before the Israelites)."},{"num":11,"verse":"And the sons of Israel went out of Mizpeh, and pursued the Philistines, and smote them unto the place that was under Bethcar."},{"num":12,"verse":"And Samuel took one stone, and put it betwixt Mizpeh, and Shen; and he called the name of that place The stone of help (and he called the name of that place Ebenezer). And he said, Hitherto the Lord hath helped us."},{"num":13,"verse":"And the Philistines were made low, and they added no more to come into the terms of Israel (And so the Philistines were humbled, and they did not come any more into the land of Israel). And so the hand of the Lord was made [up]on (the) Philistines in all the days of Samuel."},{"num":14,"verse":"And the cities which the Philistines had taken from Israel, were yielded again to Israel, from Ekron unto Gath, and the coasts of Gath; and the Lord delivered Israel from the hand of (the) Philistines; and peace was betwixt Israel and Amorites (and there was peace between Israel and the Amorites)."},{"num":15,"verse":"And Samuel deemed Israel all the days of his life, that is, till to the ordaining and confirming of Saul;"},{"num":16,"verse":"and he went by each year, and compassed Bethel, and Gilgal, and Mizpeh, and he deemed Israel in the foresaid places."},{"num":17,"verse":"And he turned again into Ramah, for his house was there; and he deemed Israel there, and he builded there also an altar to the Lord. (And then he returned to Ramah, for his house was there; and he judged Israel there, and he also built an altar there to the Lord.)"}]