[{"header":"Job Loses His Health"},{"num":2,"verse":"Again there was a day when the sons of God (angels) came to present themselves before the Lord, and Satan (adversary, accuser) also came among them to present himself before the Lord. "},{"num":2,"verse":"The Lord said to Satan, “From where have you come?” Then Satan answered the Lord, “From roaming around on the earth and from walking around on it.” "},{"num":3,"verse":"The Lord said to Satan, “Have you considered and reflected on My servant Job? For there is none like him on the earth, a blameless and upright man, one who fears God [with reverence] and abstains from and turns away from evil [because he honors God]. And still he maintains and holds tightly to his integrity, although you incited Me against him to destroy him without cause.” "},{"num":4,"verse":"Satan answered the Lord, “Skin for skin! Yes, a man will give all he has for his life. "},{"num":5,"verse":"But put forth Your hand now, and touch his bone and his flesh [and severely afflict him]; and he will curse You to Your face.” "},{"num":6,"verse":"So the Lord said to Satan, “Behold, he is in your hand, only spare his life.”"},{"num":7,"verse":"So Satan departed from the presence of the Lord and struck Job with loathsome boils and agonizingly painful sores from the sole of his foot to the crown of his head. "},{"num":8,"verse":"And Job took a piece of broken pottery with which to scrape himself, and he sat [down] among the ashes (rubbish heaps)."},{"num":9,"verse":"Then his wife said to him, “Do you still cling to your integrity [and your faith and trust in God, without blaming Him]? Curse God and die!” "},{"num":10,"verse":"But he said to her, “You speak as one of the [spiritually] foolish women speaks [ignorant and oblivious to God’s will]. Shall we indeed accept [only] good from God and not [also] accept adversity and disaster?” In [spite of] all this Job did not sin with [words from] his lips."},{"num":11,"verse":"Now when Job’s three friends heard of all this adversity that had come upon him, each one came from his own place, Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite; for they had made an appointment together to come to sympathize with him and to comfort him. "},{"num":12,"verse":"When they looked from a distance and did not recognize him [because of his disfigurement], they raised their voices and wept; and each one tore his robe [in grief] and they threw dust over their heads toward the sky [in sorrow]. "},{"num":13,"verse":"So they sat down on the ground with Job for seven days and seven nights and no one spoke a word to him, for they saw that his pain was very great."}]