[{"header":"Satan’s Second Attack on Job"},{"num":2,"verse":"Some time later, divine beings again presented themselves to the Lord, and Satan accompanied them to present himself to the Lord. "},{"num":2,"verse":"The Lord asked Satan, “Where have you come from?”"},{"num":3,"verse":"The Lord asked Satan, “Have you considered my servant Job? There is no one like him on earth. The man is blameless as well as upright. He fears God and keeps away from evil. He remains firm in his integrity, even though you have been urging me to overwhelm him without cause.”"},{"num":4,"verse":"Satan answered the Lord, “Skin for skin! The man will give up everything that he owns in exchange for his health. "},{"num":5,"verse":"However, stretch out your hand and strike his bones and flesh, and he’ll curse you to your face, won’t he?”"},{"num":6,"verse":"Then the Lord told Satan, “Very well then, he is under your control. Just preserve his life.”"},{"num":7,"verse":"So Satan left the Lord’s presence and struck Job with terrible boils from the sole of his feet to the top of his head. "},{"num":8,"verse":"Job took a broken piece of pottery to scrape himself while sitting among the ashes."},{"header":"Job Refuses to Curse God"},{"num":9,"verse":"Then his wife told him, “Do you remain firm in your integrity? Curse God and die!”"},{"num":10,"verse":"But he replied to her, “You’re talking like foolish women do. Are we to accept what is good from God but not tragedy?”"},{"header":"Job’s Friends Visit"},{"num":11,"verse":"When Job’s three friends heard all these tragedies that happened to him, they each traveled from their home towns to visit him. Eliphaz came from Teman, Bildad came from Shuah, and Zophar came from Naamath. They met together and went to console and comfort him. "},{"num":12,"verse":"Observing him from a distance, at first they didn’t even recognize him, so they raised their voices and burst into tears. They each ripped their robes, threw ashes into the air on their heads, "},{"num":13,"verse":"and sat with Job on the ground for a full week without saying a word, since they could see the great extent of his anguish."}]