[{"header":"Chapter 2"},{"num":1,"verse":"Have You Paid Any Notice to My Servant Job? On another occasion the sons of God came forward to present themselves before the Lord, and Satan accompanied them."},{"num":2,"verse":"The Lord said to Satan, “Where have you come from?” Satan answered the Lord and said, “I have been roaming the earth and going back and forth in it.”"},{"num":3,"verse":"The Lord said to Satan, “Have you paid any notice to my servant Job? You will not find anyone like him on the entire earth. He is a good and righteous man who fears God and shuns evil. He still maintains his integrity, even though you incited me to ruin him without the slightest justification.”"},{"num":4,"verse":"Satan answered the Lord, “Skin for skin! A man will surrender everything he has to save his own life."},{"num":5,"verse":"But now if you stretch forth your hand and touch his bone and his flesh, he will curse you to your face.”"},{"num":6,"verse":"The Lord said to Satan, “He is in your power, but you must spare his life.”"},{"num":7,"verse":"Job Did Not Utter a Single Sinful Word. Therefore, when Satan left the Lord’s presence, he afflicted Job with malignant sores from the soles of his feet to the top of his head."},{"num":8,"verse":"Job took a potsherd to scrape himself as he sat among the ashes."},{"num":9,"verse":"Then his wife said to him, “When will you give up persisting in your integrity? Curse God and die!”"},{"num":10,"verse":"He replied, “You are talking like a foolish woman. If we accept good things from God, should we not be willing to accept sorrows as well?” In all this, Job did not utter a single sinful word."},{"num":11,"verse":"The Three Friends. When three of Job’s friends heard of all the misfortunes that he had endured, each of them set out from his own home—Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite. After they gathered together, they went forth to console and comfort him."},{"num":12,"verse":"However, when they first saw Job from a distance, they could hardly recognize him, and they wept aloud, tore their cloaks, and threw dust into the air over their heads."},{"num":13,"verse":"Then they sat there with him upon the ground for seven days and seven nights. None of them spoke a word to him, for they could clearly see how greatly he was suffering."}]