[{"num":2,"verse":"On another day angels came to the Lord. Satan also came to him along with them. "},{"num":2,"verse":"The Lord said to Satan, “Where have you come from?”"},{"num":3,"verse":"Then the Lord said to Satan, “Have you thought about my servant Job? There isn’t anyone on earth like him. He is honest. He does what is right. He has respect for God and avoids evil. You tried to turn me against him. You wanted me to destroy him without any reason. But he still continues to be faithful.”"},{"num":4,"verse":"Satan replied, “A man will give everything he has to save himself. So Job is willing to give up the lives of his family to save his own life. "},{"num":5,"verse":"But now reach out your hand and strike his flesh and bones. Then I’m sure he will speak evil things against you. In fact, he’ll do it right in front of you.”"},{"num":6,"verse":"The Lord said to Satan, “All right. I am handing him over to you. But you must spare his life.”"},{"num":7,"verse":"Then Satan left the Lord and went on his way. He sent painful sores on Job. They covered him from the bottom of his feet to the top of his head. "},{"num":8,"verse":"He got part of a broken pot. He used it to scrape his skin. He did it while he was sitting in ashes."},{"num":9,"verse":"His wife said to him, “Are you still continuing to be faithful to the Lord? Speak evil things against him and die!”"},{"num":10,"verse":"Job replied, “You are talking like a foolish woman. We accept good things from God. So we should also accept trouble when he sends it.”"},{"num":11,"verse":"Job had three friends named Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite. They heard about all the troubles that had come to Job. So they started out from their homes. They had agreed to meet together. They wanted to go and show their concern for Job. They wanted to comfort him. "},{"num":12,"verse":"When they got closer to where he lived, they could see him. But they could hardly recognize him. They began to weep out loud. They tore their robes and sprinkled dust on their heads. "},{"num":13,"verse":"Then they sat down on the ground with him for seven days and seven nights. No one said a word to him. That’s because they saw how much he was suffering."}]