[{"num":2,"verse":"And it was done, in a day the sons of God were come to praise him, and they stood before the Lord, and Satan was come among them, and he stood in the sight of the Lord, (And it was done, on a day when the sons of God had come to praise him, and they stood before the Lord, and Satan was come among them, and he also stood before the Lord,)"},{"num":2,"verse":"and the Lord said to Satan, From whence comest thou? Which answered, and said, I have compassed the earth, and I have gone through it. (and the Lord said to Satan, Where did you come from? Who answered, and said, I have gone all around the earth, and I have gone throughout it.)"},{"num":3,"verse":"And the Lord said to Satan, Whether thou hast not considered my servant Job, that none in [the] earth is like him; he is a simple man, and rightful, and dreading God, and going away from evil, and yet holding innocence? But thou hast moved me against him, that I should torment him in vain/that thou vex him in vain. (And the Lord said to Satan, Hast thou seen my servant Job? there is one on earth like him; he is without guile, and upright, and feareth God/and revereth God, and goeth away from evil, and remaineth innocent. But thou hast moved me against him, that I should torment him without cause/that thou should vex him for no reason.)"},{"num":4,"verse":"To whom Satan answered, and said, A man shall give skin for skin, and all things that he hath for his life;"},{"num":5,"verse":"therefore put to thine hand, and touch his bone and his flesh, and then thou shalt see, that he shall curse thee in thy face. (and so put thy hand against him, and touch his bones and his flesh, and then thou shalt see that he shall curse thee to thy face.)"},{"num":6,"verse":"Therefore the Lord said to Satan, Lo! he is in thine hand; nevertheless keep thou his life. (And so the Lord said to Satan, Lo! he is in thy hands, or under thy power; but do not thou kill him.)"},{"num":7,"verse":"Therefore Satan went out from the face of the Lord, and he smote Job with the worst stinking botch, from the sole of his foot till to his top; (And so Satan went out from before the Lord, and he struck Job with running sores, from the soles of his feet unto the top of his head;)"},{"num":8,"verse":"and Job sat in a dunghill, and he shaved away the quitter of him with a shell. (and then Job sat on a hill of dung, and scratched his sores with a shell.)"},{"num":9,"verse":"Forsooth his wife said to him, Dwellest thou yet in thy simpleness, that is, fondness? (And his wife said to him, Remaineth thou yet in thy integrity, that is, in thy foolishness?) Curse thou God, and die."},{"num":10,"verse":"And Job said to her, Thou hast spoken as one of the fond women; if we have taken goods of the hand of the Lord, why forsooth suffer we not evils? In all these things Job sinned not in his lips. (And Job said to her, Thou hast spoken like the foolish woman that thou art; if we have received good from the Lord’s hand, then why should we not also suffer evil? And so in all these things Job did not sin with his lips.)"},{"num":11,"verse":"And then three friends of Job heard (of) all the evil that had befallen to him, and they came to him, each of them from his place, Eliphaz (the) Temanite, and Bildad (the) Shuhite, and Zophar (the) Naamathite; for they had said together to themselves, that they would come together, and visit Job, and comfort him."},{"num":12,"verse":"And when they had raised afar their eyes, they knew not him; and they cried [out], and wept, and rent their clothes, and sprinkled dust on their head(s) into heaven. (And when they had raised up their eyes from afar, they did not know him, or they could not recognize him; and they cried out, and wept, and tore their clothes, and sprinkled dust on their heads toward the heavens.)"},{"num":13,"verse":"And they sat with him in the earth seven days and seven nights, and no man spake a word to him; for they saw, that his sorrow was great. (And then they sat on the ground with him for seven days and seven nights, and no one spoke a word to him; for they saw, that his sorrow was great.)"}]