[[],[{"type":"header","content":"Proud to Be Called Israel"},{"type":"poetry","content":""},{"type":"poetry","content":" who made you has something to say to you;"},{"type":"poetry","content":""},{"type":"poetry","content":"Don’t be afraid, dear servant Jacob,"},{"type":"poetry","content":""},{"type":"poetry","content":"For I will pour water on the thirsty ground"},{"type":"poetry","content":""},{"type":"poetry","content":"I will pour my Spirit into your descendants"},{"type":"poetry","content":""},{"type":"poetry","content":"They shall sprout like grass on the prairie,"},{"type":"poetry","content":""},{"type":"poetry","content":"This one will say, ‘I am ’s,’"},{"type":"poetry","content":""},{"type":"poetry","content":"That one will write on his hand ‘’s property’—"},{"type":"poetry","content":""},{"type":"header","content":"Lover of Emptiness"}],[{"type":"prose","content":"All those who make no-god idols don’t amount to a thing, and what they work so hard at making is nothing. Their little puppet-gods see nothing and know nothing—they’re total embarrassments! Who would bother making gods that can’t do anything, that can’t ? Watch all the no-god worshipers hide their faces in shame. Watch the no-god makers slink off humiliated when their idols fail them. Get them out here in the open. Make them face God-reality."}],[{"type":"prose","content":"The blacksmith makes his no-god, works it over in his forge, hammering it on his anvil—such hard work! He works away, fatigued with hunger and thirst."}],[{"type":"prose","content":"The woodworker draws up plans for his no-god, traces it on a block of wood. He shapes it with chisels and planes into human shape—a beautiful woman, a handsome man, ready to be placed in a chapel. He first cuts down a cedar, or maybe picks out a pine or oak, and lets it grow strong in the forest, nourished by the rain. Then it can serve a double purpose: Part he uses as firewood for keeping warm and baking bread; from the other part he makes a god that he worships—carves it into a god shape and prays before it. With half he makes a fire to warm himself and barbecue his supper. He eats his fill and sits back satisfied with his stomach full and his feet warmed by the fire: “Ah, this is the life.” And he still has half left for a god, made to his personal design—a handy, convenient no-god to worship whenever so inclined. Whenever the need strikes him he prays to it, “Save me. You’re my god.”"}],[{"type":"prose","content":"Pretty stupid, wouldn’t you say? Don’t they have eyes in their heads? Are their brains working at all? Doesn’t it occur to them to say, “Half of this tree I used for firewood: I baked bread, roasted meat, and enjoyed a good meal. And now I’ve used the rest to make a repulsive no-god. Here I am praying to a stick of wood!”"}],[{"type":"prose","content":"This lover of emptiness, of nothing, is so out of touch with reality, so far gone, that he can’t even look at what he’s doing, can’t even look at the no-god stick of wood in his hand and say, “This is crazy.”* * *"}],[{"type":"poetry","content":"“Remember these things, O Jacob."},{"type":"poetry","content":""},{"type":"poetry","content":"I made you,  you: You’re my servant."},{"type":"poetry","content":""},{"type":"poetry","content":"I’ve wiped the slate of all your wrongdoings."},{"type":"poetry","content":""},{"type":"poetry","content":"Come back to me, come back."},{"type":"poetry","content":""}]]