[{"num":44,"verse":"Yet now hear, O Ya’akov Avdi; and Yisroel, whom I have chosen;"},{"num":2,"verse":"Thus saith Hashem that made thee, and formed thee from the beten (womb), Who will help thee; Fear not, O Ya’akov, Avdi; and thou, Yeshurun, whom I have chosen."},{"num":3,"verse":"For I will pour mayim upon him that is thirsty, and flowing streams upon the yabashah [Gn 1:9]; I will pour out My Ruach [Hakodesh] upon thy zera, and My brocha upon thine offspring;"},{"num":4,"verse":"V’tzamechu (and they shall spring up; Tzemach) as among khatzir, as willows by the streams of mayim."},{"num":5,"verse":"One shall say, I belong to Hashem; and another shall call himself by the shem of Ya’akov; and another shall write [in witness] with his yad, Hashem’s, and surname himself by the shem Yisroel."},{"num":6,"verse":"Thus saith Hashem Melech Yisroel, and His Go’el, Hashem Tzva’os; I am the Rishon, and I am the Acharon; and apart from Me there is no Elohim."},{"num":7,"verse":"And who is like Me, who can preach as I do? Let him make it known and set it out in order before Me, since I appointed the Am Olam and the otiyyot (things to come, future things) and what is approaching, let them expound and make known in support of themselves."},{"num":8,"verse":"Fear ye not, neither be afraid; have not I proclaimed to thee long ago, and have made it known? Ye are even My edim. Is there Eloah apart from Me? And there is no Tzur. I know of none."},{"num":9,"verse":"They that make a pesel are all of them tohu; and their chamudim (favorite [idols]) are worthless; and they [the idols] are their own edim; they [the idols] see not, nor know; so that they [the idol people] are put to shame."},{"num":10,"verse":"Who hath formed el (g-d), or molded a pesel to no profit?"},{"num":11,"verse":"Behold, all its chaverim shall be ashamed; and the charashim (craftsmen), they are only adam; let them all be gathered together, let them stand up; yet they shall fear, and they shall be ashamed together."},{"num":12,"verse":"The charash barzel (ironsmith) with his ma’atzad (chizel) both worketh in the red-hot coals, and formeth it with hammers, and forgeth it with his zero’a ko’ach and also, he is hungry, and his ko’ach faileth; he drinketh no mayim, and grows faint."},{"num":13,"verse":"The charash etzim (carpenter) stretcheth out his [measuring line]; he marketh it out with sered (red chalk); he worketh it with planes, and he marketh it out with a compass, and maketh it after the tavnit ish (pattern of a man), according to the tiferet adam; that it may stay inside the bais (idolatrous cult shrine)."},{"num":14,"verse":"He heweth down cedars, and taketh the cypress and the oak, which he secureth for himself among the atzei ya’ar (trees of the forest); he planteth a pine, and geshem doth nourish it."},{"num":15,"verse":"Then shall it be for an adam to burn; for he will take thereof, and warm himself; and also, he kindleth it, and baketh lechem; and also he maketh el (g-d), and boweth down in worship to it; he maketh it a pesel, and falleth down unto it."},{"num":16,"verse":"He burneth half thereof in the eish; with the other half thereof he eateth basar; he roasteth roast meat, and is satisfied; and also, he warmeth himself, and saith, Aha, I am warm, I perceive ur (flame)!"},{"num":17,"verse":"And the shererit thereof he maketh el, even his pesel; he falleth down unto it, and boweth down in worship to it, and davens unto it, and saith, Save me; for thou art Eli!"},{"num":18,"verse":"They have no da’as nor binah; for their eyes [the eyes of the idol people] are smeared over, that they cannot see; and their levavot, that they cannot understand."},{"num":19,"verse":"And none considereth in his lev, neither is there da’as nor tevunah (understanding, intelligence) to say, I have burned half of it in the eish; and, also I have baked lechem upon the hot coals thereof; I have roasted basar, and eaten it; and shall I make the rest thereof to’evah? Shall I bow down to the bul etz (product of a tree, i.e., a block of wood)?"},{"num":20,"verse":"He feedeth on efer (ash); a lev hutal (a heart deceived, a deluded mind) hath led him astray, that he cannot save his nefesh, nor say, Is there not sheker (a lie, a fraud) in my yamin (right hand)?"},{"num":21,"verse":"Remember these things, O Ya’akov and Yisroel; for thou art avdi; I have formed thee; thou art an eved to Me; O Yisroel, do not forget Me!"},{"num":22,"verse":"I have swept away thy peysha’im like a cloud, and like an anan, thy chattot; Shuva elai ki gealticha (return, turn back to Me, for I have redeemed thee)."},{"num":23,"verse":"Sing for joy, O ye Shomayim; for Hashem hath done it; shout, ye depths of the earth; break forth into singing, ye harim, O ya’ar (forest), and kol etz therein; for Hashem hath redeemed Ya’akov, and He will glorify Himself in Yisroel."},{"num":24,"verse":"Thus saith Hashem, thy Go’el, and He that formed thee from the beten (womb), I am Hashem Oseh kol (the Maker of All); that stretcheth out Shomayim alone; that spreadeth out ha’aretz (the earth) by Myself;"},{"num":25,"verse":"That annuls the otot of the baddim (liars, false prophets), and maketh kosemim (diviners, soothsayers) into madmen; that turneth back chachamim, and maketh their da’as (knowledge, science) foolishness;"},{"num":26,"verse":"That confirmeth the davar of His eved, and fulfilleth the etza (prediction) of His malachim; that saith to Yerushalayim, Thou shalt be inhabited; and to the towns of Yehudah, Ye shall be rebuilt, and I will raise up the ruins thereof:"},{"num":27,"verse":"That saith to the deep, Be dry, and I will dry up thy naharot;"},{"num":28,"verse":"That saith of Koresh (Cyrus), He is Ro’i (My Shepherd), and shall accomplish all My pleasure; even saying to Yerushalayim, Thou shalt be rebuilt; and to the Heikhal, Thy foundation shall be laid."}]