[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25:1-13 The circumstances of the parable of the ten virgins were taken from the marriage customs among the Jews, and explain the great day of Christ's coming. See the nature of Christianity. As Christians we profess to attend upon Christ, to honour him, also to be waiting for his coming. Sincere Christians are the wise virgins, and hypocrites the foolish ones. Those are the truly wise or foolish that are so in the affairs of their souls. Many have a lamp of profession in their hands, but have not, in their hearts, sound knowledge and settled resolution, which are needed to carry them through the services and trials of the present state. Their hearts are not stored with holy dispositions, by the new-creating Spirit of God. Our light must shine before men in good works; but this is not likely to be long done, unless there is a fixed, active principle in the heart, of faith in Christ, and love to God and our brethren. They all slumbered and slept. The delay represents the space between the real or apparent conversion of these professors, and the coming of Christ, to take them away by death, or to judge the world. But though Christ tarry past our time, he will not tarry past the due time. The wise virgins kept their lamps burning, but they did not keep themselves awake. Too many real Christians grow remiss, and one degree of carelessness makes way for another. Those that allow themselves to slumber, will scarcely keep from sleeping; therefore dread the beginning of spiritual decays. A startling summons was given. Go ye forth to meet Him, is a call to those prepared. The notice of Christ's approach, and the call to meet him, will awaken. Even those best prepared for death have work to do to get actually ready, 2Pe 3:14. It will be a day of search and inquiry; and it concerns us to think how we shall then be found. Some wanted oil to supply their lamps when going out. Those that take up short of true grace, will certainly find the want of it one time or other. An outward profession may light a man along this world, but the damps of the valley of the shadow of death will put out such a light. Those who care not to live the life, yet would die the death of the righteous. But those that would be saved, must have grace of their own; and those that have most grace, have none to spare. The best need more from Christ. And while the poor alarmed soul addresses itself, upon a sick-bed, to repentance and prayer, in awful confusion, death comes, judgment comes, the work is undone, and the poor sinner is undone for ever. This comes of having oil to buy when we should burn it, grace to get when we should use it. Those, and those only, shall go to heaven hereafter, that are made ready for heaven here. The suddenness of death and of Christ's coming to us then, will not hinder our happiness, if we have been prepared. The door was shut. Many will seek admission into heaven when it is too late. The vain confidence of hypocrites will carry them far in expectations of happiness. The unexpected summons of death may alarm the Christian; but, proceeding without delay to trim his lamp, his graces often shine more bright; while the mere professor's conduct shows that his lamp is going out. Watch therefore, attend to the business of your souls. Be in the fear of the Lord all the day long.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Trimmed their lamps - Burning until midnight, the oil was exhausted: they gave a dim and obscure light. They trimmed them by removing the burnt parts of the linen or the torch, so that they would burn clear. It was needful, also, to dip them again in oil, or to pour oil upon them. This strikingly represents the conduct of most people at the approach of death. They then begin to make ready. They are alarmed, anxious, and trembling, and then they ask the aid of others, but often when it is forever too late. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. Then all those virgins arose, and trimmed their lamps—the foolish virgins as well as the wise. How very long do both parties seem the same—almost to the moment of decision! Looking at the mere form of the parable, it is evident that the folly of \"the foolish\" consisted not in having no oil at all; for they must have had oil enough in their lamps to keep them burning up to this moment: their folly consisted in not making provision against its exhaustion, by taking with their lamp an oil-vessel wherewith to replenish their lamp from time to time, and so have it burning until the Bridegroom should come. Are we, then—with some even superior expositors—to conclude that the foolish virgins must represent true Christians as well as do the wise, since only true Christians have the Spirit, and that the difference between the two classes consists only in the one having the necessary watchfulness which the other wants? Certainly not. Since the parable was designed to hold forth the prepared and the unprepared to meet Christ at His coming, and how the unprepared might, up to the very last, be confounded with the prepared—the structure of the parable behooved to accommodate itself to this, by making the lamps of the foolish to burn, as well as those of the wise, up to a certain point of time, and only then to discover their inability to burn on for want of a fresh supply of oil. But this is evidently just a structural device; and the real difference between the two classes who profess to love the Lord's appearing is a radical one—the possession by the one class of an enduring principle of spiritual life, and the want of it by the other.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 25:13\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then all these virgins arose,.... Not out of their graves; for the righteous and wicked will not rise together; the dead in Christ will rise first, and this first resurrection will not be till Christ is come; nor will grace be to be had, or be thought to be had after the resurrection; nor will there be any trimming of lamps then, in order to meet the bridegroom, for he will be come: nor out of the graves of sin; for the wise virgins were not in such a state, and the foolish virgins were never brought out of it: but the meaning is, that they arose out of their sleepy and slumbering frame. True believers may fall into a very low condition, with respect to the exercise of grace, and discharge of duty; but they shall arise again, for they are held and upheld by the right hand of God: it is sometimes midnight with them, and they are fallen fast asleep, but they shall be awaked, and arise; which arising here, as it respects them, signifies, that they were thoroughly awaked, that they quitted their former place and posture, were upon their feet, and ready to meet the bridegroom. The foolish virgins also arose; which may intend some awakenings of conscience, and reformation of life, and a more diligent attendance on duties and ordinances; all which they did to make them meet for Christ, and to obtain salvation; but after all it appears, they were destitute of the oil of grace: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and trimmed their lamps: both wise and foolish: the former by removing what hindered the clear burning of them; by casting off the works of darkness, and causing the light of good works to shine before men, in the discharge of them, from a principle of grace; and chiefly by applying to Christ for fresh supplies of the oil of grace, to fill their lamps, revive their light and heat, and keep them burning: and the latter, only by a few outward decorations, and external performances; to make their outward profession of religion look as bright as possibly they could. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and trimmed their lamps: both wise and foolish: the former by removing what hindered the clear burning of them; by casting off the works of darkness, and causing the light of good works to shine before men, in the discharge of them, from a principle of grace; and chiefly by applying to Christ for fresh supplies of the oil of grace, to fill their lamps, revive their light and heat, and keep them burning: and the latter, only by a few outward decorations, and external performances; to make their outward profession of religion look as bright as possibly they could. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then all those virgins arose, and trimmed their lamps.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 25:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐκόσμησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they put in proper order",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, by trimming the wick and such like, they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dressed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑαυτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see critical remarks): each one her own; betokening the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "individual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " preparation that was now going on.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σβέννυνται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are just on the point of going out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 25:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκόσμησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", trimmed, or proceeded to trim, for which the imperfect would have been more suitable. In the case of the five foolish it was an action attempted rather than performed, begun rather than completed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trimmed their lamps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] By addition of oil, and by clearing the fibres with a needle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 25:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἠγέρθησαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were aroused",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") sc. from sleep.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πᾶσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Then will the evil and the careless also[1082] awake. All things will be awakened. By how very little the foolish missed of entering in, and yet they are shut out.[1083]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1082] Sc. As well as the good and the prudent.—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[1083] In the original, “et tamen excidunt,” corresponding with the “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "durchfallen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” above.—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Trimmed their lamps.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The trimming consisted in removing the charred portion of the wick, and raising the wick itself by means of a pointed wire which was fastened by a chain to each lamp. These operations would be followed by the replenishment of the vase with oil from the vessel carried for what purpose. In a spiritual sense the dormant grace has to be revived at the awful summons. It had, indeed, come upon all unexpectedly at the moment; but while one party was ready to meet the emergency, the other was wholly unprepared. The foolish, indeed, got their wicks ready to light, when they suddenly discovered that they had no oil in their lamps, and remembered that they had brought no further supply with them. Matthew 25:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then all those virgins arose (τότε ἠγέρθησαν πᾶσαι αι παρθένοι ἐκεῖναι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Greek order is expressive. Then arose all the virgins, those former ones. Those (ἐκεῖναι) a pronoun of remoter reference, and emphatic by its position at the end of the sentence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Trimmed (ἐκόσμησαν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From κοσμός, order, and meaning to put in order or arrange. Tynd., prepared Trench (\"Parables\") quotes from Ward (\"View of the Hindoos\"), describing a marriage ceremony in India: \"After waiting two or three hours, at length near midnight it was announced, as in the very words of Scripture, ' Behold the bridegroom cometh; go ye out to meet him.' All the persons employed now lighted their lamps, and ran with them in their hands to fill up their stations in the procession. Some of them had lost their lights, and were unprepared, but it was then too late to seek them, and the cavalcade moved forward.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Their lamps (ἑαυτῶν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., \"their own lamps ;\" emphasizing the personal preparation in contrast with the foolish, who depended for supply on their fellows. ",
        "children": []
      }
    ]
  }
]