[{"header":"Psalm 116"},{"num":1,"verse":"I love the Lord, because He has heard [and now hears] my voice and my supplications."},{"num":2,"verse":"Because He has inclined His ear to me, therefore will I call upon Him as long as I live."},{"num":3,"verse":"The cords and sorrows of death were around me, and the terrors of Sheol (the place of the dead) had laid hold of me; I suffered anguish and grief (trouble and sorrow)."},{"num":4,"verse":"Then called I upon the name of the Lord: O Lord, I beseech You, save my life and deliver me!"},{"num":5,"verse":"Gracious is the Lord, and [rigidly] righteous; yes, our God is merciful."},{"num":6,"verse":"The Lord preserves the simple; I was brought low, and He helped and saved me."},{"num":7,"verse":"Return to your rest, O my soul, for the Lord has dealt bountifully with you."},{"num":8,"verse":"For You have delivered my life from death, my eyes from tears, and my feet from stumbling and falling."},{"num":9,"verse":"I will walk before the Lord in the land of the living."},{"num":10,"verse":"I believed (trusted in, relied on, and clung to my God), and therefore have I spoken [even when I said], I am greatly afflicted."},{"num":11,"verse":"I said in my haste, All men are deceitful and liars."},{"num":12,"verse":"What shall I render to the Lord for all His benefits toward me? [How can I repay Him for all His bountiful dealings?]"},{"num":13,"verse":"I will lift up the cup of salvation and deliverance and call on the name of the Lord."},{"num":14,"verse":"I will pay my vows to the Lord, yes, in the presence of all His people."},{"num":15,"verse":"Precious (important and no light matter) in the sight of the Lord is the death of His saints (His loving ones)."},{"num":16,"verse":"O Lord, truly I am Your servant; I am Your servant, the son of Your handmaid; You have loosed my bonds."},{"num":17,"verse":"I will offer to You the sacrifice of thanksgiving and will call on the name of the Lord."},{"num":18,"verse":"I will pay my vows to the Lord, yes, in the presence of all His people,"},{"num":19,"verse":"In the courts of the Lord’s house—in the midst of you, O Jerusalem. Praise the Lord! (Hallelujah!)"}]