[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall the flocks and the herds ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". .?—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall flocks and herds ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". .? The definite article is not used here, nor the possessive pronoun, as elsewhere, where the flocks and herds of the Israelites are denoted. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) There is no evidence, therefore, that Moses alluded exclusively, or even primarily, to the flocks and herds which the Israelites had brought out of Egypt. Moreover, a large number of the sheep and goats must have been recently slain at the Passover. Whether the encampment was, or was not within an easy distance of the Ælanitic Gulf, the gathering together of the fish of the sea in sufficient quantities to satisfy such a multitude for so long a time would require a miraculous agency; and the same agency could also bring together from unknown sources flocks and herds. The expression may be regarded as a form of natural hyperbole.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:16-23 Moses is to choose such as he knew to be elders, that is, wise and experienced men. God promises to qualify them. If they were not found fit for the employ, they should be made fit. Even the discontented people shall be gratified too, that every mouth may be stopped. See here, I. The vanity of all the delights of sense; they will cloy, but they will not satisfy. Spiritual pleasures alone will satisfy and last. As the world passes away, so do the lusts of it. 2. What brutish sins gluttony and drunkenness are! they make that to hurt the body which should be its health. Moses objects. Even true and great believers sometimes find it hard to trust God under the discouragements of second causes, and against hope to believe in hope. God here brings Moses to this point, The Lord God is Almighty; and puts the proof upon the issue, Thou shalt see whether my word shall come to pass or not. If he speaks, it is done.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will take of the spirit which is upon thee - Render rather separate from the spirit, etc.; i. e. they shall have their portion in the same divine gift which thou hast.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-23. Moses said, The people, among whom I am, are six hundred thousand … Shall the flocks and herds be slain for them, to suffice them?—The great leader, struck with a promise so astonishing as that of suddenly furnishing, in the midst of the desert, more than two millions of people with flesh for a whole month, betrayed an incredulous spirit, surprising in one who had witnessed so many stupendous miracles. But it is probable that it was only a feeling of the moment—at all events, the incredulous doubt was uttered only to himself—and not, as afterwards, publicly and to the scandal of the people. (See on [75]Nu 20:10). It was, therefore, sharply reproved, but not punished.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Will they be sufficient for them? or where shall they have more? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall the flocks and the herds be slain for them, to suffice them?.... Suggesting that if all their cattle, their sheep, and oxen were killed, which they and the mixed multitude brought out of Egypt, they would not be sufficient for them to live upon a whole month; and intimating also, that it would be an unwise thing, and very improper, to slay them all, were they sufficient, since then they would have none for sacrifice, or to breed when they came into the land of Canaan; the Targum of Jonathan is,\"shall the sheep that are in Arabia and the oxen that are in Nabatea be slain for them, and be sufficient for them?\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or shall all the fish of the sea be gathered together for them to suffice them? of the great sea, as Jonathan; which, to gather together, is, humanly speaking, impossible; indeed, if it could be done, they would not suffice such a number of people a month together: Moses takes notice only of the flesh of beasts and of fishes, and seems not to have thought of the flesh of fowls with which, and not the other, the Lord afterwards fed them a whole month. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or shall all the fish of the sea be gathered together for them to suffice them? of the great sea, as Jonathan; which, to gather together, is, humanly speaking, impossible; indeed, if it could be done, they would not suffice such a number of people a month together: Moses takes notice only of the flesh of beasts and of fishes, and seems not to have thought of the flesh of fowls with which, and not the other, the Lord afterwards fed them a whole month. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Shall the flocks and the herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall the flocks and herds be slain?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Which they had brought out of Egypt with them (see on Exodus 12:32), and which no doubt were carefully husbanded, partly in order to supply them with milk and other produce, partly in order to maintain the sacrifices of the law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "All the fish of the sea.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A wild expression from which nothing can be fairly argued as to the present position of the camp. Numbers 11:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Moses thereupon expressed his amazement at the promise of God to provide flesh for 600,000 men for a whole month long even to satiety, and said, \"Shall flocks and herds be slain for them, to suffice them? or shall all the fish of the sea be gathered together for them, to suffice them?\" he was answered by the words, \"Is the arm of Jehovah too short (i.e., does it not reach far enough; is it too weak and powerless)? Thou shalt see now whether My word shall come to pass unto thee or not.\" ",
        "children": []
      }
    ]
  }
]