[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XLVII",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "JOSEPH PRESENTS HIS FATHER AND BRETHREN TO PHARAOH.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Behold, they are in the land of Goshen.—Though Joseph had all along wished this to be the dwelling-place of his brethren, yet it was necessary to obtain Pharaoh’s permission; and at present Joseph only mentions that they had halted there. In Genesis 47:4 they ask for the necessary consent.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Behold, they are in the land of Goshen.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Though Joseph had all along wished this to be the dwelling-place of his brethren, yet it was necessary to obtain Pharaoh’s permission; and at present Joseph only mentions that they had halted there. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they ask for the necessary consent.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "GROWTH BY TRANSPLANTINGGenesis 47:1 - Genesis 47:12",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "GROWTH BY TRANSPLANTING",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 1. The conduct of Joseph in reference to the settlement in Goshen is an example of the possibility of uniting worldly prudence with high religious principle and great generosity of nature. He had promised his brothers a home in that fertile eastern district, which afforded many advantages in its proximity to Canaan, its adaptation to pastoral life, and its vicinity to Joseph when in Zoan, the capital. But he had not consulted Pharaoh, and, however absolute his authority, it scarcely stretched to giving away Egyptian territory without leave. So his first care, when the wanderers arrive, is to manage the confirmation of the grant. He goes about it with considerable astuteness-a hereditary quality, which is redeemed from blame because used for unselfish purposes and unstained by deceit. He does not tell Pharaoh how far he had gone, but simply announces that his family are in Goshen, as if awaiting the monarch’s further pleasure. Then he introduces a deputation, no doubt carefully chosen, of five of his brothers {as if the whole number would have been too formidable}, previously instructed how to answer. He knows what Pharaoh is in the habit of asking, or he knows that he can lead him to ask the required question, which will bring out the fact of their being shepherds, and utilise the prejudice against that occupation, to ensure separation in Goshen. All goes as he had arranged. Thanks partly to the indifference of the king, who seems to have been rather a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "roi fainéant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the hands of his energetic ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "maire du palais",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to have been contented to give, with a flourish of formality, as a command to Joseph, what Joseph had previously carefully suggested to him {vers. 6, 7}. There is nothing unfair in all this. It is good, shrewd management, and no fault can be found with it; but it is a new trait in the ideal character of a servant of God, and contrasts strongly with the type shown in Abraham. None the less, it is a legitimate element in the character and conduct of a good man, set down to do God’s work in such a world. Joseph is a saint and a politician. His shrewdness is never craft; sagacity is not alien to consecration. No doubt it has to be carefully watched lest it degenerate; but prudence is as needful as enthusiasm, and he is the complete man who has a burning fire down in his heart to generate the force that drives him, and a steady hand on the helm, and a keen eye on the chart, to guide him. Be ye ‘wise as serpents’ but also ‘harmless as doves.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 2. We may note in Joseph’s conduct also an instance of a man in high office and not ashamed of his humble relations. One of the great lessons meant to be taught by the whole patriarchal period was the sacredness of the family. That is, in some sense, the keynote of Joseph’s history. Here we see family love, which had survived the trial of ill-usage and long absence, victorious over the temptation of position and high associates. It took some nerve and a great deal of affection, for the viceroy, whom envious and sarcastic courtiers watched, to own his kin. What a sweet morsel for malicious tongues it would be, ‘Have you heard? He is only the son of an old shepherd, who is down in Goshen, come to pick up some crumbs there!’ One can fancy the curled lips and the light laugh, as the five brothers, led by the great man himself, made their rustic reverences to Pharaoh. It is as if some high official in Paris were to walk in half a dozen peasants in blouse and sabots, and present them to the president as ‘my brothers.’ It was a brave thing to do; and it teaches a lesson which many people, who have made their way in the world, would be nobler and more esteemed if they learned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 3. The brother’s words to Pharaoh are another instance of that ignorant carrying out of the divine purposes which we have already had to notice. They evidently contemplate only a temporary stay in the country. They say that they are come ‘to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sojourn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’-the verb from which are formed the noun often rendered ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strangers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ and that which Jacob uses in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘my ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pilgrimage",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ The reason for their coming is given as the transient scarcity of pasturage in Canaan, which implies the intention of return as soon as that was altered. Joseph had the same idea of the short duration of their stay; and though Jacob had been taught by vision that the removal was in order to their being made a great nation, it does not seem that his sons’ intentions were affected by that-if they knew it. So mistaken are our estimates. We go to a place for a month, and we stay in it for twenty years. We go to a place to settle for life, and our tent-pegs are pulled up in a week. They thought of five years, and it was to be nearly as many centuries. They thought of temporary shelter and food; God meant an education of them and their descendants. Over all this story the unseen Hand hovers, chastising, guiding, impelling; and the human agents are free and yet fulfilling an eternal purpose, blind and yet accountable, responsible for motives, and mercifully ignorant of consequences. So we all play our little parts. We have no call to be curious as to what will come of our deeds. This end of the action, the motive of it, is our care; the other end, the outcome of it, is God’s business to see to.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 4. We may also observe how trivial incidents are wrought into God’s scheme. The Egyptian hatred of the shepherd class secured one of the prime reasons for the removal from Canaan-the unimpeded growth of a tribe into a nation. There was no room for further peaceful and separate expansion in that thickly populated country. Nor would there have been in Egypt, unless under the condition of comparative isolation, which could not have been obtained in any other way. Thus an unreasonable prejudice, possibly connected with religious ideas, became an important factor in the development of Israel; and, once again, we have to note the wisdom of the great Builder who uses not only gold, silver, and precious stones, but even wood, hay, stubble-follies and sins-for His edifice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " 5. The interview of Jacob with Pharaoh is pathetic and beautiful. The old man comports himself, in all the later history of Joseph, as if done with the world, and waiting to go. ‘Let me die, since I have seen thy face,’ was his farewell to life. He takes no part in the negotiation about Goshen, but has evidently handed over all temporal cares to younger hands. A halo of removedness lies round his grey hairs, and to Pharaoh he behaves as one withdrawn from fleeting things, and, by age and nearness to the end, superior even to a king’s dignity. As he enters the royal presence he does not do reverence, but invokes a blessing upon him. ‘The less is blessed of the better.’ He has nothing to do with court ceremonials or conventionalities. The hoary head is a crown of honour, Pharaoh recognises his right to address him thus by the kindly question as to his age, which implied respect for his years. The answer of the ‘Hebrew Ulysses,’ as Stanley calls him, breathes a spirit of melancholy not unnatural in one who had once more been uprooted, and found himself again a wanderer in his old age. The tremulous voice has borne the words across all the centuries, and has everywhere evoked a response in the hearts of weary and saddened men. Look at the component parts of this pensive retrospect.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Life has been to him a ‘pilgrimage’. He thinks of all his wanderings from that far-off day when at Bethel he received the promise of God’s presence ‘in all places whither thou goest,’ till this last happy and yet disturbing change. But he is thinking not only, perhaps not chiefly, of the circumstances, but of the spirit, of his life. This is, no doubt, the confession ‘that they were strangers and pilgrims’ referred to in the Epistle to the Hebrews. He was a pilgrim, not because he had often changed his place of abode, but because he sought the ‘city which hath foundations,’ and therefore could not be at home here. The goal of his life lay in the far future; and whether he looked for the promises to be fulfilled on earth, or had the unformulated consciousness of immortality, and saluted the dimly descried coast from afar while tossing on life’s restless ocean, he was effectually detached from the present, and felt himself an alien in the existing order. We have to live by the same hope, and to let it work the same estrangement, if we would live noble lives. Not because all life is change, nor because it all marches steadily on to the grave, but because our true home-the community to which we really belong, the metropolis, the mother city of our souls-is above, are we to feel ourselves strangers upon earth. They who only take into account the transiency of life are made sad, or sometimes desperate, by the unwelcome thought. But they whose pilgrimage is a journey home may look that transiency full in the face, and be as glad because of it as colonists on their voyage to the old country which they call ‘home,’ though they were born on the other side of the world and have never seen its green fields.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " To Jacob’s eyes his days seem ‘few.’ Abraham’s one hundred and seventy-five years, Isaac’s one hundred and eighty, were in his mind. But more than these was in his mind. The law of the moral perspective is other than that of the physical. The days in front, seen through the glass of anticipation, are drawn out; the days behind, viewed through the telescope of memory, are crowded together. What a moment looked all the long years of his struggling life-shorter now than even had once seemed the seven years of service for his Rachel, that love had made to fly past on such swift wings! That happy wedded life, how short it looked! A bright light for a moment, and",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Ere a man could say “Behold!”The jaws of darkness did devour it up.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Ere a man could say “Behold!”",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The jaws of darkness did devour it up.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is well to lay the coolness of this thought on our fevered hearts, and, whether they be torn by sorrows or gladdened with bliss, to remember ‘this also will pass’ and the longest stretch of dreary days be seen in retrospect, in their due relation to eternity, as but a moment. That will not paralyse effort nor abate sweetness, but it will teach proportion, and deliver from the illusions of this solid-seeming shadow which we call life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The pensive retrospect darkens as the old man’s memory dwells upon the past. His days have not only been few-that could be borne-but they have been ‘evil’ by which I understand not unfortunate so much as faulty. We have seen in preceding pages the slow process by which the crafty Jacob had his sins purged out of him, and became ‘God’s wrestler.’ Here we learn that old wrong-doing, even when forgiven-or, rather, when and because forgiven-leaves regretful memories lifelong. The early treachery had been long ago repented of and pardoned by God and man. The nature which hatched it had been renewed. But here it starts up again, a ghost from the grave, and the memory of it is full of bitterness. No lapse of time deprives a sin of its power to sting. As in the old story of the man who was killed by a rattlesnake’s poison fang embedded in a boot which had lain forgotten for years, we may be wounded by suddenly coming against it, long after it is forgiven by God and almost forgotten by ourselves. Many a good man, although he knows that Christ’s blood has washed away his guilt, is made to possess the iniquities of his youth. ‘Thou shalt be ashamed and confounded, and never open thy mouth any more, when I am pacified toward thee for all that thou hast done.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But this shaded retrospect is one-sided. It is true, and in some moods seems all the truth; but Jacob saw more distinctly, and his name was rightly Israel, when, laying his trembling hands on the heads of Joseph’s sons, he laid there the blessing of ‘the God which fed me all my life long, . . .’the Angel which redeemed me from all evil.’ That was his last thought about his life, as it began to be seen in the breaking light of eternal day. Pensive and penitent memory may call the years few and evil, but grateful faith even here, and still more the cleared vision of heaven, will discern more truly that they have been a long miracle of loving care, and that all their seeming evil has been transmuted into good.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 47:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". They ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are in the land of Goshen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either to abide there, or to remove thence to any other place which thou shalt appoint for them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "47:1-6 Though Joseph was a great man, especially in Egypt, yet he owned his brethren. Let the rich and great in the world not overlook or despise poor relations. Our Lord Jesus is not ashamed to call us brethren. In answer to Pharaoh's inquiry, What is your calling? they told him that they were shepherds, adding that they were come to sojourn in the land for a time, while the famine prevailed in Canaan. Pharaoh offered to employ them as shepherds, provided they were active men. Whatever our business or employment is, we should aim to excel in it, and to prove ourselves clever and industrious.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph announces to Pharaoh the arrival of his kindred. \"Of the whole of his brethren,\" more exactly from the end of his brethren. Five men, a favorite number in Egypt. Shepherds, owners and feeders of sheep and other cattle. \"Pasture.\" Hence, it appears that the drought had made the grazing extremely scanty. Men of ability, competent to take the oversight of others. \"Jacob his father,\" he presents before Pharaoh, after he has disposed of all business matters. \"Jacob blessed Pharaoh.\" This is the patriarch's grateful return for Pharaoh's great kindness and generosity toward him and his house. He is conscious of even a higher dignity than that of Pharaoh, as he is a prince of God; and as such he bestows his precious benediction. Pharaoh was struck with his venerable appearance, and inquired what was his age. \"Pilgrimage\" - sojourning, wandering without any constant abode or fixed holding.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Such was the life of the patriarchs in the land of promise Hebrews 11:13. \"Few and evil.\" Jacob's years at this time were far short of those of Abraham and Isaac, not to speak of more ancient men. Much bitterness also had been mingled in his cup from the time that he beguiled his brother of the birthright and the blessing, which would have come to him in a lawful way if he had only waited in patience. Obliged to flee for his life from his father's house, serving seven years for a beloved wife, and balked in his expected recompense by a deceitful father-in-law, serving seven long years more for the object of his affections, having his wages changed ten times during the six years of his further toil for a maintenance, afflicted by the dishonor of his only daughter, the reckless revenge taken by Simon and Levi, the death of his beloved wife in childbed, the disgraceful incest of Reuben, the loss of Joseph himself for twenty-two years, and the present famine with all its anxieties - Jacob, it must be confessed, has become acquainted with no small share of the ills of life. \"Blessed Pharaoh.\" It is possible that this blessing is the same as that already mentioned, now reiterated in its proper place in the narrative. \"According to the little ones.\" This means either in proportion to the number in each household, or with all the tenderness with which a parent provides for his infant offspring.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Such was the life of the patriarchs in the land of promise ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Few and evil.\" Jacob's years at this time were far short of those of Abraham and Isaac, not to speak of more ancient men. Much bitterness also had been mingled in his cup from the time that he beguiled his brother of the birthright and the blessing, which would have come to him in a lawful way if he had only waited in patience. Obliged to flee for his life from his father's house, serving seven years for a beloved wife, and balked in his expected recompense by a deceitful father-in-law, serving seven long years more for the object of his affections, having his wages changed ten times during the six years of his further toil for a maintenance, afflicted by the dishonor of his only daughter, the reckless revenge taken by Simon and Levi, the death of his beloved wife in childbed, the disgraceful incest of Reuben, the loss of Joseph himself for twenty-two years, and the present famine with all its anxieties - Jacob, it must be confessed, has become acquainted with no small share of the ills of life. \"Blessed Pharaoh.\" It is possible that this blessing is the same as that already mentioned, now reiterated in its proper place in the narrative. \"According to the little ones.\" This means either in proportion to the number in each household, or with all the tenderness with which a parent provides for his infant offspring.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 47",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ge 47:1-31. Joseph's Presentation at Court.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Joseph … told Pharaoh, My father and my brethren—Joseph furnishes a beautiful example of a man who could bear equally well the extremes of prosperity and adversity. High as he was, he did not forget that he had a superior. Dearly as he loved his father and anxiously as he desired to provide for the whole family, he would not go into the arrangements he had planned for their stay in Goshen until he had obtained the sanction of his royal master.Joseph acquaints Pharaoh with his father’s arrival; presents five of his brethren to him,  Genesis 47:1,2. He after some inquiry instates them in Goshen: they being shepherds, he orders Joseph, if he knew any men of activity amongst them, to make them rulers over his cattle,  Genesis 47:3-6. Joseph likewise brings his father before Pharaoh, who inquires after his age, and is blessed by Jacob,  Genesis 47:7-10. Joseph maintains his father, and all his house, in Goshen,  Genesis 47:11,12. Joseph gets all the money, cattle, and lands of the Egyptians into his hands for corn; removes them to distant quarters of the land,  Genesis 47:13-21; the priests only excepted, who have a portion assigned them by Pharaoh,  Genesis 47:22. Joseph leaves the land to the people to till, and gives them corn to sow, they giving Pharaoh the fifth part of the crop,  Genesis 47:23-26. Jacob’s life in Egypt, and full age,  Genesis 47:27,28. He takes an oath of Joseph concerning his burial,  Genesis 47:29-31.  1706 Either to abide there, or to remove thence to any other place which thou shalt appoint for them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. Joseph … told Pharaoh, My father and my brethren—Joseph furnishes a beautiful example of a man who could bear equally well the extremes of prosperity and adversity. High as he was, he did not forget that he had a superior. Dearly as he loved his father and anxiously as he desired to provide for the whole family, he would not go into the arrangements he had planned for their stay in Goshen until he had obtained the sanction of his royal master.Joseph acquaints Pharaoh with his father’s arrival; presents five of his brethren to him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:1,2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He after some inquiry instates them in Goshen: they being shepherds, he orders Joseph, if he knew any men of activity amongst them, to make them rulers over his cattle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:3-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Joseph likewise brings his father before Pharaoh, who inquires after his age, and is blessed by Jacob, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:7-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Joseph maintains his father, and all his house, in Goshen, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:11,12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Joseph gets all the money, cattle, and lands of the Egyptians into his hands for corn; removes them to distant quarters of the land, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:13-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the priests only excepted, who have a portion assigned them by Pharaoh, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Joseph leaves the land to the people to till, and gives them corn to sow, they giving Pharaoh the fifth part of the crop, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:23-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jacob’s life in Egypt, and full age, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:27,28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He takes an oath of Joseph concerning his burial, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Genesis 47:29-31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "1706",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Either to abide there, or to remove thence to any other place which thou shalt appoint for them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Joseph came and told Pharaoh,.... After he had been with his father, had had an interview with him, and had took his leave of him for a time, he came to Pharaoh's court: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, my father, and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; Pharaoh had desired they might come, and Joseph now acquaints him they were come; not being willing it should be said that they were come in a private manner, and without his knowledge; nor to dispose of them himself without the direction and approbation of Pharaoh, who was superior to him; and he makes mention of their flocks and herds, and other substance, partly to show that they were not a mean beggarly family that came to live upon him, and partly that a proper place of pasturage for their cattle might be appointed to them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and behold, they are in the land of Goshen; they are stopped at present, until they should have further directions and orders where to settle; and this is the rather mentioned, because it was the place Joseph proposed with himself to fix them in, if Pharaoh approved of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and behold, they are in the land of Goshen; they are stopped at present, until they should have further directions and orders where to settle; and this is the rather mentioned, because it was the place Joseph proposed with himself to fix them in, if Pharaoh approved of it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Joseph came and told Pharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come out of the land of Canaan; and, behold, they are in the land of Goshen.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1–12. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 47:1-4; Genesis 47:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " b, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:12-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:29-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " J; 5, 6a, 7–11, 27b, 28 P",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Joseph went in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Joseph seems to address Pharaoh as if the latter had been unaware of the coming of Joseph’s family. The passage (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 47:1-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:1-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") seems to ignore, or to be independent of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:17-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (E), in which Pharaoh himself offers a home in Egypt to Joseph’s brethren.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the land of Goshen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Joseph reports of their arrival at Goshen, as if his brothers had reached that place accidentally.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then Joseph came",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and Joseph went",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", up to the royal presence, as he had proposed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and told Pharaoh, and said, My father and my brethren, and their flocks, and their herds, and all that they have, are come cut of the land of Canaan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; - as thou didst desire (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:17, 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and, behold, they are in the land of Goshen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Genesis 47:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Joseph had announced to Pharaoh the arrival of his relations in Goshen, he presented five out of the whole number of his brethren (אחיו מקצה; on קצה see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the king. ",
        "children": []
      }
    ]
  }
]