[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lo, here is seed for you.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As Joseph would give them seed wherewith to sow their fields only when the famine was nearly over, these arrangements seem to have been completed shortly before the end of the seventh year; and then, with seed it would be necessary also to supply them with oxen to plough the soil, and swine wherewith to trample in the seed (Rawlinson, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "i. 76). A fifth part of the produce would be a very moderate rent, especially as there were no rates or taxes to be paid. The whole expenses of the State had to be defrayed from this rent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "47:13-26 Care being taken of Jacob and his family, which mercy was especially designed by Providence in Joseph's advancement, an account is given of the saving the kingdom of Egypt from ruin. There was no bread, and the people were ready to die. See how we depend upon God's providence. All our wealth would not keep us from starving, if rain were withheld for two or three years. See how much we are at God's mercy, and let us keep ourselves always in his love. Also see how much we smart by our own want of care. If all the Egyptians had laid up corn for themselves in the seven years of plenty, they had not been in these straits; but they regarded not the warning. Silver and gold would not feed them: they must have corn. All that a man hath will he give for his life. We cannot judge this matter by modern rules. It is plain that the Egyptians regarded Joseph as a public benefactor. The whole is consistent with Joseph's character, acting between Pharaoh and his subjects, in the fear of God. The Egyptians confessed concerning Joseph, Thou hast saved our lives. What multitudes will gratefully say to Jesus, at the last day, Thou hast saved our souls from the most tremendous destruction, and in the season of uttermost distress! The Egyptians parted with all their property, and even their liberty, for the saving of their lives: can it then be too much for us to count all but loss, and part with all, at His command, and for His sake, who will both save our souls, and give us an hundredfold, even here, in this present world? Surely if saved by Christ, we shall be willing to become his servants.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I have bought you. - He had bought their lands, and so they might be regarded, in some sort, as the servants of Pharaoh, or the serfs of the soil. \"In the increase ye shall give the fifth to Pharaoh.\" This explains at once the extent of their liability, and the security of their liberty and property. They do not become Pharaoh's bondmen. They own their land under him by a new tenure. They are no longer subject to arbitrary exactions. They have a stated annual rent, bearing a fixed ratio to the amount of their crop. This is an equitable adjustment of their dues, and places them under the protection of a statute law. The people are accordingly well pleased with the enactment of Joseph, which becomes henceforth the law of Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23-28. Joseph said, Behold, &c.—The lands being sold to the government (Ge 47:19, 20), seed would be distributed for the first crop after the famine; and the people would occupy them as tenants-at-will on the payment of a produce rent, almost the same rule as obtains in Egypt in the present day.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " For this was the last year of the famine, as was noted before. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Joseph said unto the people,.... After he had bought their land, and before the removal of them to distant parts: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold, I have bought you this day, and your land, for Pharaoh: which he observes to them, that they might take notice of it, and confirm it, or object if they had anything to say to the contrary: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lo, here is seed for you, and ye shall sow the land: by which it should seem that they were not removed from the spot where they lived, but retained their own land under Pharaoh, and had seed given them to sow it with, which may seem contrary to Genesis 47:21; wherefore that must be understood of a purpose and proposal to remove them, and not that it was actually done; or, as Musculus gives the sense, Joseph by a public edict called all the people from the extreme parts of Egypt to the cities nearest to them, and there proclaimed the subjection of them, and their lands to Pharaoh, but continued them to them as tenants of his; unless it should be said, that in those distant parts to which they were sent, land was put into their hands to till and manure for the king, and have seed given them to sow it with; but this seems to be said to them at the same time the bargain was made. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lo, here is seed for you, and ye shall sow the land: by which it should seem that they were not removed from the spot where they lived, but retained their own land under Pharaoh, and had seed given them to sow it with, which may seem contrary to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; wherefore that must be understood of a purpose and proposal to remove them, and not that it was actually done; or, as Musculus gives the sense, Joseph by a public edict called all the people from the extreme parts of Egypt to the cities nearest to them, and there proclaimed the subjection of them, and their lands to Pharaoh, but continued them to them as tenants of his; unless it should be said, that in those distant parts to which they were sent, land was put into their hands to till and manure for the king, and have seed given them to sow it with; but this seems to be said to them at the same time the bargain was made. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo, here is seed for you, and ye shall sow the land.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 23, 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then Joseph said unto the people, Behold, I have bought you this day and your land for Pharaoh: lo, here is seed for you, and ye shall sow the land.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This proves the time to have been the last year of the famine; and since the people obtained seed from the viceroy, it is reasonable to suppose that they would also have their cattle restored to them to enable them to till the ground. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And it shall come to pass in the increase, that ye shall give the fifth part unto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This verse is a sufficient refutation of the oft-preferred charge that Joseph had despoiled the Egyptians of their liberties, and converted a free people into a horde of abject slaves. Slave-owners are not usually content with a tax of only twenty percent on the gross revenues of their estates. Nor does it seem reasonable to allege that this was an exorbitant demand on the part either of Joseph or of Pharaoh. If in the seven years of plenty the people could afford to part with a fifth part of their produce, might not an improved system of agriculture enable them, under the new regulations, to pay as much as that in the shape of rent, and with quite as much ease? At all events the people themselves did not consider that they were being subjected to any harsh or unjust exaction. Genesis 47:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Joseph said to the people: \"Behold I have bought you this day and your land for Pharaoh; there have ye (הא only found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") seed, and sow the land; and of the produce ye shall give the fifth for Pharaoh, and four parts (ידת, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") shall belong to you for seed, and for the support of yourselves, your families and children.\" The people agreed to this; and the writer adds (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it became a law, in existence to this day (his own time), \"with regard to the land of Egypt for Pharaoh with reference to the fifth,\" i.e., that the fifth of the produce of the land should be paid to Pharaoh.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Profane writers have given at least an indirect support to the reality of this political reform of Joseph's. Herodotus, for example (2, 109), states that king Sesostris divided the land among the Egyptians, giving every one a square piece of the same size as his hereditary possession (κλῆρον), and derived his own revenue from a yearly tax upon them. Diod. Sic. (1, 73), again, says that all the land in Egypt belonged either to the priests, to the king, or to the warriors; and Strabo (xvii. p. 787), that the farmers and traders held rateable land, so that the peasants were not landowners. On the monuments, too, the kings, priests, and warriors only are represented as having landed property (cf. Wilkinson, Manners and Customs, i. 263). The biblical account says nothing about the exemption of the warriors from taxation and their possession of land, for that was a later arrangement. According to Herod. 2, 168, every warrior had received from former kings, as an honourable payment, twelve choice fields (ἄρουραι) free from taxation, but they were taken away by the Hephaesto-priest Sethos, a contemporary of Hezekiah, when he ascended the throne (Herod. 2, 141). But when Herodotus and Diodorus Sic. attribute to Sesostris the division of the land into 36 νομοί, and the letting of these for a yearly payment; these comparatively recent accounts simply transfer the arrangement, which was actually made by Joseph, to a half-mythical king, to whom the later legends ascribed all the greater deeds and more important measures of the early Pharaohs. And so far as Joseph's arrangement itself was concerned, not only had he the good of the people and the interests of the king in view, but the people themselves accepted it as a favour, inasmuch as in a land where the produce was regularly thirty-fold, the cession of a fifth could not be an oppressive burden. And it is probable that Joseph not only turned the temporary distress to account by raising the king into the position of sole possessor of the land, with the exception of that of the priests, and bringing the people into a condition of feudal dependence upon him, but had also a still more comprehensive object in view; viz., to secure the population against the danger of starvation in case the crops should fail at any future time, not only by dividing the arable land in equal proportions among the people generally, but, as has been conjectured, by laying the foundation for a system of cultivation regulated by laws and watched over by the state, and possibly also by commencing a system of artificial irrigation by means of canals, for the purpose of conveying the fertilizing water of the Nile as uniformly as possible to all parts of the land. (An explanation of this system is given by Hengstenberg in his Dissertations, from the Correspondance d'Orient par Michaud, etc.) To mention either these or any other plans of a similar kind, did not come within the scope of the book of Genesis, which restricts itself, in accordance with its purely religious intention, to a description of the way in which, during the years of famine, Joseph proved himself to both the king and people of Egypt to be the true support of the land, so that in him Israel already became a saviour of the Gentiles. The measures taken by Joseph are thus circumstantially described, partly because the relation into which the Egyptians were brought to their visible king bore a typical resemblance to the relation in which the Israelites were placed by the Mosaic constitution to Jehovah, their God-King, since they also had to give a double tenth, i.e., the fifth of the produce of their lands, and were in reality only farmers of the soil which Jehovah had given them in Canaan for a possession, so that they could not part with their hereditary possessions in perpetuity (Leviticus 25:23); and partly also because Joseph's conduct exhibited in type how God entrusts His servants with the good things of this earth, in order that they may use them not only for the preservation of the lives of individuals and nations, but also for the promotion of the purposes of His kingdom. For, as is stated in conclusion in Genesis 47:27, not only did Joseph preserve the lives of the Egyptians, for which they expressed their acknowledgements (Genesis 47:25), but under his administration the house of Israel was able, without suffering any privations, or being brought into a relation of dependence towards Pharaoh, to dwell in the land of Goshen, to establish itself there (נאחז as in Genesis 34:10), and to become fruitful and multiply. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Profane writers have given at least an indirect support to the reality of this political reform of Joseph's. Herodotus, for example (2, 109), states that king Sesostris divided the land among the Egyptians, giving every one a square piece of the same size as his hereditary possession (κλῆρον), and derived his own revenue from a yearly tax upon them. Diod. Sic. (1, 73), again, says that all the land in Egypt belonged either to the priests, to the king, or to the warriors; and Strabo (xvii. p. 787), that the farmers and traders held rateable land, so that the peasants were not landowners. On the monuments, too, the kings, priests, and warriors only are represented as having landed property (cf. Wilkinson, Manners and Customs, i. 263). The biblical account says nothing about the exemption of the warriors from taxation and their possession of land, for that was a later arrangement. According to Herod. 2, 168, every warrior had received from former kings, as an honourable payment, twelve choice fields (ἄρουραι) free from taxation, but they were taken away by the Hephaesto-priest Sethos, a contemporary of Hezekiah, when he ascended the throne (Herod. 2, 141). But when Herodotus and Diodorus Sic. attribute to Sesostris the division of the land into 36 νομοί, and the letting of these for a yearly payment; these comparatively recent accounts simply transfer the arrangement, which was actually made by Joseph, to a half-mythical king, to whom the later legends ascribed all the greater deeds and more important measures of the early Pharaohs. And so far as Joseph's arrangement itself was concerned, not only had he the good of the people and the interests of the king in view, but the people themselves accepted it as a favour, inasmuch as in a land where the produce was regularly thirty-fold, the cession of a fifth could not be an oppressive burden. And it is probable that Joseph not only turned the temporary distress to account by raising the king into the position of sole possessor of the land, with the exception of that of the priests, and bringing the people into a condition of feudal dependence upon him, but had also a still more comprehensive object in view; viz., to secure the population against the danger of starvation in case the crops should fail at any future time, not only by dividing the arable land in equal proportions among the people generally, but, as has been conjectured, by laying the foundation for a system of cultivation regulated by laws and watched over by the state, and possibly also by commencing a system of artificial irrigation by means of canals, for the purpose of conveying the fertilizing water of the Nile as uniformly as possible to all parts of the land. (An explanation of this system is given by Hengstenberg in his Dissertations, from the Correspondance d'Orient par Michaud, etc.) To mention either these or any other plans of a similar kind, did not come within the scope of the book of Genesis, which restricts itself, in accordance with its purely religious intention, to a description of the way in which, during the years of famine, Joseph proved himself to both the king and people of Egypt to be the true support of the land, so that in him Israel already became a saviour of the Gentiles. The measures taken by Joseph are thus circumstantially described, partly because the relation into which the Egyptians were brought to their visible king bore a typical resemblance to the relation in which the Israelites were placed by the Mosaic constitution to Jehovah, their God-King, since they also had to give a double tenth, i.e., the fifth of the produce of their lands, and were in reality only farmers of the soil which Jehovah had given them in Canaan for a possession, so that they could not part with their hereditary possessions in perpetuity (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and partly also because Joseph's conduct exhibited in type how God entrusts His servants with the good things of this earth, in order that they may use them not only for the preservation of the lives of individuals and nations, but also for the promotion of the purposes of His kingdom. For, as is stated in conclusion in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not only did Joseph preserve the lives of the Egyptians, for which they expressed their acknowledgements (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but under his administration the house of Israel was able, without suffering any privations, or being brought into a relation of dependence towards Pharaoh, to dwell in the land of Goshen, to establish itself there (נאחז as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and to become fruitful and multiply. ",
            "children": []
          }
        ]
      }
    ]
  }
]