[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "47:13-26 Care being taken of Jacob and his family, which mercy was especially designed by Providence in Joseph's advancement, an account is given of the saving the kingdom of Egypt from ruin. There was no bread, and the people were ready to die. See how we depend upon God's providence. All our wealth would not keep us from starving, if rain were withheld for two or three years. See how much we are at God's mercy, and let us keep ourselves always in his love. Also see how much we smart by our own want of care. If all the Egyptians had laid up corn for themselves in the seven years of plenty, they had not been in these straits; but they regarded not the warning. Silver and gold would not feed them: they must have corn. All that a man hath will he give for his life. We cannot judge this matter by modern rules. It is plain that the Egyptians regarded Joseph as a public benefactor. The whole is consistent with Joseph's character, acting between Pharaoh and his subjects, in the fear of God. The Egyptians confessed concerning Joseph, Thou hast saved our lives. What multitudes will gratefully say to Jesus, at the last day, Thou hast saved our souls from the most tremendous destruction, and in the season of uttermost distress! The Egyptians parted with all their property, and even their liberty, for the saving of their lives: can it then be too much for us to count all but loss, and part with all, at His command, and for His sake, who will both save our souls, and give us an hundredfold, even here, in this present world? Surely if saved by Christ, we shall be willing to become his servants.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I have bought you. - He had bought their lands, and so they might be regarded, in some sort, as the servants of Pharaoh, or the serfs of the soil. \"In the increase ye shall give the fifth to Pharaoh.\" This explains at once the extent of their liability, and the security of their liberty and property. They do not become Pharaoh's bondmen. They own their land under him by a new tenure. They are no longer subject to arbitrary exactions. They have a stated annual rent, bearing a fixed ratio to the amount of their crop. This is an equitable adjustment of their dues, and places them under the protection of a statute law. The people are accordingly well pleased with the enactment of Joseph, which becomes henceforth the law of Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23-28. Joseph said, Behold, &c.—The lands being sold to the government (Ge 47:19, 20), seed would be distributed for the first crop after the famine; and the people would occupy them as tenants-at-will on the payment of a produce rent, almost the same rule as obtains in Egypt in the present day.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Whereas he might have reserved four parts to Pharaoh, and have allowed them only the fifth. Herein he showed both his humanity and kindness, in mitigating that hard bargain which themselves had made, and were necessitated to make, and his prudence in composing, sweetening, and winning the hearts of the people to the king, and making them pay their tribute for the future with more cheerfulness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it shall come to pass, in the increase,.... When the land shall produce an increase, and it shall be gathered in: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that you shall give the fifth part unto Pharaoh; a fifth part of the increase: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and four parts shall be your own; for the following uses, one part ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for seed of the field: to sow again with for the next year: a second part ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for your food; for food for themselves: a third part ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for them of your household; their servants and maids: and the fourth part ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for food for your little ones; for their children, be they young or old; or however four parts of five he proposed they should have for their own use, and for the maintenance of their families, which was a kind and generous proposal, when all might have been demanded, and they and theirs treated as slaves. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for food for your little ones; for their children, be they young or old; or however four parts of five he proposed they should have for their own use, and for the maintenance of their families, which was a kind and generous proposal, when all might have been demanded, and they and theirs treated as slaves. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it shall come to pass in the increase, that ye shall give the fifth part unto Pharaoh, and four parts shall be your own, for seed of the field, and for your food, and for them of your households, and for food for your little ones.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a fifth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 41:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This seems an immense impost. But it is said to compare favourably with the ruthless standard of taxation by Oriental governments, in which corruption was rife and liberty did not exist: cf. the letter of King Demetrius, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Ma 10:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “the third part of the seed,” “the half of the fruit of the trees which falleth to me to receive.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 47:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Joseph said to the people: \"Behold I have bought you this day and your land for Pharaoh; there have ye (הא only found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") seed, and sow the land; and of the produce ye shall give the fifth for Pharaoh, and four parts (ידת, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") shall belong to you for seed, and for the support of yourselves, your families and children.\" The people agreed to this; and the writer adds (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it became a law, in existence to this day (his own time), \"with regard to the land of Egypt for Pharaoh with reference to the fifth,\" i.e., that the fifth of the produce of the land should be paid to Pharaoh.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Profane writers have given at least an indirect support to the reality of this political reform of Joseph's. Herodotus, for example (2, 109), states that king Sesostris divided the land among the Egyptians, giving every one a square piece of the same size as his hereditary possession (κλῆρον), and derived his own revenue from a yearly tax upon them. Diod. Sic. (1, 73), again, says that all the land in Egypt belonged either to the priests, to the king, or to the warriors; and Strabo (xvii. p. 787), that the farmers and traders held rateable land, so that the peasants were not landowners. On the monuments, too, the kings, priests, and warriors only are represented as having landed property (cf. Wilkinson, Manners and Customs, i. 263). The biblical account says nothing about the exemption of the warriors from taxation and their possession of land, for that was a later arrangement. According to Herod. 2, 168, every warrior had received from former kings, as an honourable payment, twelve choice fields (ἄρουραι) free from taxation, but they were taken away by the Hephaesto-priest Sethos, a contemporary of Hezekiah, when he ascended the throne (Herod. 2, 141). But when Herodotus and Diodorus Sic. attribute to Sesostris the division of the land into 36 νομοί, and the letting of these for a yearly payment; these comparatively recent accounts simply transfer the arrangement, which was actually made by Joseph, to a half-mythical king, to whom the later legends ascribed all the greater deeds and more important measures of the early Pharaohs. And so far as Joseph's arrangement itself was concerned, not only had he the good of the people and the interests of the king in view, but the people themselves accepted it as a favour, inasmuch as in a land where the produce was regularly thirty-fold, the cession of a fifth could not be an oppressive burden. And it is probable that Joseph not only turned the temporary distress to account by raising the king into the position of sole possessor of the land, with the exception of that of the priests, and bringing the people into a condition of feudal dependence upon him, but had also a still more comprehensive object in view; viz., to secure the population against the danger of starvation in case the crops should fail at any future time, not only by dividing the arable land in equal proportions among the people generally, but, as has been conjectured, by laying the foundation for a system of cultivation regulated by laws and watched over by the state, and possibly also by commencing a system of artificial irrigation by means of canals, for the purpose of conveying the fertilizing water of the Nile as uniformly as possible to all parts of the land. (An explanation of this system is given by Hengstenberg in his Dissertations, from the Correspondance d'Orient par Michaud, etc.) To mention either these or any other plans of a similar kind, did not come within the scope of the book of Genesis, which restricts itself, in accordance with its purely religious intention, to a description of the way in which, during the years of famine, Joseph proved himself to both the king and people of Egypt to be the true support of the land, so that in him Israel already became a saviour of the Gentiles. The measures taken by Joseph are thus circumstantially described, partly because the relation into which the Egyptians were brought to their visible king bore a typical resemblance to the relation in which the Israelites were placed by the Mosaic constitution to Jehovah, their God-King, since they also had to give a double tenth, i.e., the fifth of the produce of their lands, and were in reality only farmers of the soil which Jehovah had given them in Canaan for a possession, so that they could not part with their hereditary possessions in perpetuity (Leviticus 25:23); and partly also because Joseph's conduct exhibited in type how God entrusts His servants with the good things of this earth, in order that they may use them not only for the preservation of the lives of individuals and nations, but also for the promotion of the purposes of His kingdom. For, as is stated in conclusion in Genesis 47:27, not only did Joseph preserve the lives of the Egyptians, for which they expressed their acknowledgements (Genesis 47:25), but under his administration the house of Israel was able, without suffering any privations, or being brought into a relation of dependence towards Pharaoh, to dwell in the land of Goshen, to establish itself there (נאחז as in Genesis 34:10), and to become fruitful and multiply. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Profane writers have given at least an indirect support to the reality of this political reform of Joseph's. Herodotus, for example (2, 109), states that king Sesostris divided the land among the Egyptians, giving every one a square piece of the same size as his hereditary possession (κλῆρον), and derived his own revenue from a yearly tax upon them. Diod. Sic. (1, 73), again, says that all the land in Egypt belonged either to the priests, to the king, or to the warriors; and Strabo (xvii. p. 787), that the farmers and traders held rateable land, so that the peasants were not landowners. On the monuments, too, the kings, priests, and warriors only are represented as having landed property (cf. Wilkinson, Manners and Customs, i. 263). The biblical account says nothing about the exemption of the warriors from taxation and their possession of land, for that was a later arrangement. According to Herod. 2, 168, every warrior had received from former kings, as an honourable payment, twelve choice fields (ἄρουραι) free from taxation, but they were taken away by the Hephaesto-priest Sethos, a contemporary of Hezekiah, when he ascended the throne (Herod. 2, 141). But when Herodotus and Diodorus Sic. attribute to Sesostris the division of the land into 36 νομοί, and the letting of these for a yearly payment; these comparatively recent accounts simply transfer the arrangement, which was actually made by Joseph, to a half-mythical king, to whom the later legends ascribed all the greater deeds and more important measures of the early Pharaohs. And so far as Joseph's arrangement itself was concerned, not only had he the good of the people and the interests of the king in view, but the people themselves accepted it as a favour, inasmuch as in a land where the produce was regularly thirty-fold, the cession of a fifth could not be an oppressive burden. And it is probable that Joseph not only turned the temporary distress to account by raising the king into the position of sole possessor of the land, with the exception of that of the priests, and bringing the people into a condition of feudal dependence upon him, but had also a still more comprehensive object in view; viz., to secure the population against the danger of starvation in case the crops should fail at any future time, not only by dividing the arable land in equal proportions among the people generally, but, as has been conjectured, by laying the foundation for a system of cultivation regulated by laws and watched over by the state, and possibly also by commencing a system of artificial irrigation by means of canals, for the purpose of conveying the fertilizing water of the Nile as uniformly as possible to all parts of the land. (An explanation of this system is given by Hengstenberg in his Dissertations, from the Correspondance d'Orient par Michaud, etc.) To mention either these or any other plans of a similar kind, did not come within the scope of the book of Genesis, which restricts itself, in accordance with its purely religious intention, to a description of the way in which, during the years of famine, Joseph proved himself to both the king and people of Egypt to be the true support of the land, so that in him Israel already became a saviour of the Gentiles. The measures taken by Joseph are thus circumstantially described, partly because the relation into which the Egyptians were brought to their visible king bore a typical resemblance to the relation in which the Israelites were placed by the Mosaic constitution to Jehovah, their God-King, since they also had to give a double tenth, i.e., the fifth of the produce of their lands, and were in reality only farmers of the soil which Jehovah had given them in Canaan for a possession, so that they could not part with their hereditary possessions in perpetuity (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and partly also because Joseph's conduct exhibited in type how God entrusts His servants with the good things of this earth, in order that they may use them not only for the preservation of the lives of individuals and nations, but also for the promotion of the purposes of His kingdom. For, as is stated in conclusion in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not only did Joseph preserve the lives of the Egyptians, for which they expressed their acknowledgements (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but under his administration the house of Israel was able, without suffering any privations, or being brought into a relation of dependence towards Pharaoh, to dwell in the land of Goshen, to establish itself there (נאחז as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and to become fruitful and multiply. ",
            "children": []
          }
        ]
      }
    ]
  }
]