[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My pilgrimage.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my sojournings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and so at end of verse. The idea of a pilgrimage is a modern one. Even in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Peter 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “pilgrim” means in the Greek a stranger who has settled in a country of which he is not a native. So, too, here Jacob was not a pilgrim, for he was no traveller bound for religious motives to some distant shrine, but he was a sojourner, because Canaan was not the native land of his race.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Few and evil.—Evil certainly: for from the time when he deceived his father, Jacob’s life had been one of great anxiety and care, in addition to his many sorrows. If he had gained wealth in Haran, it had been by great industry and personal toil, aggravated by Laban’s injustice. On his return, there was the double terror of Laban’s pursuit behind and Esau’s menacing attitude in front. He had then long lain ill at Succoth, waiting till time healed his sprained hip. His entry into the promised land had been made miserable by his daughter’s dishonour and the fierce conduct of his sons. And when his home was in sight, he had lost his beloved Rachel; and finally, been compelled to remain at a distance from his father, because Esau was there chief and paramount. His father dies, and Esau goes away; but the ten years between Isaac’s death and the descent into Egypt had been years of mourning for Joseph’s loss. All these troubles had fallen upon him, and made his days evil; but they were few only in comparison with those of his father and grandfather. In Pharaoh’s eyes Jacob had lived beyond the usual span of human existence; but to himself he seemed prematurely old. His end came after seventeen years of peaceful decay spent under Joseph’s loving care.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Few and evil.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Evil certainly: for from the time when he deceived his father, Jacob’s life had been one of great anxiety and care, in addition to his many sorrows. If he had gained wealth in Haran, it had been by great industry and personal toil, aggravated by Laban’s injustice. On his return, there was the double terror of Laban’s pursuit behind and Esau’s menacing attitude in front. He had then long lain ill at Succoth, waiting till time healed his sprained hip. His entry into the promised land had been made miserable by his daughter’s dishonour and the fierce conduct of his sons. And when his home was in sight, he had lost his beloved Rachel; and finally, been compelled to remain at a distance from his father, because Esau was there chief and paramount. His father dies, and Esau goes away; but the ten years between Isaac’s death and the descent into Egypt had been years of mourning for Joseph’s loss. All these troubles had fallen upon him, and made his days evil; but they were few only in comparison with those of his father and grandfather. In Pharaoh’s eyes Jacob had lived beyond the usual span of human existence; but to himself he seemed prematurely old. His end came after seventeen years of peaceful decay spent under Joseph’s loving care.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The land of Rameses.—See Note on Genesis 45:10. Though the LXX. take “land of Rameses” as equivalent to Goshen, it was more probably some special district of it, for, as we have seen, Goshen was a territory of vast extent. Raamses (Exodus 1:11) is the same word, though the Masorites have given it different vowels; but whether such a town already existed, or whether when built it took its name from the district, we cannot tell. If there were such a place, it would at this period be a poor village, consisting of a few shepherds’ huts; but long afterwards, in the days of King Rameses II., “it was the centre of a rich, fertile, and beautiful land, described as the abode of happiness, where all alike, rich and poor, lived in peace and plenty.”—Canon Cook, Excursus on Egyptian Words, p. 487. It deserved therefore its description as “the best of the land.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The land of Rameses.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—See Note on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Though the LXX. take “land of Rameses” as equivalent to Goshen, it was more probably some special district of it, for, as we have seen, Goshen was a territory of vast extent. Raamses (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is the same word, though the Masorites have given it different vowels; but whether such a town already existed, or whether when built it took its name from the district, we cannot tell. If there were such a place, it would at this period be a poor village, consisting of a few shepherds’ huts; but long afterwards, in the days of King Rameses II., “it was the centre of a rich, fertile, and beautiful land, described as the abode of happiness, where all alike, rich and poor, lived in peace and plenty.”—Canon Cook, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Excursus on Egyptian Words, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 487. It deserved therefore its description as “the best of the land.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "GROWTH BY TRANSPLANTING",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "TWO RETROSPECTS OF ONE LIFEGenesis 47:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "TWO RETROSPECTS OF ONE LIFE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 48:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These are two strangely different estimates of the same life to be taken by the same man. In the latter Jacob categorically contradicts everything that he had said in the former. ‘Few and evil,’ he said before Pharaoh. ‘All my life long,’ ‘the Angel which redeemed me from all evil,’ he said on his death-bed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If he meant what he said when he spoke to Pharaoh, and characterised his life thus, he was wrong. He was possibly in a melancholy mood. Very naturally, the unfamiliar splendours of a court dazzled and bewildered the old man, accustomed to a quiet shepherd life down at Hebron. He had not come to see Pharaoh, he only cared to meet Joseph; and, as was quite natural, the new and uncongenial surroundings depressed him. Possibly the words are only a piece of the etiquette of an Eastern court, where it is the correct thing for the subject to depreciate himself in all respects as far inferior to the prince. And there may be little more than conventional humility in the words of my first text. But I am rather disposed to think that they express the true feeling of the moment, in a mood that passed and was followed by a more wholesome one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I put the two sayings side by side just for the sake of gathering up one or two plain lessons from them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1. We have here two possible views of life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. We have here two possible views of life.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now the key to the difference between these two statements and moods of feeling seems to me to be a very plain one. In the former of them there is nothing about God. It is all Jacob. In the latter we notice that there is a great deal more about God than about Jacob, and that determines the whole tone of the retrospect. In the first text Jacob speaks of ‘the days of the years of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " pilgrimage,’ ‘the days of the years of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " life,’ and so on, without a syllable about anything except the purely earthly view of life. Of course, when you shut out God, the past is all dark enough, grey and dismal, like the landscape on some cloudy day, where the woods stand black, and the rivers creep melancholy through colourless fields, and the sky is grey and formless above. Let the sun come out, and the river flashes into a golden mirror, and the woods are alive with twinkling lights and shadows, and the sky stretches a blue pavilion above them, and all the birds sing. Let God into your life, and its whole complexion and characteristics change. The man who sits whining and complaining, when he has shut out the thought of a divine Presence, finds that everything alters when he brings that in.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And, then, look at the two particulars on which the patriarch dwells. ‘I am only one hundred and thirty years old,’ he says; a mere infant compared with Abraham and Isaac! How did he know he was not going to live to be as old as either of them? And ‘if his days were evil,’ as he said, was it not a good thing that they were few? But, instead of that, he finds reasons for complaint in the brevity of the life which, if it were as evil as he made it out to be, must often have seemed wearisomely long, and dragged very slowly. Now, both things are true-life is short, life is long. Time is elastic-you can stretch it or you can contract it. It is short compared with the duration of God; it is short, as one of the Psalms puts it pathetically, as compared with this Nature round us-’The earth abideth for ever’; we are strangers upon it, and there is no abiding for us. It is short as compared with the capacities and powers of the creatures that possess it; but, oh! if we think of our days as a series of gifts of God, if we look upon them, as Jacob looked upon them when he was sane, as being one continued shepherding by God, they stretch out into blessed length. Life is long enough if it manifests that God takes care of us, and if we learn that He does. Life is long enough if it serves to build up a God-pleasing character.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is beautiful to see how the thought of God enters into the dying man’s remembrances in the shape which was natural to him, regard being had to his own daily avocations. For the word translated ‘fed’ means much more than supplied with nourishment. It is the word for doing the office of shepherd, and we must not forget, if we want to understand its beauty, that Jacob’s sons said, ‘Thy servants are shepherds; both we and also our fathers.’ So this man, in the solitude of his pastoral life, and whilst living amongst his woolly people who depended upon his guidance and care, had learned many a lesson as to how graciously and tenderly and constantly fed, and led, and protected, and fostered by God were the creatures of His hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was he, I suppose, who first gave to religious thought that metaphor which has survived temple and sacrifice and priesthood, and will survive even earth itself; for ‘I am the Good Shepherd’ is as true to-day as when first spoken by Jesus, and ‘the Lamb which is in the midst of the throne shall lead them,’ and be their Shepherd when the flock is carried to the upper pastures and the springs that never fail. The life which has brought us that thought of a Shepherd-God has been long enough; and the days which have been so expanded as to contain a continuous series of His benefits and protections need never be remembered as ‘few,’ whatsoever be the arithmetic that is applied to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The other contradiction is equally eloquent and significant. ‘Few and evil’ have my days been, said Jacob, when he was not thinking about God; but when he remembered the Angel of the Presence, that mysterious person with whom he had wrestled at Peniel, and whose finger had lamed the thigh while His lips proclaimed a blessing, his view changed, and instead of talking about ‘evil’ days, he says, ‘The Angel that redeemed me from all evil.’ Yes, his life had been evil, whether by that we mean sorrowful or sinful, and the sorrows and the sins had been closely connected. A sorely tried man he had been. Far away back in the past had been his banishment from home; his disappointment and hard service with the churlish Laban; the misbehaviour of his sons; the death of Rachel-that wound which was never stanched; and then the twenty years’ mourning for Rachel’s son, the heir of his inheritance. These were the evils, the sins were as many, for every one of the sorrows, except perhaps the chiefest of them all, had its root in some piece of duplicity, dishonesty, or failure. But he was there in Egypt beside Joseph. The evils had stormed over him, but he was there still. And so at the end he says, ‘The Angel . . .redeemed me from evil, though it smote me. Sorrow became chastisement, and I was purged of my sin by my calamities.’ The sorrows are past, like some raging inundation that comes up for a night over the land and then subsides; but the blessing of fertility which it brought in its tawny waves abides with me yet. Joseph is by my side. ‘I had not thought to see thy face, and God hath showed me the face of thy seed.’ That sorrow is over. Rachel’s grave is still by the wayside, and that sorest of sorrows has wrought with others to purify character. Jacob has been tried by sorrows; he has been purged from sins. ‘The Angel delivered me from all evil.’ So, dear friends, sorrow is not evil if it helps to strip us from the evil that we love, and the ills that we bear are good if they alienate our affections from the ills that we do.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2. Secondly, note the wisdom and the duty of taking the completer and brighter view. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "2. Secondly, note the wisdom and the duty of taking the completer and brighter view.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "These first words of Jacob’s are very often quoted as if they were the pattern of the kind of thing people ought to say, ‘Few and evil have been the days of the years of my pilgrimage.’ That is a text from which many sermons have been preached with approbation of the pious resignation expressed in it. But it does not seem to me that that is the tone of them. If the man believed what he said, then he was very ungrateful and short-sighted, though there were excuses to be made for him under the circumstances. If the days had been evil, he had made them so.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the point which I wish to make now is that it is largely a matter for our own selection which of the two views of our lives we take. We may make our choice whether we shall fix our attention on the brighter or on the darker constituents of our past.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Suppose a wall papered with paper of two colours, one black, say, and the other gold. You can work your eye and adjust the focus of vision so that you may see either a black background or a gold one. In the one case the prevailing tone is gloomy, relieved by an occasional touch of brightness; and in the other it is brightness, heightened by a background of darkness. And so you can do with life, fixing attention on its sorrows, and hugging yourselves in the contemplation of these with a kind of morbid satisfaction, or bravely and thankfully and submissively and wisely resolving that you will rather seek to learn what God means by darkness, and not forgetting to look at the unenigmatical blessings, and plain, obvious mercies, that make up so much of our lives. We have to govern memory as well as other faculties, by Christian principle. We have to apply the plain teaching of Christian truth to our sentimental, and often unwholesome, contemplations of the past. There is enough in all our lives to make material for plenty of whining and complaining, if we choose to take hold of them by that handle. And there is enough in all our lives to make us ashamed of one murmuring word, if we are devout and wise and believing enough to lay hold of them by that one. Remember that you can make your view of your life either a bright one or a dark one, and there will be facts for both; but the facts that feed melancholy are partial and superficial, and the facts that exhort, ‘Rejoice in the Lord alway; and again I say, Rejoice,’ are deep and fundamental.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3. So, lastly, note how blessed a thing it is when the last look is the happiest. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "3. So, lastly, note how blessed a thing it is when the last look is the happiest.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "When we are amongst the mountains, or when we are very near them, they look barren enough, rough, stony, steep. When we travel away from them, and look at them across the plain, they lie blue in the distance; and the violet shadows and the golden lights upon them and the white peaks above make a dream of beauty. Whilst we are in the midst of the struggle, we are often tempted to think that things go hardly with us and that the road is very rough. But if we keep near our dear Lord, and hold by His hand, and try to shape our lives in accordance with His will-whatever be their outward circumstances and texture-then we may be very sure of this, that when the end comes, and we are far enough away from some of the sorrows to see what they lead to and blossom into, then we shall be able to say, It was all very good, and to thank Him for all the way by which the Lord our God has led us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In the same conversation in which the patriarch, rising to the height of a prophet and organ of divine revelation, gives this his dying testimony of the faithfulness of God, and declares that he has been delivered from all evil, he recurs to the central sorrow of his life; and speaks, though in calm words, of that day when he buried Rachel by ‘Ephrath, which is Bethel.’ But the pain had passed and the good was present to him. And so, leaving life, he left it according to his own word, ‘satisfied with favour, and full of the blessing of the Lord.’ So we in our turns may, at the last, hope that what we know not now will largely be explained; and may seek to anticipate our dying verdict by a living confidence, in the midst of our toils and our sorrows, that ‘all things work together for good to them that love God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 47:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Observe, 1st, Jacob calls his life a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pilgrimage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "looking upon himself as a stranger in this world, and a traveller toward another. He reckoned himself not only a pilgrim now he was in Egypt, a strange country in which he never was before, but his life, even in the land of his nativity, was a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pilgrimage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2d, He reckoned his life by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "days; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for even so it is soon reckoned; and we are not sure of the continuance of it for a day to an end, but may be turned out of this tabernacle at less than an hour’s warning. 3d, The character he gives of them was, 1st, That they were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "few.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Though he had now lived one hundred and thirty years, they seemed to him but as a few days, in comparison of the days of many of his ancestors, and especially of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "days of eternity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in which a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thousand years ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are but as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one day. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2d, That they were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is true concerning man in general, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he is of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "few days and full of trouble: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Jacob’s life particularly had been made up of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil days; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the pleasantest days of his life were yet before him. 3d, That they were short of the days of his fathers; not so many, not so pleasant as their days. Old age came sooner upon him than it had done upon some of his ancestors.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "47:7-12 With the gravity of old age, the piety of a true believer, and the authority of a patriarch and a prophet, Jacob besought the Lord to bestow a blessing upon Pharaoh. He acted as a man not ashamed of his religion; and who would express gratitude to the benefactor of himself and his family. We have here a very uncommon answer given to a very common question. Jacob calls his life a pilgrimage; the sojourning of a stranger in a foreign country, or his journey home to his own country. He was not at home upon earth; his habitation, his inheritance, his treasures were in heaven. He reckons his life by days; even by days life is soon reckoned, and we are not sure of the continuance of it for a day. Let us therefore number our days. His days were few. Though he had now lived one hundred and thirty years, they seemed but a few days, in comparison with the days of eternity, and the eternal state. They were evil; this is true concerning man. He is of few days and full of trouble; since his days are evil, it is well they are few. Jacob's life had been made up of evil days. Old age came sooner upon him than it had done upon some of his fathers. As the young man should not be proud of his strength or beauty, so the old man should not be proud of his age, and his hoary hairs, though others justly reverence them; for those who are accounted very old, attain not to the years of the patriarchs. The hoary head is only a crown of glory, when found in the way of righteousness. Such an answer could not fail to impress the heart of Pharaoh, by reminding him that worldly prosperity and happiness could not last long, and was not enough to satisfy. After a life of vanity and vexation, man goes down into the grave, equally from the throne as the cottage. Nothing can make us happy, but the prospect of an everlasting home in heaven, after our short and weary pilgrimage on earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph announces to Pharaoh the arrival of his kindred. \"Of the whole of his brethren,\" more exactly from the end of his brethren. Five men, a favorite number in Egypt. Shepherds, owners and feeders of sheep and other cattle. \"Pasture.\" Hence, it appears that the drought had made the grazing extremely scanty. Men of ability, competent to take the oversight of others. \"Jacob his father,\" he presents before Pharaoh, after he has disposed of all business matters. \"Jacob blessed Pharaoh.\" This is the patriarch's grateful return for Pharaoh's great kindness and generosity toward him and his house. He is conscious of even a higher dignity than that of Pharaoh, as he is a prince of God; and as such he bestows his precious benediction. Pharaoh was struck with his venerable appearance, and inquired what was his age. \"Pilgrimage\" - sojourning, wandering without any constant abode or fixed holding.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Such was the life of the patriarchs in the land of promise Hebrews 11:13. \"Few and evil.\" Jacob's years at this time were far short of those of Abraham and Isaac, not to speak of more ancient men. Much bitterness also had been mingled in his cup from the time that he beguiled his brother of the birthright and the blessing, which would have come to him in a lawful way if he had only waited in patience. Obliged to flee for his life from his father's house, serving seven years for a beloved wife, and balked in his expected recompense by a deceitful father-in-law, serving seven long years more for the object of his affections, having his wages changed ten times during the six years of his further toil for a maintenance, afflicted by the dishonor of his only daughter, the reckless revenge taken by Simon and Levi, the death of his beloved wife in childbed, the disgraceful incest of Reuben, the loss of Joseph himself for twenty-two years, and the present famine with all its anxieties - Jacob, it must be confessed, has become acquainted with no small share of the ills of life. \"Blessed Pharaoh.\" It is possible that this blessing is the same as that already mentioned, now reiterated in its proper place in the narrative. \"According to the little ones.\" This means either in proportion to the number in each household, or with all the tenderness with which a parent provides for his infant offspring.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Such was the life of the patriarchs in the land of promise ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Few and evil.\" Jacob's years at this time were far short of those of Abraham and Isaac, not to speak of more ancient men. Much bitterness also had been mingled in his cup from the time that he beguiled his brother of the birthright and the blessing, which would have come to him in a lawful way if he had only waited in patience. Obliged to flee for his life from his father's house, serving seven years for a beloved wife, and balked in his expected recompense by a deceitful father-in-law, serving seven long years more for the object of his affections, having his wages changed ten times during the six years of his further toil for a maintenance, afflicted by the dishonor of his only daughter, the reckless revenge taken by Simon and Levi, the death of his beloved wife in childbed, the disgraceful incest of Reuben, the loss of Joseph himself for twenty-two years, and the present famine with all its anxieties - Jacob, it must be confessed, has become acquainted with no small share of the ills of life. \"Blessed Pharaoh.\" It is possible that this blessing is the same as that already mentioned, now reiterated in its proper place in the narrative. \"According to the little ones.\" This means either in proportion to the number in each household, or with all the tenderness with which a parent provides for his infant offspring.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. The days of the years of my pilgrimage, &c.—Though a hundred thirty years, he reckons by days (compare Ps 90:12), which he calls few, as they appeared in retrospect, and evil, because his life had been one almost unbroken series of trouble. The answer is remarkable, considering the comparative darkness of the patriarchal age (compare 2Ti 1:10).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My pilgrimage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. my unstable or unsettled life, in which I have been flitting from place to place. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 17:8 Psalm 119:19 Hebrews 11:9,13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And though I seem old in comparison of thy people, yet I fall much short of my progenitors, Isaac, and Abraham, and Terah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob said unto Pharaoh, the days of the years of my pilgrimage are an hundred and thirty years,.... He calls his life a \"pilgrimage\"; as every good man's is; they are not at home in their own country, they are seeking a better, even an heavenly one: Jacob's life was very emphatically and literally a pilgrimage; he first dwelt in Canaan, from thence he removed to Padanaram, and sojourned there awhile, and then came to Canaan again; for some time he dwelt at Succoth, and then at Shechem, and after that at Hebron, and now he was come down to Egypt, and he had spent one hundred and thirty years of his life in this way: and with this perfectly agrees the account of Polyhistor from Demetrius (n), an Heathen writer, who makes the age of Jacob when he came into Egypt one hundred and thirty, and that year to be the third year of the famine, agreeably to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "few and evil have the days of the years of my life been; see Job 14:1; he calls his days but \"few\", in comparison of the long lives of the patriarchs in former times, and especially in comparison of the days of eternity: and \"evil\", because of the many afflictions he had met with; as from Esau, from whose face he was obliged to flee lest he should kill him, Genesis 27:41; and in Laban's house, where he served for a wife fourteen years, and endured great hardships, Genesis 31:41; and at Shechem, where his daughter was ravished, Genesis 34:2, and his sons made that slaughter of the Shechemites, Genesis 34:25, which he feared would cause his name to stink, Genesis 34:30; and at Ephrath, where he buried his beloved Rachel, Genesis 35:16; and at Hebron, where his sons brought him such an account as if they believed his beloved son Joseph was destroyed by a wild beast, Genesis 37:32, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "few and evil have the days of the years of my life been; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; he calls his days but \"few\", in comparison of the long lives of the patriarchs in former times, and especially in comparison of the days of eternity: and \"evil\", because of the many afflictions he had met with; as from Esau, from whose face he was obliged to flee lest he should kill him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 27:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and in Laban's house, where he served for a wife fourteen years, and endured great hardships, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 31:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and at Shechem, where his daughter was ravished, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and his sons made that slaughter of the Shechemites, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which he feared would cause his name to stink, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 34:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and at Ephrath, where he buried his beloved Rachel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and at Hebron, where his sons brought him such an account as if they believed his beloved son Joseph was destroyed by a wild beast, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and have not attained unto the days of the years of the life of my fathers in the days of their pilgrimage; his grandfather Abraham lived to be one hundred amnd seventy five years of age, Genesis 25:7, and his father Isaac lived to the age of one hundred and eighty, Genesis 35:28. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and have not attained unto the days of the years of the life of my fathers in the days of their pilgrimage; his grandfather Abraham lived to be one hundred amnd seventy five years of age, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and his father Isaac lived to the age of one hundred and eighty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 35:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Apud Euseb. Praepar. Evangel. l. 9. c. p. 21. p. 425. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Apud Euseb. Praepar. Evangel. l. 9. c. p. 21. p. 425. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jacob said unto Pharaoh, The days of the years of my pilgrimage are an hundred and thirty years: few and evil have the days of the years of my life been, and have not attained unto the days of the years of the life of my fathers in the days of their pilgrimage.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pilgrimage",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. marg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sojournings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 36:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (P). The two renderings depend upon the metaphorical, or literal, explanation of Jacob’s words. Is it the metaphorical pilgrimage of life? or is it the frequent change of Jacob’s abode to which he makes reference? The latter is perhaps preferable, (1) on account of the allusion to the lives of his fathers, and (2) because this metaphor in the Bible seems to be based on the experience of the patriarchs themselves. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "few",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. by comparison with the traditional days of old (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.) according to P.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Alluding to the flight from home, the hardships of the service in Haran, the loss of Joseph, the death of Rachel, the violence of Simeon and Levi (chap. 34).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they have not attained",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jacob’s life of 130 years at this juncture seemed short in comparison with the 175 years of Abraham (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the 180 years of Isaac (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 47:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph then presented his father to Pharaoh, but not till after the audience of his brothers had been followed by the royal permission to settle, for which the old man, who was bowed down with age, was not in a condition to sue. The patriarch saluted the king with a blessing, and replied to his inquiry as to his age, \"The days of the years of my pilgrimage are 130 years; few and sorrowful are the days of my life's years, and have not reached (the perfect in the presentiment of his approaching end) the days of the life's years of my fathers in the days of their pilgrimage.\" Jacob called his own life and that of his fathers a pilgrimage (מגוּרים), because they had not come into actual possession of the promised land, but had been obliged all their life long to wander about, unsettled and homeless, in the land promised to them for an inheritance, as in a strange land. This pilgrimage was at the same time a figurative representation of the inconstancy and weariness of the earthly life, in which man does not attain to that true rest of peace with God and blessedness in His fellowship, for which he was created, and for which therefore his soul is continually longing (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The apostle, therefore, could justly regard these words as a declaration of the longing of the patriarchs for the eternal rest of their heavenly fatherland (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). So also Jacob's life was little (מעט) and evil (i.e., full of toil and trouble) in comparison with the life of his fathers. For Abraham lived to be 175 years old, and Isaac 180; and neither of them had led a life so agitated, so full of distress and dangers, of tribulation and anguish, as Jacob had from his first flight to Haran up to the time of his removal to Egypt. ",
        "children": []
      }
    ]
  }
]