[{"header":"The Building of the Temple"},{"num":6,"verse":"Now it came about in the four hundred and eightieth year after the Israelites came out of the land of Egypt, in the fourth year of Solomon’s reign over Israel, in the month of Ziv (April-May) which is the second month, that he began to build the Lord’s house (temple). "},{"num":2,"verse":"The length of the house which King Solomon built for the Lord was sixty cubits (90 ft.), its width twenty (30 ft.), and its height thirty cubits (45 ft.). "},{"num":3,"verse":"The porch in front of the main room of the house (temple) was twenty cubits long, corresponding to the width of the house, and its depth in front of the house was ten cubits. "},{"num":4,"verse":"He also made framed (artistic) window openings for the house. "},{"num":5,"verse":"Against the wall of the house he built extensions around the walls of the house, around both the main room (Holy Place) and the Holy of Holies; and he made side chambers all around. "},{"num":6,"verse":"The lowest story was five cubits wide, the middle was six cubits wide, and the third was seven cubits wide; for he made offsets (niches) in the walls all around on the outside of the house so that the supporting beams would not be inserted into the walls of the house."},{"num":7,"verse":"While it was being built, the house was built of stone prepared and finished (precut) at the quarry, and no hammer, axe, or iron tool of any kind was heard in the house while it was under construction."},{"num":8,"verse":"The entrance to the lowest side chamber was on the right [or south] side of the house; and they would go up winding stairs to the middle [level], and from the middle to the third. "},{"num":9,"verse":"So Solomon built the house (temple) and finished it, and roofed the house with beams and boards of cedar. "},{"num":10,"verse":"Then he built the extensions [of rooms] against the entire house, each [story] five cubits high; and they were attached to the house with timbers of cedar."},{"num":11,"verse":"Now the word of the Lord came to Solomon, saying, "},{"num":12,"verse":"“Concerning this house which you are building, if you will walk in My statutes and execute My precepts and keep all My commandments by walking in them, then I will carry out My word (promises) with you which I made to David your father. "},{"num":13,"verse":"I will dwell among the sons (descendants) of Israel, and will not abandon My people Israel.”"},{"num":14,"verse":"So Solomon built the house (temple) and finished it. "},{"num":15,"verse":"He built the walls of the interior of the house [that is, the Holy Place and the Holy of Holies] with boards of cedar, from the floor of the house to the rafters of the ceiling. He overlaid the interior with wood, and he overlaid the floor of the house with boards of cypress. "},{"num":16,"verse":"He built twenty cubits on the rear of the house with boards of cedar from the floor to the ceiling; he built its interior as the [inner] sanctuary, the Holy of Holies. "},{"num":17,"verse":"The [rest of the] house, that is, the temple in front of the Holy of Holies, was forty cubits long. "},{"num":18,"verse":"The cedar on the house within had wood carvings in the shape of gourds and open flowers. Everything was cedar; no stone was visible. "},{"num":19,"verse":"Then he prepared the Holy of Holies within the house in order to put the ark of the covenant of the Lord there. "},{"num":20,"verse":"The Holy of Holies was twenty cubits in length, twenty cubits in width, and twenty cubits in height (a cube), and he overlaid it with pure gold. He also overlaid the cedar altar [with gold]. "},{"num":21,"verse":"Solomon overlaid the interior of the house with pure gold, and he drew chains of gold across the front of the Holy of Holies (inner sanctuary), and he overlaid it with gold. "},{"num":22,"verse":"Then he overlaid the entire house with gold, until the whole house was finished. He also overlaid the entire [incense] altar which was by the Holy of Holies with gold."},{"num":23,"verse":"Within the Holy of Holies he made two cherubim (sculptured figures) of olive wood, each ten cubits high. "},{"num":24,"verse":"One wing of the cherub was five cubits long, and the other wing was also five cubits long; it was ten cubits from the tip of one wing to the tip of the other. "},{"num":25,"verse":"The [wingspan of the] other cherub was also ten cubits. The measurements and cut (shape) of the two cherubim were the same; "},{"num":26,"verse":"the height of the one cherub was ten cubits, as was the other. "},{"num":27,"verse":"He put the cherubim [above the ark] inside the innermost room of the house, and their wings were spread out so that the wing of the one touched one wall, and the wing of the other cherub was touching the other wall; and their inner wings were touching each other in the middle of the house. "},{"num":28,"verse":"Solomon also overlaid the cherubim with gold."},{"num":29,"verse":"He carved all the walls of the house all around with carved engravings of cherubim, palm-shaped decorations, and open flowers, [both] the inner and the outer sanctuaries. "},{"num":30,"verse":"He overlaid the floor of the house with gold, [both] the inner and outer sanctuaries."},{"num":31,"verse":"For the entrance of the Holy of Holies he made two [folding] doors of olive wood, the lintel (header above the door) and five-sided doorposts (frames). "},{"num":32,"verse":"So he made two doors of olive wood, and he carved on them carvings of cherubim, palm-shaped decorations, and open flowers; and overlaid them with gold; and he hammered out overlays of gold on the cherubim and palm decorations."},{"num":33,"verse":"Also he made for the entrance of the [outer] sanctuary (the Holy Place) four-sided doorposts (frames) of olive wood "},{"num":34,"verse":"and two doors of cypress wood; the two leaves of the one door turned on pivots and were folding, and the two leaves of the other door also turned on pivots. "},{"num":35,"verse":"He carved cherubim, palm-shaped decorations, and open flowers on the doors, and overlaid them with gold evenly applied on the carved work. "},{"num":36,"verse":"He built the inner courtyard with three rows of cut stone and a row of cedar beams."},{"num":37,"verse":"In the fourth year [of King Solomon’s reign] the foundation of the Lord’s house was laid, in the [second] month, Ziv (April-May). "},{"num":38,"verse":"In the eleventh year [of King Solomon’s reign] in the month of Bul (October-November), that is, the eighth month, the house was finished throughout all its parts and in accordance with all its specifications. So he built it in seven years."}]