[{"header":"Solomon Builds the Temple"},{"num":6,"verse":"Four hundred and eighty years after the people of Israel left Egypt, during the fourth year of Solomon's reign over Israel, in the second month, the month of Ziv, Solomon began work on the Temple. "},{"num":2,"verse":"Inside it was 90 feet long, 30 feet wide, and 45 feet high. "},{"num":3,"verse":"The entrance room was 15 feet deep and 30 feet wide, as wide as the sanctuary itself. "},{"num":4,"verse":"The walls of the Temple had openings in them, narrower on the outside than on the inside. "},{"num":5,"verse":"Against the outside walls, on the sides and the back of the Temple, a three-storied annex was built, each story 7½ feet high. "},{"num":6,"verse":"Each room in the lowest story was 7½ feet wide, in the middle story 9 feet wide, and in the top story 10½ feet wide. The Temple wall on each floor was thinner than on the floor below, so that the rooms could rest on the wall without having their beams built into it."},{"num":7,"verse":"The stones with which the Temple was built had been prepared at the quarry, so that there was no noise made by hammers, axes, or any other iron tools as the Temple was being built."},{"num":8,"verse":"The entrance to the lowest story of the annex was on the south side of the Temple, with stairs leading up to the second and third stories. "},{"num":9,"verse":"So King Solomon finished building the Temple. He put in a ceiling made of beams and boards of cedar. "},{"num":10,"verse":"The three-storied annex, each story 7½ feet high, was built against the outside walls of the Temple, and was joined to them by cedar beams."},{"num":11,"verse":"The Lord said to Solomon, "},{"num":12,"verse":"“If you obey all my laws and commands, I will do for you what I promised your father David. "},{"num":13,"verse":"I will live among my people Israel in this Temple that you are building, and I will never abandon them.”"},{"num":14,"verse":"So Solomon finished building the Temple."},{"header":"The Interior Furnishings of the Temple(A)"},{"num":15,"verse":"The inside walls were covered with cedar panels from the floor to the ceiling, and the floor was made of pine. "},{"num":16,"verse":"An inner room, called the Most Holy Place, was built in the rear of the Temple. It was 30 feet long and was partitioned off by cedar boards reaching from the floor to the ceiling. "},{"num":17,"verse":"The room in front of the Most Holy Place was 60 feet long. "},{"num":18,"verse":"The cedar panels were decorated with carvings of gourds and flowers; the whole interior was covered with cedar, so that the stones of the walls could not be seen."},{"num":19,"verse":"In the rear of the Temple an inner room was built, where the Lord's Covenant Box was to be placed. "},{"num":20,"verse":"This inner room was 30 feet long, 30 feet wide, and 30 feet high, all covered with pure gold. The altar was covered with cedar panels. "},{"num":21,"verse":"The inside of the Temple was covered with gold, and gold chains were placed across the entrance of the inner room, which was also covered with gold. "},{"num":22,"verse":"The whole interior of the Temple was covered with gold, as well as the altar in the Most Holy Place."},{"num":23,"verse":"Two winged creatures were made of olive wood and placed in the Most Holy Place, each one 15 feet tall. "},{"num":24,"verse":"Both were of the same size and shape. Each had two wings, each wing 7½ feet long, so that the distance from one wing tip to the other was 15 feet. "},{"num":27,"verse":"They were placed side by side in the Most Holy Place, so that two of their outstretched wings touched each other in the middle of the room, and the other two wings touched the walls. "},{"num":28,"verse":"The two winged creatures were covered with gold."},{"num":29,"verse":"The walls of the main room and of the inner room were all decorated with carved figures of winged creatures, palm trees, and flowers. "},{"num":30,"verse":"Even the floor was covered with gold."},{"num":31,"verse":"A double door made of olive wood was set in place at the entrance of the Most Holy Place; the top of the doorway was a pointed arch. "},{"num":32,"verse":"The doors were decorated with carved figures of winged creatures, palm trees, and flowers. The doors, the winged creatures, and the palm trees were covered with gold. "},{"num":33,"verse":"For the entrance to the main room a rectangular doorframe of olive wood was made. "},{"num":34,"verse":"There were two folding doors made of pine "},{"num":35,"verse":"and decorated with carved figures of winged creatures, palm trees, and flowers, which were evenly covered with gold."},{"num":36,"verse":"An inner court was built in front of the Temple, enclosed with walls which had one layer of cedar beams for every three layers of stone."},{"num":37,"verse":"The foundation of the Temple was laid in the second month, the month of Ziv, in the fourth year of Solomon's reign. "},{"num":38,"verse":"In the eighth month, the month of Bul, in the eleventh year of Solomon's reign, the Temple was completely finished exactly as it had been planned. It had taken Solomon seven years to build it."}]