[{"header":"Crossing the Jordan"},{"num":3,"verse":"Early the next morning Joshua and all the people of Israel left Acacia. They traveled to the Jordan River and camped there before crossing it. "},{"num":2,"verse":"After three days the officers went through the camp. "},{"num":3,"verse":"They gave orders to the people. They said, “You will see the priests and Levites carrying the Ark of the Covenant with the Lord your God. Then you should leave where you are and follow it. "},{"num":4,"verse":"That way you will know which way to go. You have never traveled this way before. But do not follow too closely. Stay about a thousand yards behind the Ark of the Covenant.”"},{"num":5,"verse":"Then Joshua told the people, “Make yourselves holy for the Lord. Tomorrow the Lord will do amazing things among you.”"},{"num":6,"verse":"Joshua said to the priests, “Take the Ark of the Covenant. Cross over the river ahead of the people.” So the priests lifted the Ark of the Covenant and carried it ahead of the people."},{"num":7,"verse":"Then the Lord said to Joshua, “Today I will begin to make you a great man to all the Israelites. So the people will know I am with you just as I was with Moses. "},{"num":8,"verse":"The priests will carry the Ark of the Covenant. Tell them this: ‘Go to the edge of the Jordan River and stand in the water.’”"},{"num":9,"verse":"Then Joshua said to the people of Israel, “Come here. Listen to the words of the Lord your God. "},{"num":10,"verse":"Here is proof that the living God is with you. Here is proof that he will drive out the Canaanites, Hittites, Hivites, Perizzites, Girgashites, Amorites and the Jebusites. "},{"num":11,"verse":"This is the proof: The Ark of the Covenant will go ahead of you into the Jordan River. It is the Agreement with the Lord of the whole world. "},{"num":12,"verse":"Now choose 12 men from among you. Choose 1 from each of the 12 tribes of Israel. "},{"num":13,"verse":"The priests will carry the Ark of the Covenant of the Lord, the Master of the whole world. They will carry it into the Jordan ahead of you. When they enter the water, the river will stop flowing. The water will be stopped. It will stand up in a heap as if a dam were there.”"},{"num":14,"verse":"So the priests carried the Ark of the Covenant. And the people left the place where they had camped. Then they started across the Jordan River. "},{"num":15,"verse":"During harvest the Jordan is flooded. So the river was at its fullest. The priests who were carrying the Ark of the Covenant came to the edge of the river. And they stepped into the water. "},{"num":16,"verse":"Just at that moment, the water stopped flowing. It stood up in a heap a great distance away at Adam. This is a town near Zarethan. The water flowing down to the Sea of Arabah (the Dead Sea) was completely cut off. So the people crossed the river near Jericho. "},{"num":17,"verse":"The ground there became dry. The priests carried the Ark of the Covenant with the Lord to the middle of the river and stopped. They waited there while all the people of Israel walked across. They crossed the Jordan River on dry land."}]