[{"num":16,"verse":"1 The sign of Jonah. 6 The leaven of the Pharisees, 12 for their doctrine. 13 The people’s opinion of Christ. 17 Faith cometh of God. 18 The rock. 19 The keys. 21 Christ foreshadoweth his death. 24 The forsaking of ourself, and the cross. 25 To lose the life."},{"num":1,"verse":"Then came the Pharisees and Sadducees, and did tempt him, desiring him to show them a sign from heaven."},{"num":2,"verse":"But he answered, and said unto them, When it is evening, ye say, Fair weather, for the sky is red. "},{"num":3,"verse":"And in the morning, ye say, Today shall be a tempest: for the sky is red and lowering. O hypocrites, ye can discern the face of the sky, and can ye not discern the signs of the times? "},{"num":4,"verse":"The wicked generation, and adulterous seeketh a sign, but there shall no sign be given it, but that sign of the Prophet Jonah: so he left them, and departed."},{"num":5,"verse":"¶ And when his disciples were come to the other side, they had forgotten to take bread with them."},{"num":6,"verse":"Then Jesus said unto them, Take heed and beware of the leaven of the Pharisees and Sadducees. "},{"num":7,"verse":"And they reasoned among themselves, saying, It is because we have brought no bread."},{"num":8,"verse":"But Jesus knowing it, said unto them, O ye of little faith, why reason ye thus among yourselves, because ye have brought no bread? "},{"num":9,"verse":"Do ye not yet perceive, neither remember the five loaves, when there were five thousand men, and how many baskets took ye up? "},{"num":10,"verse":"Neither the seven loaves when there were four thousand men, and how many baskets took ye up? "},{"num":11,"verse":"Why perceive ye not that I said not unto you concerning bread, that ye should beware of the leaven of the Pharisees and Sadducees? "},{"num":12,"verse":"Then understood they that he had not said that they should beware of the leaven of bread, but of the doctrine of the Pharisees, and Sadducees."},{"num":13,"verse":"¶ Now when Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I, the son of man, am? "},{"num":14,"verse":"And they said, Some say, John Baptist: and some, Elijah: and others, Jeremiah, or one of the Prophets."},{"num":15,"verse":"He said unto them, But whom say ye that I am? "},{"num":16,"verse":"Then Simon Peter answered, and said, Thou art that Christ, the son of the living God."},{"num":17,"verse":"And Jesus answered, and said to him, Blessed art thou, Simon, the son of Jonah: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven. "},{"num":18,"verse":"And I say also unto thee, that thou art Peter, and upon this rock I will build my Church: and the gates of hell shall not overcome it. "},{"num":19,"verse":"And I  will give unto thee the keys of the Kingdom of heaven, and whatsoever thou shalt bind upon earth, shall be bound in heaven: and whatsoever thou shalt loose on earth, shall be loosed in heaven. "},{"num":20,"verse":"Then he charged his disciples, that they should tell no man that he was Jesus that Christ."},{"num":21,"verse":"¶ From that time forth Jesus began to show unto his disciples, that he must go unto Jerusalem, and suffer many things of the Elders, and of the high Priests, and Scribes, and be slain and be raised again the third day."},{"num":22,"verse":"Then Peter took him aside, and began to rebuke him, saying, Master, pity thyself: this shall not be unto thee."},{"num":23,"verse":"Then he turned back, and said unto Peter, Get thee behind me, Satan: thou art an offence unto me, because thou understandest not the things that are of God, but the things that are of men. "},{"num":24,"verse":"Jesus then said to his disciples, If any man will follow me, let him forsake himself: and take up his cross, and follow me. "},{"num":25,"verse":"For whosoever will save his life, shall lose it: and whosoever shall lose his life for my sake, shall find it. "},{"num":26,"verse":"For what shall it profit a man though he should win the whole world, if he lose his own soul? or what shall a man give for recompense of his soul? "},{"num":27,"verse":"For the son of man shall come in the glory of his Father with his Angels, and then shall he give to every man according to his deeds. "},{"num":28,"verse":"Verily I say unto you, there be some of them that stand here, which shall not taste of death, till they have seen the Son of man come in his kingdom. "}]