[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45:1-5 An encouragement sent to Baruch. - Baruch was employed in writing Jeremiah's prophecies, and reading them, see ch. Jer 36, and was threatened for it by the king. Young beginners in religion are apt to be discouraged with little difficulties, which they commonly meet with at first in the service of God. These complaints and fears came from his corruptions. Baruch had raised his expectations too high in this world, and that made the distress and trouble he was in harder to be borne. The frowns of the world would not disquiet us, if we did not foolishly flatter ourselves with the hopes of its smiles, and court and covet them. What a folly is it then to seek great things for ourselves here, where every thing is little, and nothing certain! The Lord knows the real cause of our fretfulness and despondency better than we do, and we should beg of him to examine our hearts, and to repress every wrong desire in us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These words - i. e., the words of Jehoiakim's scroll. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 45",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jer 45:1-5. Jeremiah Comforts Baruch.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "After the completion of the prophecies and histories appertaining to the Jewish people and kings, Jeremiah subjoins one referring to an individual, Baruch; even as there are subjoined to the epistles of Paul addressed to churches, epistles to individuals, some of which were prior in date to the former. Afterwards follow the prophecies referring to other nations, closing the book [Grotius]. The date of the events here told is eighteen years before the taking of the city; this chapter in point of time follows the thirty-sixth chapter. Baruch seems to have been regularly employed by Jeremiah to commit his prophecies to writing (Jer 36:1, 4, 32).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. these words—his prophecies from the thirteenth year of Josiah to the fourth of Jehoiakim.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Jeremiah had in his former discourses revealed the will of God concerning nations, here he revealeth it as to Baruch his secretary or clerk, upon which account some compare him to Paul writing to Philemon as well as to churches. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus saith the Lord, the God of Israel, unto thee, O Baruch. Whom he knew by name, had a great regard for, and honours with this prophecy; and, being an Israelite, both in a literal and spiritual sense, he addresses him as the God of Israel, and as being his covenant God; in whom he should put his trust, and from whom he might expect safety and protection in the worst of times; and to whose sovereign will, in all the dispensations of his providence, he ought to have humbly and patiently submitted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus saith the LORD, the God of Israel, unto thee, O Baruch:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] rather, as mg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "concerning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jeremiah 45:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"The word which Jeremiah the prophet spake to Baruch the son of Neriah, when he wrote these words in a book at the mouth of Jeremiah, in the fourth year of Jehoiakim the son of Josiah king of Judah, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 45:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith Jahveh, the God of Israel, to thee, O Baruch: V. 3. Thou saidst, Woe to me now! for Jahveh hath added sorrow to my pain: I am weary with sighing, and no rest do I find. V. 4. Thus shalt thou say unto him, Thus saith Jahveh: Behold, what I have built I will destroy, and what I have planted I will pluck up, and that is the whole earth. V. 5. And thou seekest great things for thyself: seek them not: for, behold, I will bring evil on all flesh, saith Jahveh; but I will give thy life unto thee for booty in all places whither thou shalt go.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From the superscription in Jeremiah 45:1, it appears that this word of God came to Baruch through Jeremiah the prophet, in the fourth year of the reign of Jehoiakim, when Baruch was writing out, or had written out, in a book-roll the prophecies that had been uttered by Jeremiah up till that time. It is not necessarily implied in the infin. בּכתבו that the word of God came during the transcription, while he was still engaged in writing: it may also mean, \"when he was ready with the writing,\" had got done with it; and Hitzig is wrong when he rejects as \"misleading\" the view which Movers takes - \"when he had written.\" The writing down of the addresses of Jeremiah in the year mentioned is related in Jeremiah 36; thus the substance of this chapter and that of Jeremiah 36 agree. \"These words\" can only be the addresses (words) of Jeremiah which Baruch was then writing down. From this, Hitzig, Graf, Ngelsbach, and others, infer that this small piece was the last in the copy of Jeremiah's prophecies originally prepared under Jehoiakim, - if not of the first one which was intended to be read in the temple, at least of the second copy which was made after the former one had been destroyed; and that it was only after the collection had been enlarged to the extent of the collection handed down to us, that this portion was affixed as an appendix to the end of the prophecies of Jeremiah which relate to his own country. But this inference is not a valid one. \"These words\" are the addresses of the prophet in general, which Baruch wrote down; and that only those which were uttered up to the fourth year of Jehoiakim are intended, is implied, not in the demonstrative \"these,\" but in the date given afterwards, by which \"these\" is further specified. In Jeremiah 45:1 it is merely stated that at that time the word of God, given below, came to Jeremiah, and through Him to Baruch, but not that Baruch wrote down this also on that occasion, and appended it to the roll of Jeremiah's prophecies which had been prepared at his dictation. It may have been written down much later, possibly not till the whole of Jeremiah's prophecies were collected and arranged in Egypt. Moreover, the position occupied by this chapter in the collection shows that this message of comfort to Baruch was added as an appendix to those predictions of Jeremiah which concern Judah and Israel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From the superscription in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 45:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it appears that this word of God came to Baruch through Jeremiah the prophet, in the fourth year of the reign of Jehoiakim, when Baruch was writing out, or had written out, in a book-roll the prophecies that had been uttered by Jeremiah up till that time. It is not necessarily implied in the infin. בּכתבו that the word of God came during the transcription, while he was still engaged in writing: it may also mean, \"when he was ready with the writing,\" had got done with it; and Hitzig is wrong when he rejects as \"misleading\" the view which Movers takes - \"when he had written.\" The writing down of the addresses of Jeremiah in the year mentioned is related in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; thus the substance of this chapter and that of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " agree. \"These words\" can only be the addresses (words) of Jeremiah which Baruch was then writing down. From this, Hitzig, Graf, Ngelsbach, and others, infer that this small piece was the last in the copy of Jeremiah's prophecies originally prepared under Jehoiakim, - if not of the first one which was intended to be read in the temple, at least of the second copy which was made after the former one had been destroyed; and that it was only after the collection had been enlarged to the extent of the collection handed down to us, that this portion was affixed as an appendix to the end of the prophecies of Jeremiah which relate to his own country. But this inference is not a valid one. \"These words\" are the addresses of the prophet in general, which Baruch wrote down; and that only those which were uttered up to the fourth year of Jehoiakim are intended, is implied, not in the demonstrative \"these,\" but in the date given afterwards, by which \"these\" is further specified. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 45:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is merely stated that at that time the word of God, given below, came to Jeremiah, and through Him to Baruch, but not that Baruch wrote down this also on that occasion, and appended it to the roll of Jeremiah's prophecies which had been prepared at his dictation. It may have been written down much later, possibly not till the whole of Jeremiah's prophecies were collected and arranged in Egypt. Moreover, the position occupied by this chapter in the collection shows that this message of comfort to Baruch was added as an appendix to those predictions of Jeremiah which concern Judah and Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The occasion for this message of comfort addressed to the prophet's attendant is pointed out in Jeremiah 45:3, in the words which Baruch had uttered: \"Woe to me! for Jahveh adds sorrow to my pain.\" Baruch felt \"pain,\" i.e., pain of soul, at the moral corruption of the people, their impenitence and obduracy in sin and vice, just like the prophet himself, Jeremiah 15:18. To this pain God adds sorrow, by threatening the judgment which shall fall on Judah for sin, and which was even then beginning to break over the land; cf. Jeremiah 8:18. Baruch sighs over this till he is wearied, and finds no rest; cf. Lamentations 5:5. \"I am weary with my sighing,\" is a reminiscence from Psalm 6:7. This sorrow in addition to his pain was not caused in him for the first time by writing down the discourses of the prophet, but was rather thus freshened and increased. The answer of the Lord to this sighing is of a stern character, yet soothing for Baruch. The sentence of destruction has been determined on. What the Lord has built He will now destroy: it is not said why, since the reason was sufficiently known from the prophet's utterances. As to the expression in Jeremiah 45:4, cf. Jeremiah 1:10; Jeremiah 31:28. The destruction regards the whole earth, היא  ואת־כּל־הארץ, lit., \"and as regards the whole earth, it is it,\" namely that I destroy. On the employment of את in introducing the subject, cf. Daniel 9:13; Haggai 2:5, and Ewald, 277 d. כּל־הארץ does not mean \"the whole land,\" but \"the whole earth:\" this is indubitably evident from the parallel \"upon all flesh,\" Jeremiah 45:5, i.e., the whole of humanity, as in Jeremiah 25:31. The sentence is passed on all the earth, in accordance with the announcement made in Jeremiah 25:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The occasion for this message of comfort addressed to the prophet's attendant is pointed out in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 45:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the words which Baruch had uttered: \"Woe to me! for Jahveh adds sorrow to my pain.\" Baruch felt \"pain,\" i.e., pain of soul, at the moral corruption of the people, their impenitence and obduracy in sin and vice, just like the prophet himself, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 15:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To this pain God adds sorrow, by threatening the judgment which shall fall on Judah for sin, and which was even then beginning to break over the land; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 8:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Baruch sighs over this till he is wearied, and finds no rest; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"I am weary with my sighing,\" is a reminiscence from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 6:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This sorrow in addition to his pain was not caused in him for the first time by writing down the discourses of the prophet, but was rather thus freshened and increased. The answer of the Lord to this sighing is of a stern character, yet soothing for Baruch. The sentence of destruction has been determined on. What the Lord has built He will now destroy: it is not said why, since the reason was sufficiently known from the prophet's utterances. As to the expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 45:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 31:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The destruction regards the whole earth, היא  ואת־כּל־הארץ, lit., \"and as regards the whole earth, it is it,\" namely that I destroy. On the employment of את in introducing the subject, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Ewald, 277 d. כּל־הארץ does not mean \"the whole land,\" but \"the whole earth:\" this is indubitably evident from the parallel \"upon all flesh,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 45:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", i.e., the whole of humanity, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The sentence is passed on all the earth, in accordance with the announcement made in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]