[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Silver . . . gold.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is unnatural to suppose that this is said in the sense of Ps. 1:10, as implying “I have no need of silver or gold.” Clearly what is meant is that the treasures of earth are at God’s disposal, and that He will incite the Gentiles to offer their silver and gold in His Temple. A rigid application of this prediction is impossible. (See Introduction, § 2.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Haggai 2:8-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 2:8-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The silver is mine — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Solomon’s temple was more richly adorned with silver and gold than this, and I, that am the Lord of all the world, could easily command the riches of it, and bring them together for beautifying this my house, if I took delight in, or wanted any thing of this sort. A like expression as this is used, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with regard to sacrifices. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The glory of this latter house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — The glory of this second temple shall exceed that of the former, not in riches or costly ornaments, but in this, that there the prince of peace shall make his appearance, and there the gospel of peace shall be preached and published. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 9:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Notwithstanding the former temple had the Urim and Thummim, the ark containing the two tables of the law, (written with the finger of God,) the pot of manna, Aaron’s rod that budded, and the cloud that overshadowed the mercy-seat, and was the symbol of the divine presence; yet the glory of this latter house shall be greater by the appearance, doctrines, and miracles of Christ. Some interpret this passage of the richer decorations in the latter temple; but it may well be doubted whether the second temple could exceed that of Solomon in the splendour and costliness of its ornaments. The presumption is, that the former temple was more magnificent and sumptuous in its furniture than the latter, though inferior to it in point of magnitude. Prideaux values the gold, with which the holy of holies alone was overlaid, at four million three hundred and twenty thousand pounds sterling. P.I.B. 3. Ann. 534.” — Newcome. What were the magnificence and beauty which adorned the former temple? What was even the Shechinah, the resplendent ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cloud of glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which rested upon the mercy-seat, compared with the emanations of the divine perfections from Immanuel: the almighty power and boundless goodness exerted in acts of beneficence which shone forth in Christ, when ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the blind and the lame came to him in the temple, and he healed them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the infinite wisdom displayed in his divine discourses, when ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he taught daily in the temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doctrine dropped as the rain, and his speech distilled as the dew? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And never, surely, was such peace given to men by any other as was imparted by and through him; peace between God and man, between Jews and Gentiles, and between man and man, wherever his religion is received in the truth and power of it: peace, spiritual, internal, and heavenly; peace of conscience, tranquillity of mind, serenity of heart; a peace which, as the apostle observes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "passeth all understanding, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "all purely rational conception, or, which no one can comprehend, save he that receives it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-9 Those who are hearty in the Lord's service shall receive encouragement to proceed. But they could not build such a temple then, as Solomon built. Though our gracious God is pleased if we do as well as we can in his service, yet our proud hearts will scarcely let us be pleased, unless we do as well as others, whose abilities are far beyond ours. Encouragement is given the Jews to go on in the work notwithstanding. They have God with them, his Spirit and his special presence. Though he chastens their transgressions, his faithfulness does not fail. The Spirit still remained among them. And they shall have the Messiah among them shortly; He that should come. Convulsions and changes would take place in the Jewish church and state, but first should come great revolutions and commotions among the nations. He shall come, as the Desire of all nations; desirable to all nations, for in him shall all the earth be blessed with the best of blessings; long expected and desired by all believers. The house they were building should be filled with glory, very far beyond Solomon's temple. This house shall be filled with glory of another nature. If we have silver and gold, we must serve and honour God with it, for the property is his. If we have not silver and gold, we must honour him with such as we have, and he will accept us. Let them be comforted that the glory of this latter house shall be greater than that of the former, in what would be beyond all the glories of the first house, the presence of the Messiah, the Son of God, the Lord of glory, personally, and in human nature. Nothing but the presence of the Son of God, in human form and nature, could fulfil this. Jesus is the Christ, is He that should come, and we are to look for no other. This prophecy alone is enough to silence the Jews, and condemn their obstinate rejection of Him, concerning whom all their prophets spake. If God be with us, peace is with us. But the Jews under the latter temple had much trouble; but this promise is fulfilled in that spiritual peace which Jesus Christ has by his blood purchased for all believers. All changes shall make way for Christ to be desired and valued by all nations. And the Jews shall have their eyes opened to behold how precious He is, whom they have hitherto rejected.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The silver is Mine, and the gold is Mine - These words, which have occasioned some to think, that God, in speaking of the glory with which He should fill the house, meant our material riches, suggest the contrary. For silver was no ornament of the temple of Solomon. Everything was overlaid with gold. In the tabernacle there were bowls of silver,  in Soloman's temple they and all were of gold ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 7:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Silver, we are expressly told, \"was nothing accounted of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the days of Solomon: he ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". made silver to be in Jerusalem as stones - for abundance.\" Rather, as God says by the Psalmist ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:10-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Every beast of the forest is Mine, so are the cattle upon a thousand hills: I know all the fowls of the mountains, and the wild beasts of the field are Mine. If I were hungry, I would not tell thee: for the world is Mine and the fullness thereof:\" so here He tells them, that for the glory of His house He needed not gold or silver: for all the wealth of the world is His. They had no ground  \"to grieve then, that they could not equal the magnificence of Solomon who had abundance of gold and silver.\" All was God's. He would fill it with divine glory. The Desire of all nations, Christ, should come, and be a glory, to which all created glory is nothing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " \"God says really and truly, that the silver and gold is His, which in utmost bounty He created, and in His most just government administers, so that, without His will and dominion, neither can the bad have gold and silver for the punishment of avarice, nor the good for the use of mercy. Its abundance does not inflate the good, nor its want crush them: but the bad, when bestowed, it blinds: when taken away, it tortures.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " \"It is as if He would say, Think not the temple inglorious, because, may be, it will have no portion of gold or silver, and their splendor. I need not such things. How should I? \"For Mine is the silver and Mine the gold, saith the Lord Almighty.\" I seek rather true worshipers: with their brightness will I guild this temple. Let him come who hath right faith, is adorned by graces, gleams with love for Me, is pure in heart, poor in spirit, compassionate and good.\" \"These make the temple, i. e., the Church, glorious and renowned, being glorified by Christ. For they have learned to pray, Psalm 90:17. \"The glory of the Lord our God be upon us.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " \"It is as if He would say, Think not the temple inglorious, because, may be, it will have no portion of gold or silver, and their splendor. I need not such things. How should I? \"For Mine is the silver and Mine the gold, saith the Lord Almighty.\" I seek rather true worshipers: with their brightness will I guild this temple. Let him come who hath right faith, is adorned by graces, gleams with love for Me, is pure in heart, poor in spirit, compassionate and good.\" \"These make the temple, i. e., the Church, glorious and renowned, being glorified by Christ. For they have learned to pray, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 90:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"The glory of the Lord our God be upon us.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. The silver is mine—(Job 41:11; Ps 50:12). Ye are disappointed at the absence of these precious metals in the adorning of this temple, as compared with the first temple: If I pleased I could adorn this temple with them, but I will adorn it with a \"glory\" (Hag 2:7, 9) far more precious; namely, with the presence of My divine Son in His veiled glory first, and at His second coming with His revealed glory, accompanied with outward adornment of gold and silver, of which the golden covering within and without put on by Herod is the type. Then shall the nations bring offerings of those precious metals which ye now miss so much (Isa 2:3; 60:3, 6, 7; Eze 43:2, 4, 5; 44:4). The heavenly Jerusalem shall be similarly adorned, but shall need \"no temple\" (Re 21:10-22). Compare 1Co 3:12, where gold and silver represent the most precious things (Zec 2:5). The inward glory of New Testament redemption far exceeds the outward glory of the Old Testament dispensation. So, in the case of the individual poor believer, God, if He pleased, could bestow gold and silver, but He bestows far better treasures, the possession of which might be endangered by that of the former (Jas 2:5).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The right as indisputable, the treasures of both as full and large, doubt not therefore but I will give enough to build this house; and I could beautify it with these as much as the first temple, but I intend a greater glory. I am the Proprietor, others but trustees; I have the full disposal of all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The silver is mine, and the gold is mine, saith the Lord of hosts. This seems designed to anticipate an objection taken from the gold and silver, with which the first temple was either decorated, or were in gifts dedicated to it; and which, it might easily be foreseen, would be wanting in the second temple; and in answer to which the Lord observes, that all the gold and silver in the world were his, were made by him, and were at his dispose; and therefore whatever were bestowed upon the former temple was only giving him his own; what he had a prior right to, and was no accession of riches or honour to him; and so it would be the same, let what would be expended on this; and therefore it was an article very inconsiderable, and of little significance; nor did he regard, or was he delighted with anything of this kind; and, was he so disposed, he could easily command all the gold and silver in the world together, and bring it into this house, to enrich and adorn it, without doing any injury to any person; but these were things he delighted not in; and, besides, he had a far greater glory in view to put upon this house, as follows: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The {e} silver is mine, and the gold is mine, saith the LORD of hosts.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " silver ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mine, and the gold ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mine, saith the LORD of hosts.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Therefore when his time comes he can make all the treasures of the world to serve his purpose: but the glory of this second Temple does not consist of material things, neither can it be built.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The silver is mine.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All the riches of the world are the Lord's, and he disposes of them as he wills; if he has promised that the Gentiles shall offer their treasures for his service, be sure he will perform his word. There may also be intended a word of comfort for the desponding; they need not grieve because they had but poor offerings to bring to the house; he wanted not gold or silver, for all was his. Haggai 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jehovah can fill this house with glory, because the silver and gold which the heathen nations possess belong to Him. By shaking all kingdoms He can induce the nations to present their treasures to Him as gifts for the glorification of His house. Thus (the promise closes with this in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the later glory of this house will be greater than the former was. Hâachărōn might be regarded as belonging to habbayith hazzeh, in the sense of \"the glory of this latter house;\" and the majority of the commentators have taken it so, after the Itala, Vulgate, and Peschito. But it is quite as admissible to connect it with kâbhōd, in the sense of \"the later glory of this house,\" inasmuch as when one substantive is determined by another which is connected with it in the construct state, the adjective belonging to the nomen regens follows with the article (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 23:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 23:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Ewald, 289, a). This is the rendering adopted by Michaelis, Maurer, Hitzig, and others, after the lxx. According to the first construction, the distinction would be drawn between a former and a later house; according to the second, simply between the earlier and later glory of the same house; and the passage would be based upon the idea, that through all ages there was only one house of Jehovah in Jerusalem existing under different forms. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is decisive in favour of the second view, for there an earlier glory is attributed to this house, and contrasted with its present miserable condition. The first or former glory is that of Solomon's temple, the later or last that of Zerubbabel's. The difference of opinion as to the true rendering of the words has no material influence upon the matter itself; except that, if the latter view be adopted, the question so often discussed by earlier writers - namely, whether by the second temple we are to understand the temple of Zerubbabel or the temple as altered by Herod, which many have erroneously taken to be the third - falls to the ground as perfectly unmeaning. The final glory of the temple will also be a lasting one. This is implied in the closing words of the promise: \"And in this place will I give peace.\" \"This place\" is not the temple, but Jerusalem, as the place where the temple is built; and the \"peace\" is not spiritual peace, but external peace, which does indeed in its perfect form include spiritual peace as well. This is perfectly evident from the parallel passages, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If we also take up the question as to the fulfilment of this prophecy, we must keep the two features quite distinct - (a) the shaking of heaven and earth and all nations; (b) the consequence of this shaking, the coming of the heathen with their possessions to the glorification of the temple - although they both stand in close connection. The earlier commentators were no doubt generally right, when they sought for the fulfilment in the establishment of the new covenant through Christ; they simply erred in referring the predicted shaking of the nations and the promised glorification of the temple in too one-sided and exclusive a manner to the coming of Christ in the flesh, to His teaching in the temple, and to the establishment of the kingdom of heaven through the preaching of the gospel. They were thereby compelled, on the one hand, to force upon the prophecy a meaning irreconcilable with the words themselves, and, on the other hand, to seek for its fulfilment in historical particulars to some extent of very subordinate importance. Even the predicted nearness of the time (\"it is a little while\") does not suit the exclusive reference to the establishment of the new covenant, or the founding of the Christian church. The period of 520 years, which elapsed before the birth of Christ, cannot be called a little or short time, as Calovius supposes, \"in comparison with the time that had passed since either the promulgation of the law or the promulgation of the protevangelium,\" inasmuch as five hundred are not מעט in relation to fifteen hundred, and the proposal to go back to the protevangelium is evidently merely a loophole of perplexity. Nor can מעט היא be explained on the hypothesis that the measure of time here is not a human one, but the divine measure, according to which a thousand years are equal to one day. \"For whoever speaks to men, must speak of things according to a human method of thinking; or if he do not, he must make it clear that this is the case. The prophet lays stress upon the brevity of the time, for the purpose of comforting. And only what is short in the eyes of men is fitted for this\" (Hengstenberg). The shaking of the heathen world did not first begin with the birth of Christ, but commenced shortly after the time of Haggai. It is true that under Darius Hystaspes the Persian empire was still standing at the summit of its power; but its shaking began under his successor Xerxes, and came very plainly to light in his war against Greece. \"Even then there were forebodings that the time of this empire would soon be accomplished, and the rapid conquests of Alexander gave fulfilment to this foreboding. And even his power, which seemed destined to last for ever, very speedily succumbed to the lot of all temporal things. Inde (says Livy) morte Alexandri distractum in multa regna, dum ad se quisque opes rapiunt lacerantes viribus, a summo culmine fortunae ad ultimum finem centum quinquaginta annos stetit. The two most powerful kingdoms that grew out of the monarchy of Alexander, viz., the Syrian and Egyptian, destroyed one another. The Romans now attained to the government of the world; but at the very time when they appeared to be at the summit of their greatness, their shaking had very considerably advanced\" (Hengstenberg). The circumstance that the prophet mentions the shaking of heaven and earth before the shaking of all the heathen, cannot furnish any valid ground for objecting to these allusions; nor can it force us to the conclusion that the words are only to be understood as denoting \"great political shakings, whereby the power of the heathen would be broken, their pride humbled, and so the susceptibility for salvation be evoked among them.\" For even if such events do shake the world, and are poetically represented as earthquakes, even if they were regarded by the nations as heralds of the approaching destruction of the world, because the impression they produced upon the mind was as if heaven and earth were falling to pieces; all this does not satisfy the words, which do not express the subjective emotion, but announce real facts. The shaking of heaven and earth, of the sea and of the dry land, is indeed partially effected by violent earthquakes and wonderful signs in the sky, and was typified by such judgments as the flood; but it is only fully accomplished at the breaking up of the present condition of the world in the destruction of this heaven and this earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The prophet mentions at the very outset the utmost and the last that God will do, to clear away all existing hindrances to the completion of His kingdom in glory, and then passes on to the shakings of the world of nations which prepare the way for and lead on to this result, just as Micah in Micah 4:1-13 comes back from the most remote future to the less remote, and then to the immediate future. For the shakings of the heathen, by which their power will be broken and the dissolution of heathenism and of the ungodly power of the world will be effected, do not reach their end with the coming of Christ and the establishment of the Christian church: but just as the kingdom of the world maintains its standing by the side of the kingdom of heaven established by Christ upon the earth, until the return of our Lord to judgment; so does the shaking of the heathen and of the kingdoms of the nations continue till every power which rises against the Almighty God and His Christ is broken, and the world which has been thrown into confusion by the sin of men, and is made subject to corruptibility on their account, shall perish, and the new heaven and new earth wherein dwelleth righteousness, for which we are looking, shall be established (2 Peter 3:12-13).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The prophet mentions at the very outset the utmost and the last that God will do, to clear away all existing hindrances to the completion of His kingdom in glory, and then passes on to the shakings of the world of nations which prepare the way for and lead on to this result, just as Micah in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:1-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " comes back from the most remote future to the less remote, and then to the immediate future. For the shakings of the heathen, by which their power will be broken and the dissolution of heathenism and of the ungodly power of the world will be effected, do not reach their end with the coming of Christ and the establishment of the Christian church: but just as the kingdom of the world maintains its standing by the side of the kingdom of heaven established by Christ upon the earth, until the return of our Lord to judgment; so does the shaking of the heathen and of the kingdoms of the nations continue till every power which rises against the Almighty God and His Christ is broken, and the world which has been thrown into confusion by the sin of men, and is made subject to corruptibility on their account, shall perish, and the new heaven and new earth wherein dwelleth righteousness, for which we are looking, shall be established (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Peter 3:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Aug. Koehler also assumes that the ultimate fulfilment of our prophecy will not take place till the second coming of Christ, although he is of opinion that, generally speaking, it has not been fulfilled in the manner originally intended. Starting, for example, with the fact that the fulfilment of the events predicted by Haggai and the coming of the day of Jehovah are one and the same, and that according to Malachi 3:1; Malachi 4:5 the day of Jehovah was to be preceded by the coming of a messenger, to prepare the way for Jehovah to come to His temple, Koehler assumes that the fulfilment of these events ought to have taken place with the coming of Jesus of Nazareth, to establish the new covenant as the Messiah. But, inasmuch as Israel was still without such moral preparation as would allow of the coming of Jehovah being a blessing to it, and rejected its Messiah, there occurred an event in connection with this rejection of Jesus on the part of Israel, which not only put a stop to the fulfilment of the prophecies, the realization of which had commenced with the coming of Jesus, but introduced a partial modification. \"The new covenant,\" he says, \"which was established by the Lord in His incarnation, was not at first a blessing to Israel, but to the heathen world. Instead of setting up His kingdom over the earth, with Zion as the centre, the Lord returned to heaven, and there took possession of the throne above all thrones. But Israel was smitten with the ban, and scattered among the heathen nations. The sacred places which were to be glorified by the valuables of all the heathen, had become unclean through Israel's sin, and were given up to destruction in consequence.\" In his opinion there is a coming of Jehovah still in the future. Jesus will return from heaven again, but not till Israel shall have been converted to the Messiah it rejected. Then will the prophecies of Haggai that remained unfulfilled at the first coming of Jesus be accomplished, but in the only way that is still possible, since the former holy places of Israel have been destroyed, and the heathen world has already participated in the new covenant, and has at any rate in part already become the people of God. Consequently the events predicted by Haggai (Haggai 2:6-9) have not been fulfilled; for the valuable possessions of all the heathen have not been applied to the glorification of the sanctuary of Jehovah built by Zerubbabel, and there has not been a place of peace created there in the midst of the judgments that were to fall upon the heathen world. But the fault of this rests purely upon Israel. And so also it is in the impenitence of Israel that we have to look for the reason why the shaking of the heaven and the earth, and all the heathen, which Haggai announced as מעט היא, has been postponed for more than 500 years. This is Koehler's view. But if there had really been any foundation in the Scriptures for this view, and the predictions of our prophet had not been fulfilled in the manner intended, the fault would not rest entirely in the impenitence of Israel, but would fall in part upon God Himself, for having sent His Son, not at the proper time, or when the time was accomplished, but too early, namely, before Israel was in that moral condition which would allow of the coming of the Messiah to become a blessing to it, whether God was mistaken as to the proper time for sending His Son, or in His judgment as to the moral condition of Israel. If Koehler had put this clearly to his own mind, he would certainly have hesitated before he built up a view on the basis of an erroneous idea of the day of the Lord which necessarily leads to the denial not only of the divine prescience or the πρόγνωσιη τοῦ Θεοῦ, but also of the supernatural character of the old Testament prophecy.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Aug. Koehler also assumes that the ultimate fulfilment of our prophecy will not take place till the second coming of Christ, although he is of opinion that, generally speaking, it has not been fulfilled in the manner originally intended. Starting, for example, with the fact that the fulfilment of the events predicted by Haggai and the coming of the day of Jehovah are one and the same, and that according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 4:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the day of Jehovah was to be preceded by the coming of a messenger, to prepare the way for Jehovah to come to His temple, Koehler assumes that the fulfilment of these events ought to have taken place with the coming of Jesus of Nazareth, to establish the new covenant as the Messiah. But, inasmuch as Israel was still without such moral preparation as would allow of the coming of Jehovah being a blessing to it, and rejected its Messiah, there occurred an event in connection with this rejection of Jesus on the part of Israel, which not only put a stop to the fulfilment of the prophecies, the realization of which had commenced with the coming of Jesus, but introduced a partial modification. \"The new covenant,\" he says, \"which was established by the Lord in His incarnation, was not at first a blessing to Israel, but to the heathen world. Instead of setting up His kingdom over the earth, with Zion as the centre, the Lord returned to heaven, and there took possession of the throne above all thrones. But Israel was smitten with the ban, and scattered among the heathen nations. The sacred places which were to be glorified by the valuables of all the heathen, had become unclean through Israel's sin, and were given up to destruction in consequence.\" In his opinion there is a coming of Jehovah still in the future. Jesus will return from heaven again, but not till Israel shall have been converted to the Messiah it rejected. Then will the prophecies of Haggai that remained unfulfilled at the first coming of Jesus be accomplished, but in the only way that is still possible, since the former holy places of Israel have been destroyed, and the heathen world has already participated in the new covenant, and has at any rate in part already become the people of God. Consequently the events predicted by Haggai (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 2:6-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") have not been fulfilled; for the valuable possessions of all the heathen have not been applied to the glorification of the sanctuary of Jehovah built by Zerubbabel, and there has not been a place of peace created there in the midst of the judgments that were to fall upon the heathen world. But the fault of this rests purely upon Israel. And so also it is in the impenitence of Israel that we have to look for the reason why the shaking of the heaven and the earth, and all the heathen, which Haggai announced as מעט היא, has been postponed for more than 500 years. This is Koehler's view. But if there had really been any foundation in the Scriptures for this view, and the predictions of our prophet had not been fulfilled in the manner intended, the fault would not rest entirely in the impenitence of Israel, but would fall in part upon God Himself, for having sent His Son, not at the proper time, or when the time was accomplished, but too early, namely, before Israel was in that moral condition which would allow of the coming of the Messiah to become a blessing to it, whether God was mistaken as to the proper time for sending His Son, or in His judgment as to the moral condition of Israel. If Koehler had put this clearly to his own mind, he would certainly have hesitated before he built up a view on the basis of an erroneous idea of the day of the Lord which necessarily leads to the denial not only of the divine prescience or the πρόγνωσιη τοῦ Θεοῦ, but also of the supernatural character of the old Testament prophecy.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But if the shaking of the heathen commenced before the coming of Christ in the flesh, and will continue till His second coming in glory, we must not restrict the fulfilment of the predicted moral consequences of this shaking - namely, that the heathen come and consecrate their possessions to the Lord for the glorification of His house, to the conversion of the heathen to Christ, and their entrance into the Christian church - but must also regard the desire for the living God, awakened by the decay of heathendom and its religions, which was manifested in the adoption of Judaism by the more pious heathen, as a prelude to the fulfilment which commenced with the spread of the gospel among the Gentiles, and must include not only the presentation of dedicatory offerings τῶν ἀλλυφύλων and of gifts ἔξωθεν ἐθνῶν, with which the temple was adorned according to Josephus, de Bell. Jud. ii. 17, 3, but also the presents of king Artaxerxes and his counsellors, which Ezra received on his return to Jerusalem to carry with him for the temple (Ezra 7:15.).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But if the shaking of the heathen commenced before the coming of Christ in the flesh, and will continue till His second coming in glory, we must not restrict the fulfilment of the predicted moral consequences of this shaking - namely, that the heathen come and consecrate their possessions to the Lord for the glorification of His house, to the conversion of the heathen to Christ, and their entrance into the Christian church - but must also regard the desire for the living God, awakened by the decay of heathendom and its religions, which was manifested in the adoption of Judaism by the more pious heathen, as a prelude to the fulfilment which commenced with the spread of the gospel among the Gentiles, and must include not only the presentation of dedicatory offerings τῶν ἀλλυφύλων and of gifts ἔξωθεν ἐθνῶν, with which the temple was adorned according to Josephus, de Bell. Jud. ii. 17, 3, but also the presents of king Artaxerxes and his counsellors, which Ezra received on his return to Jerusalem to carry with him for the temple (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: We must not, however, include the additions to Zerubbabel's temple undertaken by Herod the Great for the sake of beautifying it, because, although Herod was a Gentile by descent, the work was not undertaken from any love to the Lord, but (as Calvin; and Hengstenberg, Christol. iii. pp. 289-90, have already observed) with the intention of securing the fulfilment of Haggai's prophecy, in order to prevent the coming of the kingdom of God, his fear of which was that it would put an end to his earthly sway. His intention is obvious enough from the address communicated by Josephus (Ant. xv. 11, 1), through which Herod endeavoured to win over the people to his plan. After telling them that the temple built after the return of the fathers from exile was still sixty cubits lower than that of Solomon, which he proposed to add, he proceeded thus: \"But since I am now by God's will your governor, and I have had peace a long time, and have gained great riches and large revenues, and, what is the principal thing of all, I am at amity with and well regarded by the Romans, who, if I may so say, are the rulers of the whole world,\" etc. The allusion to our prophecy, as Hengstenberg says, is unmistakeable here. He tries to prove that all the conditions which it lays down for the glorifying of the temple have now been realized. \"All nations,\" by whom the building of the temple is to be promoted, are equivalent in his esteem to \"the Romans, who are the rulers of the whole world.\" He whom God has called to the government has gold and silver enough. And the words \"in this place will I give peace\" are now fulfilled. The manner in which he strained every nerve to fulfil the words \"the glory will be greater,\" is evident from 3, where it is stated that \"he laid out larger sums of money upon them than had been done before him, till it seemed that no one else had so greatly adorned the temple as he had done.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yea, even the command of king Darius Hystaspes to his vicegerent, which no doubt reached Jerusalem after our prophecy had been uttered, not only to allow the work at this house of God to continue, but also to deliver to the elders of Judah what was required for the building as well as for the requirements of the daily sacrificial worship out of the moneys raised by taxation on this side the river (Ezra 6:6-10), may at any rate be regarded as a pledge of the certain fulfilment of the divine promise uttered by Haggai.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yea, even the command of king Darius Hystaspes to his vicegerent, which no doubt reached Jerusalem after our prophecy had been uttered, not only to allow the work at this house of God to continue, but also to deliver to the elders of Judah what was required for the building as well as for the requirements of the daily sacrificial worship out of the moneys raised by taxation on this side the river (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 6:6-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), may at any rate be regarded as a pledge of the certain fulfilment of the divine promise uttered by Haggai.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But whilst the honour paid to the temple of Zerubbabel on the part of the heathen and heathen princes by the presentation of sacrifices and dedicatory offerings must not be overlooked, as preludes to the promised filling of this house with the riches of the Gentiles, we must not look to this outward glorification of the temple at Jerusalem for the true fulfilment of our prophecy, even if it had exceeded Solomon's temple in glory. This first took place with the coming of Christ, and that not in the fact that Jesus visited the temple and taught in it, and as the incarnate Logos, in whom the \"glory of Jehovah\" that filled the temple of Solomon dwelt in its truest essence as δόξα ὡς μονογενοῦς παρὰ πατρός, glorified the temple of stone with His presence, but by the fact that Christ raised up the true temple of God not built with human hand (John 2:19), i.e., that He exalted the kingdom of God shadowed forth in the temple at Jerusalem to its true essence. We must draw a distinction between the substance and form, the kernel and the shell, of the prophecy. The temple, as the place where the Lord dwelt in the midst of Israel in a visible symbol of His gracious presence, was the seat and concentration of the kingdom of God, which had its visible embodiment in the temple so long as the old covenant lasted. In this respect the rebuilding of the temple that had been destroyed was a sign and pledge of the restoration of the kingdom of God, which had been broken up through the banishment of Israel among the heathen, and the attitude of those who returned from exile towards the building of the temple was a sign of their internal attitude towards the Lord and His kingdom. If, then, the old men who had seen the temple in its former glory wept aloud at the laying of the foundation of the new building, because in comparison with the former it was as nothing in their eyes, this mourning was occasioned not so much by the fact that the new temple would not be so beautiful and majestic a building as that of Solomon had been, as by the fact that the poverty of the new building set before their eyes the wretched condition of the kingdom of God. This true or deeper ground for their mourning, which might very well give rise to the question whether the Lord would restore His former gracious relation to Israel, or at any rate would restore it now, is met by the divine promise published by Haggai to the people, which attaches itself in form to the existing circumstances, and accordingly promises for the future a glorification of the temple which will outshine the glory of the former one. If we look at the thought itself which is expressed in this form, it is the following: The Lord will one day exalt His kingdom, which is so deeply degraded and despised, to a glory which will far surpass the glory of the kingdom of God at the time of Solomon, and that by the fact that all the heathen nations will dedicate their possessions to it. This glorification of the house of God commenced with the introduction of the kingdom of heaven, which Jesus Christ preached, and of which He laid the foundation in His church. And whilst the stone-temple at Jerusalem built by Zerubbabel and splendidly finished by Herod fell into ruins, because the Jews had rejected their Saviour, and crucified Him, this has been carried on through the spread of the kingdom of God among the nations of the earth, and will be completed at the end of the course of this world; not, however, by the erection of a new and much more glorious temple in Jerusalem, but in the founding of the new Jerusalem coming down out of heaven from God upon the new earth, after the overthrow of all the powers of the world that are hostile to God. This holy city will have the glory of God (ἡ δόξα τοῦ Θεοῦ  equals  כּבוד יהוה), but no temple; because the Lord God Almighty and the Lamb are the temple of it. Into this holy city of God will the kings of the earth bring their glory and honour, and the heathen who are saved will walk therein (Revelation 21:10-11, Revelation 21:22-24). Thus the promise covers the entire development of the kingdom of God to the end of days.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But whilst the honour paid to the temple of Zerubbabel on the part of the heathen and heathen princes by the presentation of sacrifices and dedicatory offerings must not be overlooked, as preludes to the promised filling of this house with the riches of the Gentiles, we must not look to this outward glorification of the temple at Jerusalem for the true fulfilment of our prophecy, even if it had exceeded Solomon's temple in glory. This first took place with the coming of Christ, and that not in the fact that Jesus visited the temple and taught in it, and as the incarnate Logos, in whom the \"glory of Jehovah\" that filled the temple of Solomon dwelt in its truest essence as δόξα ὡς μονογενοῦς παρὰ πατρός, glorified the temple of stone with His presence, but by the fact that Christ raised up the true temple of God not built with human hand (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., that He exalted the kingdom of God shadowed forth in the temple at Jerusalem to its true essence. We must draw a distinction between the substance and form, the kernel and the shell, of the prophecy. The temple, as the place where the Lord dwelt in the midst of Israel in a visible symbol of His gracious presence, was the seat and concentration of the kingdom of God, which had its visible embodiment in the temple so long as the old covenant lasted. In this respect the rebuilding of the temple that had been destroyed was a sign and pledge of the restoration of the kingdom of God, which had been broken up through the banishment of Israel among the heathen, and the attitude of those who returned from exile towards the building of the temple was a sign of their internal attitude towards the Lord and His kingdom. If, then, the old men who had seen the temple in its former glory wept aloud at the laying of the foundation of the new building, because in comparison with the former it was as nothing in their eyes, this mourning was occasioned not so much by the fact that the new temple would not be so beautiful and majestic a building as that of Solomon had been, as by the fact that the poverty of the new building set before their eyes the wretched condition of the kingdom of God. This true or deeper ground for their mourning, which might very well give rise to the question whether the Lord would restore His former gracious relation to Israel, or at any rate would restore it now, is met by the divine promise published by Haggai to the people, which attaches itself in form to the existing circumstances, and accordingly promises for the future a glorification of the temple which will outshine the glory of the former one. If we look at the thought itself which is expressed in this form, it is the following: The Lord will one day exalt His kingdom, which is so deeply degraded and despised, to a glory which will far surpass the glory of the kingdom of God at the time of Solomon, and that by the fact that all the heathen nations will dedicate their possessions to it. This glorification of the house of God commenced with the introduction of the kingdom of heaven, which Jesus Christ preached, and of which He laid the foundation in His church. And whilst the stone-temple at Jerusalem built by Zerubbabel and splendidly finished by Herod fell into ruins, because the Jews had rejected their Saviour, and crucified Him, this has been carried on through the spread of the kingdom of God among the nations of the earth, and will be completed at the end of the course of this world; not, however, by the erection of a new and much more glorious temple in Jerusalem, but in the founding of the new Jerusalem coming down out of heaven from God upon the new earth, after the overthrow of all the powers of the world that are hostile to God. This holy city will have the glory of God (ἡ δόξα τοῦ Θεοῦ  equals  כּבוד יהוה), but no temple; because the Lord God Almighty and the Lamb are the temple of it. Into this holy city of God will the kings of the earth bring their glory and honour, and the heathen who are saved will walk therein (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:22-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Thus the promise covers the entire development of the kingdom of God to the end of days.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This was the sense in which the author of the Epistle to the Hebrews (Hebrews 12:26-27) understood our prophecy. In order, namely, to give emphasis to his admonition, not to expose themselves to still severer punishment than fell upon those who hardened themselves under the Old Testament against the incomplete revelation of God, by rejecting the far more perfect revelation of God in Christ, he quotes our prophecy, and shows from it (Hebrews 12:26), that at the founding of the old covenant only a comparatively small shaking of the earth took place; whereas for the times of the new covenant there had been predicted a shaking not only of the earth, but also of the heaven, which indicated that what was moveable was to be altered, as made for that purpose, that the immoveable might remain. The author of this epistle consequently brings out the fundamental thought of our prophecy, in which its fulfilment culminates, viz., that everything earthly must be shaken and altered, that the immoveable, i.e., the βασιλεία ἀσάλευτος, may remain, or in other words, that the whole of the earthly creation must perish, in order that the kingdom of God may be shown to be immoveably permanent. He does not, however, thereby represent the predicted shaking of heaven and earth \"as still in the future,\" as Koehler supposes; but, as his words in Hebrews 12:28 (cf. Hebrews 12:22), \"Wherefore we, receiving a kingdom which cannot be moved, let us have grace,\" clearly show, he takes it as having already commenced, and looks upon the whole period, from the coming of Christ in the flesh till His coming again in glory, as one continuum. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This was the sense in which the author of the Epistle to the Hebrews (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:26-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") understood our prophecy. In order, namely, to give emphasis to his admonition, not to expose themselves to still severer punishment than fell upon those who hardened themselves under the Old Testament against the incomplete revelation of God, by rejecting the far more perfect revelation of God in Christ, he quotes our prophecy, and shows from it (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that at the founding of the old covenant only a comparatively small shaking of the earth took place; whereas for the times of the new covenant there had been predicted a shaking not only of the earth, but also of the heaven, which indicated that what was moveable was to be altered, as made for that purpose, that the immoveable might remain. The author of this epistle consequently brings out the fundamental thought of our prophecy, in which its fulfilment culminates, viz., that everything earthly must be shaken and altered, that the immoveable, i.e., the βασιλεία ἀσάλευτος, may remain, or in other words, that the whole of the earthly creation must perish, in order that the kingdom of God may be shown to be immoveably permanent. He does not, however, thereby represent the predicted shaking of heaven and earth \"as still in the future,\" as Koehler supposes; but, as his words in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), \"Wherefore we, receiving a kingdom which cannot be moved, let us have grace,\" clearly show, he takes it as having already commenced, and looks upon the whole period, from the coming of Christ in the flesh till His coming again in glory, as one continuum. ",
            "children": []
          }
        ]
      }
    ]
  }
]