[{"num":68,"verse":"Unto the end, for them that shall be changed; for David."},{"num":2,"verse":"SAVE me, O God: for the waters are come in even unto my soul."},{"num":3,"verse":"I stick fast in the mire of the deep: and there is no sure standing. I am come into the depth of the sea: and a tempest hath overwhelmed me."},{"num":4,"verse":"I have laboured with crying; my jaws are become hoarse: my eyes have failed, whilst I hope in my God."},{"num":5,"verse":"They are multiplied above the hairs of my head, who hate me without cause. My enemies are grown strong who have wrongfully persecuted me: then did I pay that which I took not away."},{"num":6,"verse":"O God, thou knowest my foolishness; and my offences are not hidden from thee:"},{"num":7,"verse":"Let not them be ashamed for me, who look for thee, O Lord, the Lord of hosts. Let them not be confounded on my account, who seek thee, O God of Israel."},{"num":8,"verse":"Because for thy sake I have borne reproach; shame hath covered my face."},{"num":9,"verse":"I am become a stranger to my brethren, and an alien to the sons of my mother."},{"num":10,"verse":"For the zeal of thy house hath eaten me up: and the reproaches of them that reproached thee are fallen upon me."},{"num":11,"verse":"And I covered my soul in fasting: and it was made a reproach to me."},{"num":12,"verse":"And I made haircloth my garment: and I became a byword to them."},{"num":13,"verse":"They that sat in the gate spoke against me: and they that drank wine made me their song."},{"num":14,"verse":"But as for me, my prayer is to thee, O Lord; for the time of thy good pleasure, O God. In the multitude of thy mercy hear me, in the truth of thy salvation."},{"num":15,"verse":"Draw me out of the mire, that I may not stick fast: deliver me from them that hate me, and out of the deep waters."},{"num":16,"verse":"Let not the tempest of water drown me, nor the deep swallow me up: and let not the pit shut her mouth upon me."},{"num":17,"verse":"Hear me, O Lord, for thy mercy is kind; look upon me according to the multitude of thy tender mercies."},{"num":18,"verse":"And turn not away thy face from thy servant: for I am in trouble, hear me speedily."},{"num":19,"verse":"Attend to my soul, and deliver it: save me because of my enemies."},{"num":20,"verse":"Thou knowest my reproach, and my confusion, and my shame."},{"num":21,"verse":"In thy sight are all they that afflict me; my heart hath expected reproach and misery. And I looked for one that would grieve together with me, but there was none: and for one that would comfort me, and I found none."},{"num":22,"verse":"And they gave me gall for my food, and in my thirst they gave me vinegar to drink."},{"num":23,"verse":"Let their table become as a snare before them, and a recompense, and a stumblingblock."},{"num":24,"verse":"Let their eyes be darkened that they see not; and their back bend thou down always."},{"num":25,"verse":"Pour out thy indignation upon them: and let thy wrathful anger take hold of them."},{"num":26,"verse":"Let their habitation be made desolate: and let there be none to dwell in their tabernacles."},{"num":27,"verse":"Because they have persecuted him whom thou hast smitten; and they have added to the grief of my wounds."},{"num":28,"verse":"Add thou iniquity upon their iniquity: and let them not come into thy justice."},{"num":29,"verse":"Let them be blotted out of the book of the living; and with the just let them not be written."},{"num":30,"verse":"But I am poor and sorrowful: thy salvation, O God, hath set me up."},{"num":31,"verse":"I will praise the name of God with a canticle: and I will magnify him with praise."},{"num":32,"verse":"And it shall please God better than a young calf, that bringeth forth horns and hoofs."},{"num":33,"verse":"Let the poor see and rejoice: seek ye God, and your soul shall live."},{"num":34,"verse":"For the Lord hath heard the poor: and hath not despised his prisoners."},{"num":35,"verse":"Let the heavens and the earth praise him; the sea, and every thing that creepeth therein."},{"num":36,"verse":"For God will save Sion, and the cities of Juda shall be built up. And they shall dwell there, and acquire it by inheritance."},{"num":37,"verse":"And the seed of his servants shall possess it; and they that love his name shall dwell therein."}]