[{"header":"Water from the Rock"},{"num":17,"verse":"At the Lord’s command, the whole community of Israel left the wilderness of Sin and moved from place to place. Eventually they camped at Rephidim, but there was no water there for the people to drink."},{"num":2,"verse":"So once more the people complained against Moses. “Give us water to drink!” they demanded."},{"num":3,"verse":"But tormented by thirst, they continued to argue with Moses. “Why did you bring us out of Egypt? Are you trying to kill us, our children, and our livestock with thirst?”"},{"num":4,"verse":"Then Moses cried out to the Lord, “What should I do with these people? They are ready to stone me!”"},{"num":5,"verse":"The Lord said to Moses, “Walk out in front of the people. Take your staff, the one you used when you struck the water of the Nile, and call some of the elders of Israel to join you."},{"num":6,"verse":"I will stand before you on the rock at Mount Sinai. Strike the rock, and water will come gushing out. Then the people will be able to drink.” So Moses struck the rock as he was told, and water gushed out as the elders looked on."},{"num":7,"verse":"Moses named the place Massah (which means “test”) and Meribah (which means “arguing”) because the people of Israel argued with Moses and tested the Lord by saying, “Is the Lord here with us or not?”"},{"header":"Israel Defeats the Amalekites"},{"num":8,"verse":"While the people of Israel were still at Rephidim, the warriors of Amalek attacked them."},{"num":9,"verse":"Moses commanded Joshua, “Choose some men to go out and fight the army of Amalek for us. Tomorrow, I will stand at the top of the hill, holding the staff of God in my hand.”"},{"num":10,"verse":"So Joshua did what Moses had commanded and fought the army of Amalek. Meanwhile, Moses, Aaron, and Hur climbed to the top of a nearby hill."},{"num":11,"verse":"As long as Moses held up the staff in his hand, the Israelites had the advantage. But whenever he dropped his hand, the Amalekites gained the advantage."},{"num":12,"verse":"Moses’ arms soon became so tired he could no longer hold them up. So Aaron and Hur found a stone for him to sit on. Then they stood on each side of Moses, holding up his hands. So his hands held steady until sunset."},{"num":13,"verse":"As a result, Joshua overwhelmed the army of Amalek in battle."},{"num":14,"verse":"After the victory, the Lord instructed Moses, “Write this down on a scroll as a permanent reminder, and read it aloud to Joshua: I will erase the memory of Amalek from under heaven.”"},{"num":15,"verse":"Moses built an altar there and named it Yahweh-Nissi (which means “the Lord is my banner”)."},{"num":16,"verse":"He said, “They have raised their fist against the Lord’s throne, so now the Lord will be at war with Amalek generation after generation.”"}]