[{"header":"We Also Should Follow Jesus’ Example"},{"num":12,"verse":"We have all these great people around us as examples. Their lives tell us what faith means. So we, too, should run the race that is before us and never quit. We should remove from our lives anything that would slow us down and the sin that so often makes us fall."},{"num":2,"verse":"We must never stop looking to Jesus. He is the leader of our faith, and he is the one who makes our faith complete. He suffered death on a cross. But he accepted the shame of the cross as if it were nothing because of the joy he could see waiting for him. And now he is sitting at the right side of God’s throne."},{"num":3,"verse":"Think about Jesus. He patiently endured the angry insults that sinful people were shouting at him. Think about him so that you won’t get discouraged and stop trying."},{"header":"God Is Like a Father"},{"num":4,"verse":"You are struggling against sin, but you have not had to give up your life for the cause."},{"num":5,"verse":"You are children of God, and he speaks words of comfort to you. You have forgotten these words:"},{"num":7,"verse":"So accept sufferings like a father’s discipline. God does these things to you like a father correcting his children. You know that all children are disciplined by their fathers."},{"num":8,"verse":"So, if you never receive the discipline that every child must have, you are not true children and don’t really belong to God."},{"num":9,"verse":"We have all had fathers here on earth who corrected us with discipline. And we respected them. So it is even more important that we accept discipline from the Father of our spirits. If we do this, we will have life."},{"num":10,"verse":"Our fathers on earth disciplined us for a short time in the way they thought was best. But God disciplines us to help us so that we can be holy like him."},{"num":11,"verse":"We don’t enjoy discipline when we get it. It is painful. But later, after we have learned our lesson from it, we will enjoy the peace that comes from doing what is right."},{"header":"Be Careful How You Live"},{"num":12,"verse":"You have become weak, so make yourselves strong again."},{"num":13,"verse":"Live in the right way so that you will be saved and your weakness will not cause you to be lost."},{"num":14,"verse":"Try to live in peace with everyone. And try to keep your lives free from sin. Anyone whose life is not holy will never see the Lord."},{"num":15,"verse":"Be careful that no one fails to get God’s grace. Be careful that no one loses their faith and becomes like a bitter weed growing among you. Someone like that can ruin your whole group."},{"num":16,"verse":"Be careful that no one commits sexual sin. And be careful that no one is like Esau and never thinks about God. As the oldest son, Esau would have inherited everything from his father. But he sold all that for a single meal."},{"num":17,"verse":"You remember that after Esau did this, he wanted to get his father’s blessing. He wanted that blessing so much that he cried. But his father refused to give him the blessing, because Esau could find no way to change what he had done."},{"num":18,"verse":"You have not come to a place that can be seen and touched, like the mountain the people of Israel saw, which was burning with fire and covered with darkness, gloom, and storms."},{"num":19,"verse":"There is no sound of a trumpet or a voice speaking words like those they heard. When they heard the voice, they begged never to hear another word."},{"num":20,"verse":"They did not want to hear the command: “If anything, even an animal, touches the mountain, it must be killed with stones.”"},{"num":21,"verse":"What they saw was so terrible that Moses said, “I am shaking with fear.”"},{"num":22,"verse":"But you have come to Mount Zion, to the city of the living God, the heavenly Jerusalem. You have come to a place where thousands of angels have gathered to celebrate."},{"num":23,"verse":"You have come to the meeting of God’s firstborn children. Their names are written in heaven. You have come to God, the judge of all people. And you have come to the spirits of good people who have been made perfect."},{"num":24,"verse":"You have come to Jesus—the one who brought the new agreement from God to his people. You have come to the sprinkled blood that tells us about better things than the blood of Abel."},{"num":25,"verse":"Be careful and don’t refuse to listen when God speaks. Those people refused to listen to him when he warned them on earth. And they did not escape. Now God is speaking from heaven. So now it will be worse for those who refuse to listen to him."},{"num":26,"verse":"When he spoke before, his voice shook the earth. But now he has promised, “Once again I will shake the earth, but I will also shake heaven.”"},{"num":27,"verse":"The words “once again” clearly show us that everything that was created will be destroyed—that is, the things that can be shaken. And only what cannot be shaken will remain."},{"num":28,"verse":"So we should be thankful because we have a kingdom that cannot be shaken. And because we are thankful, we should worship God in a way that will please him. We should do this with respect and fear,"},{"num":29,"verse":"because our God is like a fire that can destroy us."}]