[{"num":12,"verse":"¶ Therefore, seeing we also are compassed about with so great a cloud of witnesses, leaving behind all the weight of the sin which surrounds us, let us run with patience the race that is set before us,"},{"num":2,"verse":"with our eyes fixed on Jesus, the author and finisher of our faith, who having been offered joy, endured the cross,{Gr. stauros-stake} despising the shame and was seated at the right hand of the throne of God."},{"num":3,"verse":"For consider him that endured such contradiction of sinners against himself lest ye be wearied in your souls and faint."},{"num":4,"verse":"¶ Ye have not yet resisted unto blood, fighting against sin."},{"num":5,"verse":"And ye have quite forgotten the consolation which speaks unto you as unto sons, My son, despise not thou the chastening of the Lord, nor faint when thou art reproved of him:"},{"num":6,"verse":"for whom the Lord loves, he chastens and scourges everyone whom he receives as a son."},{"num":7,"verse":"If ye endure chastening, God deals with you as with sons; for what son is he whom the father does not chasten?"},{"num":8,"verse":"But if ye are without chastisement, of which all the sons are partakers, then ye are bastards, and not sons."},{"num":9,"verse":"Furthermore, we have had fathers of our flesh who corrected us, and we gave them reverence; is it not much better to be in subjection to the Father of spirits, and we shall live?"},{"num":10,"verse":"For they verily for a few days chastened us as it seemed good unto them, but he for our profit, that we might be partakers of his holiness."},{"num":11,"verse":"It is true that no chastening at present seems to be cause for joy, but rather for grief; nevertheless, afterward it yields the peaceable fruit of righteousness unto those who are exercised by it."},{"num":12,"verse":"Therefore, lift up the hands which hang down, and the feeble knees,"},{"num":13,"verse":"and make straight steps unto your feet, so that which is lame will not turn out of the way, but let it rather be healed."},{"num":14,"verse":"Follow peace with everyone and holiness, without which no one shall see the Lord:"},{"num":15,"verse":"looking diligently that no one deviate from the grace of God, lest any root of bitterness springing up impede you, and thereby many be defiled,"},{"num":16,"verse":"lest there be any fornicator or profane person as Esau, who for one morsel of food sold his birthright."},{"num":17,"verse":"For ye know how that afterward, desiring to inherit the blessing, he was rejected; for he found no place of repentance, though he sought it carefully with tears."},{"num":18,"verse":"¶ For ye are not come unto the mount that might be touched and that burned with fire nor unto blackness and darkness and tempest"},{"num":19,"verse":"and the sound of a trumpet and the voice of words, which voice those that heard intreated that the word should not be spoken to them any more;"},{"num":20,"verse":"(for they could not endure that which was commanded, and if so much as a beast should touch the mountain, it shall be stoned or thrust through with a dart:"},{"num":21,"verse":"and so terrible was the sight that Moses said, I exceedingly fear and quake);"},{"num":22,"verse":"but ye are come unto Mount Sion and unto the city of the living God, the heavenly Jerusalem, and to an innumerable company of angels,"},{"num":23,"verse":"to the congregation of the called out ones of the firstborn, who are registered in the heavens and to God the Judge of all and to the spirits of just men made perfect"},{"num":24,"verse":"and to Jesus, the mediator of the new testament and to the blood of sprinkling, that speaks better than that of Abel."},{"num":25,"verse":"See that you do not refuse him that speaks. For if those who refused him that spoke on earth did not escape, much less shall we escape, if we turn away from him that speaks from the heavens,"},{"num":26,"verse":"whose voice then shook the earth; but now he has promised, saying, Yet even once, I shall shake not the earth only, but also the heaven."},{"num":27,"verse":"And this word, Yet even once, signifies the removing of those things that are shaken, as of things that are made, that those things which cannot be shaken may remain."},{"num":28,"verse":"Therefore, receiving a kingdom which cannot be moved, let us hold fast to the grace, by which we serve God, pleasing him with reverence and godly fear:"},{"num":29,"verse":"for our God is a consuming fire."}]