[{"header":"Follow Jesus’ Example"},{"num":12,"verse":"We are surrounded by a great cloud of people whose lives tell us what faith means. So let us run the race that is before us and never give up. We should remove from our lives anything that would get in the way and the sin that so easily holds us back. "},{"num":2,"verse":"Let us look only to Jesus, the One who began our faith and who makes it perfect. He suffered death on the cross. But he accepted the shame as if it were nothing because of the joy that God put before him. And now he is sitting at the right side of God’s throne. "},{"num":3,"verse":"Think about Jesus’ example. He held on while wicked people were doing evil things to him. So do not get tired and stop trying."},{"header":"God Is like a Father"},{"num":4,"verse":"You are struggling against sin, but your struggles have not yet caused you to be killed. "},{"num":5,"verse":"You have forgotten the encouraging words that call you his children:"},{"num":7,"verse":"So hold on through your sufferings, because they are like a father’s discipline. God is treating you as children. All children are disciplined by their fathers. "},{"num":8,"verse":"If you are never disciplined (and every child must be disciplined), you are not true children. "},{"num":9,"verse":"We have all had fathers here on earth who disciplined us, and we respected them. So it is even more important that we accept discipline from the Father of our spirits so we will have life. "},{"num":10,"verse":"Our fathers on earth disciplined us for a short time in the way they thought was best. But God disciplines us to help us, so we can become holy as he is. "},{"num":11,"verse":"We do not enjoy being disciplined. It is painful at the time, but later, after we have learned from it, we have peace, because we start living in the right way."},{"header":"Be Careful How You Live"},{"num":12,"verse":"You have become weak, so make yourselves strong again. "},{"num":13,"verse":"Keep on the right path, so the weak will not stumble but rather be strengthened."},{"num":14,"verse":"Try to live in peace with all people, and try to live free from sin. Anyone whose life is not holy will never see the Lord. "},{"num":15,"verse":"Be careful that no one fails to receive God’s grace and begins to cause trouble among you. A person like that can ruin many of you. "},{"num":16,"verse":"Be careful that no one takes part in sexual sin or is like Esau and never thinks about God. As the oldest son, Esau would have received everything from his father, but he sold all that for a single meal. "},{"num":17,"verse":"You remember that after Esau did this, he wanted to get his father’s blessing, but his father refused. Esau could find no way to change what he had done, even though he wanted the blessing so much that he cried."},{"num":18,"verse":"You have not come to a mountain that can be touched and that is burning with fire. You have not come to darkness, sadness, and storms. "},{"num":19,"verse":"You have not come to the noise of a trumpet or to the sound of a voice like the one the people of Israel heard and begged not to hear another word. "},{"num":20,"verse":"They did not want to hear the command: “If anything, even an animal, touches the mountain, it must be put to death with stones.” "},{"num":21,"verse":"What they saw was so terrible that Moses said, “I am shaking with fear.”"},{"num":22,"verse":"But you have come to Mount Zion, to the city of the living God, the heavenly Jerusalem. You have come to thousands of angels gathered together with joy. "},{"num":23,"verse":"You have come to the meeting of God’s firstborn children whose names are written in heaven. You have come to God, the judge of all people, and to the spirits of good people who have been made perfect. "},{"num":24,"verse":"You have come to Jesus, the One who brought the new agreement from God to his people, and you have come to the sprinkled blood that has a better message than the blood of Abel."},{"num":25,"verse":"So be careful and do not refuse to listen when God speaks. Others refused to listen to him when he warned them on earth, and they did not escape. So it will be worse for us if we refuse to listen to God who warns us from heaven. "},{"num":26,"verse":"When he spoke before, his voice shook the earth, but now he has promised, “Once again I will shake not only the earth but also the heavens.” "},{"num":27,"verse":"The words “once again” clearly show us that everything that was made—things that can be shaken—will be destroyed. Only the things that cannot be shaken will remain."},{"num":28,"verse":"So let us be thankful, because we have a kingdom that cannot be shaken. We should worship God in a way that pleases him with respect and fear, "},{"num":29,"verse":"because our God is like a fire that burns things up."}]