[{"header":"Christ the Perfect One"},{"num":12,"verse":"All these many people who have had faith in God are around us like a cloud. Let us put every thing out of our lives that keeps us from doing what we should. Let us keep running in the race that God has planned for us. "},{"num":2,"verse":"Let us keep looking to Jesus. Our faith comes from Him and He is the One Who makes it perfect. He did not give up when He had to suffer shame and die on a cross. He knew of the joy that would be His later. Now He is sitting at the right side of God."},{"num":3,"verse":"Sinful men spoke words of hate against Christ. He was willing to take such shame from sinners. Think of this so you will not get tired and give up. "},{"num":4,"verse":"In your fight against sin, you have not yet had to stand against sin with your blood. "},{"num":5,"verse":"Do you remember what God said to you when He called you His sons? “My son, listen when the Lord punishes you. Do not give up when He tells you what you must do. "},{"num":6,"verse":"The Lord punishes everyone He loves. He whips every son He receives.”  "},{"num":7,"verse":"Do not give up when you are punished by God. Be willing to take it, knowing that God is teaching you as a son. Is there a father who does not punish his son sometimes? "},{"num":8,"verse":"If you are not punished as all sons are, it means that you are not a true son of God. You are not a part of His family and He is not your Father. "},{"num":9,"verse":"Remember that our fathers on earth punished us. We had respect for them. How much more should we obey our Father in heaven and live? "},{"num":10,"verse":"For a little while our fathers on earth punished us when they thought they should. But God punishes us for our good so we will be holy as He is holy. "},{"num":11,"verse":"There is no joy while we are being punished. It is hard to take, but later we can see that good came from it. And it gives us the peace of being right with God."},{"num":12,"verse":"So lift up your hands that have been weak. Stand up on your weak legs. "},{"num":13,"verse":"Walk straight ahead so the weak leg will not be turned aside, but will be healed."},{"num":14,"verse":"Be at peace with all men. Live a holy life. No one will see the Lord without having that kind of life. "},{"num":15,"verse":"See that no one misses God’s loving-favor. Do not let wrong thoughts about others get started among you. If you do, many people will be turned to a life of sin. "},{"num":16,"verse":"None of you should fall into sex sins or forget God like Esau did. He had a right to get all Isaac had because he was the oldest son. But for one plate of food he sold this right to his brother. "},{"num":17,"verse":"You know that later he would have received everything. But he did not get it even when he asked for it with tears. It was too late to make right the wrong he had done."},{"num":18,"verse":"For you have not come close to a mountain that you can touch. You have not come to worship where there is burning fire and darkness and storm and wind. "},{"num":19,"verse":"The sound of a horn was heard and God’s voice spoke. The people cried out to Moses to have God stop speaking to them. "},{"num":20,"verse":"They could not stand to listen to His strong words, “Even if an animal comes to the mountain, it must be killed.”  "},{"num":21,"verse":"What Moses saw was so hard to look at that he said, “I am full of fear and am shaking.” "},{"num":22,"verse":"But instead, you have come to the mountain of Jerusalem. It is the city of the living God. It is the Jerusalem of heaven with its thousands of angels. "},{"num":23,"verse":"You have gathered there with God’s children who were born long ago. They are citizens of heaven. God is there. He will judge all men. The spirits of all those right with God are there. They have been made perfect. "},{"num":24,"verse":"Jesus is there. He has made a way for man to go to God. He gave His blood that men might worship God the New Way. The blood of Jesus tells of better things than that which Abel used."},{"num":25,"verse":"Be sure you listen to the One Who is speaking to you. The Jews did not obey when God’s Law was given to them on earth. They did not go free. They were punished. We will be punished more if we do not listen to God as He speaks from heaven. "},{"num":26,"verse":"On Mount Sinai, God’s voice shook the earth. But now He has promised, saying, “Once more I will shake the earth and the heavens.” "},{"num":27,"verse":"When God says, “Once more,” He means He will take away everything of this world that can be shaken so the things that cannot be shaken will be left."},{"num":28,"verse":"Since we have received a holy nation that cannot be moved, let us be thankful. Let us please God and worship Him with honor and fear. "},{"num":29,"verse":"For our God is a fire that destroys everything."}]