[{"header":"Faith Directs Our Lives"},{"num":12,"verse":"Since we are surrounded by so many examples of faith, we must get rid of everything that slows us down, especially sin that distracts us. We must run the race that lies ahead of us and never give up. "},{"num":2,"verse":"We must focus on Yeshua, the source and goal of our faith. He saw the joy ahead of him, so he endured death on the cross and ignored the disgrace it brought him. Then he received the highest position in heaven, the one next to the throne of God. "},{"num":3,"verse":"Think about Yeshua, who endured opposition from sinners, so that you don’t become tired and give up."},{"num":4,"verse":"You struggle against sin, but your struggles haven’t killed you. "},{"num":5,"verse":"You have forgotten the encouraging words that God speaks to you as his children:"},{"num":7,"verse":"Endure your discipline. God corrects you as a father corrects his children. All children are disciplined by their fathers. "},{"num":8,"verse":"If you aren’t disciplined like the other children, you aren’t part of the family. "},{"num":9,"verse":"On earth we have fathers who disciplined us, and we respect them. Shouldn’t we place ourselves under the authority of God, the father of spirits, so that we will live? "},{"num":10,"verse":"For a short time our fathers disciplined us as they thought best. Yet, God disciplines us for our own good so that we can become holy like him. "},{"num":11,"verse":"We don’t enjoy being disciplined. It always seems to cause more pain than joy. But later on, those who learn from that discipline have peace that comes from doing what is right."},{"num":12,"verse":"Strengthen your tired arms and weak knees. "},{"num":13,"verse":"Keep walking along straight paths so that your injured leg won’t get worse. Instead, let it heal."},{"num":14,"verse":"Try to live peacefully with everyone, and try to live holy lives, because if you don’t, you will not see the Lord. "},{"num":15,"verse":"Make sure that everyone has kindness from God so that bitterness doesn’t take root and grow up to cause trouble that corrupts many of you. "},{"num":16,"verse":"Make sure that no one commits sexual sin or is as concerned about earthly things as Esau was. He sold his rights as the firstborn son for a single meal. "},{"num":17,"verse":"You know that afterwards, when he wanted to receive the blessing that the firstborn son was to receive, he was rejected. Even though he begged and cried for the blessing, he couldn’t do anything to change what had happened."},{"num":18,"verse":"You have not come to something that you can feel, to a blazing fire, to darkness, to gloom, to a storm, "},{"num":19,"verse":"to a trumpet’s blast, and to a voice. When your ancestors heard that voice, they begged not to hear it say another word. "},{"num":20,"verse":"They couldn’t obey the command that was given, “If even an animal touches the mountain, it must be stoned to death.” "},{"num":21,"verse":"The sight was so terrifying that even Moses said he was trembling and afraid."},{"num":22,"verse":"Instead, you have come to Mount Zion, to the city of the living God, to the heavenly Jerusalem. You have come to tens of thousands of angels joyfully gathered together "},{"num":23,"verse":"and to the assembly of God’s firstborn children (whose names are written in heaven). You have come to a judge (the God of all people) and to the spirits of people who have God’s approval and have gained eternal life. "},{"num":24,"verse":"You have come to Yeshua, who brings the new promise from God, and to the sprinkled blood that speaks a better message than Abel’s."},{"num":25,"verse":"Be careful that you do not refuse to listen when God speaks. Your ancestors didn’t escape when they refused to listen to God, who warned them on earth. We certainly won’t escape if we turn away from God, who warns us from heaven. "},{"num":26,"verse":"When God spoke to your ancestors, his voice shook the earth. But now he has promised, “Once more I will shake not only the earth but also the sky.”"},{"num":27,"verse":"The words once more show clearly that God will change what he has made. These are the things that can be shaken. Then only the things that cannot be shaken will remain. "},{"num":28,"verse":"Therefore, we must be thankful that we have a kingdom that cannot be shaken. Because we are thankful, we must serve God with fear and awe in a way that pleases him. "},{"num":29,"verse":"After all, our God is a destructive fire."}]