[{"header":"We should consider these examples and Christ the perfect example"},{"num":1,"verse":"Surrounded then as we are by these serried ranks of witnesses, let us strip off everything that hinders us, as well as the sin which dogs our feet, and let us run the race that we have to run with patience, our eyes fixed on Jesus the source and the goal of our faith. For he himself endured a cross and thought nothing of its shame because of the joy he knew would follow his suffering; and he is now seated at the right hand of God’s throne. Think constantly of him enduring all that sinful men could say against him and you will not lose your purpose or your courage."},{"header":"Look upon suffering as heavenly discipline"},{"num":4,"verse":"After all, your fight against sin has not yet meant the shedding of blood, and you have perhaps lost sight of that piece of advice which reminds you of our sonship in God: ‘My son, do not despise the chastening of the Lord, nor be discouraged when you are rebuked by him; for whom the Lord loves he chastens, and scourges every son whom he receives’."},{"num":7,"verse":"Bear what you have to bear as “chastening”—as God’s dealing with you as sons. No true son ever grows up uncorrected by his father. For if you had no experience of the correction which all sons have to bear you might well doubt the legitimacy of your sonship. After all, when we were children we had fathers who corrected us, and we respected them for it. Can we not much more readily submit to a heavenly Father’s discipline, and learn how to live?"},{"num":10,"verse":"For our fathers used to correct us according to their own ideas during the brief days of childhood. But God corrects us all our days for our own benefit, to teach us his holiness. Now obviously no “chastening” seems pleasant at the time: it is in fact most unpleasant. Yet when it is all over we can see that is has quietly produced the fruit of real goodness in the characters of those who have accepted it in the right spirit. So take a fresh grip on life and brace your trembling limbs. Don’t wander away from the path but forge steadily onward. On the right path the limping foot recovers strength and does not collapse."},{"header":"In times of testing be especially on your guard against certain sins"},{"num":14,"verse":"Let it be your ambition to live at peace with all men and to achieve holiness “without which no man shall see the Lord”. Be careful that none of you fails to respond to the grace which God gives, for if he does there can very easily spring up in him a bitter spirit which is not only bad in itself but can also poison the lives of many others. Be careful too, that none of you falls into impurity or loses his reverence for the things of God and then, like Esau, is ready to sell his birthright to satisfy the momentary hunger of his body. Remember how afterwards, when he wanted to have the blessing which was his birthright, he was refused. He never afterwards found the way of repentance though he sought it desperately and with tears."},{"header":"Your experience is not that of the old agreement but of the new"},{"num":18,"verse":"You have not had to approach things which your senses could experience as they did in the old days—flaming fire, black darkness, rushing wind and out of it a trumpet-blast, a voice speaking human words. So terrible was that voice that those who heard it begged and prayed that it might stop speaking, for what it had already commanded was more than they could bear—‘And if so much as a beast touches the mountain, it shall be stoned or thrust through with an arrow’. So fearful was the spectacle that Moses cried out, ‘I am exceedingly afraid and trembling’."},{"num":22,"verse":"No, you have been allowed to approach the true Mount Zion, the city of the living God, the heavenly Jerusalem. You have drawn near to the countless angelic army, the great assembly of Heaven and the Church of the first-born whose names are written above. You have drawn near to God, the judge of all, to the souls of good men made perfect, and to Jesus, mediator of a new agreement, to the cleansing of blood which tells a better story than the age-old sacrifice of Abel."},{"num":25,"verse":"So be sure you do not refuse to hear the voice of God! For if they who refused to hear those who spoke to them on earth did not escape, how little chance of escape is there for us if we refuse to hear the one who speaks from Heaven. Then his voice shook the earth, but now he promises: ‘Yet once more I shake not only the earth, but also heaven’."},{"num":27,"verse":"This means that in this final “shaking” all that is impermanent will be removed, that is, everything that is merely “made”, and only the unshakeable things will remain. Since then we have been given a kingdom that is “unshakeable”, let us serve God with thankfulness in the ways which please him, but always with reverence and holy fear. For it is perfectly true that our ‘God is a burning fire’."}]