[{"header":"Daniel Is Thrown Into a Den of Lions"},{"num":6,"verse":"It pleased Darius to appoint 120 royal rulers over his entire kingdom. "},{"num":2,"verse":"He placed three leaders over them. One of the leaders was Daniel. The royal rulers were made accountable to the three leaders. Then the king wouldn’t lose any of his wealth. "},{"num":3,"verse":"Daniel did a better job than the other two leaders or any of the royal rulers. He was an unusually good and able man. So the king planned to put him in charge of the whole kingdom. "},{"num":4,"verse":"But the other two leaders and the royal rulers heard about it. So they looked for a reason to bring charges against Daniel. They tried to find something wrong with the way he ran the government. But they weren’t able to. They couldn’t find any fault with his work. He could always be trusted. He never did anything wrong. And he always did what he was supposed to. "},{"num":5,"verse":"Finally these men said, “We want to bring charges against this man Daniel. But It’s almost impossible for us to come up with a reason to do it. If we find a reason, it will have to be in connection with the law of his God.”"},{"num":6,"verse":"So the two leaders and the royal rulers went as a group to the king. They said, “King Darius, may you live forever! "},{"num":7,"verse":"All the royal leaders, high officials, royal rulers, advisers and governors want to make a suggestion. We’ve agreed that you should give an order. And you should make sure it’s obeyed. Your Majesty, here is the command you should make your people obey for the next 30 days. Don’t let any of your people pray to any god or human being except to you. If they do, throw them into the lions’ den. "},{"num":8,"verse":"Now give the order. Write it down in the law of the Medes and Persians. Then it can’t be changed.” "},{"num":9,"verse":"So King Darius put the order in writing."},{"num":10,"verse":"Daniel found out that the king had signed the order. In spite of that, he did just as he had always done before. He went home to his upstairs room. Its windows opened toward Jerusalem. He went to his room three times a day to pray. He got down on his knees and gave thanks to his God. "},{"num":11,"verse":"Some of the other royal officials went to where Daniel was staying. They saw him praying and asking God for help. "},{"num":12,"verse":"So they went to the king. They spoke to him about his royal order. They said, “Your Majesty, didn’t you sign an official order? It said that for the next 30 days your people could pray only to you. They could not pray to anyone else, whether god or human being. If they did, they would be thrown into the lions’ den.”"},{"num":13,"verse":"Then they spoke to the king again. They said, “Daniel is one of the prisoners from Judah. He doesn’t pay any attention to you, Your Majesty. He doesn’t obey the order you put in writing. He still prays to his God three times a day.” "},{"num":14,"verse":"When the king heard this, he was very upset. He didn’t want Daniel to be harmed in any way. Until sunset, he did everything he could to save him."},{"num":15,"verse":"Then the men went as a group to King Darius. They said to him, “Your Majesty, remember that no order or command you give can be changed. That’s what the law of the Medes and Persians requires.”"},{"num":16,"verse":"So the king gave the order. Daniel was brought out and thrown into the lions’ den. The king said to him, “You always serve your God faithfully. So may he save you!”"},{"num":17,"verse":"A stone was brought and placed over the opening of the den. The king sealed it with his own special ring. He also sealed it with the rings of his nobles. Then nothing could be done to help Daniel. "},{"num":18,"verse":"The king returned to his palace. He didn’t eat anything that night. He didn’t ask for anything to be brought to him for his enjoyment. And he couldn’t sleep."},{"num":19,"verse":"As soon as the sun began to rise, the king got up. He hurried to the lions’ den. "},{"num":20,"verse":"When he got near it, he called out to Daniel. His voice was filled with great concern. He said, “Daniel! You serve the living God. You always serve him faithfully. So has he been able to save you from the lions?”"},{"num":21,"verse":"Daniel answered, “Your Majesty, may you live forever! "},{"num":22,"verse":"My God sent his angel. And his angel shut the mouths of the lions. They haven’t hurt me at all. That’s because I haven’t done anything wrong in God’s sight. I’ve never done anything wrong to you either, Your Majesty.”"},{"num":23,"verse":"The king was filled with joy. He ordered his servants to lift Daniel out of the den. So they did. They didn’t see any wounds on him. That’s because he had trusted in his God."},{"num":24,"verse":"Then the king gave another order. The men who had said bad things about Daniel were brought in. They were thrown into the lions’ den. So were their wives and children. Before they hit the bottom of the den, the lions attacked them. And the lions crushed all their bones."},{"num":25,"verse":"Then King Darius wrote to people of all nations, no matter what language they spoke. He said,"},{"num":28,"verse":"So Daniel had success while Darius was king. Things went well with Daniel during the rule of Cyrus, the Persian."}]