[{"num":42,"verse":"Then all the captains of the forces, and Johanan son of Kareah and Jezaniah [Azariah] son of Hoshaiah, and all the people from the least even to the greatest came near"},{"num":2,"verse":"And said to Jeremiah the prophet, We beseech you that you will let our supplication be presented before you and that you will pray to the Lord your God for us, even for all this remnant [of the people of Judah]; for whereas we were once many, there are but a few of us left, as you see with your [own] eyes."},{"num":3,"verse":"[Pray] that the Lord your God may show us the way in which we should walk and the thing that we should do."},{"num":4,"verse":"Then Jeremiah the prophet said to them, I have heard you. Behold, I will pray to the Lord your God according to your words; and it will be that whatever thing the Lord will answer you, I will declare it to you; I will keep nothing back from you."},{"num":5,"verse":"Then they said to Jeremiah, May the Lord be a true and faithful witness against us if we fail to do according to all the things that the Lord your God sends you to tell us."},{"num":6,"verse":"Whether it is good or evil, we will obey the voice of the Lord our God, to Whom we are sending you [to inquire], that it may be well with us when we obey the voice of the Lord our God."},{"num":7,"verse":"And after ten days the word of the Lord came to Jeremiah."},{"num":8,"verse":"Then he called Johanan son of Kareah and all the captains of the forces that were with him and all the people from the least even to the greatest,"},{"num":9,"verse":"And said to them, Thus says the Lord, the God of Israel, to Whom you sent me to present your supplication before Him:"},{"num":10,"verse":"If you will remain in this land, then I will build you up and not pull you down, and I will plant you and not pull you up; for I will relent and comfort and ease Myself concerning the evil that [in chastisement] I have done to you [and I will substitute mercy and loving-kindness for judgment]."},{"num":11,"verse":"Be not afraid of the king of Babylon, of whom you are fearful [with the profound and reverent dread inspired by deity]; be not afraid of him, says the Lord, for [he is a mere man, while I am the all-wise, all-powerful, and ever-present God] I [the Lord] am with you to save you and to deliver you from his hand."},{"num":12,"verse":"And I will grant mercy to you, that he may have mercy on you and permit you to remain in your own land."},{"num":13,"verse":"But if you say, We will not dwell in this land, and so disobey the voice of the Lord your God,"},{"num":14,"verse":"Saying, No, but we will go to the land of Egypt, where we will not see war or hear the sound of the trumpet or be hungry for bread, and we will dwell there,"},{"num":15,"verse":"Then hear the word of the Lord, O remnant of Judah. Thus says the Lord of hosts, the God of Israel: If you are fully determined to go to Egypt and you do go to dwell there temporarily,"},{"num":16,"verse":"Then the sword which you fear shall overtake you there in the land of Egypt, and the famine of which you are afraid shall follow close after you to Egypt and in it, and there you shall die."},{"num":17,"verse":"So will it be with all the men who set their faces to go to Egypt to dwell there temporarily; they will die by the sword, by famine, and by pestilence; none of them will remain or survive the evil that I will bring upon them."},{"num":18,"verse":"For thus says the Lord of hosts, the God of Israel: As My anger and My wrath have been poured forth upon the inhabitants of Jerusalem, so shall My wrath be poured forth upon you when you enter Egypt. You shall be a detested thing, an astonishment and horror, a curse, a thing lightly esteemed and a taunt and a reproach; you shall see this place no more."},{"num":19,"verse":"The Lord has said to you, O remnant of Judah, Do not go to Egypt. Know for a certainty that I [Jeremiah] have warned and testified to you this day"},{"num":20,"verse":"That you have dealt deceitfully against your own lives; for you sent me [Jeremiah] to the Lord your God, saying, Pray for us to the Lord our God; and whatever the Lord our God says, declare it to us and we will do it."},{"num":21,"verse":"And I have this day declared it to you, but you have not obeyed the voice of the Lord your God in anything that He sent me to tell you."},{"num":22,"verse":"Now therefore know for a certainty that you shall die by the sword, by famine, and by pestilence in the place [Egypt] where you desire to go to dwell temporarily."}]