[[],[],[{"type":"header","content":"What You Fear Will Catch Up with You"},{"type":"prose","content":"All the army officers, led by Johanan son of Kareah and Jezaniah son of Hoshaiah, accompanied by all the people, small and great, came to Jeremiah the prophet and said, “We have a request. Please listen. Pray to your  for us, what’s left of us. You can see for yourself how few we are! Pray that your  will tell us the way we should go and what we should do.”"}],[{"type":"prose","content":"Jeremiah the prophet said, “I hear your request. And I will pray to your  as you have asked. Whatever  says, I’ll pass on to you. I’ll tell you everything, holding nothing back.”"}],[{"type":"prose","content":"They said to Jeremiah, “Let  be our witness, a true and faithful witness against us, if we don’t do everything that your  directs you to tell us. Whether we like it or not, we’ll do it. We’ll obey whatever our  tells us. Yes, count on us. We’ll do it.”"}],[{"type":"prose","content":"Ten days later ’s Message came to Jeremiah. He called together Johanan son of Kareah and all the army officers with him, including all the people, regardless of how much clout they had."}],[{"type":"prose","content":"He then spoke: “This is the Message from , the God of Israel, to whom you sent me to present your prayer. He says, ‘If you are ready to stick it out in this land, I will build you up and not drag you down, I will plant you and not pull you up like a weed. I feel deep compassion on account of the doom I have visited on you. You don’t have to fear the king of Babylon. Your fears are for nothing. I’m on your side, ready to save and deliver you from anything he might do. I’ll pour mercy on you. What’s more,  will show you mercy! He’ll let you come back to your very own land.’"}],[{"type":"prose","content":"“But do not say, ‘We’re not staying around this place,’ refusing to obey the command of your  and saying instead, ‘No! We’re off to Egypt, where things are peaceful—no wars, no attacking armies, plenty of food. We’re going to live there.’ If what’s left of Judah is headed down that road, then listen to ’s Message. This is what -of-the-Angel-Armies says: ‘If you have determined to go to Egypt and make that your home, then the very wars you fear will catch up with you in Egypt and the starvation you dread will track you down in Egypt. You’ll die there! Every last one of you who is determined to go to Egypt and make it your home will either be killed, starve, or get sick and die. No survivors, not one! No one will escape the doom that I’ll bring upon you.’"}],[{"type":"prose","content":"“This is the Message from -of-the-Angel-Armies, the God of Israel: ‘In the same way that I swept the citizens of Jerusalem away with my anger and wrath, I’ll do the same thing all over again in Egypt. You’ll end up being cursed, reviled, ridiculed, and mocked. And you’ll never see your homeland again.’"}],[{"type":"prose","content":"“ has plainly told you, you leftovers from Judah, ‘Don’t go to Egypt.’ Could anything be plainer? I warn you this day that you are living out a fantasy. You’re making a fatal mistake.“Didn’t you just now send me to your , saying, ‘Pray for us to our . Tell us everything that  says and we’ll do it all’?"}],[{"type":"prose","content":"“Well, now I’ve told you, told you everything he said, and you haven’t obeyed a word of it, not a single word of what your  sent me to tell you. So now let me tell you what will happen next: You’ll be killed, you’ll starve to death, you’ll get sick and die in the wonderful country where you’ve determined to go and live.”"}]]