[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Oh that my words were now written",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "!—Some understand this to refer to the words he is about to utter; by others they are interpreted generally. The former view is probably owing to the Christian acceptation given to them, and the consequently great importance attaching to them. Since, however, the three verses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are manifestly more emphatic than any he has yet spoken, though they do not stand quite alone, there is no reason why it should not be especially these very words which he desires more than any others to have recorded. Perhaps the “now” = ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "here ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "shows this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Oh that they were printed.—This points us to primitive time, when writing materials and the use of writing involved more or less of engraving, as, for instance, in later times was the case with tablets of wax.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Oh that they were printed.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This points us to primitive time, when writing materials and the use of writing involved more or less of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "engraving, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as, for instance, in later times was the case with tablets of wax.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 19:23-24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:23-24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O that my words were now written! — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either, 1st, All his foregoing discourses with his friends, which he was so far from disowning or being ashamed of, that he was desirous all ages should know them, that they might judge between him and them, and decide whose cause was better, and whose arguments were stronger: or, rather, 2d, The words which he was now about to speak, containing a remarkable confession of his faith. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O that they were printed in a book! — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inserted, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "recorded ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יחקו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jochaku, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in a register. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "printed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is certainly used very improperly here, as being a term expressive of an art invented only about three hundred and fifty years ago: and, “especially as it does not, even by an improper expression,” as Dr. Dodd justly observes, “convey the idea of Job, which was the perpetuating his words; records, to which Job refers, being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "written, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "printed ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "among ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Observe, reader, that which Job wished for, God granted. His words are written in God’s book, are entered and preserved in the divine records. So that, wherever those records are read, there shall this glorious confession be declared for a memorial of him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That they were graven with an iron pen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Of which there is also mention ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and lead — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Job here alludes to the ancient custom of graving the letters on stone or marble, and then filling them up with lead, to render the inscription more legible and lasting. The LXX. however, do not seem to have understood Job thus, but rather to have supposed that he meant the recording of his words, by engraving them on plates of lead. Their words are, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εν γραφειω σιδηρω και μολιβω η εν πετραις εγγλυφηναι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To be engraven with an iron pen and lead, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon lead,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or on the rocks. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And it is very probable it was customary in those times to engrave inscriptions on plates of lead as well as on stones. One of these ways of engraving must have been intended by Job; for it would be absurd to suppose, that he meant to have the inscription cut on stone with a leaden pen, which could make no impression on so hard a material.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:23-29 The Spirit of God, at this time, seems to have powerfully wrought on the mind of Job. Here he witnessed a good confession; declared the soundness of his faith, and the assurance of his hope. Here is much of Christ and heaven; and he that said such things are these, declared plainly that he sought the better country, that is, the heavenly. Job was taught of God to believe in a living Redeemer; to look for the resurrection of the dead, and the life of the world to come; he comforted himself with the expectation of these. Job was assured, that this Redeemer of sinners from the yoke of Satan and the condemnation of sin, was his Redeemer, and expected salvation through him; and that he was a living Redeemer, though not yet come in the flesh; and that at the last day he would appear as the Judge of the world, to raise the dead, and complete the redemption of his people. With what pleasure holy Job enlarges upon this! May these faithful sayings be engraved by the Holy Spirit upon our hearts. We are all concerned to see that the root of the matter be in us. A living, quickening, commanding principle of grace in the heart, is the root of the matter; as necessary to our religion as the root of the tree, to which it owes both its fixedness and its fruitfulness. Job and his friends differed concerning the methods of Providence, but they agreed in the root of the matter, the belief of another world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Oh that my words were now written! - Margin, as in Hebrew, \"Who will give;\" a common mode of expressing desire among the Hebrews. This expression of desire introduces one of the most important passages in the book of Job. It is the language of a man who felt that injustice was done by his friends, and that he was not likely to have justice done him by that generation. He was charged with hypocrisy; his motives were called in question; his solemn appeals, and his arguments to assert his innocence, were disregarded; and in this state of mind he expresses the earnest wish that his expressions might be permanently recorded, and go down to far distant times. He desired that what he had said might be preserved, that future ages might be able to judge between him and his accusers, and to know the justice of his cause. The desire thus expressed has been granted, and a more permanent record bas been made than if, in accordance with his request, his sentiments had been engraved on lead or stone.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Oh that they were printed! - It is clear that this expression may convey wholly an erroneous idea. The art of \"printing\" was then unknown; and the passage has no allusion to that art. The original word (חקק  châqaq) means properly, to cut in, to hew; then to cut - e. g. a sepulchre in a rock, Isaiah 22:16; then to cut, or engrave letters on a tablet of lead or stone, Isaiah 30:8; Ezekiel 4:1; and generally it implies the notion of engraving, or inscribing on a plate with an engraving tool. Anciently books were made of materials which allowed of this mode of making a record. Stone would probably be the first material; and then plates of metal, leaves, bark, skins, etc. The notion of engraving, however, is the proper idea here.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Oh that they were printed! - It is clear that this expression may convey wholly an erroneous idea. The art of \"printing\" was then unknown; and the passage has no allusion to that art. The original word (חקק  châqaq) means properly, to cut in, to hew; then to cut - e. g. a sepulchre in a rock, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; then to cut, or engrave letters on a tablet of lead or stone, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and generally it implies the notion of engraving, or inscribing on a plate with an engraving tool. Anciently books were made of materials which allowed of this mode of making a record. Stone would probably be the first material; and then plates of metal, leaves, bark, skins, etc. The notion of engraving, however, is the proper idea here.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In a book -  - בספר  besêpher. The word ספר drow  sêpher is derived from ספר  sâphar. In Arabic the kindred word shafar means to scratch, to scrape; and hence, to engrave, write, record - and the idea was originally that ofinsculping or engraving on a stone. Hence, the word comes to denote a book, of any materials, or made in any form. Pliny, speaking of the materials of ancient books, says, Olim in palmarum foliis scriptitatum, et libris quarundam arborum; postea publira monumenta plumbeis voluminibus, mox et privata lintels confici coepta aut ceris. Lib. xiii. 11. \"At first men wrote on the leaves of the palm, or the bark of certain trees; but afterward public documents were preserved in leaden volumes (or rolls), and those of a private nature on wax or linen.\" \"Montfaucon purchased at Rome, in 1699, an ancient book entirely composed of lead. It was about four inches long, and three inches wide: and not only were the two pieces that formed the cover, and the leaves, six in number, of lead, but also the stick inserted through the rings to hold the leaves together, as well as the hinges and nails. It contained Egyptian Gnostic figures and unintelligible writing. Brass, as more durable, was used for the inscriptions designed to last the longest, such as treaties, laws, and alliances. These public documents were, however, usually written on large tablets. The style for writing on brass and other hard substances was sometimes tipped with diamond.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The meaning of the word here is evidently a record made on stone or lead - for so the following verses indicate. The art of writing or engraving was known in the time of Job; but I do not know that there is evidence that the art of writing on leaves, bark, or vellum was yet understood. As books in the form in which they are now were then unknown; as there is no evidence that at that time anything like volumes or rolls were possessed; as the records were probably preserved on tablets of stone or lead; and as the entire description here pertains to something that was engraved; and as this sense is conveyed by the Arabic verb from which the word ספר  sêpher, book, is derived, the word tablet, or some kindred word, will better express the sense of the original than book - and I have, therefore, used it in the translation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Assyrian records are found generally in stone or clay; and the latter being more easily and speedily engraven with a triangular instrument, was more frequently employed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) An Assyrian terra-cotta cylinder from Khorsabad contains the annals of the reign of Sargon. It is dated about 721 B.C.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) A hexagonal terra cotta cylinder from Koyunjik contains the annals of the first eight years of the reign of Sennacherib (702 to 694 B.C.), with an account of the expedition against Hezekiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) The inscription shows Assyrian scribes making notes of prisoners, heads of slain, spoils, etc. It comes from Koyunjik. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) The inscription shows Assyrian scribes making notes of prisoners, heads of slain, spoils, etc. It comes from Koyunjik. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. Despairing of justice from his friends in his lifetime, he wishes his words could be preserved imperishably to posterity, attesting his hope of vindication at the resurrection.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "printed—not our modern printing, but engraven.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My words; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The following and famous confession of his faith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 19:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. All his foregoing discourses with his friends, which he was so far from disowning or being ashamed of, that he was desirous that all ages should know, that they might judge between him and them, whose cause was better, and whose arguments were stronger. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O that my words were now written!.... Not his things (q), as some render it, his affairs, the transactions of his life; that so it might appear with what uprightness and integrity he had lived, and was not the bad man he was thought to be; nor the words he had delivered already, the apologies and defences he had made for himself, the arguments he had used in his own vindication, and the doctrines respecting God and his providence which he had laid down and asserted; and was so far from being ashamed of them, or retracting them, that he wishes they had been taken down in writing, that posterity might read and judge of the controversy between him and his friends; but rather the words he was about to deliver in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", expressing his faith in Christ, in the resurrection of the dead, and in a future state of happiness and glory; these he wishes were \"written\", that they might remain as a standing testimony of his faith and hope; for what is written abides, when that which is only spoken is soon forgot, and not easily recalled: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O that they were printed in a book! not written on loose sheets, which might be lost, but in a book bound up, or rolled up in a volume, as was the custom of ancient times; though this cannot be understood of printing properly taken, which has not been in use but little more than five hundred years, but of engrossing, as of statutes and decrees in public records; and the word for \"statutes comes\" from this that is here used. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) \"res meae\", Polychronius apud Pinedam in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) \"res meae\", Polychronius apud Pinedam in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Oh that my words were now written! oh that they were printed in a book!",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in a book",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. says in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the book",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", using the Art. to indicate the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "kind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of record, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The phrase means merely to “commit to writing.” The “words” which Job desires written are not those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., but his general and oft repeated protestations of his innocence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "23–27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job turns to the future. He desires that his protestation of innocence could find indelible record in the rock, that it might stand a perpetual witness to all generations. But he shall have something greater: he knows that God will yet appear for his vindication, and that he shall see Him with joy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The passage should probably be read something as follows:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "23  Oh now that my words were written,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Oh that they were inscribed in a book;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "24  That with a pen of iron and lead",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They were graven in the rock for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "25  But I know that my redeemer liveth,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And in after time he shall stand upon the dust,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "26  And after this my skin is destroyed",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And without my flesh I shall see God:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "27  Whom I shall see for myself,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And mine eyes shall behold and not another—",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "My reins consume within me!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:21-22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:21-22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Job in his terror of God appealed to his friends for pity, but probably he saw no signs of relenting there. They could not relent; their friend might be dear, but truth and religion were greater. Secure in their principles, their countenances shewed but austere reprobation of their wicked friend. They will be more austere because they are putting down humanity and sacrificing themselves in being austere. And turning from them the desire suddenly seizes Job to make his appeal to posterity, to record in writing his protestation of his innocence, or to grave it in the rock, that when he is gone men might read it to all time. Yet this thought satisfies him but for a moment. Even if the generations to come should pass a more gentle sentence upon him than his own time, being better able to estimate his circumstances and no more warped by the heats of controversy, and more inclined amidst the acknowledged mystery of his life to allow weight to the persistent testimony of his conscience, as that behind which it is impossible to go—even if they should not only mitigate but reverse the judgment of his contemporaries, how small a thing that would be to him. And his mind rebounds from this thought forward to a greater—he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "knows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that his redeemer liveth and shall appear for his vindication and peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "APPENDIX",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Additional Note on Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:23-27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In these verses Job anticipates that God will appear and interpose in his behalf to vindicate him, and that he shall see God, and he faints before the joyful vision. The meaning is sufficiently clear except in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:25-26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:25-26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", in regard to which some difference of opinion prevails. The point on which interpreters differ is chiefly the question, When, according to Job’s anticipation, shall this appearance of God on his behalf take place? Shall it be before or after his death?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The difference of view arises greatly from the ambiguity of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "umibbesârî, and from my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (see notes), though other points of construction are also involved. It is important to observe the connexion of ideas in the passage, and what the great thought is which fills Job’s mind. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:23-24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:23-24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " he desired that his protestations of rectitude were written in a book or rather graven with an iron pen in the rock for ever, that all generations of men to come might read them and know that he died in innocence. Suddenly a higher thought takes possession of his mind, namely the assurance that this innocence shall yet be vindicated by God appearing to uphold it, and that he himself shall see God to his joy. This seeing of God includes all within it, for now God hides His face; and this is the main thought of the passage, as the impassioned reiteration of it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", indicates. The connexion of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:25-26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:25-26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is: I know that my Goel liveth, and that he shall stand upon the dust, and … I shall see God. The bulk of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " contributes nothing to the main idea of the passage, which is the assurance of seeing God; it merely describes the circumstances in, or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which the vision shall take place. This makes it probable that the construction of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is light, and that its two clauses are parallel and not in antithesis to one another, in other words that the second clause begins with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", too, is a prep. in the original, and this fact increases the improbability of the antithetical construction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "i. The words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " might mean, (looking) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from my flesh I shall see God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i. e. as A. V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my flesh. Two interpretations are then possible, (1) that Job shall see God after his skin is destroyed and he is reduced to a mass of flesh; or (2) that endowed with flesh anew, in another (resurrection) body he shall see God. In the one case ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is opposed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in the other it is taken as denoting Job’s present body. Both of these interpretations require the second clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " to be taken in antithesis to the first, and are liable to the objections urged above. But in truth the first sense is nothing short of grotesque. A distinction between ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " might be made, if the second expressed more strongly the same meaning with the first, but in the circumstances to put them in antithesis seems ludicrous. Considering the nature of Job’s malady he could hardly express its worst ravages by saying that it would destroy his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", leaving his flesh remaining. He had already said much stronger things than this of his actual condition, among others that he was become a skeleton of bones, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that all his members were a shadow, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that his leanness bore witness to his face, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as he says later that his clothes clung to his shrunken frame like the opening of his shirt, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that he was escaped with the skin of his teeth, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Besides, the word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "destroyed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is literally ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "struck off",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a meaning which suggests removal of the solid parts of the body. And that the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be used in this general sense of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "body",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " appears from ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Where ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used along with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the two words express the same general meaning, the accumulation of terms merely serving to intensify the expression, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 102:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "If therefore we understand the words “from my flesh” in the sense of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my flesh, we must suppose that Job anticipated being clothed in a new body after death; and this body is what he names his “flesh.” Something may be said for this view. Undoubtedly in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job already conceived the idea of being delivered from Sheol and living again, and fervently prayed that such a thing might be. And what he there ventured to long for he might here speak of as a thing of which he was assured. No violence would be done to the line of thought in the Book by this supposition. Nevertheless several things are against it. The great idea of the passage, as has been said, is that God shall appear and that Job shall see Him. The rest of the words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 19:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " seem unemphatic, and descriptive of something naturally to be understood. But it is highly improbable that the great thought of the resurrection of the body could be referred to in a way so brief. Even if this idea had been current and a commonplace of belief, a reference to it by the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would be singular and unnatural. But on Old Testament ground, and in the situation of Job, such a matter-of-course kind of reference is almost inconceivable. We may be certain, had such an idea been alluded to, that it would have been expressed in a manner much more formal and detailed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A somewhat different view has been taken by some scholars. Finding it difficult to accept the meaning ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "away from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the Heb. prep. here, they retain the sense ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i. e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and consider the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to be each used somewhat generally in the sense of the “body.” Hence they translate: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and after my skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i. e. my body) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "has been thus destroyed, yet from my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i. e. in this body of mine) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall see God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though not liable to the objections urged above, this view is rather unnatural. The words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "skin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " express a single general idea when coupled together by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but that each of them should mean generally the body when separated by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is little probable. Though this view agrees in rendering with i. above, it coincides in meaning with ii. (1) just to be mentioned, and is liable to the difficulties urged below.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "ii. The words ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", however, may mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "away from",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "without",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my flesh. In this case the words “after this my skin has been destroyed are taken up and their meaning repeated in a more intense form in the phrase ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and without my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is the natural construction. It is to be observed, however, that the language does not state ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in",
        "children": [
          {
            "element": "span",
            "class": "ital",
            "text": "in",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " what condition precisely Job shall see God, but rather ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what events, viz. after his skin has been destroyed and his flesh has been removed. Here, however, again a division of opinion exists. (1) By some the words are taken in a comparative sense, meaning that Job shall see God when his skin and flesh have been (virtually) destroyed by his disease and he is reduced to a skeleton of bones—though still in life. (2) By others the language is taken in an absolute sense, meaning that Job’s vision of God shall be after his disease has wholly destroyed his body and brought him to death. The second view is the more natural, does most justice to the language, and is most in harmony with the elevated character of the passage. It is also supported by many considerations suggested by other parts of the Book.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Before these considerations are referred to another remark may be made. It is always to be remembered what is the main thought here in Job’s mind; it is that God shall appear to vindicate his innocence, and that he shall see God to his joy. The question whether this shall be in this life or beyond this life is of subsidiary importance, and not the main point. At present Job’s afflictions are proof to him of God’s estrangement. God holds him guilty and hides His face from him. And his friends, arguing on his calamities, impute grievous sins to him. His misery was very aggravated in every view. His good name among men was sullied by shameful imputations, intolerable to his lofty mind; for the easy theory of his friends, that one might be a religious man and at the same time a great sinner, he repudiated with abhorrence, so far as his own life was concerned. Then, as a religious man, his heart was crushed by the loss of God’s favour. And the inexplicableness of this loss, combined with his unbearable afflictions at God’s hand, threw up before his mind great moral riddles which utterly baffled him. In this thick darkness he has nothing but his own consciousness to fall back upon. But his consciousness of his innocence assures him that God knows it also. And this assurance becomes the basis of the other assurance that God from His nature must yet make manifest the relation in which His servant stands to Him, and that he shall see God. Job’s assurance is based on his own past experience, on his life with God, on his consciousness of being a God-fearing man, and on his ineradicable convictions in regard to the nature of God and His relations to men. Job’s circumstances cause his principle to appear in its barest form: the human spirit is conscious of fellowship with God, and this fellowship, from the nature of God, is a thing imperishable, and, in spite of obscurations, it must yet be fully manifested by God. This principle, grasped with convulsive earnestness in the prospect of death, became the Hebrew doctrine of Immortality. This doctrine was but the necessary corollary of religion. In this life on earth the true relations of men and God were felt to be realized; and the Hebrew faith of Immortality—never a belief in the mere existence of the soul after death, for the lowest popular superstition assumed this (see notes on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)—was a faith that the dark and mysterious event of death should not interrupt the life of the person with God enjoyed in this world. Job’s afflictions make his faith not so much an assurance of the continuation of his fellowship with God as of its renewal or manifestation, and, of course, this might take place in this life. The similarity of the passage, however, to many others in the Old Testament, uttered in the prospect of death, makes it probable that Job speaks with death in view. And the probability is heightened by many other considerations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The whole of the chapters 16, 17 and 19 are spoken by Job under the feeling that he shall die with his innocence unrecognised. Hence in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he appeals to the earth not to cover his innocent blood; and in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he desires that his protestations of his innocence might be graven in the rock for ever, that when he is gone men to all generations might read them. There is not the slightest ground to think that in the verses that follow these expressions in ch. 16 and 19. Job retracts or corrects this anticipation that he shall die an unjust death. The verses that follow proceed on the same assumption, but they express the prayer (ch. 16–17) or the assurance (ch. 19) that, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "though",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he die with God’s face hidden from him and under the reproach of being a transgressor, this perverse and cruel fate shall not for ever prevail over him; God shall yet appear to vindicate his innocence and he shall see Him to his joy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "On this view every word in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". becomes full of meaning. Job’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Goel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is he who shall vindicate him against his wrongful death. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "liveth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " derives its meaning from the fact that Job shall have died. The term ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "aḥaron",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", however we render it, whether “he who shall come after me” or with Ewald an ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after-man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i. e. vindicator, equally implies Job’s previous death. Similarly the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dust",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the supposition that Job’s vindication shall be in this life, every one of those words is robbed of its just significance, and no account at all can be given of the use of the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "liveth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Further, it is certain that Job does not anticipate restoration to health and prosperity in this life. Neither in the lofty passages above referred to nor anywhere does he express such an opinion, but always and consistently an opposite one. He calls such a hope when held out by his friends “mockery,” ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So certain is he that he shall die under his malady that he does not even pray for recovery, only for a little easing of his pain before he departs, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If life is to be his portion at all, it must be a new life after this one comes to its rapid close, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is his tone after ch. 19 as well as before it. In ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he says that God “will perform the thing appointed for him,” i. e. bring him to death through his malady. And almost his last words are, “I know that thou wilt bring me unto death,” ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It seems clear therefore that God’s intervention to declare Job’s innocence, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., take place in this life, will not be accompanied by Job’s restoration to health. His disease will in spite of it carry him to the grave. But could such a thought have occurred to Job? His disease was to him the seal of God’s estrangement from him. It was God’s witness to his guilt. It was this moral meaning which his death had that caused him so to wrestle against it (see notes ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). It seems impossible that Job could have conceived God declaring to men and to himself his innocence ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "while",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He continued to afflict him fatally with his disease. To “see God” and to be chastened to death by Him are two things which on Old Testament ground are contradictory of one another.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The theory that God’s intervention in Job’s behalf is looked for by him in this life is thought to derive support from the actual ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dénouement",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Job’s history (ch. 42). But the argument proves too much by a half. The author allows Job to be restored to prosperity in this life in contradiction to Job’s uniform and contemptuous rejection of such a hope. And he may equally well have advanced Job’s vision of God into this life, though Job pushed it back beyond his death. In truth, as has been said, the two things are inseparable. It would be a strange demand to make of a dramatic writer that he should make his personages express only opinions that coincide with his own, and allow them to anticipate the issue of the plot. Certainly the author of Job imposes no such restrictions on himself. He never allows Job to come within sight of the true cause of his afflictions, and as little does he permit him to foresee their issue. It was his purpose to bring into a focus the thoughts of men on the question of suffering, the great problem of his day; and some of the views expressed, particularly by Job, are those to which men were driven by the pressure of the time, or to which they rose out of the distress of their own hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3. If, however, we must conclude that Job looked for this appearance of God on his behalf, and this vision of Him to his joy, not previous to his death, we must not attempt to fill up the outline which he has drawn. We must take care not to complete his sketch out of events that transpired long after his day, or out of beliefs, reposing on these events, that are now current among ourselves. The English Version has done so at the expense of the original. The great thought which filled Job’s imagination was the thought that God would appear to manifest his innocence and that he should see Him in peace and reconciliation. This thought was so intense that it almost realized itself. Job’s assurance of seeing God was so vivid that it virtually became a vision of God and he faints in the ecstasy of his faith. In such a condition of mind the preliminaries and the circumstances that would occur to a mind in a calmer state, or which immediately occur to us, do not obtrude themselves, and if we are rightly to conceive Job’s state of mind we must entirely exclude them. We should be wrong to say that he contemplates a purely spiritual vision of God, and further wrong to say that he contemplates being invested with a new body when he shall see God. Neither thought is present to his mind, which is entirely absorbed in the idea of seeing God. The ideas of Old Test, saints regarding the condition of man after death were too obscure to permit of any such formal and precise conception as that which we call a spiritual sight of God. Besides, as the kind of half-ecstasy under which Job here speaks has fallen on him when a living man, it is probable that, like all persons in such conditions, he carries over with him his present circumstances into his vision after death, and seems to himself to be such a man as he is now when he sees God; comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "4. The above remarks suggest what elements of truth lay in the traditional interpretation of this passage, in spite of its hardy treatment of the text. The christology of the Book is indirect. There are no express references to the Messiah, though several passages may seem unconscious prophecies of Him, as those that express Job’s desire to meet and see God as a man, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Goel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or redeemer is God. A distinction of Person’s in the Godhead was not present to his thoughts when he used this term; though the conception of God in the passage and many things said in it may find verification in God’s manifestation of Himself in His Son. The strange distinction which Job draws between God and God, God who persecutes him and God who is his Witness and Redeemer, is, of course, not a christological distinction, nor one that corresponds to any distinction in the Godhead made known to us by subsequent revelation. To suppose so would be a gross perversion not only of this Book but of the whole of Scripture. The distinction was one which Job’s ideas almost compelled him to draw. He believed that every event that occurred came immediately from God’s hand; and he believed that every event that befell a man reflected the disposition of God’s mind toward him: calamity indicated the anger and prosperity the favour of God. This second superstition is the source of all his perplexities; and the distinction which he draws between God and God is his effort to overcome it. God whom he appeals against is the rule and course of this world, the outer providence of God, to which Job can give no name but “God.” God to whom he appeals is the inner mind of God towards His servants, the moral ideal of the human heart. This is God his Witness and Redeemer. Job succeeded in drawing this distinction; but the reconciliation which the distinction demanded he was only partially successful in effecting. He could not reach the idea that God, the heart of God, might be towards him, while God—the outer course of the world—afflicted him. These two things could not be at the same time. But they might succeed one another. Hence his reconciliation is temporal: God will bring him unto death, but after his body is destroyed God shall appear to vindicate him and he shall see God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The doctrine of Immortality in the Book is the same as that of other parts of the Old Testament. Immortality is the corollary of Religion. If there be religion, that is, if God be, there is immortality, not of the soul but of the whole personal being of man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This teaching of the whole Old Testament is expressed by our Lord with a surprising incisiveness in two sentences—“I am the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Abraham. God is not the God of the dead but of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "living",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Oh that my words were written!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is questioned what words of his Job is so anxious to have committed to writing - those that precede the expression of the wish, or those that follow, or both. As there is nothing that is very remarkable in the preceding words, whereas the latter are among the most striking in the book, the general opinion has been that he refers to these last. It is now universally allowed, even by those whose date for Job is the most remote, that books were common long before his time, and so that he might naturally have been familiar with them. Writing is, of course, even anterior to books, and was certainly in use before  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 2000",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The earliest writing was probably on stone or brick, and was perhaps in every case hieroglyphical. When writing on papyrus, or parchment, or the bark of trees, came into use, a cursive character soon superseded the hieroglyphical, though the latter continued In be employed for religious purposes, and for inscriptions on stone. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Oh that they were printed in a book!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "inscribed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "engraved.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The impression of the characters below the surface of the writing material, as in the Babylonian and Assyrian clay-tablets, seems to be pointed at. Job 19:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21  Have pity upon me, have pity upon me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O ye my friends, For the hand of Eloah hath touched me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22  Wherefore do ye persecute me as God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And are never satisfied with my flesh?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23  Oh that my words were but written,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That they were recorded in a book,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24  With an iron pen, filled in with lead,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Graven in the rock for ever!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25  And I:know: my Redeemer liveth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as the last One will He arise from the dust.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Job 19:21 Job takes up a strain we have not heard previously. His natural strength becomes more and more feeble, and his voice weaker and weaker. It is a feeling of sadness that prevails in the preceding description of suffering, and now even stamps the address to the friends with a tone of importunate entreaty which shall, if possible, affect their heart. They are indeed his friends, as the emphatic רעי אתּם affirms; impelled towards him by sympathy they are come, and at least stand by him while all other men flee from him. They are therefore to grant him favour (חנן, prop. to incline to) in the place of right; it is enough that the hand of Eloah has touched him (in connection with this, one is reminded that leprosy is called נגע, and is pre-eminently accounted as plaga divina; wherefore the suffering Messiah also bears the significant name חוּרא דבי רבּי, \"the leprous one from the school of Rabbi,\" in the Talmud, after Isaiah 53:4, Isaiah 53:8), they are not to make the divine decree heavier to him by their uncharitableness. Wherefore do ye persecute me - he asks them in Job 19:22 - like as God (כּמו־אל, according to Saad. and Ralbag  equals  כמו־אלּה, which would be very tame); by which he means not merely that they add their persecution to God's, but that they take upon themselves God's work, that they usurp to themselves a judicial divine authority, they act towards him as if they were superhuman (vid., Isaiah 31:3), and therefore inhumanly, since they, who are but his equals, look down upon him from an assumed and false elevation. The other half of the question: wherefore are ye not full of my flesh (de ma chair, with מן, as Job 31:31), but still continue to devour it? is founded upon a common Semitic figurative expression, with which may be compared our Germ. expression, \"to gnaw with the tooth of slander\" comp. Engl. \"backbiting\". In Chaldee, אכל קרצוהי די, to eat the pieces of (any one), is equivalent to, to slander him; in Syriac, ochelqarsso is the name of Satan, like διάβολος. The Arabic here, as almost everywhere in the book of Job, presents a still closer parallel; for Arab. 'kl lḥm signifies to eat any one's flesh, then (different from אכל בשׂר, Psalm 27:2) equivalent to, to slander, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Job takes up a strain we have not heard previously. His natural strength becomes more and more feeble, and his voice weaker and weaker. It is a feeling of sadness that prevails in the preceding description of suffering, and now even stamps the address to the friends with a tone of importunate entreaty which shall, if possible, affect their heart. They are indeed his friends, as the emphatic רעי אתּם affirms; impelled towards him by sympathy they are come, and at least stand by him while all other men flee from him. They are therefore to grant him favour (חנן, prop. to incline to) in the place of right; it is enough that the hand of Eloah has touched him (in connection with this, one is reminded that leprosy is called נגע, and is pre-eminently accounted as plaga divina; wherefore the suffering Messiah also bears the significant name חוּרא דבי רבּי, \"the leprous one from the school of Rabbi,\" in the Talmud, after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), they are not to make the divine decree heavier to him by their uncharitableness. Wherefore do ye persecute me - he asks them in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - like as God (כּמו־אל, according to Saad. and Ralbag  equals  כמו־אלּה, which would be very tame); by which he means not merely that they add their persecution to God's, but that they take upon themselves God's work, that they usurp to themselves a judicial divine authority, they act towards him as if they were superhuman (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 31:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and therefore inhumanly, since they, who are but his equals, look down upon him from an assumed and false elevation. The other half of the question: wherefore are ye not full of my flesh (de ma chair, with מן, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but still continue to devour it? is founded upon a common Semitic figurative expression, with which may be compared our Germ. expression, \"to gnaw with the tooth of slander\" comp. Engl. \"backbiting\". In Chaldee, אכל קרצוהי די, to eat the pieces of (any one), is equivalent to, to slander him; in Syriac, ochelqarsso is the name of Satan, like διάβολος. The Arabic here, as almost everywhere in the book of Job, presents a still closer parallel; for Arab. 'kl lḥm signifies to eat any one's flesh, then (different from אכל בשׂר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") equivalent to, to slander, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Schultens' ad Prov. Meidanii, p. 7 (where \"to eat his own flesh,\" equivalent to \"himself,\" without allowing others to do it, signifies to censure his kinsmen), and comp. the phrase Arab. aclu-l-a‛râdhi in the signification arrodere existimationem hominum in Makkari, i. 541, 13.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "since an evil report is conceived of as a wild beast, which delights in tearing a neighbour to pieces, as the friends do not refrain from doing, since, from the love of their assumption that his suffering must be the retributive punishment of heinous sins, they lay sins to his charge of which he is not conscious, and which he never committed. Against these uncharitable and groundless accusations he wishes (Job 19:23) that the testimony of his innocence, to which they will not listen, might be recorded in a book for posterity, or because a book may easily perish, graven in a rock (therefore not on leaden plates) with an iron style, and the addition of lead, with which to fill up the engraved letters, and render them still more imperishable. In connection with the remarkable fidelity with which the poet throws himself back into the pre-Israelitish patriarchal time of his hero, it is of no small importance that he ascribes to him an acquaintance not only with monumental writing, but also with book and documentary writing (comp. Job 31:35).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "since an evil report is conceived of as a wild beast, which delights in tearing a neighbour to pieces, as the friends do not refrain from doing, since, from the love of their assumption that his suffering must be the retributive punishment of heinous sins, they lay sins to his charge of which he is not conscious, and which he never committed. Against these uncharitable and groundless accusations he wishes (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") that the testimony of his innocence, to which they will not listen, might be recorded in a book for posterity, or because a book may easily perish, graven in a rock (therefore not on leaden plates) with an iron style, and the addition of lead, with which to fill up the engraved letters, and render them still more imperishable. In connection with the remarkable fidelity with which the poet throws himself back into the pre-Israelitish patriarchal time of his hero, it is of no small importance that he ascribes to him an acquaintance not only with monumental writing, but also with book and documentary writing (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The fut., which also elsewhere (Job 6:8; Job 13:5; Job 14:13, once the praet., Job 23:3, noverim) follows מי־יתּן, quis dabat  equals  utinam, has Waw consec. here (as Deuteronomy 5:26 the praet.); the arrangement of the words is extremely elegant, בּסּפר stands per hyperbaton emphatically prominent. כּתב and חקק (whence fut. Hoph. יחקוּ with Dag. implicitum in the ח, comp. Job 4:20, and the Dag. of the ק omitted, for יוּחקּוּ, according to Ges. 67, rem. 8) interchange also elsewhere, Isaiah 30:8. ספר, according to its etymon, is a book formed of the skin of an animal, as Arab. sufre, the leathern table-mat spread on the ground instead of a table. It is as unnecessary to read לעד (comp. Job 16:8, lxx, εἰς μαρτύριον) instead of לעד here, as in Isaiah 30:8. He wishes that his own declaration, in opposition to his accusers, may be inscribed as on a monument, that it may be immortalized, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The fut., which also elsewhere (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", once the praet., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", noverim) follows מי־יתּן, quis dabat  equals  utinam, has Waw consec. here (as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 5:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the praet.); the arrangement of the words is extremely elegant, בּסּפר stands per hyperbaton emphatically prominent. כּתב and חקק (whence fut. Hoph. יחקוּ with Dag. implicitum in the ח, comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the Dag. of the ק omitted, for יוּחקּוּ, according to Ges. 67, rem. 8) interchange also elsewhere, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ספר, according to its etymon, is a book formed of the skin of an animal, as Arab. sufre, the leathern table-mat spread on the ground instead of a table. It is as unnecessary to read לעד (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", lxx, εἰς μαρτύριον) instead of לעד here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He wishes that his own declaration, in opposition to his accusers, may be inscribed as on a monument, that it may be immortalized, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]