[{"num":26,"verse":"Then all the people of Judah took Uzziah, who was sixteen years old, and made him king in place of his father Amaziah."},{"num":2,"verse":"He built Eloth and restored it to Judah after Amaziah slept with his fathers."},{"num":3,"verse":"Uzziah was sixteen years old when he began his fifty-two-year reign in Jerusalem. His mother was Jecoliah of Jerusalem."},{"num":4,"verse":"He did right in the Lord’s sight, to the extent of all that his father Amaziah had done."},{"num":5,"verse":"He set himself to seek God in the days of Zechariah, who instructed him in the things of God; and as long as he sought (inquired of, yearned for) the Lord, God made him prosper."},{"num":6,"verse":"He went out against the Philistines and broke down the walls of Gath, of Jabneh, and of Ashdod, and built cities near Ashdod and elsewhere among the Philistines."},{"num":7,"verse":"And God helped him against the Philistines, and the Arabs who dwelt in Gur-baal and the Meunim."},{"num":8,"verse":"The Ammonites paid tribute to Uzziah, and his fame spread abroad even to the border of Egypt, for he became very strong."},{"num":9,"verse":"Also Uzziah built towers in Jerusalem at the Corner Gate, the Valley Gate, and at the angle of the wall, and fortified them."},{"num":10,"verse":"Also he built towers in the wilderness and hewed out many cisterns, for he had much livestock, both in the lowlands and in the tableland. And he had farmers and vinedressers in the hills and in the fertile fields [of Carmel], for he loved farming."},{"num":11,"verse":"And Uzziah had a combat army for waging war by regiments according to the number as recorded by Jeiel the secretary and Maaseiah the officer under the direction of Hananiah, one of the king’s commanders."},{"num":12,"verse":"The whole number of the heads of fathers’ houses of mighty men of valor was 2,600."},{"num":13,"verse":"Under their command was an army of 307,500 who could fight with mighty power to help the king against the enemy."},{"num":14,"verse":"Uzziah prepared for all the army shields, spears, helmets, coats of mail, bows, and stones to sling."},{"num":15,"verse":"In Jerusalem he made machines invented by skillful men to be on the towers and the [corner] bulwarks, with which to shoot arrows and great stones. And his fame spread far, for he was marvelously helped till he was strong."},{"num":16,"verse":"But when [King Uzziah] was strong, he became proud to his destruction; and he trespassed against the Lord his God, for he went into the temple of the Lord to burn incense on the altar of incense."},{"num":17,"verse":"And Azariah the priest went in after him and with him eighty priests of the Lord, men of courage."},{"num":18,"verse":"They opposed King Uzziah and said to him, It is not for you, Uzziah, to burn incense to the Lord, but for the priests, the sons of Aaron, who are set apart to burn incense. Withdraw from the sanctuary; you have trespassed, and that will not be to your credit and honor before the Lord God."},{"num":19,"verse":"Then Uzziah was enraged, and he had a censer in his hand to burn incense. And while he was enraged with the priests, leprosy broke out on his forehead before the priests in the house of the Lord, beside the incense altar."},{"num":20,"verse":"And as Azariah the chief priest and all the priests looked upon him, behold, he was leprous on his forehead! So they forced him out of there; and he also made haste to get out, because the Lord had smitten him."},{"num":21,"verse":"And King Uzziah was a leper to the day of his death, and, being a leper, he dwelt in a separate house, for he was excluded from the Lord’s house. And Jotham his son took charge of the king’s household, ruling the people of the land."},{"num":22,"verse":"Now the rest of the acts of Uzziah, from first to last, Isaiah the prophet, the son of Amoz, wrote."},{"num":23,"verse":"So Uzziah slept with his fathers, and they buried him in the burial field of the kings [outside the royal tombs], for they said, He is a leper. Jotham his son reigned in his stead."}]