[{"header":"Uzziah Rules Judah"},{"num":26,"verse":"Then all the people took Uzziah, who was sixteen years old, and made him king in the place of his father Amaziah. "},{"num":2,"verse":"He built Eloth and returned it to Judah after the king died. "},{"num":3,"verse":"Uzziah was sixteen years old when he became king. And he ruled fifty-two years in Jerusalem. His mother’s name was Jechiliah of Jerusalem. "},{"num":4,"verse":"Uzziah did what was right in the eyes of the Lord. He did all that his father Amaziah had done. "},{"num":5,"verse":"He kept on looking to God in the days of Zechariah, who had special wisdom from God and taught him in the things of God. And as long as he looked to the Lord, God made things go well for him."},{"num":6,"verse":"Uzziah went out and made war against the Philistines. He broke down the wall of Gath and the wall of Jabneh and the wall of Ashdod. And he built cities in the land of Ashdod and among the Philistines. "},{"num":7,"verse":"God helped him against the Philistines, and against the Arabians who lived in Gur-baal, and against the Meunites. "},{"num":8,"verse":"The Ammonites paid taxes to Uzziah. And his name was known as far as the land of Egypt, for he became very strong. "},{"num":9,"verse":"Uzziah built towers in Jerusalem at the Corner Gate, at the Valley Gate, and at the place where the walls joined. And he made them strong. "},{"num":10,"verse":"He built towers in the desert and dug many wells. For he had many animals, both in the valley and in the plain. He also had farmers and vine-keepers in the hill country and in the good growing fields, for he loved farming. "},{"num":11,"verse":"And Uzziah had an army ready for battle. It was divided by the number of names written down by Jeiel the writer and Maaseiah the captain, led by Hananiah, one of the king’s leaders. "},{"num":12,"verse":"The whole number of the leaders of the family groups of powerful soldiers was 2,600. "},{"num":13,"verse":"Under their leading was an army of 307,500, who could fight with great power, to help the king against those who hated them. "},{"num":14,"verse":"Uzziah had battle-coverings, spears, head-coverings, strong battle-clothes, bows, and slings using arrows and large stones made for all the army. "},{"num":15,"verse":"In Jerusalem he made large objects of war, planned by able men, to be on the towers and the corners. They were for shooting arrows and big stones. So Uzziah’s name became known in far away places. For he was helped by God in a very special way until he was strong."},{"header":"Uzziah Is Punished because of His Pride"},{"num":16,"verse":"But when he became strong, Uzziah’s heart was so proud that his actions were sinful. He was not faithful to the Lord his God, for he went into the Lord’s house to burn special perfume on the altar of special perfume. "},{"num":17,"verse":"Then Azariah the religious leader went in after him, with eighty religious leaders of the Lord who were men strong in heart. "},{"num":18,"verse":"They went against King Uzziah and said to him, “It is not for you, Uzziah, to burn special perfume to the Lord. It should be done by the religious leaders, the sons of Aaron, who are set apart to burn special perfume. Get out of the holy place, for you have not been faithful. You will have no honor from the Lord God.” "},{"num":19,"verse":"Then Uzziah was angry, and he had a dish in his hand for burning special perfume. While he was angry with the religious leaders, a bad skin disease broke out on his forehead in front of the religious leaders in the Lord’s house, beside the altar of special perfume. "},{"num":20,"verse":"Azariah the head religious leader and all the religious leaders looked at him and saw that he had a bad skin disease on his forehead. So they were quick to get him out of there, and he himself left in a hurry because the Lord had punished him. "},{"num":21,"verse":"King Uzziah had the bad skin disease to the day of his death. He lived in a separate house, suffering with the skin disease, for he was cut off from the house of the Lord. And his son Jotham was over the king’s house, ruling the people of the land. "},{"num":22,"verse":"Now the rest of the acts of Uzziah, first to last, were written by the man of God Isaiah, the son of Amoz. "},{"num":23,"verse":"Uzziah died, and they buried him with his fathers in the field of the grave which belonged to the kings. For they said, “He has a bad skin disease.” And Jotham his son became king in his place."}]