[{"header":"King Uzziah of Judah(A)"},{"num":26,"verse":"All the people of Judah took Uzziah, who was 16 years old, and made him king in place of his father Amaziah. "},{"num":2,"verse":"Uzziah rebuilt Elath and returned it to Judah after King Amaziah lay down in death with his ancestors. "},{"num":3,"verse":"Uzziah was 16 years old when he began to rule, and he ruled for 52 years in Jerusalem. His mother was Jecoliah from Jerusalem. "},{"num":4,"verse":"He did what Yahweh considered right, as his father Amaziah had done. "},{"num":5,"verse":"He dedicated his life to serving Elohim in the days of Zechariah, who taught him to fear Elohim. As long as he dedicated his life to serving Yahweh, Elohim gave him success."},{"num":6,"verse":"Uzziah went to wage war against the Philistines. He tore down the walls of Gath, Jabneh, and Ashdod. He built cities near Ashdod and elsewhere among the Philistines. "},{"num":7,"verse":"Elohim helped him when he attacked the Philistines, the Arabs who lived in Gur Baal, and the Meunites. "},{"num":8,"verse":"The Ammonites paid taxes to Uzziah, and his fame spread to the border of Egypt because he became very powerful. "},{"num":9,"verse":"Uzziah built towers in Jerusalem at Corner Wall, Valley Gate, and the Angle, and he reinforced them. "},{"num":10,"verse":"He built towers in the desert. He dug many cisterns because he had a lot of herds in the foothills and the plains. He had farmers and vineyard workers in the mountains and the fertile fields because he loved the soil."},{"num":11,"verse":"Uzziah had an army of professional soldiers. They were ready to go to war in their companies based on the number organized by the scribe Jeiel and the officer Maaseiah. They were commanded by Hananiah, one of the king’s officials. "},{"num":12,"verse":"The total number of family heads among these warriors was 2,600. "},{"num":13,"verse":"Under them was an army of 307,500 soldiers. They were a powerful force that could support the king against the enemy. "},{"num":14,"verse":"For the entire army Uzziah prepared shields, spears, helmets, armor, bows, and stones for slings. "},{"num":15,"verse":"In Jerusalem he made machines designed by inventive people. The machines were placed on the towers and corners to shoot arrows and hurl large stones."},{"header":"King Uzziah Is Cursed with a Skin Disease(B)"},{"num":16,"verse":"But when he became powerful, his pride destroyed him. He was unfaithful to Yahweh his Elohim. He went into Yahweh’s temple to burn incense on the incense altar. "},{"num":17,"verse":"The priest Azariah went in after him with 80 of Yahweh’s courageous priests. "},{"num":18,"verse":"They opposed King Uzziah. They said to him, “Uzziah, you have no right to burn incense as an offering to Yahweh. That right belongs to the priests, Aaron’s descendants, who have been given the holy task of burning incense. Get out of the holy place because you have been unfaithful. Yahweh Elohim will not honor you for this.”"},{"num":19,"verse":"Uzziah, who held an incense burner in his hand, became angry. While he was angry with the priests, a skin disease broke out on his forehead. This happened in front of the priests in Yahweh’s temple as Uzziah was at the incense altar. "},{"num":20,"verse":"When the chief priest Azariah and all the priests turned toward him, a skin disease was on his forehead. They rushed him away. Uzziah was in a hurry to get out because Yahweh had inflicted him with the disease."},{"num":21,"verse":"King Uzziah had a skin disease until the day he died. Since he had a skin disease, he lived in a separate house and was barred from Yahweh’s temple. His son Jotham was in charge of the royal palace and governed the country."},{"num":22,"verse":"Everything else about Uzziah, from beginning to end, is recorded by the prophet Isaiah, son of Amoz. "},{"num":23,"verse":"Uzziah lay down in death with his ancestors and was buried with them in a field containing tombs that belonged to the kings. People said, “He had a skin disease.” His son Jotham succeeded him as king."}]