[{"header":"Uzziah Strengthens Judah’s Defenses"},{"num":26,"verse":"Then all the people of Judah took Uzziah, who was 16 years old, and made him king in place of his father Amaziah. "},{"num":2,"verse":"He built Eloth and restored it to Judah after the king slept with his fathers. "},{"num":3,"verse":"Uzziah was 16 years old when he became king, and he reigned 52 years in Jerusalem. His mother’s name was Jecoliah from Jerusalem. "},{"num":4,"verse":"He did what was right in the eyes of Adonai just as his father Amaziah had done. "},{"num":5,"verse":"He continued to seek God in the days of Zechariah, who had understanding through the visions of God. As long as he sought Adonai, God made him prosper."},{"num":6,"verse":"He went out and fought the Philistines and breached the wall of Gath, the wall of Jabneh and the wall of Ashdod. He built cities in Ashdod and among the Philistines. "},{"num":7,"verse":"God helped him against the Philistines, against the Arabs who dwelt in Gur-Baal, and against the Meunites. "},{"num":8,"verse":"The Ammonites paid tribute to Uzziah, and his fame spread abroad even to the border of Egypt, for he became exceedingly strong."},{"num":9,"verse":"Moreover, Uzziah built towers in Jerusalem at the Corner Gate, the Valley Gate and at the Angle, and fortified them. "},{"num":10,"verse":"He also built towers in the wilderness and dug out many cisterns because he had much livestock, and he had farmers in the foothills and in the plain and vinedressers in the mountains and in the fertile fields—for he loved the soil."},{"num":11,"verse":"Uzziah also had a well-trained army ready to go out to battle by divisions, according to the numbers mustered by the hand of Jeiel the scribe and Maaseiah the official, under Hananiah, one of the king’s chieftains. "},{"num":12,"verse":"The total number of family leaders over the fighting men was 2,600, "},{"num":13,"verse":"and under their command was an army of 307,500 trained for war with mighty power to support the king against the enemy. "},{"num":14,"verse":"Uzziah provided shields, spears, helmets, body armor, bows and slingstones for the entire army. "},{"num":15,"verse":"In Jerusalem he made machines designed by skillful men to be used on the towers and on the corners to shoot arrows and hurl large stones. So his fame spread far, for he was marvelously helped until he became strong."},{"header":"Uzziah Usurps the Kohanim"},{"num":16,"verse":"But when he became strong, his heart grew so haughty that he acted corruptly. For he trespassed against Adonai his God by entering into the Temple of Adonai to burn incense upon the altar of incense. "},{"num":17,"verse":"Then Azariah the kohen with 80 valiant kohanim of Adonai followed him in. "},{"num":18,"verse":"They opposed Uzziah the king and said to him, “It is not for you, Uzziah, to burn incense to Adonai, but for the kohanim, the descendants of Aaron, who have been consecrated to burn incense. Get out of the Sanctuary, for you have acted unfaithfully. You will have no honor from Adonai Elohim.”"},{"num":19,"verse":"Then Uzziah, who had a censer in his hand ready to burn incense, became angry. While he was raging at the kohanim tza’arat broke out on his forehead right in front of the kohanim in the House of Adonai, beside the incense altar. "},{"num":20,"verse":"When Azariah the chief kohen and all the other kohanim stared at him, behold, his forehead had tza’arat! So they rushed him out of there. Indeed, he himself hurried to get out because Adonai had smitten him."},{"num":21,"verse":"King Uzziah had tza’arat until the day of his death. He lived in a separate house with tza’arat, for he was cut off from the House of Adonai. Jotham his son was in charge of the king’s house and governed the people of the land."},{"num":22,"verse":"Now the rest of the acts of Uzziah, from beginning to end, were recorded by the prophet Isaiah, the son of Amoz. "},{"num":23,"verse":"So Uzziah slept with his fathers and they buried him with his fathers in the field of burial that belonged to the kings, for they said: “He had tza’arat.” Then Jotham his son became king in his place."}]