[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8-10) These are the words which the chronicler (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 6:41-42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") puts into Solomon’s mouth at the dedication of the Temple. Some think that they are there only as a quotation from this psalm, but the mode in which the words are here introduced points the other way. The psalmist does not at his distance from the events distinguish between David and Solomon. He merges the executor of the work in the projector; and in honour of the second Temple it is as natural for him to take up words used at the actual dedication of the first as it was to refer to the original purpose in David’s mind. All is blended together in the long perspective of poetry. As to the form of the words, they are of course themselves a reminiscence of the ancient battle-cry of the nation when the Ark set forward on the march. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Note.) The mention of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ark ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "does not definitely dispose of the Maccabæan theory of this psalm, though it doubtless must weigh against it. The quotation may have been adopted generally without meaning literal correspondence between all the circumstances—just as the battle-cry had become merely a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "religious ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "formula—or, as Lightfoot and Prideaux suggest (see Prideaux, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Connection, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "i. 141), there may have been an ark made for the second Temple in imitation of the original.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(8) Ark of thy strength.—See the reference in Chronicles. The expression occurs nowhere else but in Psalm 78:61, where the word strength by itself denotes the ark. The technical word ark nowhere else occurs in the psalms. For strength the LXX. and Vulg. have “sanctification.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(8) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Ark of thy strength.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—See the reference in Chronicles. The expression occurs nowhere else but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:61",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "strength ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "by itself denotes the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ark. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The technical word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ark ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "nowhere else occurs in the psalms. For ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "strength ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the LXX. and Vulg. have “sanctification.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 132:8-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:8-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Arise, O Lord, to thy rest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — See notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 6:41-42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let thy priests be clothed with righteousness — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not only with those outward sacerdotal garments of glory and beauty, which thou hast appointed for them, but, especially, with the inward ornaments of righteousness and true holiness, that so their persons and services may be accepted by thee, both for themselves and for all thy people; and they may be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "clothed with salvation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) which is the effect, or consequent, of the former clothing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And let thy saints shout for joy — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Let all thy people have cause of rejoicing in the tokens of thy goodness; which they eminently had at the dedication of the temple, as is signified ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:66",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For thy servant David’s sake — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In regard of thy singular kindness and promises vouchsafed to David, as this is explained in the following verses. This verse makes it more than probable that David was not the penman of this Psalm, for he never used to beg mercies from God for his own sake, but constantly for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God’s name’s sake, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and for the sake of his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "truth, mercy, goodness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "righteousness. Turn not away the face of thine anointed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Of me, whom thou hast anointed to be king over thy people. Cast me not out of thy presence: do not reject or deny my request.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "132:1-10 David bound himself to find a place for the Lord, for the ark, the token of God's presence. When work is to be done for the Lord, it is good to tie ourselves to a time. It is good in the morning to fix upon work for the day, with submission to Providence, for we know not what a day may bring forth. And we should first, and without delay, seek to have our own hearts made a habitation of God through the Spirit. He prays that God would take up his dwelling in the habitation he had built; that he would give grace to the ministers of the sanctuary to do their duty. David pleads that he was the anointed of the Lord, and this he pleads as a type of Christ, the great Anointed. We have no merit of our own to plead; but, for His sake, in whom there is a fulness of merit, let us find favour. And every true believer in Christ, is an anointed one, and has received from the Holy One the oil of true grace. The request is, that God would not turn away, but hear and answer their petitions for his Son's sake.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Arise, O Lord, into thy rest - Into that which is appointed for its permanent place of repose, that it may no longer be removed from spot to spot. This is spoken of the ark, considered as the place where God, by an appropriate symbol, abode. That symbol - the Shechinah - rested on the cover of the ark. The same language was used by Solomon at the dedication of the temple: \"Now, therefore, arise, O Lord God, into thy resting place, thou and the ark of thy strength,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 6:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou, and the ark of thy strength - The ark, the symbol of the divine power, as if the power of God resided there, or as if the Almighty had his abode there. Perhaps the language was derived from the fact that the ark, in the wars of the Hebrews against their foes, was a symbol of the divine presence and protection - that by which the divine power was put forth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thou, and the ark of thy strength - The ark, the symbol of the divine power, as if the power of God resided there, or as if the Almighty had his abode there. Perhaps the language was derived from the fact that the ark, in the wars of the Hebrews against their foes, was a symbol of the divine presence and protection - that by which the divine power was put forth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8, 9. The solemn entry of the ark, symbolical of God's presence and power, with the attending priests, into the sanctuary, is proclaimed in the words used by Solomon (2Ch 6:41).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8 Arise, O Lord, into thy rest; thou, and the ark of thy strength.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "9 Let thy priests be clothed with righteousness; and let thy saints shout for joy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 For thy servant David's sake turn not away the face of thine anointed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 132:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:8",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In these three verses we see the finders of the ark removing it to its appointed place, using a formula somewhat like to that used by Moses when he said, \"Rise up, Lord,\" and again, \"Return, O Lord, unto the many thousands of Israel.\" The ark had been long upon the move, and no fit place had been found for it in Canaan, but now devout men have prepared a temple, and they sing, \"Arise, O Lord, into thy rest; thou, and the ark of thy strength.\" They hoped that now the covenant symbol had found a permanent abode - a rest, and they trusted that Jehovah would now abide with it for ever. Vain would it be for the ark to be settled if the Lord did not continue with it, and perpetually shine forth from between the cherubim. Unless the Lord shall rest with us there is no rest for us; unless the ark of his strength abide with us we are ourselves without strength. The ark of the covenant is here mentioned by a name which it well deserved; for in its captivity it smote its captors, and broke their gods, and when it was brought back it guarded its own honour by the death of those who dared to treat it with disrespect. The power of God was thus connected with the sacred chest. Reverently, therefore did Solomon pray concerning it as he besought the living God to consecrate the temple by his presence. It is the Lord and the covenant, or rather say the covenant Jehovah whose presence we desire in our assemblies, and this presence is the strength of his people. Oh that the Lord would indeed abide in all the churches, and cause his power to be revealed in Zion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 132:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:9",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Let thy priests be clothed with righteousness.\" No garment is so resplendent as that of a holy character. In this glorious robe our great High-priest is evermore arrayed, and he would have all his people adorned in the same manner. Then only are priests fit to appear before the Lord, and to minister for the profit of the people, when their lives are dignified with goodness. They must ever remember that they are God's priests, and should therefore wear the livery of their Lord, which is holiness: they are not only to have righteousness, but to be clothed with it, so that upon every part of them righteousness shall be conspicuous. Whoever looks upon God's servants should see holiness if they see nothing else. Now, this righteousness of the ministers of the temple is prayed for in connection with the presence of the Lord; and this instructs us that holiness is only to be found among those who commune with God, and only comes to them through his visitation of their spirits. God will dwell among a holy people: and on the other hand, where God is the people become holy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And let thy saints shout for joy.\" Holiness and happiness go together; where the one is found, the other ought never to be far away. Holy persons have a right to great and demonstrative joy they may shout because of it. Since they are saints, and thy saints, and thou hast come to dwell with them, O Lord, thou hast made it their duty to rejoice, and to let others know of their joy. The sentence, while it may read as a permit, is also a precept saints are commanded to rejoice in the Lord. Happy religion which makes it a duty to be glad! Where righteousness is the clothing, joy may well be the occupation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 132:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:10",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For thy servant David's sake turn not away the face of thine anointed.\" King Solomon was praying, and here the people pray for him that his face may not be turned away, or that he may not be refused an audience. It is a dreadful thing to have our face turned away from God, or to have his face turned away from us. If we are anointed of the Spirit the Lord will look upon us with favour. Specially is this true of Him who represents us, and is on our behalf the Christ - the truly anointed of the Lord. Jesus is both our David and God's anointed; in him is found in fulness that which David received in measure. For his sake all those who are anointed in him are accepted. God blessed Solomon and succeeding kings, for David's sake; and he will bless us for Jesus' sake. How condescending was the Son of the Highest to take upon himself the form of a servant, to be anointed for us, and to go in before the mercy-seat to plead on our behalf! The Psalm sings of the ark, and it may well remind us of the going in of the anointed priest within the veil all depended upon his acceptance, and therefore well do the people pray, \"Turn not away the face of thine anointed.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus, in Psalm 132:8-10, we have a prayer for the temple, the ark, the priests, the Levites, the people, and the king: in each petition there is a fulness of meaning well worthy of careful thought. We cannot plead too much in detail; the fault of most prayers is their indefiniteness. In God's house and worship everything needs a blessing, and every person connected therewith needs it continually. As David vowed and prayed when he was minded to house the ark, so now the prayer is continued when the temple is consecrated, and the Lord deigns to fill it with his glory. We shall never have done praying till we have done needing. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:8-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we have a prayer for the temple, the ark, the priests, the Levites, the people, and the king: in each petition there is a fulness of meaning well worthy of careful thought. We cannot plead too much in detail; the fault of most prayers is their indefiniteness. In God's house and worship everything needs a blessing, and every person connected therewith needs it continually. As David vowed and prayed when he was minded to house the ark, so now the prayer is continued when the temple is consecrated, and the Lord deigns to fill it with his glory. We shall never have done praying till we have done needing. ",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Arise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. arise and come. One word put for two, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 43:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "marvelled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i.e. marvelled looking) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one at another",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 43:34",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:34",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he took messes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he took and sent messes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as our translation renders it. And this word is very proper in this place, because it was to be used by God’s appointment when the ark was to be removed from one place to another, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 10:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as now it was from the tabernacle in Zion to the temple in Moriah, upon which occasion this and the two following verses were used by Solomon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 6:41,42",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 6:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",42",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Into thy rest; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into thy resting-place, the temple, so called ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 66:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where thou hast now a fixed habitation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The ark of thy strength; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the seat of thy powerful and glorious presence, from whence thou dost put forth and manifest thy strength on the behalf of thy people when they desire and need it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Arise, O Lord, into thy rest,.... Which words, and what follow, were used by Solomon at the dedication of the temple; and with which he concluded his prayer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 6:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and so may be a request to the Lord, that he would take up his residence in the temple built for him, where he would have a firm and stable place of rest; who, from the time of Israel's coming out of Egypt, had not dwelt in a house; but had walked in a tent or tabernacle from place to place, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that he would take up his abode in his church, the antitype of the temple, and rest in his love there, and cause his people to rest also; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou, and the ark of thy strength; the Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"thou, and the ark in which is thy law.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This is sometimes called the strength of the Lord; because by it he showed his great strength in destroying the enemies of his people, the Philistines and others; see Psalm 78:61. It was a type of Christ, who is the power of God, and the mighty God; and, as man, made strong by the Lord; and, as Mediator, has all strength in him for his people. And so the words may be considered as a request to him, either to arise and enter into his rest in heaven, having done his work of redemption and salvation here on earth, for which he became incarnate; or to grant his presence with his church, and take up his rest there, and give them spiritual peace and rest for their souls. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This is sometimes called the strength of the Lord; because by it he showed his great strength in destroying the enemies of his people, the Philistines and others; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:61",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was a type of Christ, who is the power of God, and the mighty God; and, as man, made strong by the Lord; and, as Mediator, has all strength in him for his people. And so the words may be considered as a request to him, either to arise and enter into his rest in heaven, having done his work of redemption and salvation here on earth, for which he became incarnate; or to grant his presence with his church, and take up his rest there, and give them spiritual peace and rest for their souls. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Arise, O LORD, into thy {e} rest; thou, and the ark of thy strength.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Arise, O LORD, into thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rest; thou, and the ark of thy strength.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) That is Jerusalem, because later his Ark would move to no other place.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The people’s prayer that Jehovah will occupy the resting-place (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") prepared for Him; that His Presence may accompany the symbol of it. The first line is an adaptation of the watchword used when the Ark started to find a resting-place for the Israelites in their wanderings. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 6:41-42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the words of the Psalm are quoted at the close of Solomon’s prayer at the Dedication of the Temple, and some commentators suppose that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 132:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. the Psalmist carries us on into the Solomonic period; but it is simpler and more natural to suppose that he is still describing David’s translation of the Ark to Zion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the ark of thy strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:61",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Arise, O Lord, into thy rest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Another transfer, but into the place of final \"rest.\" The words are a quotation from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":41, and were uttered originally by Solomon at the close of his long dedication prayer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thou, and the ark of thy strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The quotation continues. God is regarded as entering the temple, and taking possession of it, in and with the ark. Psalm 132:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " begins the language of the church, which in this Psalm reminds Jahve of His promises and comforts itself with them. Olshausen regards this ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 132:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as altogether inexplicable. The interpretation nevertheless has some safe starting-points. (1) Since the subject spoken of is the founding of a fixed sanctuary, and one worthy of Jahve, the suffix of שׁמענוּה (with Chateph as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Ew. ֗60, a) and מצאנוּה refers to the Ark of the covenant, which is fem. also in other instances (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (2) The Ark of the covenant, fetched up out of Shiloh by the Israelites to the battle at Ebenezer, fell into the hands of the victors, and remained, having been again given up by them, for twenty years in Kirjath-Jearim (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), until David removed it out of this Judaean district to Zion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:2-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). What is then more natural than that שׂדי־יער is a poetical appellation of Kirjath-Jearim (cf. \"the field of Zoan\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? Kirjath-Jearim has, as a general thing, very varying names. It is also called Kirjath-ha-jearim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Kirjath-'arim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 18:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Kirjath-ba'al in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 16:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :50, Ba'alah in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. Har-ha-ba'alah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with Har-Jearim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and, as it seems, even Ba'al Jehudah in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Why should it not also have been called Ja'ar side by side with Kirjath-Jearim, and more especially if the mountainous district, to which the mention of a hill and mountain of Jearim points, was, as the name \"city of the wood\" implies, at the same time a wooded district? We therefore fall in with Khnl's (1799) rendering: we found it in the meadows of Jaar, and with his remark: \"Jaar is a shortened name of the city of Kirjath-Jearim.\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The question now further arises as to what Ephrathah is intended to mean. This is an ancient name of Bethlehem; but the Ark of the covenant never was in Bethlehem. Accordingly Hengstenberg interprets, \"We knew of it in Bethlehem (where David had spent his youth) only by hearsay, no one had seen it; we found it in Kirjath-Jearim, yonder in the wooded environs of the city, where it was as it were buried in darkness and solitude.\" So even Anton Hulsius (1650): Ipse David loquitur, qui dicit illam ipsam arcam, de qua quum adhuc Bethlehemi versaretur inaudivisset, postea a se (vel majroibus suis ipso adhuc minorenni) inventam fuisse in campis Jaar. But (1) the supposition that David's words are continued here does not harmonize with the way in which they are introduced in Psalm 132:2, according to which they cannot possibly extend beyond the vow that follows. (2) If the church is speaking, one does not see why Bethlehem is mentioned in particular as the place of the hearsay. (3) We heard it in Ephrathah cannot well mean anything else than, per antiptosin (as in Genesis 1:4, but without כּי), we heard that it was in Ephrathah. But the Ark was before Kirjath-Jearim in Shiloh. The former lay in the tribe of Judah close to the western borders of Benjamin, the latter in the midst of the tribe of Ephraim. Now since אפרתי quite as often means an Ephraimite as it does a Bethlehemite, it may be asked whether Ephrathah is not intended of the Ephraimitish territory (Khnl, Gesenius, Maurer, Tholuck, and others). The meaning would then be: we had heard that the sacred Ark was in Shiloh, but we found it not there, but in Kirjath-Jearim. And we can easily understand why the poet has mentioned the two places just in this way. Ephrāth, according to its etymon, is fruitful fields, with which are contrasted the fields of the wood - the sacred Ark had fallen from its original, more worthy abode, as it were, into the wilderness. But is it probable, more especially in view of Micah 5:1, that in a connection in which the memory of David is the ruling idea, Ephrathah signifies the land of Ephraim? No, Ephrathah is the name of the district in which Kirjath-Jearim lay. Caleb had, for instance, by Ephrath, his third wife, a son named Hr (Chr), 1 Chronicles 2:19, This Hr, the first-born of Ephrathah, is the father of the population of Bethlehem (1 Chronicles 4:4), and Shobal, a son of this Hr, is father of the population of Kirjath-Jearim (1 Chronicles 2:50). Kirjath-Jearim is therefore, so to speak, the daughter of Bethlehem. This was called Ephrathah in ancient times, and this name of Bethlehem became the name of its district (Micah 5:1). Kirjath-Jearim belonged to Caleb-Ephrathah (1 Chronicles 2:24), as the northern part of this district seems to have been called in distinction from Negeb-Caleb (1 Samuel 30:14).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The question now further arises as to what Ephrathah is intended to mean. This is an ancient name of Bethlehem; but the Ark of the covenant never was in Bethlehem. Accordingly Hengstenberg interprets, \"We knew of it in Bethlehem (where David had spent his youth) only by hearsay, no one had seen it; we found it in Kirjath-Jearim, yonder in the wooded environs of the city, where it was as it were buried in darkness and solitude.\" So even Anton Hulsius (1650): Ipse David loquitur, qui dicit illam ipsam arcam, de qua quum adhuc Bethlehemi versaretur inaudivisset, postea a se (vel majroibus suis ipso adhuc minorenni) inventam fuisse in campis Jaar. But (1) the supposition that David's words are continued here does not harmonize with the way in which they are introduced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", according to which they cannot possibly extend beyond the vow that follows. (2) If the church is speaking, one does not see why Bethlehem is mentioned in particular as the place of the hearsay. (3) We heard it in Ephrathah cannot well mean anything else than, per antiptosin (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but without כּי), we heard that it was in Ephrathah. But the Ark was before Kirjath-Jearim in Shiloh. The former lay in the tribe of Judah close to the western borders of Benjamin, the latter in the midst of the tribe of Ephraim. Now since אפרתי quite as often means an Ephraimite as it does a Bethlehemite, it may be asked whether Ephrathah is not intended of the Ephraimitish territory (Khnl, Gesenius, Maurer, Tholuck, and others). The meaning would then be: we had heard that the sacred Ark was in Shiloh, but we found it not there, but in Kirjath-Jearim. And we can easily understand why the poet has mentioned the two places just in this way. Ephrāth, according to its etymon, is fruitful fields, with which are contrasted the fields of the wood - the sacred Ark had fallen from its original, more worthy abode, as it were, into the wilderness. But is it probable, more especially in view of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that in a connection in which the memory of David is the ruling idea, Ephrathah signifies the land of Ephraim? No, Ephrathah is the name of the district in which Kirjath-Jearim lay. Caleb had, for instance, by Ephrath, his third wife, a son named Hr (Chr), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 2:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", This Hr, the first-born of Ephrathah, is the father of the population of Bethlehem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and Shobal, a son of this Hr, is father of the population of Kirjath-Jearim (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 2:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Kirjath-Jearim is therefore, so to speak, the daughter of Bethlehem. This was called Ephrathah in ancient times, and this name of Bethlehem became the name of its district (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Kirjath-Jearim belonged to Caleb-Ephrathah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), as the northern part of this district seems to have been called in distinction from Negeb-Caleb (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 30:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But משׁכּנותיו in Psalm 132:7 is now neither a designation of the house of Abinadab in Kirjath-Jearim, for the expression would be too grand, and in relation to Psalm 132:5 even confusing, nor a designation of the Salomonic Temple-building, for the expression standing thus by itself is not enough alone to designate it. What is meant will therefore be the tent-temple erected by David for the Ark when removed to Zion (2 Samuel 7:2, יריעה). The church arouses itself to enter this, and to prostrate itself in adoration towards (vid., Psalm 99:5) the footstool of Jahve, i.e., the Ark; and to what purpose? The ark of the covenant is now to have a place more worthy of it; the מנוּחה, i.e., the בּית מנוּחה,    1 Chronicles 28:2, in which David's endeavours have through Solomon reached their goal, is erected: let Jahve and the Ark of His sovereign power, that may not be touched (see the examples of its inviolable character in 1 Samuel 5:1-12, 1 Samuel 6, 2 Samuel 6:6.), now enter this fixed abode! Let His priests who are to serve Him there clothe themselves in \"righteousness,\" i.e., in conduct that is according to His will and pleasure; let His saints, who shall there seek and find mercy, shout for joy! More especially, however, let Jahve for David's sake, His servant, to whose restless longing this place of rest owes its origin, not turn back the face of His anointed one, i.e., not reject his face which there turns towards Him in the attitude of prayer (cf. Psalm 84:10). The chronicler has understood Psalm 132:10 as an intercession on behalf of Solomon, and the situation into which we are introduced by Psalm 132:6-8 seems to require this. It is, however, possible that a more recent poet here, in Psalm 132:7-8, reproduces words taken from the heart of the church in Solomon's time, and blends petitions of the church of the present with them. The subject all through is the church, which is ever identical although changing in the persons of its members. The Israel that brought the sacred Ark out of Kirjath-Jearim to Zion and accompanied it thence to the Temple-hill, and now worships in the sanctuary raised by David's zeal for the glory of Jahve, is one and the same. The prayer for the priests, for all the saints, and more especially for the reigning king, that then resounded at the dedication of the Temple, is continued so long as the history of Israel lasts, even in a time when Israel has no king, but has all the stronger longing for the fulfilment of the Messianic promise. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But משׁכּנותיו in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is now neither a designation of the house of Abinadab in Kirjath-Jearim, for the expression would be too grand, and in relation to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " even confusing, nor a designation of the Salomonic Temple-building, for the expression standing thus by itself is not enough alone to designate it. What is meant will therefore be the tent-temple erected by David for the Ark when removed to Zion (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", יריעה). The church arouses itself to enter this, and to prostrate itself in adoration towards (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 99:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the footstool of Jahve, i.e., the Ark; and to what purpose? The ark of the covenant is now to have a place more worthy of it; the מנוּחה, i.e., the בּית מנוּחה,    ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 28:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in which David's endeavours have through Solomon reached their goal, is erected: let Jahve and the Ark of His sovereign power, that may not be touched (see the examples of its inviolable character in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 5:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".), now enter this fixed abode! Let His priests who are to serve Him there clothe themselves in \"righteousness,\" i.e., in conduct that is according to His will and pleasure; let His saints, who shall there seek and find mercy, shout for joy! More especially, however, let Jahve for David's sake, His servant, to whose restless longing this place of rest owes its origin, not turn back the face of His anointed one, i.e., not reject his face which there turns towards Him in the attitude of prayer (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 84:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The chronicler has understood ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as an intercession on behalf of Solomon, and the situation into which we are introduced by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:6-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " seems to require this. It is, however, possible that a more recent poet here, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", reproduces words taken from the heart of the church in Solomon's time, and blends petitions of the church of the present with them. The subject all through is the church, which is ever identical although changing in the persons of its members. The Israel that brought the sacred Ark out of Kirjath-Jearim to Zion and accompanied it thence to the Temple-hill, and now worships in the sanctuary raised by David's zeal for the glory of Jahve, is one and the same. The prayer for the priests, for all the saints, and more especially for the reigning king, that then resounded at the dedication of the Temple, is continued so long as the history of Israel lasts, even in a time when Israel has no king, but has all the stronger longing for the fulfilment of the Messianic promise. ",
            "children": []
          }
        ]
      }
    ]
  }
]