[{"header":"Psalm 135"},{"num":1,"verse":"Praise the Lord! (Hallelujah!) Praise the name of the Lord; praise Him, O you servants of the Lord!"},{"num":2,"verse":"You who stand in the house of the Lord, in the courts of the house of our God,"},{"num":3,"verse":"Praise the Lord! For the Lord is good; sing praises to His name, for He is gracious and lovely!"},{"num":4,"verse":"For the Lord has chosen [the descendants of] Jacob for Himself, Israel for His peculiar possession and treasure."},{"num":5,"verse":"For I know that the Lord is great and that our Lord is above all gods."},{"num":6,"verse":"Whatever the Lord pleases, that has He done in the heavens and on earth, in the seas and all deeps—"},{"num":7,"verse":"Who causes the vapors to arise from the ends of the earth, Who makes lightnings for the rain, Who brings the wind out of His storehouses;"},{"num":8,"verse":"Who smote the firstborn of Egypt, both of man and beast;"},{"num":9,"verse":"Who sent signs and wonders into the midst of you, O Egypt, upon Pharaoh and all his servants;"},{"num":10,"verse":"Who smote nations many and great and slew mighty kings—"},{"num":11,"verse":"Sihon king of the Amorites, Og king of Bashan, and all the kingdoms of Canaan."},{"num":12,"verse":"[The Lord] gave their land as a heritage, a heritage to Israel His people."},{"num":13,"verse":"Your name, O Lord, endures forever, Your fame, O Lord, throughout all ages."},{"num":14,"verse":"For the Lord will judge and vindicate His people, and He will delay His judgments [manifesting His righteousness and mercy] and take into favor His servants [those who meet His terms of separation unto Him]."},{"num":15,"verse":"The idols of the nations are silver and gold, the work of men’s hands."},{"num":16,"verse":"[Idols] have mouths, but they speak not; eyes have they, but they see not;"},{"num":17,"verse":"They have ears, but they hear not, nor is there any breath in their mouths."},{"num":18,"verse":"Those who make [idols] are like them; so is everyone who trusts in and relies on them."},{"num":19,"verse":"Bless (affectionately and gratefully praise) the Lord, O house of Israel; bless the Lord, O house of Aaron [God’s ministers]."},{"num":20,"verse":"Bless the Lord, O house of Levi [the dedicated tribe]; you who reverently and worshipfully fear the Lord, bless the Lord [affectionately and gratefully praise Him]!"},{"num":21,"verse":"Blessed out of Zion be the Lord, Who dwells [with us] at Jerusalem! Praise the Lord! (Hallelujah!)"}]