[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Any nation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This boast in Israel’s peculiar and exclusive privilege may be compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:32-41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judgments.—Here plainly not manifestations of wrath; but, as so frequently in Psalms 119, the display of righteousness towards Israel.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Judgments.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Here plainly not manifestations of wrath; but, as so frequently in Psalms 119, the display of righteousness towards Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "147:12-20 The church, like Jerusalem of old, built up and preserved by the wisdom, power, and goodness of God, is exhorted to praise him for all the benefits and blessings vouchsafed to her; and these are represented by his favours in the course of nature. The thawing word may represent the gospel of Christ, and the thawing wind the Spirit of Christ; for the Spirit is compared to the wind, Joh 3:8. Converting grace softens the heart that was hard frozen, and melts it into tears of repentance, and makes good reflections to flow, which before were chilled and stopped up. The change which the thaw makes is very evident, yet how it is done no one can say. Such is the change wrought in the conversion of a soul, when God's word and Spirit are sent to melt it and restore it to itself.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath not dealt so with any nation - He has favored Israel more than any other people by giving them his revealed truth. This was so. There was no nation in the ancient world so favored as the Hebrew people in this respect. There is no nation now so favored as the nation that has the revealed will of God - the Bible. The possession of that book gives a nation a vast superiority in all respects over all others. In laws, customs, morals, intelligence, social life, purity, charity, prosperity, that book elevates a nation at once, and scatters blessings which can be derived from nothing else. The highest benevolence that could be shown to any nation would be to put it in possession of the word of God in the language of the people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as for his judgments, they have not known them - Other nations are ignorant of his laws, his statutes, his revealed will. They are consequently subjected to all the evils which arise from ignorance of those laws. The fact that the ancient people of God possessed them was a sufficient reason for the Hallelujah with which the psalm closes. The fact that we possess them is a sufficient reason why we should re-echo the shout of praise, and cry Hallelujah. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And as for his judgments, they have not known them - Other nations are ignorant of his laws, his statutes, his revealed will. They are consequently subjected to all the evils which arise from ignorance of those laws. The fact that the ancient people of God possessed them was a sufficient reason for the Hallelujah with which the psalm closes. The fact that we possess them is a sufficient reason why we should re-echo the shout of praise, and cry Hallelujah. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19, 20. This mighty ruler and benefactor of heaven and earth is such especially to His chosen people, to whom alone (De 4:32-34) He has made known His will, while others have been left in darkness. Therefore unite in the great hallelujah.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He left all others to their own native darkness and blindness, and to those dim discoveries of God and of themselves which they had from the light of nature. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath not dealt so with any nation,.... Or \"every nation\" (b); or all the nations under the heavens; only with the Jewish nation: these only for many hundreds of years were favoured with the divine revelation, with the word and ordinances of God; with the law, and with the Gospel, and with the service and worship of God; as well as with promises and prophecies of Christ, and good things to come by him. These were not communicated to anyone nation or body of people besides them; only now and then, to one here and there among the Gentiles: the Gospel was first preached to them at the coming of Christ, and after them to the Gentiles, when rejected by them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and as for his judgments, they have not known them; by which are meant, not the providential dispensations of God, which are unsearchable, and past finding out, till made manifest; nor punishments inflicted on wicked men, unobserved by them; but the word of God, and the ordinances of it, which the Gentile world for many ages were unacquainted with; see Psalm 19:9; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and as for his judgments, they have not known them; by which are meant, not the providential dispensations of God, which are unsearchable, and past finding out, till made manifest; nor punishments inflicted on wicked men, unobserved by them; but the word of God, and the ordinances of it, which the Gentile world for many ages were unacquainted with; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "praise ye the Lord: as literal Israel had reason to do, for those distinguishing instances of his favour and goodness; and as the spiritual Israel of God everywhere have; and particularly our British ones, who are highly favoured with the privileges of having the word of God purely and powerfully preached, and his ordinances truly and duly administered; at least in some parts of it, and that more than in any other nation under the heavens. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b)  \"omni genti\", Pagninus, Montanus, Gejerus; \"omni nationi\", V. L. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b)  \"omni genti\", Pagninus, Montanus, Gejerus; \"omni nationi\", V. L. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He hath not dealt so with any nation: and as for his judgments, they have not {n} known them. Praise ye the LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He hath not dealt so with any nation: and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "as for his",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " judgments, they have not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " known them. Praise ye the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) The cause of this difference is God's free mercy, which has elected his in his Son Christ Jesus to salvation: and his just judgment, by which he has appointed the reprobate to eternal damnation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath not dealt so with any nation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though the Word of God, to a certain extent, \"lighteth every man that cometh into the world\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), yet this light of nature is not to be compared to the revelation vouchsafed to Israel. Israel was God's \"peculiar people,\" and had peculiar privileges, which involved special responsibilities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And as for his judgments, they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". the nations) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "have not known them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"You only have I known out of all the families of the earth: therefore will I visit upon you all your iniquities\"). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Praise ye the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ver. 1). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 147:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the lxx this strophe is a Psalm (Lauda Jerusalem) of itself. The call goes forth to the church again on the soil of the land of promise assembled round about Jerusalem. The holy city has again risen out of its ruins; it now once more has gates which can stand open in the broad daylight, and can be closed and bolted when the darkness comes on for the security of the municipality that is only just growing into power (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 7:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The blessing of God again rests upon the children of the sacred metropolis. Its territory, which has experienced all the sufferings of war, and formerly resounded with the tumult of arms and cries of woe and destruction, God has now, from being an arena of conflict, made into peace (the accusative of the effect, and therefore different from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and since the land can now again be cultivated in peace, the ancient promise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is fulfilled, that God would feed His people, if they would only obey Him, with the fat of wheat. The God of Israel is the almighty Governor of nature. It is He who sends His fiat (אמרתו after the manner of the ויּאמר of the history of creation, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") earthwards (ארץ, the accusative of the direction). The word is His messenger (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), עד־מהרה, i.e., it runs as swiftly as possible, viz., in order to execute the errand on which it is sent. He it is who sends down snow-flakes like flocks of wool, so that the fields are covered with snow as with a white-woollen warming covering.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Bochart in his Hierozoicon on this passage compares an observation of Eustathius on Dionysius Periegetes: τὴν χιόνα ἐριῶδες ὕδωρ ἀστείως οἱ παλαιοὶ ἐκάλουν.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He scatters hoar-frost (כּפור from כּפר, to cover over with the fine frozen dew or mist as though they were powdered with ashes that the wind had blown about. Another time He casts His ice",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: lxx (Italic, Vulgate) κρύσταλλον, i.e., ice, from the root κρυ, to freeze, to congeal (Jerome glaciem). Quid est crystallum? asks Augustine, and replies: Nix est glacie durata per multos annos ita ut a sole vel igne acile dissolvi non possit.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(קרחו from קרח; or according to another reading, קרחו from קרח) down like morsels, fragments, כפתּים, viz., as hail-stones, or as sleet. The question: before His cold - who can stand? is formed as in Nahum 1:6, cf. Psalm 130:3. It further comes to pass that God sends forth His word and causes them (snow, hoar-frost, and ice) to melt away: He makes His thawing wind blow, waters flow; i.e., as soon as the one comes about, the other also takes place forthwith. This God now, who rules all things by His word and moulds all things according to His will, is the God of the revelation pertaining to the history of salvation, which is come to Israel, and as the bearer of which Israel takes the place of honour among the nations, Deuteronomy 4:7., 32-34. Since the poet says מגּיד and not הגּיד, he is thinking not only of the Tra, but also of prophecy as the continuous self-attestation of God, the Lawgiver. The Ker דּבריו, occasioned by the plurals of the parallel member of the verse, gives an unlimited indistinct idea. We must keep to דברו, with the lxx, Aquila, Theodotion, the Quinta, Sexta, and Jerome. The word, which is the medium of God's cosmical rule, is gone forth as a word of salvation to Israel, and, unfolding itself in statutes and judgments, has raised Israel to a legal state founded upon a positive divine law or judgment such as no Gentile nation possesses. The Hallelujah does not exult over the fact that these other nations are not acquainted with any such positive divine law, but (cf. Deuteronomy 4:7., Baruch 4:4) over the fact that Israel is put into possession of such a law. It is frequently attested elsewhere that this possession of Israel is only meant to be a means of making salvation a common property of the world at large. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(קרחו from קרח; or according to another reading, קרחו from קרח) down like morsels, fragments, כפתּים, viz., as hail-stones, or as sleet. The question: before His cold - who can stand? is formed as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 130:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It further comes to pass that God sends forth His word and causes them (snow, hoar-frost, and ice) to melt away: He makes His thawing wind blow, waters flow; i.e., as soon as the one comes about, the other also takes place forthwith. This God now, who rules all things by His word and moulds all things according to His will, is the God of the revelation pertaining to the history of salvation, which is come to Israel, and as the bearer of which Israel takes the place of honour among the nations, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., 32-34. Since the poet says מגּיד and not הגּיד, he is thinking not only of the Tra, but also of prophecy as the continuous self-attestation of God, the Lawgiver. The Ker דּבריו, occasioned by the plurals of the parallel member of the verse, gives an unlimited indistinct idea. We must keep to דברו, with the lxx, Aquila, Theodotion, the Quinta, Sexta, and Jerome. The word, which is the medium of God's cosmical rule, is gone forth as a word of salvation to Israel, and, unfolding itself in statutes and judgments, has raised Israel to a legal state founded upon a positive divine law or judgment such as no Gentile nation possesses. The Hallelujah does not exult over the fact that these other nations are not acquainted with any such positive divine law, but (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., Baruch 4:4) over the fact that Israel is put into possession of such a law. It is frequently attested elsewhere that this possession of Israel is only meant to be a means of making salvation a common property of the world at large. ",
            "children": []
          }
        ]
      }
    ]
  }
]