[{"header":"Mordecai Asks Esther to Help"},{"num":4,"verse":"When Mordecai heard about all that had been done, he tore his clothes, put on rough cloth and ashes, and went out into the city crying loudly and painfully. "},{"num":2,"verse":"But Mordecai went only as far as the king’s gate, because no one was allowed to enter that gate dressed in rough cloth. "},{"num":3,"verse":"As the king’s order reached every area, there was great sadness and loud crying among the Jewish people. They fasted and cried out loud, and many of them lay down on rough cloth and ashes to show how sad they were."},{"num":4,"verse":"When Esther’s servant girls and eunuchs came to her and told her about Mordecai, she was very upset and afraid. She sent clothes for Mordecai to put on instead of the rough cloth, but he would not wear them. "},{"num":5,"verse":"Then Esther called for Hathach, one of the king’s eunuchs chosen by the king to serve her. Esther ordered him to find out what was bothering Mordecai and why."},{"num":6,"verse":"So Hathach went to Mordecai, who was in the city square in front of the king’s gate. "},{"num":7,"verse":"Mordecai told Hathach everything that had happened to him, and he told Hathach about the amount of money Haman had promised to pay into the king’s treasury for the killing of the Jewish people. "},{"num":8,"verse":"Mordecai also gave him a copy of the order to kill the Jewish people, which had been given in Susa. He wanted Hathach to show it to Esther and to tell her about it. And Mordecai told him to order Esther to go into the king’s presence to beg for mercy and to plead with him for her people."},{"num":9,"verse":"Hathach went back and reported to Esther everything Mordecai had said. "},{"num":10,"verse":"Then Esther told Hathach to tell Mordecai, "},{"num":11,"verse":"“All the royal officers and people of the royal states know that no man or woman may go to the king in the inner courtyard without being called. There is only one law about this: Anyone who enters must be put to death unless the king holds out his gold scepter. Then that person may live. And I have not been called to go to the king for thirty days.”"},{"num":12,"verse":"Esther’s message was given to Mordecai. "},{"num":13,"verse":"Then Mordecai sent back word to Esther: “Just because you live in the king’s palace, don’t think that out of all the Jewish people you alone will escape. "},{"num":14,"verse":"If you keep quiet at this time, someone else will help and save the Jewish people, but you and your father’s family will all die. And who knows, you may have been chosen queen for just such a time as this.”"},{"num":15,"verse":"Then Esther sent this answer to Mordecai: "},{"num":16,"verse":"“Go and get all the Jewish people in Susa together. For my sake, fast; do not eat or drink for three days, night and day. I and my servant girls will also fast. Then I will go to the king, even though it is against the law, and if I die, I die.”"},{"num":17,"verse":"So Mordecai went away and did everything Esther had told him to do."}]