[{"num":20,"verse":"Forsooth David fled from Naioth, which is in Ramah, and came and spake before Jonathan (and came and said to Jonathan), What have I done? what is my wickedness, and what is my sin against thy father, for (that) he seeketh my life?"},{"num":2,"verse":"And Jonathan said to him, Far be it from thee, thou shalt not die, for my father shall not do anything great either little, no but he show first to me; therefore, (would) my father (have) kept privy from me this word only, forsooth it shall not be. And again he swore to David. (And Jonathan said to him, Far be it from thee, thou shalt not die, for my father shall not do anything great or small, no but first he tell it to me; would my father have only kept secret this word from me? no, it is not so. And again he swore to David.)"},{"num":3,"verse":"And David said, Truly thy father knoweth, that I have found grace in thine eyes, and he shall say, Jonathan know not this, lest peradventure he be sorry; certainly the Lord liveth, and thy soul liveth, for, that I say so, I and death be parted only by one degree. (And David said, Truly thy father knoweth that I have found favour in thy sight, and he shall say, I will not let Jonathan know this, lest he become angry, or upset; truly, as the Lord liveth, and as thy soul liveth, I say that I and death be separated by only one degree.)"},{"num":4,"verse":"And Jonathan said to David, Whatever thing thy soul shall say to me, I shall do it to thee. (And Jonathan said to David, Whatever thou shalt ask me, I shall do it for thee.)"},{"num":5,"verse":"And David said to Jonathan, Lo! calends be tomorrow, that is the feast of the new moon, and by custom I am wont to sit by the king to eat; therefore suffer thou me, that I be hid in the field till to [the] eventide of the third day (but instead, allow me to hide in the field until the evening of the third day)."},{"num":6,"verse":"And if thy father beholdeth, and asketh after me, thou shalt answer to him, David prayed me, that he might go at once into Bethlehem, his city, for solemn sacrifices be now there to all [the] men of his lineage (for now is the time of the annual sacrifice there for all the men of his family)."},{"num":7,"verse":"If he saith, Well, peace shall be to thy servant; forsooth if he is wroth, know thou, that his malice is filled. (And if he saith, Fine, then peace shall be to thy servant; but if he is angry, then know thou, that he is determined to harm me.)"},{"num":8,"verse":"Therefore do thou mercy into thy servant, for thou hast made me thy servant to make with thee (a) bond of peace of the Lord; but if any wickedness is in me, slay thou me, and bring thou not in me to thy father. (And so do thou mercy with me, thy servant, for thou hast made a covenant with me before the Lord; but if there is any wickedness in me, then thou kill me, and do not bring me in to thy father.)"},{"num":9,"verse":"And Jonathan said, Far be this from me, for it may not be done, that I tell (it) not to thee, if I know certainly, that the malice of my father is filled against thee. (And Jonathan said, Far be this from me, for it will not be done, that I do not tell it to thee, if I know with certainty, that my father is determined to harm thee.)"},{"num":10,"verse":"And David answered to Jonathan, Who shall tell me, if in case thy father answereth hard [to thee] anything of me? (And David asked Jonathan, Who shall tell me, if thy father saith anything hard to thee about me?)"},{"num":11,"verse":"And Jonathan said to David, Come thou, and go we forth into the field. And when they both had gone into the field,"},{"num":12,"verse":"Jonathan said (out loud) to David, Thou Lord God of Israel, if I inquire the sentence of my father tomorrow, either in the next day after (O Lord God of Israel, if I inquire about my father’s thoughts tomorrow, or the next day), and any good thing be said of thee, (David,) and I send not at once to thee, and make it known to thee,"},{"num":13,"verse":"God do these things to Jonathan, and add these (other) things. And if the malice of my father continue against thee, I shall show it to thine ear (I shall tell it to thee), and I shall deliver thee, (so) that thou go in peace; and the Lord be with thee, as he was with my father."},{"num":14,"verse":"And if I live, do thou the mercies of the Lord to me; forsooth if I am dead, (And while I live, do thou the Lord’s mercies to me; but if I should die,)"},{"num":15,"verse":"take thou not away thy mercy from mine house unto without end; and if I do it not, when the Lord shall draw out by the root the enemies of David, each man from the land, take he away Jonathan from his house, and seek the Lord of the hand of the enemies of David. (take thou not away thy mercy from my family forevermore; and even when the Lord shall draw out David’s enemies by the root, yea, each man from the land, let the Lord call David to account, if he and his household, or his family, no longer be my friends.)"},{"num":16,"verse":"Therefore Jonathan made [a] bond of peace with the house of David, and the Lord sought (it) of the hand of [the] enemies of David. (And so Jonathan made a covenant with the house of David, saying, Let the Lord seek justice for me at the hands of David’s enemies.)"},{"num":17,"verse":"And Jonathan added to swear steadfastly to David, for he loved him; for he loved so David, as his own soul. (And Jonathan added to steadfastly swear to David, for he loved him; yea, he loved David as much as his own life.)"},{"num":18,"verse":"And Jonathan said to David, Tomorrow is the first day of the month, that is solemn (and that is a feast day), and thou shalt be sought (after);"},{"num":19,"verse":"and thy sitting shall be asked (of) till after the morrow. Therefore thou shalt go down hastily, and thou shalt come into a place, where thou shalt be hid in the day, when it is leaveful to work (while this business is at hand); and thou shalt sit beside the stone, that is called Ezel."},{"num":20,"verse":"And I shall shoot three arrows beside that stone, and I shall cast (those) as (if) exercising, either playing me at a sign. (And I shall shoot three arrows toward that stone, and I shall shoot them as if I were aiming at a mark, or at a target.)"},{"num":21,"verse":"I shall send my child, and I shall say to him, Go thou, and bring to me the arrows. If I say to the child, Lo! the arrows be on this side (of) thee, take thou those; then come thou to me, for peace is to thee, and nothing is of evil, the Lord liveth. (And I shall send my boy, and I shall say to him, Go thou, and bring me the arrows. Now if I say to the boy, Lo! the arrows be on this side of thee, take thou them; then come thou to me, for all is well for thee, and nothing is of evil, as the Lord liveth.)"},{"num":22,"verse":"But if I speak thus to the child, Lo! the arrows be beyond thee; go thou in peace, for the Lord hath delivered thee. (But if I speak thus to the boy, Lo! the arrows be beyond thee; then go thou away to save thy own life, for the Lord hath sent thee away.)"},{"num":23,"verse":"Certainly of the word that thou and I have spoken, that is, of the bond of peace betwixt us and our heirs (that is, of the covenant between us and our heirs), the Lord be witness betwixt me and thee till into without end."},{"num":24,"verse":"Therefore David was hid in the field; and the calends/the solemn feast came, and the king sat to eat bread (and the king sat down to eat his meal)."},{"num":25,"verse":"And when the king had set on his chair (as) by custom, which chair was beside the wall, Jonathan rose, and sat after Abner, and Abner sat at the side of Saul, and the place of David appeared void (and David’s place was empty)."},{"num":26,"verse":"And Saul spake not anything in that day; for he thought, that in hap it befelled to him, that he was not clean, neither purified. (And Saul did not say anything about David that day; for he thought perhaps it befell that David was not clean, or purified.)"},{"num":27,"verse":"And when the second day after the calends had shined, again the place of David appeared void. And Saul said to Jonathan his son, Why cometh not the son of Jesse, neither yesterday, neither today, to eat? (And when the second day came after that the new moon had shone, again David’s place was empty. And Saul said to his son Jonathan, Why cometh not the son of Jesse to eat, not yesterday, or today?)"},{"num":28,"verse":"And Jonathan answered to Saul, He prayed me meekly that he should go into Bethlehem (He humbly asked me if he could go to Bethlehem);"},{"num":29,"verse":"and he said, Suffer thou me, for solemn sacrifice is (now) in my city; one of my brethren [hath] called me; now therefore, if I [have] found grace in thine eyes, I shall go soon, and I shall see my brethren (I shall go swiftly, and I shall see my brothers); for this cause he cometh not to the table of the king."},{"num":30,"verse":"And Saul was wroth against Jonathan, and said to him, Thou son of the woman willfully ravishing a man (Thou son of the woman who willfully robbeth a man), whether I know not, that thou lovest the son of Jesse into thy [own] confusion, and into the confusion of thy shameful mother?"},{"num":31,"verse":"For in all the days in which the son of Jesse liveth on [the] earth, thou shalt not be stablished, neither thy realm (thou shalt not be secure, nor shall thy kingdom); therefore right now/at once send thou, and bring him to me, for he is the son of death."},{"num":32,"verse":"And Jonathan answered to Saul his father, and said, Why shall he die? what hath he done?"},{"num":33,"verse":"And Saul took a spear, that he should smite him, and Jonathan understood, that it was determined of his father, that David should be slain (and Jonathan understood that his father was determined to kill David)."},{"num":34,"verse":"Then Jonathan rose (up) from the table in full fierce wrath, and he ate not bread in the second day of calends (and he ate nothing on the second day of the feast); for he was sorry for David, for his father had shamed him."},{"num":35,"verse":"And when the morrowtide had shined, Jonathan came into the field, and a little child with him, by the covenant made of David. (And when the morning came, Jonathan went into the field, and had a young boy with him, as by the pact which he had made with David.)"},{"num":36,"verse":"And Jonathan said to his child, Go thou, and bring to me the arrows that I shoot. And when the child had run forth, he shot another arrow beyond the child. (And Jonathan said to his boy, Go thou, and bring me back the arrows that I shoot. And as the boy ran forth, he shot the arrows beyond the boy.)"},{"num":37,"verse":"Therefore when the child came to the place of the arrow that Jonathan had shot, Jonathan cried behind the back of the child, and said, Lo! the arrow is not there, certainly it is beyond thee. (And so when the boy came to the place where the arrows were that Jonathan had shot, Jonathan cried behind the boy’s back, and said, Lo! the arrows be not there, but they be beyond thee.)"},{"num":38,"verse":"And Jonathan cried again behind the back of the child, Haste thou swiftly, stand thou not. Soothly the child gathered up the arrows of Jonathan, and brought them to his lord, (And Jonathan cried again behind the back of the boy, Run thou quickly, do not thou stand still. And the boy gathered up the arrows of Jonathan, and brought them back to his lord,)"},{"num":39,"verse":"and utterly the child knew not what was done; for only Jonathan and David knew the thing. (and utterly the boy could not understand what had happened; but Jonathan and David knew what the words really meant.)"},{"num":40,"verse":"Then Jonathan gave his bow and arrows to the child, and said to him, Go thou, bear these into the city. (Then Jonathan gave his bow and arrows to the boy, and said to him, Go thou, carry these back to the city.)"},{"num":41,"verse":"And when the child had gone, David rose from the place that went to the south; and he felled low upon the earth, and worshipped the third time, and they kissed themselves together, and wept together; but David wept more. (And when the boy had gone, David rose up from a place toward the south; and he fell low on the ground, and bowed three times, and then they kissed one another, and wept together; but David wept more.)"},{"num":42,"verse":"Then Jonathan said to David, Go thou in peace; whatever things we both have sworn in the name of the Lord, and said, The Lord be betwixt me and thee, and betwixt my seed and thy seed, till into without end, be steadfast, (or certain). And David rose up, and went forth, but and Jonathan went into the city."}]