[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And when he.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is not clear whether “the multitude” or “the king” is subject of the sentence, or whether the verb “he hath taken away” is to be translated active or passive. The verse might mean, “And the multitude is lifted up—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " takes courage—and its heart is exalted,” or, “when the multitude takes courage the king’s heart is exalted.” The English translation is most in accordance with the context, but the second rendering is preferred by many, according to which the king’s courage and pride increase as he perceives the mightiness of his troops. The LXX. follow a different reading throughout the verse.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he shall cast down.—These words describe the victory of the southern king after he has taken the “multitude” of the northern king.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And he shall cast down.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "These words describe the victory of the southern king after he has taken the “multitude” of the northern king.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But he shall not be strengthened—i.e., he does not prove so successful as he had hoped. His aim was to gain complete supremacy over his rival, but for reasons which are about to be stated he was unable to gain his object. Those interpreters who see a distinct reference to the wars of Ptolemy and Antiochus point out that though the loss of the Syrians was very great, yet Ptolemy did not follow up his success as he should have done. Instead of striking a decisive blow, he was content with regaining the towns which Antiochus had taken from him.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "But he shall not be strengthened",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he does not prove so successful as he had hoped. His aim was to gain complete supremacy over his rival, but for reasons which are about to be stated he was unable to gain his object. Those interpreters who see a distinct reference to the wars of Ptolemy and Antiochus point out that though the loss of the Syrians was very great, yet Ptolemy did not follow up his success as he should have done. Instead of striking a decisive blow, he was content with regaining the towns which Antiochus had taken from him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 11:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When he hath taken away the multitude, his heart shall be lifted up — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is a description of the effect which this victory would have on Ptolemy, namely, to puff him up with pride and insolence: and so we are informed it did; for being freed by it from his fears, he now more freely indulged his lusts; and, after a few menaces and complaints, he granted peace to Antiochus, that he might be more at liberty to gratify his appetites and passions. He had before murdered his father, his mother, and his brother; and now he killed his wife, who was also his sister, and gave himself up entirely to the management of Agathoclea his harlot, and her brother, Agathocles, who was his catamite, and their equally vicious mother Oenanthe: and so, forgetful of the greatness of his name and majesty, he consumed his days in feasting, and his nights in lewdness, and became not only the spectator, but the master and leader of all wickedness. Alas! what availed it to have conquered his enemies, when he was thus overcome by his vices; he was so far from being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strengthened by it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that even his own subjects, offended at his inglorious peace, and more inglorious life, rebelled against him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "After the retreat of Antiochus, Ptolemy visited the cities of Cœlosyria and Palestine, which had submitted to him; and, among others, in his progress, he came to Jerusalem, “where he took a view of the temple, and even offered sacrifices, &c., to the God of Israel. But, not being satisfied with viewing it only from the outer court, beyond which no Gentile was allowed to pass, he showed a great inclination to enter the sanctuary, and even the holy of holies itself. This occasioned a great uproar all over the city; the high-priest informed him of the holiness of the place, and the express law of God, by which he was forbid to enter it. But every sort of opposition only served to inflame his curiosity; he forced in as far as the second court, where, while he was preparing to enter the temple itself, he was struck by God with such terror, that he was carried off half dead. On this he left the city, highly exasperated against the whole Jewish nation, and loudly threatening future vengeance.” At his return, therefore, to Alexandria, he began a cruel persecution against the Jewish inhabitants of that city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and cast down many ten thousands; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for it appears from Eusebius, that, about this time, forty thousand Jews, or, according to Jerome, sixty thousand, were slain. The loss of so many of his Jewish subjects, and the rebellion of the Egyptians, added to the mal-administration of the state, must certainly have very much weakened, and almost totally ruined his kingdom: see Bishop Newton, Wintle, and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Univ. Hist., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "vol. 9. p. 220.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:1-30 The angel shows Daniel the succession of the Persian and Grecian empires. The kings of Egypt and Syria are noticed: Judea was between their dominions, and affected by their contests. From ver. 5-30, is generally considered to relate to the events which came to pass during the continuance of these governments; and from ver. 21, to relate to Antiochus Epiphanes, who was a cruel and violent persecutor of the Jews. See what decaying, perishing things worldly pomp and possessions are, and the power by which they are gotten. God, in his providence, sets up one, and pulls down another, as he pleases. This world is full of wars and fightings, which come from men's lusts. All changes and revolutions of states and kingdoms, and every event, are plainly and perfectly foreseen by God. No word of God shall fall to the ground; but what he has designed, what he has declared, shall infallibly come to pass. While the potsherds of the earth strive with each other, they prevail and are prevailed against, deceive and are deceived; but those who know God will trust in him, and he will enable them to stand their ground, bear their cross, and maintain their conflict.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he hath takcn away the multitude - When he has subdued them. Lengerke, however, renders this, \"And the multitude shall lift themselves up,\" supposing it to refer to the fact that the people as well as the king would be excited. But the more natural interpretation is that in our common version, and the same sense of the word (נשׂא  nâss'â') occurs in Ames ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His heart shall be lifted up - That is, he will be proud and self-confident. The reference is to the effect which would be produced on him after his defeat of Antiochus. He was a man naturally indolent and effeminate - a most profligate and vicious prince. - Prideaux, Con. iii. 146. The effect of such a victory would be to lift him up with pride.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he shall cast down many ten thousands - Or, rather, the meaning is, \"he has cast down many myriads.\" The object seems to be to give a reason why his heart was lifted up. The fact that he had been thus successful is the reason which is assigned, and this effect of a great victory has not been uncommon in the world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But he shall not be strengthened by it - He was wholly given up to luxury, sloth, and voluptuousness, and returned immediately after his victory into Egypt, and surrendered himself up to the enjoyment of his pleasures. The consequence was, that he, by his conduct, excited some of his people to rebellion, and greatly weakened himself in the affections and confidence of the rest. After the victory, he concluded a truce with Antiochus; and the result was, that his people, who expected much more from him, and supposed that he would have prosecuted the war, became dissatisfied with his conduct, and broke out into rebellion. As a matter of fact, he was less strong in the confidence and affections of his people, and would have been less able to wage a war, after his triumph over Antiochus than he was before. See Prideaux, Con. iii. 155, following. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But he shall not be strengthened by it - He was wholly given up to luxury, sloth, and voluptuousness, and returned immediately after his victory into Egypt, and surrendered himself up to the enjoyment of his pleasures. The consequence was, that he, by his conduct, excited some of his people to rebellion, and greatly weakened himself in the affections and confidence of the rest. After the victory, he concluded a truce with Antiochus; and the result was, that his people, who expected much more from him, and supposed that he would have prosecuted the war, became dissatisfied with his conduct, and broke out into rebellion. As a matter of fact, he was less strong in the confidence and affections of his people, and would have been less able to wage a war, after his triumph over Antiochus than he was before. See Prideaux, Con. iii. 155, following. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. when he hath taken away—that is, subdued \"the multitude\" of Antiochus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "heart … lifted up—instead of following up his victory by making himself master of the whole of Syria, as he might, he made peace with Antiochus, and gave himself up to licentiousness [Polybius, 87; Justin, 30.4], and profaned the temple of God by entering the holy place [Grotius].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "not be strengthened by it—He shall lose the power gained by his victory through his luxurious indolence.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He might have conquered and recovered all again, but he grew proud of his victory, and returned again to his luxury. Entering Judea he entered into the temple of God at Jerusalem and the holy place against the law; yet, though he ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "cast down many thousands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he was not ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "strengthened by it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That is, when Ptolemy king of Egypt had defeated the large army of Antiochus, killed great numbers of them, and taken many: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his heart shall be lifted up; with pride, through the victory he obtained; and so he gave himself up to sensuality and luxury, judging himself now safe and secure in the possession of his kingdom: or, this may refer to his insolence, when he entered into Judea, went to Jerusalem, and forced his way into the holiest of all to offer sacrifice upon his victory; of which see third Maccabees chapter one: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he shall cast down many ten thousands; or \"many thousands\", as the Vulgate Latin version; or rather \"ten thousand\" (m), either of the Jews, when he went into their country; or of the army of Antiochus the king of the north, as Jacchiades: and it may be rendered, \"though he shall cast down many thousands\" (n); that is, cast them down to the earth, slay them, as he did, even ten thousand of them, the number here mentioned: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "yet he shall not be strengthened by it; for Antiochus escaped out of his hands, nor did he pursue his victory, and take all the advantages of it, as he might have done; for, as the historian (o) says, had he added valour to his fortune, he might have spoiled Antiochus of his kingdom; but, content with the recovery of the cities he lost, made peace, and greedily took the advantage of ease, and rolled himself in luxury, uncleanness, and intemperance. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) \"decem millia\", Pagninus, Montanus, so Ben Melech. (n) \"etiamsi dejiciet\", Gejerus; \"quamvis prostraverit\", Michaelis. (o) Justin, l. 30. c. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) \"decem millia\", Pagninus, Montanus, so Ben Melech. (n) \"etiamsi dejiciet\", Gejerus; \"quamvis prostraverit\", Michaelis. (o) Justin, l. 30. c. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when he hath taken away the multitude, his heart shall be lifted up; and he shall cast down many ten thousands: but he shall not be strengthened by it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when he hath taken away the multitude, his heart shall be lifted up; and he shall cast down many ten thousands; but he shall not be strengthened by it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The rendering of the LXX. is, \"And he shall take the levy (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "συναγωγήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and his heart shall be lifted up, and he shall trouble many, and shall not be afraid.\" There seems to have been some difference of reading in the last clause, but it is not clear what. Theodotion renders the first clause as does the Septuagint; but the latter clause is more in accordance with the English version of the Massoretic text. The Peshitta from the same text differs in its interpretation, \"And he shall destroy them mightily, and his heart shall be lifted up, and he shall cast down many, and shall not be strengthened.\" The Vulgate presents no occasion of remark. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And he shall cast  down many ten thousands.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This, most probably, refers to the complete victory at Raphia, where Antiochus was reported to have lost ten thousand men. There is thus a repetition here of what has already been narrated. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "But he shall not be strengthened by it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is very noticeable that Ptolemy did not even attempt to strengthen his position by vigorously following up his victory. Daniel 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This verse illustrates the last clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e., explains more fully how the great multitude of the enemy are given into his hand. The first two clauses of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " stand in correlation to each other, as the change of the time and the absence of the copula before ירוּם show (the Keri ורם proceeds from a misunderstanding). The meaning is this: \"As the multitude rises up, so his heart is lifted up.\" ההמון, with the article, can only be the host of the king of the north mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The supposition that the Egyptian army is meant, is the result of the difficulty arising out of the misapprehension of the right relation in which the perfect ונשּׂא (hath lifted up raised) stands to the imperfect ירוּם. נשּׂא as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : they raise themselves to the conflict. לבב רוּם, the lifting up of the heart, commonly in the sense of pride; here the increase of courage, but so that pride is not altogether to be excluded. The subject to ירוּם is the king of the south, to whom the suffix to בּידו, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", points. With excited courage he overthrows myriads, namely, the powerful multitude of the enemies, but he yet does not reach to power, he does not attain to the supremacy over the king of the north and over his kingdom which he is striving after. The Vulgate, without however fully expressing the meaning, has rendered יעוז ולא by sed non praevalebit. ",
        "children": []
      }
    ]
  }
]