[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 11:38",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:38",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But in his estate — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jurisdiction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The LXX. render it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "επι τοπου αυτου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in his place shall he honour the god of forces — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the god Mahuzzim. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This seems to be either Jupiter Olympus, never introduced among the Syrians till Antiochus did it, or, as others rather suppose, Mars, the god of war, whom Antiochus ordered to be worshipped in his dominions: which latter opinion seems the more likely, as Antiochus was almost always engaged in some war or other, and appears to have depended most upon his sword for raising himself to power and dignity. The Greek version, the Vulgate, and several other translations, retain the original word, without interpreting it. The word imports ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "protection, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a protector, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and is often rendered by the LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "υπερασπιστης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a defender, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "champion. A god whom his fathers knew not — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Nor worshipped; because he wished to be thought to excel his fathers in wisdom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall he honour with gold, and silver, and pleasant things — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "חמדות",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pleasant things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is used by the Prophet Isaiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to signify the costly ornaments with which the heathen decked their idols; and of such ornaments it is to be understood here. And the god spoken of here, as honoured and ornamented by Antiochus, seems to have been ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Baal- Semon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the chief god of the Phenicians, who is with propriety said to be a god whom Antiochus’s father knew not; because there was no god of such name, nor supposed with the same power and attributes, among the Greeks, till (probably by Antiochus’s means) they followed the example of the Phenicians in worshipping such a god.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:31-45 The remainder of this prophecy is very difficult, and commentators differ much respecting it. From Antiochus the account seems to pass to antichrist. Reference seems to be made to the Roman empire, the fourth monarchy, in its pagan, early Christian, and papal states. The end of the Lord's anger against his people approaches, as well as the end of his patience towards his enemies. If we would escape the ruin of the infidel, the idolater, the superstitious and cruel persecutor, as well as that of the profane, let us make the oracles of God our standard of truth and of duty, the foundation of our hope, and the light of our paths through this dark world, to the glorious inheritance above.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But in his estate - The marginal reading here is, \"As for the Almighty God, in his seat he shall honor, yea, he shall honor a god,\" etc. The more correct rendering, however, is that in the text, and the reference is to some god which he would honor, or for which he would show respect. The rendering proposed by Lengerke is the true rendering, \"But the god of forces (firm places, fastnesses - der Vesten) he shall honor in their foundation\" (auf seinem Gestelle). The Vulgate renders this, \"But the god Maozim shall he honor in his place.\" So also the Greek. The phrase \"in his estate\" - על־כנו  'al-kanô - means, properly, \"upon his base,\" or foundation. It occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is applied to a monarch who would succeed another - occupying the same place, or the same seat or throne. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here it seems to mean that he would honor the god referred to in the place which he occupied, or, as it were, on his own throne, or in his own temple. The margin is, \"or stead;\" but the idea is not that he would honor this god instead of another, but that he would do it in his own place. If, however, as Gesenius and De Wette suppose, the sense is, \"in his place, or stead,\" the correct interpretation is, that he would honor this \"god of forces,\" in the stead of honoring the god of his fathers, or any other god. The general idea is clear, that he would show disrespect or contempt for all other gods, and pay his devotions to this god alone.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall he honor - Pay respect to; worship; obey. This would be his god. He would show no respect to the god of his fathers, nor to any of the idols usually worshipped, but would honor this god exclusively.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The God of forces - Margin, Mauzzim, or gods protectors; or, munitions. Hebrew, מעזים  mâ‛uzym; Latin Vulgate, Maozim; Greek, Μαωξεὶμ  Maōxeim; Syriac, \"the strong God;\" Luther, Mausim; Lengerke, der Vesten - fastnesses, fortresses. The Hebrew word מעוז  mâ‛ôz means, properly, a strong or fortified place, a fortress; and Gesenius (Lexicon) supposes that the reference here is to \"the god of fortresses, a deity of the Syrians obtruded upon the Jews, perhaps Mars.\" So also Grotius, C. B. Michaelis, Staudlin, Bertholdt, and Winer. Dereser, Havernick, and Lengerke explain it as referring to the Jupiter Capitolinus that Antiochus had learned to worship by his long residence in Rome, and whose worship he transferred to his own country. There has been no little speculation as to the meaning of this passage, and as to the god here referred to; but it would seem that the general idea is plain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is, that the only god which he would acknowledge would be force, or power, or dominion. He would set at nought the worship of the god of his fathers, and all the usual obligations and restraints of religion; he would discard and despise all the pleadings of humanity and kindness, as if they were the weaknesses of women, and he would depend solely on force. He would, as it were, adore only the \"god of force,\" and carry his purposes, not by right, or by the claims of religion, but by arms. The meaning is not, I apprehend, that he would formally set up this \"god of forces,\" and adore him, but that this would be, in fact, the only god that he would practically acknowledge. In selecting such a god as would properly represent his feelings he would choose such an one as would denote force or dominion. Such a god would be the god of war, or the Roman Jupiter, who, as being supreme, and ruling the world by his mere power, would be a fit representative of the prevailing purpose of the monarch.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The general sentiment is, that all obligations of religion, and justice, and compassion, would be disregarded, and he would carry his purposes by mere power, with the idea, perhaps, included, as seems to be implied in the remainder of the verse, that he would set up and adore such a foreign god as would be a suitable representation of this purpose. It is hardly necessary to say that this was eminently true of Antiochus Epiphanes; and it may be equally said to be true of all the great heroes and conquerors of the world. Mars, the god of war, was thus adored openly in ancient times, and the devotion of heroes and conquerors to that idol god, though less open and formal, has not been less real by the heroes and conquerors of modern times; and, as we say now of an avaricious or covetous man that he is a worshipper of mammon, though he in fact formally worships no god, and has no altar, so it might be affirmed of Antiochus, and may be of heroes and conquerors in general, that the only god that is honored is the god of war, of power, of force; and that setting at nought all the obligations of religion, and of worship of the true God, they pay their devotions to this god alone.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Next to mammon, the god that is most adored in this world is the \"god of force\" - this Mauzzim that Antiochus so faithfully served. In illustration of the fact that seems here to be implied, that he would introduce such a god as would be a fit representative of this purpose of his life, it may be remarked that, when in Rome, where Antiochus spent his early years, he had learned to worship the Jupiter of the Capitol, and that he endeavored to introduce the worship of that foreign god into Syria. Of this fact there can be no doubt. It was one of the characteristics of Antiochus that he imitated the manners and customs of the Romans to a ridiculous extent (Diod. Sic. Frag, xxvi. 65); and it was a fact that he sent rich gifts to Rome in honor of the Jupiter worshipped there (Livy, lxii. 6), and that he purposed to erect a magnificent temple in honor of Jupiter Capitolinus in Antioch - Livy, xli. 20.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This temple, however, was not completed. It will be remembered, also, that he caused an altar to Jupiter to be erected over the altar of burnt-sacrifice in Jerusalem. It should be added, that they who apply this to Anti-christ, or the Pope, refer it to idol or image worship. Elliott (Apocalypse, iv. 153) supposes that it relates to the homage paid to the saints and martyrs under the Papacy, and says that an appellation answering to the word Mahuzzim was actually given to the departed martyrs and saints under the Papal apostasy. Thus he remarks: \"As to what is said of the willful king's honoring the god Mahuzzim (a god whom his fathers knew not) in place of his ancestors' god, and the true God, it seems to me to have been well and consistently explained, by a reference to those saints, and their relics and images, which the apostasy from its first development regarded and worshipped as the Mahuzzim, or fortresses of the places where they were deposited.\" - Apoc. iv. 157. But all this appears forced and unnatural; and if it be not supposed that it was designed to refer to Antichrist or the Papacy, no application of the language can be found so obvious and appropriate as that which supposes that it refers to Antiochus, and to his reliance on force rather than on justice and right.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And a god whom his fathers knew not - This foreign god, Jupiter, whom he had learned to worship at Rome.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall he honor with gold, and silver, and with precious stones ... - That is, he shall lavish these things on building a temple for him, or on his image. This accords with the account which Livy gives (xli. 20) of the temple which he commenced at Antioch in honor of Jupiter. Livy says that, although in his conduct he was profligate, and although in many things it was supposed that he was deranged - \"Quidam hand dubie insanire aiebunt\" - yet that in two respects he was distinguished for having a noble mind - for his worship of the gods, and for his favor toward cities in adorning them: \"In duabus tamen magnis honestisque rebus vere regius erat animus, in urbium donis, et deorum cultu.\" He then adds, in words that are all the commentary which we need on the passage before us: \"Magnificentiae vero in deos vel Jovis Olympii ternplum Athenis, unum in terris inchoatum pro magnitudine dei, potest testis esse. Sed et Delon aris insignibus statuarumque copia exornavit; et Antiochiae Joyis capitolini magnificum templum, non laqueatum auro tantum, sed parietibus totis lamina inauratum, et alia multa in aliis locis pollicita, quia perbreve tempus regni ejus fuit, non perfecited.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And pleasant things - Margin, \"things desired.\" That is, with ornaments, or statuary, or perhaps pictures. Compare the notes at Isaiah 2:16. e meant that the temple should be beautified and adorned in the highest degree. This temple, Livy says, he did not live to finish. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And pleasant things - Margin, \"things desired.\" That is, with ornaments, or statuary, or perhaps pictures. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". e meant that the temple should be beautified and adorned in the highest degree. This temple, Livy says, he did not live to finish. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "38. God of forces—probably Jupiter Capitolinus, to whom Antiochus began to erect a temple at Antioch [Livy, 41.20]. Translate, \"He shall honor the god of fortresses on his basis,\" that is, the base of the statue. Newton translates, \"And the god 'Mahuzzim' (guardians, that is, saints adored as 'protectors' in the Greek and Roman churches) shall he honor.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "honour with gold, &c.—Compare Re 17:4 as to Antiochus' antitype, Antichrist.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall honour the god of forces; Mauzzim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of strengths or strong holds. The Phoenicians worshipped Mars the God of wars, which Antiochus did worship; but we are come to the Romans; and though many have conjectured several senses of this Mynem translated god of forces, yet none comes nearer than Mr. Mede, who interprets it of demons, or tutelar gods, which the Romans should worship with Christ, supposing them to be angels or saints. This is not to be thought a novel opinion, for many of the fathers say that this Mauzzim is the idol that antichrist should worship. So the meaning is, that in Christ’s seat, or place, the temple, they should worship saints and angels with Christ, as the preposition imports, together with Christ; which it is notorious they do. That which, made this place obscure was, that men generally took this strange god for an idol, which indeed the Jews call the Gentiles’ gods, and so doth the Old Testament often, because foreign to the true God, which was their God; but the true God was foreign and strange to the Romans, because their gods were idols. Therefore the philosophers called Christ Xenon daimonion, a strange god. This god they should ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "honour with gold, and silver, and precious stones.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Vulgate translates ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mauzzim, protector",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and we know too well how the Romanists adorn the churches and shrines of these their patrons and tutelar saints, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 27:1 28:8 31:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 27:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 28:8 31:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the fathers sometimes fatally hit upon this expression at the first setting and honouring of martyrs, calling them strong holds, and strong towers of defence; but the Council Of Constantinople called them the devil’s strong holds; thus they called their images also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But in his estate shall he honour the god of forces,.... Or god Mahuzzim (q); departed saints and their images, whom the Papists make their protectors, defenders, and guardians: the word signifies towers, strong holds, fortresses; and by these titles the martyrs, saints departed, are called by the ancient fathers, who first introduced the worship of them: So Basil (r), speaking of the forty martyrs, says, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"these are they, who obtaining our country, like certain towers, afford us a refuge against the incursion of enemies:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and a little after thus addresses them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"O ye common keepers of mankind, the best companions of our cares, the suffragans of our prayers and wishes, \"most powerful\" ambassadors with God, &c.:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and elsewhere (s) he prays, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"that God would keep the church unmoved, and fortified with the great towers of the martyrs;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so Chrysostom (t) calls them patrons and protectors. Or, \"with God he shall honour\" (u); these along with him, or besides him; these shall be the objects of religious worship and honour, as they are: and that \"in his estate\"; or in his room and stead, that is, of the true God, our Lord Jesus Christ, the only Mediator between God and man; and yet angels and departed saints are set up as mediators in his stead: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and a god whom his fathers knew not shall he honour; the host, the wafer, the breaden god, made a god by the words of a muttering priest; this is such a god as the apostles, and Peter particularly, from whom the popes of Rome pretend to, derive their succession, never knew, nor once dreamed of; and yet this is received as a god, bowed unto, and worshipped, and honoured: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with gold, silver, and with precious stones, and pleasant things; with rich and costly ornaments, with which the pyxis or box, in which it is carried in procession, is adorned. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q)  \"deum Mahuzim\", V. L. Pagninus, Montanus. (r) Homil. in 40. Martyr. p. 151. (s) Homil. de Martyr. Mamant. p. 167. (t) Sermo in Berenice, Homil. l. in 1 Thess. See Mede's Works, B. 3. p. 673, 674. (u) \"Ad, vel juxta deum Mahuzzimos in sede ejus honorabit\", Medus, p. 667, 671. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q)  \"deum Mahuzim\", V. L. Pagninus, Montanus. (r) Homil. in 40. Martyr. p. 151. (s) Homil. de Martyr. Mamant. p. 167. (t) Sermo in Berenice, Homil. l. in 1 Thess. See Mede's Works, B. 3. p. 673, 674. (u) \"Ad, vel juxta deum Mahuzzimos in sede ejus honorabit\", Medus, p. 667, 671. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But in his estate shall he honour the {y} God of forces: and a god whom his fathers knew not shall he honour with {z} gold, and silver, and with precious stones, and pleasant things.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But in his estate shall he honour the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{y}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " God of forces: and a god whom his fathers knew not shall he honour with ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{z}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gold, and silver, and with precious stones, and pleasant things.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) That is, the god of power and riches: they will esteem their own power above all their gods and worship it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Under pretence of worshipping the gods, they will enrich their city with the most precious jewels of all the world, because by this all men would hold them in admiration for their power and riches.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But in his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he will honour the god of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "strongholds",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] it is not certain who is meant by the ‘god of strongholds’: possibly the reference is to some deity (? Mars) of whose worship by Antiochus we have no other notice; more probably, however, the name is simply an alternative designation of Jupiter Capitolinus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and a god whom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] No doubt, Zeus or Jupiter (cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 11:37",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:37",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is true, the first three Seleucidae, as their coins testify, recognized Zeus Olympios,—not, as Behrmann (misunderstanding a sentence of G. Hoffmann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Einige Phön. Inschr.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 29) states, Zeus Polieus,—as their patron; but Zeus was not, of course, a native Syrian deity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pleasant things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "costly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "things desired",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 11:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (‘precious’ cannot be used here; as the word is needed for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yěḳârâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in ‘precious stones’).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 38.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "his estate shall he honour the God of forces: and a god whom his fathers knew not shall he honour with gold, and silver, and with precious stores, and pleasant things.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As we have said above, the last clause of the preceding verse according  to the LXX. really belongs to this, \"Strong nations shall be subject to him,\" reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לְאמִּים עְזִּים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לֶךאלהּ מָעֻזִים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Massoretic, where ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "י",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has been in the reading followed by the Septuagint. After this clause the Septuagint proceeds, \"And to his place he shall move, and a god whom his fathers knew not he shall honour with gold, and silver, and precious stones.\" It is possible that ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נדד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nadad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "),\" to flee or move,\" was read instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כבד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "kabad",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "),\" to honour;\" for though ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κινέω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is usually active and transitive, there is no object here. Theodotion has, \"And the God of Maozeim he shall honour in his place, and a god whom his father knew not he shall honour with gold, silver, and precious stones, and with offerings.\" The Peshitta rendering is freer, \"The mighty god he shall honour in his possession, and a god whom his fathers have not known shall he honour with gold and with silver, with precious gems and desirable things.\" The Vulgate adopts the transliteration ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Maozim. In his estate shall he honour the god of forces.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There are a number of questions here. To whom does the prenominal suffix refer? The English translators have arranged the words so that we cannot escape the view that \"the estate\" is the king's, but the natural meaning of the Hebrew order is that it is \"on the place\" or \"pedestal\" of the god. The word translated \"estate\" is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 40:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for \"office.\" It is used of the \"base\" of the \"laver.\" It may mean \"place.\" The next point - What Deity is meant by \"the god of strong holds\"? There is absolutely nothing to guide us in the matter. Some have supposed that the reference is to Jupiter Olympius, whose statue Antiochus is reported to have set np in the temple. Others, that the reference is to Jupiter Capitolinus. Were there any evidences that Antiochus worshipped the genius of Rome, something might be urged for this; but we have no evidence of this. In the absence of anything to fix a definite meaning on this word, we feel inclined to suggest that Jehovah is meant by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "slosh mauzzeem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Repeatedly in the Psalms is God declared to be the Strength of the saint; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Of Jehovah it might be said that the ancestors of Antiochus - Greek and Syrian - knew him not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Honour with gold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The repeated defeats of the armies of Antiochus and the spoiling of their camps by the followers of Jehovah, was giving honour to Jehovah, however unwittingly and unwillingly it was done. God \"gat him honour upon Pharaoh,\" and so now he was honoured upon Epiphanes. Daniel 11:38",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the other hand, he will honour the god of fortresses. That מעזּים is not, with Theodotion, the Vulgate, Luther, and others, to be regarded as the proper name of a god, is now generally acknowledge. But as to which god is to be understood by the \"god of fortresses,\" there is very great diversity of opinion. Grotius, C. B. Michaelis, Gesenius, and others think on Mars, the god of war, as the one intended; Hvernick, v. Lengerke, Maurer, and Ewald regard Jupiter Capitolinus, to whom Antiochus purposed to erect a temple in Antioch (Livy, xli. 20); others, Jupiter Olympius; while Hitzig, by changing מעזּים into ים מעז, fortress of the sea, thinks that Melkart, or the Phoenician Hercules, is referred to. But according to the following passage, this god was not known to his fathers. That could not be said either of Mars, or Jupiter, or Melkart. Add to this, \"that if the statement here refers to the honouring of Hercules, or Mars, or Zeus, or Jupiter, then therewith all would be denied that was previously said of the king's being destitute of all religion\" (Klief.). The words thus in no respect agree with Antiochus, and do not permit us to think on any definite heathen deity. כּנּו על does not signify on his foundation, pedestal (Hv., v. Leng., Maurer, Hitzig, Ewald), because the remark that he honoured God on his pedestal would be quite inappropriate, unless it had been also said that he had erected a statue to him. כּנּו על has here the same meaning as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"in his place or stead\" (Gesenius, de Wette, Kliefoth, and others). But the suffix is not, with Klief., to be referred to כּל על: in the place of all that, which he did not regard, but it refers to כּל־אלוהּ: in the place of every god; which is not overthrown by the objection that in that case the suffix should have been plur., because the suffix is connected with the singular אלוה. The \"god of fortresses\" is the personification of war, and the thought is this: he will regard no other god, but only war; the taking of fortresses he will make his god; and he will worship this god above all as the means of his gaining the world-power. Of this god, war as the object of deification, it might be said that his fathers knew nothing, because no other king had made war his religion, his god to whom he offered up in sacrifice all, gold, silver, precious stones, jewels. ",
        "children": []
      }
    ]
  }
]