[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(44) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He shall go forth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The end of the northern king. While in Egypt he has bad news brought to him from the north and from the east, which stirs up feelings of revenge. Once again he halts in Palestine, where he comes to an end. That this cannot apply to Antiochus is evident from the following facts—(1) Antiochus was in Persia when the news of the defeat of Lysias reached him; (2) Judæa and Jerusalem cannot in any sense be regarded as either east or north of Persia; (3) Antiochus died in Persia, and not near Jerusalem.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 11:44-45. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:44-45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But tidings out of the east and out of the north shall trouble him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Historians relate, that the Parthians on the east, and the Armenians on the north, declared war against Antiochus about the same time; so that this may very reasonably be supposed to relate to this fact. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he shall plant the tabernacles of his palace — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The word translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "palace ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here, is a Syriac word, and therefore is very properly used when speaking of the Syrian king. The expression signifies, as we would speak now, his royal tent, or pavilion. By planting it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "between the seas, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the glorious holy mountain, is meant, his fixing it in Judea, called a mountain elsewhere, as well as here, because it is a mountainous country. The epithet ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "glorious ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is the very same as Daniel generally uses in speaking of Judea as a peculiar mark of distinction. The epithet ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is also frequently applied to Judea, because the whole of it was dedicated to the true God, and was chosen by him for the residence of a nation which he intended to be a holy people. Judea is likewise situated between two seas, namely, the Mediterranean, and the sea of Sodom, or the Dead sea; which are its boundaries on each side. So the meaning of this sentence is, that Antiochus should place his royal pavilion in Judea, leaving there some of his principal generals, or officers, who should, by his command, keep up the pomp of majesty as if he himself were present. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet he shall come to his end, and none shall help him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God shall cut him off in the midst of his days, and none shall be able to prevent his fall. This is the same with what is foretold ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He shall be broken without hand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "where see the note. Observe, reader, when God’s time is come to bring proud oppressors to their end, none shall be able, nor perhaps, inclined to help them, for those who, when they are in their grandeur, covet to be feared by all, will find, when they come to be in distress, that they are loved by none: none will lend them so much as a hand, or a prayer to help them: for if the Lord do not help, who shall? Of the kings that came after Antiochus nothing is here prophesied, for he was the most malicious, mischievous enemy to the church, and a type of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the son of perdition, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "whom the Lord will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "consume with the breath of his mouth, and destroy with the brightness of his coming, and none shall help him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As a confirmation of the explanation of this prophecy given above, it may be proper to observe here, that Calmet, in like manner, confines the latter part of it to the persecutions of Antiochus against the Jews. He observes, however, at the close of the chapter, it is necessary to acknowledge that Antiochus was one of the most manifest, and most expressive figures of antichrist, and that these things which the angel foretold of Antiochus will receive a further accomplishment before the end of the world. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:31-45 The remainder of this prophecy is very difficult, and commentators differ much respecting it. From Antiochus the account seems to pass to antichrist. Reference seems to be made to the Roman empire, the fourth monarchy, in its pagan, early Christian, and papal states. The end of the Lord's anger against his people approaches, as well as the end of his patience towards his enemies. If we would escape the ruin of the infidel, the idolater, the superstitious and cruel persecutor, as well as that of the profane, let us make the oracles of God our standard of truth and of duty, the foundation of our hope, and the light of our paths through this dark world, to the glorious inheritance above.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But tidings out of the east and out of the north shall trouble him - Shall disturb him, or alarm him. That is, he will hear something from those quarters that will disarrange all his other plans, or that will summon him forth in his last and final expedition - on that expedition in which \"he will come to his end\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or which will be the end of this series of historical events. The reference here is to the winding up of this series of transactions, and, according to the view taken on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the note at that place), it is not necessary to suppose that this would happen immediately after what is stated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but it is rather to be regarded as a statement of what would occur in the end, or of the manner in which the person here referred to would finally come to an end, or in which these events would be closed. As a matter of fact, Antiochus, as will be seen in the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 11:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was called forth in a warlike expedition by tidings or reports from Parthia and Armenia - regions lying to the east and the north, and it was in this expedition that he lost his life, and that this series of historical events was closed. Lengerke says, Antiochus assembled an army to take vengeance on the Jews, who, after the close of the unfortunate campaign in Egypt, rose up, under the Maccabees, against Antiochus, 1 Macc. 3:10, following Then the intelligence that the Parthians in the east, and the Armenians in the north, had armed themselves for war against him, alarmed him. So Tacitus (Hist. v. 8) says (Antiochus Judaeis), Demere superstitionem et mores Groecorum dare adnixus, quominus teterrimain gentem in melius mutaret, Parthorum bello prohibitus est, nam ea tempestate Arsaces defecerat. In the year 147 b.c., Antiochus went on the expedition to Persia and Armenia, on the return from which he died. The occasions for this were these:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Artaxias, the king of Armenia, who was his vassal, had revolted from him, and",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) he sought to replenish his exhausted treasury, that he might wage the war with Judas Maccabeus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See 1 Macc. 3:27-37; Jos. Ant. b. xii. ch. vii. Section 2; Appian, Syriac. xlvi. 80; Porphyry, in Jerome, in loc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Therefore he shall go forth with great fury to destroy ... - Great fury at the revolt of Artaxias, and especially at this juncture when he was waging war with the Jews; and great fury at the Jews, with a determination to obtain the means utterly to destroy them. 1 Macc. 3:27: \"Now when king Antiochus heard these things (the successes of Judas Maceabeus), he was full of indignation.\" In every way his wrath was kindled. He was enraged against the Jews on account of their success; he was enraged against Artaxias for revolting from him; he was enraged because his treasury was exhausted, and he had not the means of prosecuting the war. In this mood of mind he crossed the Euphrates (1 Macc. 3:37) to prosecute the war in the East, and, as it is said here, \"utterly to make away many.\" Everything conspired to kindle his fury, and in this state of mind, he went forth on his last expedition to the East. Nothing, in fact, could better describe the state of mind of Antiochus than the language used here by the angel to Daniel. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore he shall go forth with great fury to destroy ... - Great fury at the revolt of Artaxias, and especially at this juncture when he was waging war with the Jews; and great fury at the Jews, with a determination to obtain the means utterly to destroy them. 1 Macc. 3:27: \"Now when king Antiochus heard these things (the successes of Judas Maceabeus), he was full of indignation.\" In every way his wrath was kindled. He was enraged against the Jews on account of their success; he was enraged against Artaxias for revolting from him; he was enraged because his treasury was exhausted, and he had not the means of prosecuting the war. In this mood of mind he crossed the Euphrates (1 Macc. 3:37) to prosecute the war in the East, and, as it is said here, \"utterly to make away many.\" Everything conspired to kindle his fury, and in this state of mind, he went forth on his last expedition to the East. Nothing, in fact, could better describe the state of mind of Antiochus than the language used here by the angel to Daniel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "44. tidings out of the east and out of the north—Artaxias, king of Armenia, his vassal, had revolted in the north, and Arsaces, leader of the Parthians, in the east (1 Maccabees 3:10, &c., 1 Maccabees 3:37; Tacitus, Histories, 5.8). In 147 B.C. Antiochus went on the expedition against them, on the return from which he died.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "great fury—at the Jews, on account of their successes under Judas Maccabeus, whence he desired to replenish his treasury with means to prosecute the war with them; also at Artaxias and Arsaces, and their respective followers. De Burgh makes the \"tidings\" which rouse his fury, to be concerning the Jews' restoration; such may be the antitypical reference.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The Christian princes of the north, and the dispersed Israelites, and the Jews carried captive into the north, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 16:14,15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", called also kings of the east, shall come and trouble him, and all his power shall not be able to withstand. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 16:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 16:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But tidings out of the east and out of the north shall trouble him,.... This and the following verse respect times and things yet to come, and the interpretation of them is not so certain: perhaps this clause may have a regard to the news brought to the Turk, of the Jews, upon their conversion, being about to return to their own land, from the eastern and northern parts of the world, where they chiefly are at this day; which will greatly alarm him, since their land is part of his dominions: or it may be, out of the east may come tidings of some commotions and disturbances in the eastern part of the world, as Tartary, &c. which he may fear would be of bad consequence to the Ottoman empire; and news out of the north, of the northern Christian princes preparing to assist the Jews in the repossession of their country; all which may give him great uneasiness. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Therefore he shall go forth with great fury to destroy, and utterly to make away many; hearing the Jews are preparing to return to their own country, or that they have got possession of it, he will be provoked to the last degree, and raise a prodigious army, and march out of his own land with them to Judea; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and will come like a storm, with the utmost rage and fury, and like a cloud for number, and threaten utter ruin and destruction to the nation of the Jews; this will be his end in view in coming out, but he will not be able to accomplish it; of all which see Ezekiel 38:2, where the Turk, and this expedition of his, are prophesied of, and where he goes by the name of Gog. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and will come like a storm, with the utmost rage and fury, and like a cloud for number, and threaten utter ruin and destruction to the nation of the Jews; this will be his end in view in coming out, but he will not be able to accomplish it; of all which see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the Turk, and this expedition of his, are prophesied of, and where he goes by the name of Gog. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But tidings out of the east and out of the north shall {d} trouble him: therefore he shall go forth {e} with great fury to destroy, and utterly to make away many.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But tidings out of the east and out of the north shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " trouble him: therefore he shall go forth ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with great fury to destroy, and utterly to make away many.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Hearing that Crassus was slain, and Antonius defeated.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) For Augustus overcame the Parthians, and recovered that which Antonius had lost.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But tidings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rumours",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the same word is rendered in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 19:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), of the tidings which caused Sennacherib to withdraw. So ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "something heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here, probably, rumours of insurrections, or wars, in the E. and N. of his dominions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trouble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "alarm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he shall go forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] viz. out of Egypt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to destroy and utterly to make away many",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ‘and to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "ban",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "devote",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") many.’ The word, which means properly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to set apart, seclude",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is used primarily of the ban laid upon persons or objects hostile to Israel’s religion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 2:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:25-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 6:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.)[391]: as this involved generally their destruction, it is often rendered in A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "utterly destroy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so also in R.V., when applied to persons), though, of course, this rendering expresses only a secondary idea. In the present late passage, however, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 20:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is simply a synonym for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "destroy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[391] See further the writer’s Commentary on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 15:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 44.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But tidings out of the east and out of the north shall trouble him; there. fore he shall go forth with great fury to destroy, and utterly to make away many",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The version of the Septuagint is very like this, \"A rumour out of the east and out of the north shall trouble him, and he shall come out in great rage to lay waste with the sword, and to slay many.\" The version of Theodotion is somewhat briefer, \"Rumours and disturbances out of the east and from the north shall trouble him, and he shall come in much wrath to destroy many.\" The Syriac is closer than any other version to the Massoretic text. The Vulgate renders, \"A rumour out of the east and north shall trouble him, and he shall come with a great multitude that he may beat down and slay many.\" The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "חֵמָא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hayma",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may mean either \"wrath\" or \"multitude.\" It is difficult to identify the rumours that recalled Antiochus from his conquests. The account given by Porphyry (quoted by Jerome) of his receiving news that led him to ravage the coasts of Phoenicia and march against Armenia are unsupported by other historians. A phrase in Tacitus ('Hist.,' 5:8) seems to throw light on this, \"After the Macedonians held the supremacy, King Antiochus, when he was endeavouring to change the superstition of this people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Jews, into the manners of the Greeks, was hindered by a Parthian war.\" There is, however, no record of such a Parthian war; but such a war may have arisen, and not be recorded, as the histories for the period before us are very incomplete. Should we regard these verses as giving another account of the war between Epiphanes and Ptolemy, the tidings out of the north might mean the arrival of the Roman envoys, headed by Popilius Lsenas. If there were also a threat of a Parthian invasion, we should then have, \"tidings put of the east and north.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Therefore he shall go forth with great fury to destroy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and utterly to make away many.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Certainly Antiochus did return furious from the expedition in which he was stayed by the Romans; and certainly also he set himself thereafter  to compel the Jews to become Greeks in religion, punishing with death refusal to yield to his demands (1 Macc. 1:24-28; Josephus, 'Ant.,' 12:05. 3). Daniel 11:44",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The End of the Hostile King",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As has been already seen, the expressions in Daniel 11:40-43 regarding this king do not agree with Antiochus Epiphanes, so also the statements regarding his end are in contradiction to the historical facts regarding the end of the Syrian king. When the hostile king took possession of Egypt and its treasures, and made the Lybians and Cushites subject to him, tidings from the east and the north overwhelm him with terror. The masc. יבהלהוּ stands ad sensum related to the persons who occasion the reports. The reports excited his anger, so that he goes forth to destroy many. We have to think thus on the reports of revolt and insurrections in the east and the north of his kingdom, which came to his ears in Egypt. On this ground Hitzig, with other interpreters, refuses to refer the statement in Daniel 11:44 to the expedition of Antiochus against the Parthians and Armenians (Tacit. hist. Daniel 11:8, and App. Syr. c. 45, 46; 1 Macc. 3:37), because Antiochus did not undertake this expedition from Egypt; and rather, in regard to the east, thinks on the tidings from Jerusalem of the rebellion of Judea (2 Macc. 5:11ff.; 1 Macc. 1:24), and in regard to the north, on the very problematical expedition against the Aradiaei, without observing, however, that no Scripture writer designates Jerusalem as lying in the east of Egypt, But besides, Antiochus, since he has occupied for some years beyond the Euphrates, and there met with his death, could not shortly before his end lead an expedition out of Egypt against Aradus. What Porphyry says",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As has been already seen, the expressions in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:40-43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " regarding this king do not agree with Antiochus Epiphanes, so also the statements regarding his end are in contradiction to the historical facts regarding the end of the Syrian king. When the hostile king took possession of Egypt and its treasures, and made the Lybians and Cushites subject to him, tidings from the east and the north overwhelm him with terror. The masc. יבהלהוּ stands ad sensum related to the persons who occasion the reports. The reports excited his anger, so that he goes forth to destroy many. We have to think thus on the reports of revolt and insurrections in the east and the north of his kingdom, which came to his ears in Egypt. On this ground Hitzig, with other interpreters, refuses to refer the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the expedition of Antiochus against the Parthians and Armenians (Tacit. hist. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and App. Syr. c. 45, 46; 1 Macc. 3:37), because Antiochus did not undertake this expedition from Egypt; and rather, in regard to the east, thinks on the tidings from Jerusalem of the rebellion of Judea (2 Macc. 5:11ff.; 1 Macc. 1:24), and in regard to the north, on the very problematical expedition against the Aradiaei, without observing, however, that no Scripture writer designates Jerusalem as lying in the east of Egypt, But besides, Antiochus, since he has occupied for some years beyond the Euphrates, and there met with his death, could not shortly before his end lead an expedition out of Egypt against Aradus. What Porphyry says",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The words are: Pugnans contra Aegyptios et Lybias, Aethiopiasque pertransiens, audiet sibi ab aquilone et oriente praelia concitari, unde et regrediens capit Aradios resistentes et omnem in littore Phoenicis vastavit provinciam; confestimque pergit ad Artaxiam regem Armeniae, qui de orientis partibus movebatur.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(in Jerome under Daniel 11:44) regarding an expedition of Antiochus undertaken from Egypt and Lybia against the Aradiaei and the Armenian king Artaxias, he has gathered only from this verse and from notices regarding the wars of Antiochus against the Aradiaei and king Artaxias (after whose imprisonment, according to App. Syr. c. 46, he died), without having any historical evidence for it. But even though the statement of Porphyry were better established, yet it would not agree with Daniel 11:45; for when the king goes forth, in consequence of the report brought to him, to destroy many, he plants, according to Daniel 11:45, his palace-tent near to the holy mount, and here comes to his end; thus meeting with his destruction in the Holy Land not far from Jerusalem, while Antiochus, according to Polybius and Porphyry, died in the Persian city of Tabae on his return from Persia to Babylon.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(in Jerome under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") regarding an expedition of Antiochus undertaken from Egypt and Lybia against the Aradiaei and the Armenian king Artaxias, he has gathered only from this verse and from notices regarding the wars of Antiochus against the Aradiaei and king Artaxias (after whose imprisonment, according to App. Syr. c. 46, he died), without having any historical evidence for it. But even though the statement of Porphyry were better established, yet it would not agree with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for when the king goes forth, in consequence of the report brought to him, to destroy many, he plants, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 11:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", his palace-tent near to the holy mount, and here comes to his end; thus meeting with his destruction in the Holy Land not far from Jerusalem, while Antiochus, according to Polybius and Porphyry, died in the Persian city of Tabae on his return from Persia to Babylon.",
            "children": []
          }
        ]
      }
    ]
  }
]