[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Do in the dark,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in secret. Hence the difficulty of access to the place of their worship. The ordinary idolatries of Israel, as of most heathen, consisted in the worship of the true, or of a supposed spiritual Deity, by means of sensible images (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This was open and public enough at Jerusalem at this time; but the peculiar sin here portrayed was the actual worship of the creature by means of images and paintings. This, although joined in by the chief people of the nation, was practised secretly, perhaps, not only for the purpose of concealing its Egyptian tendencies from the Chaldæans, but also to throw over it the charm of mystery, as was so common among the heathen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Every man in the chambers of his imagery.—By “chambers of imagery” (the same word as in Leviticus 26:1) is intended chambers painted with images like the one now shown to the prophet. This was not a solitary case; on the contrary, it was but an example of what was done everywhere. The people stifled the voice of conscience then, as in every age, by saying “The LORD seeth us not,” comp. Psalm 10:11; Psalm 94:7, &c. Yet, besides this, they argued, doubtless from the calamities that had already fallen upon their country, “the LORD hath forsaken the earth,” or. rather, the land; and therefore they must have recourse to other help. But the prophet was to see yet worse things.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Every man in the chambers of his imagery.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "By “chambers of imagery” (the same word as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is intended chambers painted with images like the one now shown to the prophet. This was not a solitary case; on the contrary, it was but an example of what was done everywhere. The people stifled the voice of conscience then, as in every age, by saying “The LORD seeth us n",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ot,” ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c. Yet, besides this, they argued, doubtless from the calamities that ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "had ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "already fallen upon their country, “the LORD hath forsaken the earth,” or. rather, the land; and therefore they must have recourse to other help. But the prophet was to see yet worse things.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ezekiel",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "CHAMBERS OF IMAGERYEzekiel 8:12",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "CHAMBERS OF IMAGERY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is part of a vision which came to the prophet in his captivity. He is carried away in imagination from his home amongst the exiles in the East to the Temple of Jerusalem. There he sees in one dreadful series representations of all the forms of idolatry to which the handful that were left in the land were cleaving. There meets him on the threshold of the court ‘the image of jealousy,’ the generalised expression for the aggregate of idolatries which had stirred the anger of the divine husband of the nation. Then he sees within the Temple three groups representing the idolatries of three different lands. First, those with whom my text is concerned, who, in some underground room, vaulted and windowless, were bowing down before painted animal forms upon the walls. Probably they were the representatives of Egyptian worship, for the description of their temple might have been taken out of any book of travels in Egypt in the present day. It is only an ideal picture that is represented to Ezekiel, and not a real fact. It is not at all probable that all these various forms of idolatry were found at any time within the Temple itself. And the whole cast of the vision suggests that it is an ideal picture, and not reality, with which we have to do. Hence the number of these idolaters was seventy-the successors of the seventy whom Moses led up to Sinai to see the God of Israel! And now here they are grovelling before brute forms painted on the walls in a hole in the dark. Their leader bears a name which might have startled them in their apostasy, and choked their prayers in their throats, for Jaazan-iah means ‘the Lord hears.’ Each man has a censer in his hand-self-consecrated priests of self-chosen deities. Shrouded in obscurity, they pleased themselves with the ancient lie, ‘The Lord sees not; He hath forsaken the earth.’ And then, into that Sanhedrim of apostates there comes, all unknown to them, the light of God’s presence; and the eye of the prophet marks their evil.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I have nothing to do here with the other groups which Ezekiel saw in his vision. The next set were the representatives of the women of Israel, who, false at once to their womanhood and to their God, were taking part in the nameless obscenities and abominations of the worship of the Syrian Adonis. And the next, who from their numbers seem to be intended to stand for the representatives of the priesthood, as the former were of the whole people, represent the worshippers who had fallen under the fascinations of a widespread Eastern idolatry, and with their backs to the house of the Lord were bowing before the rising sun.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " All these false faiths got on very well together. Their worshippers had no quarrel with each other. Polytheism, by its very nature and the necessity of its being, is tolerant. All its rabble of gods have a mutual understanding, and are banded together against the only One that says, ‘Thou shalt have none other gods beside Me.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But now, I take this vision in a meaning which the prophet had no intention to put on it. I do not often do that with my texts, and when I do I like to confess frankly that I am doing it. So I take the words now as a kind of symbol which may help to put into a picturesque and more striking form some very familiar and homely truths. Look at that dark-painted chamber that we have all of us got in our hearts; at the idolatries that go on there, and at the flashing of the sudden light of God who marks, into the midst of the idolatry, ‘Hast thou seen what the ancients of the children of Israel do in the dark, each man in the chambers of his imagery?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Think of the dark and painted chamber which we all of us carry in our hearts. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Think of the dark and painted chamber which we all of us carry in our hearts.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Every man is a mystery to himself as to his fellows. With reverence, we may say of each other as we say of God-’Clouds and darkness are round about Him.’ After all the manifestations of a life, we remain enigmas to one another and mysteries to ourselves. For every man is no fixed somewhat, but a growing personality, with dormant possibilities of good and evil lying in him, which up to the very last moment of his life may flame up into altogether unexpected and astonishing developments. Therefore we have all to feel that after all self-examination there lie awful depths within us which we have not fathomed; and after all our knowledge of one another we yet do see but the surface, and each soul dwells alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is in every heart a dark chamber. Oh, brethren! there are very, very few of us that dare tell all our thoughts and show our inmost selves to our dearest ones. The most silvery lake that lies sleeping amidst beauty, itself the very fairest spot of all, when drained off shows ugly ooze and filthy mud, and all manner of creeping abominations in the slime. I wonder what we should see if our hearts were, so to speak, drained off, and the very bottom layer of every thing brought into the light. Do you think you could stand it? Well, then, go to God and ask Him to keep you from unconscious sins. Go to Him and ask Him to root out of you the mischiefs that you do not know are there, and live humbly and self-distrustfuliy, and feel that your only strength is: ‘Hold Thou me up, and I shall be saved.’ ‘Hast thou seen what they do in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "dark",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Still further, we may take another part of this description with possibly permissible violence as a symbol of another characteristic of our inward nature. The walls of that chamber were all painted with animal forms, to which these men were bowing down. By our memory, and by that marvellous faculty that people call the imagination, and by our desires, we are for ever painting the walls of the inmost chambers of our hearts with such pictures. That is an awful power which we possess, and, alas! too often use for foul idolatries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I do not dwell upon that, but I wish to drop one very earnest caution and beseeching entreaty, especially to the younger members of my congregation now. You, young men and women, especially you young men, mind what you paint upon those mystic walls! Foul things, as my text says, ‘creeping things and abominable beasts,’ only too many of you are tracing there. Take care, for these figures are ineffaceable. No repentance will obliterate them. I do not know whether even Heaven can blot them out. What you love, what you desire, what you think about, you are photographing on the walls of your immortal soul. And just as to-day, thousands of years after the artists have been gathered to the dust, we may go into Egyptian temples and see the figures on their walls, in all the freshness of their first colouring, as if the painter had but laid down his pencil a moment ago; so, on your hearts, youthful evils, the sins of your boyhood, the pruriences of your earliest days, may live in ugly shapes, that no tears and no repentance will ever wipe out. Nothing can do away with ‘the marks of that which once hath been.’ What are you painting on the chambers of imagery in your hearts? Obscenity, foul things, mean things, low things? Is that mystic shrine within you painted with such figures as were laid bare in some chambers in Pompeii, where the excavators had to cover up the pictures because they were so foul? Or, is it like the cells in the convent of San Marco at Florence, where Fra Angelico’s holy and sweet genius has left on the bare walls, to be looked at, as he fancied, only by one devout brother in each cell, angel imaginings, and noble, pure celestial faces that calm and hallow those who gaze upon them? What are you doing, my brother, in the dark, in your chambers of imagery?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now look with me briefly at the second thought that I draw from this symbol,-the idolatries of the dark chamber. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now look with me briefly at the second thought that I draw from this symbol,-the idolatries of the dark chamber.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "All these seventy grey-bearded elders that were bowing there before the bestial gods which they had portrayed, had, no doubt, often stood in the courts of the Temple and there made prayers to the God of Israel, with broad phylacteries, to be seen of men. Their true worship was their worship in the dark. The other was conscious or unconscious hypocrisy. And the very chamber in which they were gathered, according to the ideal representation of our text, was a chamber in, and therefore partaking of the consecration of, the Temple. So their worship was doubly criminal, in that it was sacrilege as well as idolatry. Both things are true about us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " A man’s true worship is not the worship which he performs in the public temple, but that which he offers down in that little private chapel, where nobody goes but himself. Worship is the attribution of supreme excellence to, and the entire dependence of the heart upon, a certain person. And the people or the things to which a man attributes the highest excellence, and on which he hangs his happiness and well-being, these be his gods, no matter what his outward profession is. You can find out what these are for you, if you will ask yourself, and honestly answer, one or two questions. What is that I want most? What is it which makes my ideal of happiness? What is that which I feel that I should be desperate without? What do I think about most naturally and spontaneously, when the spring is taken off, and my thoughts are allowed to go as they will? And if the answer to none of these questions is ‘God!’ then I do not know why you should call yourself a worshipper of God. It is of no avail that we pray in the temple, if we have a dark underground shrine where our true adoration is rendered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh, dear brethren! I am afraid there are a great many of us nominal Christians, connected with Christian Churches, posing before men as orthodox religionists, who keep this private chapel where we do our devotion to an idol and not to God. If our real gods could be made visible, what a pantheon they would make! All the foul forms painted on that cell of this vision would be paralleled in the creeping things, which crawl along the low earth and never soar nor even stand erect, and in the vile, bestial forms of passion to which some of us really bow down. Honour, wealth, literary or other distinction, the sweet sanctities of human love dishonoured and profaned by being exalted to the place which divine love should hold, ease, family, animal appetites, lust, drink-these are the gods of some of us. Bear with my poor words and ask yourselves, not whom do you worship before the eye of men, but who is the God to whom in your inmost heart you bow down? What do you do in the dark? That is the question. Whom do you worship there? Your other worship is not worship at all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Do not forget that all such diversion of supreme love and dependence from God alone is like the sin of these men in our text, in that it is sacrilege. They had taken a chamber in the very Temple, and turned it into a temple of the false gods. Whom is your heart made to enshrine? Why! every stone, if I may so say, of the fabric of our being bears marked upon it that it was laid in order to make a dwelling-place for God. Whom are you meant to worship, by the witness of the very constitution of your nature and make of your spirits? Is there anybody but One who is worthy to receive the priceless gift of human love absolute and entire? Is there any but One to whom it is aught but degradation and blasphemy for a man to bow down? Is there any being but One that can still the tumult of my spirit, and satisfy the immortal yearnings of my soul? We were made for God, and whensoever we turn the hopes, the desires, the affections, the obedience, and that which is the root of them all, the confidence that ought to fix and fasten upon Him, to other creatures, we are guilty not only of idolatry but of sacrilege. We commit the sin of which that wild reveller in Babylon was guilty, when, at his great feast, in the very madness of his presumption he bade them bring forth the sacred vessels from the Temple at Jerusalem; ‘and the king and his princes and his concubines drank in them and praised the gods.’ So we take the sacred chalice of the human heart, on which there is marked the sign manual of Heaven, claiming it for God’s, and fill it with the spiced and drugged draught of our own sensualities and evils, and pour out libations to vain and false gods. Brethren! Render unto Him that which is His; and see even upon the walls scrabbled all over with the deformities that we have painted there, lingering traces, like those of some dropping fresco in a roofless Italian church, which suggest the serene and perfect beauty of the image of the One whose likeness was originally traced there, and for whose worship it was all built.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, look at the sudden crashing in upon the cowering worshippers of the revealing light. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, lastly, look at the sudden crashing in upon the cowering worshippers of the revealing light.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Apparently the picture of my text suggests that these elders knew not the eyes that were looking upon them. They were hugging themselves in the conceit, ‘the Lord seeth not; the Lord hath forsaken the earth.’ And all the while, all unknown, God and His prophet stand in the doorway and see it all. Not a finger is lifted, not a sign to the foolish worshippers of His presence and inspection, but in stern silence He records and remembers.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And does that need much bending to make it an impressive form of putting a solemn truth? There are plenty of us-alas! alas! that it should be so-to whom it is the least welcome of all thoughts that there in the doorway stand God and His Word. Why should it be, my brother, that the properly blessed thought of a divine eye resting upon you should be to you like the thought of a policeman’s bull’s-eye to a thief? Why should it not be rather the sweetest and the most calming and strength-giving of all convictions-’Thou God seest me’? The little child runs about the lawn perfectly happy as long as she knows that her mother is watching her from the window. And it ought to be sweet and blessed to each of us to know that there is no darkness where a Father’s eye comes not. But oh! to the men that stand before bestial idols and have turned their backs on the beauty of the one true God, the only possibility of composure is that they shall hug themselves in the vain delusion:-’The Lord seeth not.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I beseech you, dear friends, do not think of His eye as the prisoner in a cell thinks of the pin-hole somewhere in the wall, through which a jailer’s jealous inspection may at any moment be glaring in upon him, but think of Him your Brother, who ‘knew what was in man,’ and who knows each man, and see in Christ the all-knowing Godhood that loves yet better than it knows, and beholds the hidden evils of men’s hearts, in order that it may cleanse and forgive all which it beholds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One day a light will flash in upon all the dark cells. We must all be manifest before the judgment-seat of Christ. Do you like that thought? Can you stand it? Are you ready for it? My friend! let Jesus Christ come to you with His light. Let Him come into the dark corners of your hearts. Cast all your sinfulness, known and unknown, upon Him that died on the Cross for every soul of man, and He will come; and His light, streaming into your hearts, like the sunbeam upon foul garments, will cleanse and bleach them white by its shining upon them. Let Him come into your hearts by your lowly penitence, by your humble faith, and all these vile shapes that you have painted on its walls will, like phosphorescent pictures in the daytime, pale and disappear when the ‘Sun of Righteousness, with healing in His beams, floods your soul, leaving no part dark, and turning all into a temple of the living God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 8:12. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hast thou seen what the ancients do in the dark — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Do secretly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "every man in the chambers of his imagery — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Chambers so very private, that the prophet is described as obliged to dig a hole through the wall before he could discover their idolatrous practices. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For they say, The Lord seeth us not — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They either deny the being and providence of God, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) or they say in their hearts, God hath cast us off, and withdrawn his wonted protection from us. They seem to have been of the same mind with Ahaz, who resolved to worship the gods of the Syrians, his conquerors, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So these men worshipped the idols of their neighbours, whom they saw to be more prosperous than themselves. Observe here, reader, a practical disbelief of God’s omniscience and superintending providence is one chief cause of men’s treacherous departures from him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord hath forsaken the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Looks not after the affairs of it, and therefore we had as well worship any other god as him. Or, he hath forsaken our land, and left it to be a prey to its enemies, and therefore it is time for us to look out to some other god to whom to commit the protection of it. This was a blasphemous reflection upon God, as if he had forsaken them first, otherwise they would not have forsaken him. Those are indeed ripe for ruin who are arrived to such a pitch of impudence as to lay the blame of their sins on God himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:7-12 A secret place was, as it were, opened, where the prophet saw creatures painted on the walls, and a number of the elders of Israel worshipped before them. No superiority in worldly matters will preserve men from lust, or idolatries, when they are left to their own deceitful hearts; and those who are soon wearied in the service of God, often grudge no toil nor expense when following their superstitions. When hypocrites screen themselves behind the wall of an outward profession, there is some hole or other left in the wall, something that betrays them to those who look diligently. There is a great deal of secret wickedness in the world. They think themselves out of God's sight. But those are ripe indeed for ruin, who lay the blame of their sins upon the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the dark - Hidden in the secret places which the seer dug through the wall to discover.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Chambers of his imagery - i. e., chambers painted with images. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Chambers of his imagery - i. e., chambers painted with images. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. every man in … chambers of … imagery—The elders (\"ancients\") are here the representatives of the people, rather than to be regarded literally. Mostly, the leaders of heathen superstitions laughed at them secretly, while publicly professing them in order to keep the people in subjection. Here what is meant is that the people generally addicted themselves to secret idolatry, led on by their elders; there is no doubt, also, allusion to the mysteries, as in the worship of Isis in Egypt, the Eleusinian in Greece, &c., to which the initiated alone were admitted. \"The chambers of imagery\" are their own perverse imaginations, answering to the priests' chambers in the vision, whereon the pictures were portrayed (Eze 8:10).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lord … forsaken … earth—They infer this because God has left them to their miseries, without succoring them, so that they seek help from other gods. Instead of repenting, as they ought, they bite the curb [Calvin].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hast thou seen?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " observed and thoroughly considered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The ancients:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 8:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Do in the dark; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whether ashamed to act openly what was most absurd, or whether out of blindness doting in secret on what heathens secretly derided, though for interest they acted it openly; owning that religion which awed the people among them, and deriding it at home. But idolatrous Jews blush in public, and retire into corners to be idolaters, as thou seest in this chamber. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Every man; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " every one of those ancients, for still God had his remnant that kept close to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the chambers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " secret closet, or bed-chamber. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They say; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the most shameless would give a reason for their unreasonable practices. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jehovah, the everlasting and almighty God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "seeth us not:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either they deny his providence, and act what they durst not if they thought the Lord knew and noted it, as if they accounted Jehovah no better than idols, that have eyes but see not; or else they deny God’s care of them and their affairs, traduce him, as if he minded them not, and therefore they must choose some or other god for patron who would better help them than he had done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord hath forsaken the earth:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this seems to explain the meaning of that, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "he seeth us not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and so with atheism more than ordinary they would cast the blame of choosing other gods on God himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then said he unto me, son of man, hast thou seen,.... Here should be a stop, as the accent \"segolta\" shows; hast thou taken notice of, hast thou considered, what thou hast seen, the amazing shocking abominations committed by these men? it follows, and the question is to be repeated, \"hast thou seen\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what the ancients of the house of Israel do in the dark? their deeds being evil, such as will not bear the light, of which they had reason to be ashamed before men; and which they imagined would not be seen by the Lord, though the darkness and the light are both alike to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "every man in the chambers of his imagery? the Septuagint, Syriac, and Arabic versions, render it, \"in his hidden\" or \"secret chamber\"; and the Vulgate Latin version, \"in the hidden place of his bedchamber\". The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"in the chamber of the house of his bed;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in his bedchamber; that is, in those chambers of the temple, which belonged to the priests and Levites, on the walls of which were portrayed the images and pictures of their gods. Here they had their secret rites or mysteries performed, in imitation of the Heathens; who had the several mysteries of their religion privately observed; to which none were admitted but those that were initiated into them; as those of Osiris among the Egyptians; of Ceres with the Grecians; and of Bona Dea among the Romans; as Junius observes. Though some interpret this of the imaginations of their minds, according to which they framed to themselves deities, and a form of worship; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they say, the Lord seeth not, the Lord hath forsaken the earth; this they gave as a reason of their idolatry, because the Lord took no notice of them, did not help them when in distress; but, as they concluded, had forsaken them; therefore they betook themselves to the gods of the Egyptians, Syrians, and other nations, for their assistance and protection: for these words are not the language of Epicureans, or such who deny the providence of God in general; who think that God takes no notice of the lower world, only of the upper one, as Kimchi and others interpret them; for these elders of Israel were not so ignorant and stupid as to deny the general providence of God, only distrusted his particular care of them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for they say, the Lord seeth not, the Lord hath forsaken the earth; this they gave as a reason of their idolatry, because the Lord took no notice of them, did not help them when in distress; but, as they concluded, had forsaken them; therefore they betook themselves to the gods of the Egyptians, Syrians, and other nations, for their assistance and protection: for these words are not the language of Epicureans, or such who deny the providence of God in general; who think that God takes no notice of the lower world, only of the upper one, as Kimchi and others interpret them; for these elders of Israel were not so ignorant and stupid as to deny the general providence of God, only distrusted his particular care of them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then said he to me, Son of man, hast thou seen what the elders of the house of Israel {n} do in the dark, every man in the chambers of his imagery? for they say, The LORD seeth us not; the LORD hath forsaken the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then said he to me, Son of man, hast thou seen what the elders of the house of Israel ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " do in the dark, every man in the chambers of his imagery? for they say, The LORD seeth us not; the LORD hath forsaken the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) For besides their common idolatry they had particular service, which they had in secret chambers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the chambers of his imagery",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "his chambers of imagery.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The language implies that there were many chambers of imagery, and again suggests that the scene was symbolical. For “ancients” ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "elders.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " On “imagery” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 33:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forsaken the earth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather: the ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "land.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The multiplied calamities of later years suggested that Jehovah no more protected the country (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This was possibly the feeling of the elders and people in some moods, but in other moods they spoke differently. In ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they say to those already in exile, “Get you far from the Lord! unto us is this land given in possession.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Every man,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. And this, after all, was but a sample of the prevalence of the Egyptian influence. Other elders had, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the dark",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a like ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "adytum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a like chamber of imagery, like the Latin ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "lararium",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", filled. with a like cloud of incense. And though the name of the leader of the band might have warned them that the Lord was listening, they boasted, in their blindness, that Jehovah did not see them; he had forsaken the temple, and had fiche elsewhere. They thought of Jehovah as of a local deity who had abdicated. They were free to do as they liked without fear. The words are worth noting further as the first of a series of popular half proverbs, in which the thoughts of the people clothed themselves (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:2, 19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 33:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). All these imply some personal knowledge of what was passing in Jerusalem. Ezekiel 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Second Abomination: Worship of Beasts",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 8:7. And He brought me to the entrance of the court, and I saw, and behold there was a hole in the wall. Ezekiel 8:8. And He said to me, Son of man, break through the wall: and I broke through the wall, and behold there was a door. Ezekiel 8:9. And He said to me, Come and see the wicked abominations which they are doing here. Ezekiel 8:10. And I came and saw, and behold there were all kinds of figures of reptiles, and beasts, abominations, and all kinds of idols of the house of Israel, drawn on the wall round about. Ezekiel 8:11. And seventy men of the leaders of the house of Israel, with Jaazaniah the son of Shaphan standing among them, stood in front, every man with his censer in his hand; and the smell of a cloud of incense arose. Ezekiel 8:12. And He said to me, Seest thou, son of man, what the elders of the house of Israel do in the dark, every one in his image-chambers? For they say: Jehovah doth not see us; Jehovah hath forsaken the land. - The entrance of the court to which Ezekiel was now transported cannot be the principal entrance to the outer court towards the east (Ewald). This would be at variance with the context, as we not only find the prophet at the northern entrance in Ezekiel 8:3 and Ezekiel 8:5, but at Ezekiel 8:14 we find him there still. If he had been taken to the eastern gate in the meantime, this would certainly have been mentioned. As that is not the case, the reference must be to that entrance to the court which lay between the entrance-gate of the inner court (Ezekiel 8:3) and the northern entrance-gate to the house of Jehovah (Ezekiel 8:14), or northern gate of the outer court, in other words, the northern entrance into the outer court. Thus the prophet was conducted out of the inner court through its northern gate into the outer court, and placed in front of the northern gate, which led out into the open air. There he saw a hole in the wall, and on breaking through the wall, by the command of God, he saw a door, and having entered it, he saw all kinds of figures of animals engraved on the wall round about, in front of which seventy of the elders of Israel were standing and paying reverence to the images of beasts with burning incense. According to Ezekiel 8:12, the prophet was thereby shown what the elders of Israel did in the dark, every one in his image-chamber. From this explanation on the part of God concerning the picture shown to the prophet, it is very evident that it had no reference to any idolatrous worship practised by the elders in one or more of the cells of the outer court of the temple. For even though the objection raised by Kliefoth to this view, namely, that it cannot be proved that there were halls with recesses in the outer court, is neither valid nor correct, since the existence of such halls is placed beyond the reach of doubt by Jeremiah 35:4; 2 Kings 23:11, and 1 Chronicles 28:12; such a supposition is decidedly precluded by the fact, that the cells and recesses at the gates cannot have been large enough to allow of seventy-one men taking part in a festive idolatrous service. The supposition that the seventy-one men were distributed in different chambers is at variance with the distinct words of the text. The prophet not only sees the seventy elders standing along with Jaazaniah, but he could not look through one door into a number of chambers at once, and see the pictures draw all round upon their walls. The assembling of the seventy elders in a secret cell by the northern gate of the outer temple to worship the idolatrous images engraved on the walls of the cell, is one feature in the visionary form given to the revelation of what the elders of the people were doing secretly throughout the whole land. To bring out more strikingly the secrecy of this idolatrous worship, the cell is so completely hidden in the wall, that the prophet is obliged to enlarge the hole by breaking through the wall before he can see the door which leads to the cell and gain a view of them and of the things it contains, and the things that are done therein.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And He brought me to the entrance of the court, and I saw, and behold there was a hole in the wall. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And He said to me, Son of man, break through the wall: and I broke through the wall, and behold there was a door. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And He said to me, Come and see the wicked abominations which they are doing here. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I came and saw, and behold there were all kinds of figures of reptiles, and beasts, abominations, and all kinds of idols of the house of Israel, drawn on the wall round about. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And seventy men of the leaders of the house of Israel, with Jaazaniah the son of Shaphan standing among them, stood in front, every man with his censer in his hand; and the smell of a cloud of incense arose. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And He said to me, Seest thou, son of man, what the elders of the house of Israel do in the dark, every one in his image-chambers? For they say: Jehovah doth not see us; Jehovah hath forsaken the land. - The entrance of the court to which Ezekiel was now transported cannot be the principal entrance to the outer court towards the east (Ewald). This would be at variance with the context, as we not only find the prophet at the northern entrance in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we find him there still. If he had been taken to the eastern gate in the meantime, this would certainly have been mentioned. As that is not the case, the reference must be to that entrance to the court which lay between the entrance-gate of the inner court (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and the northern entrance-gate to the house of Jehovah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or northern gate of the outer court, in other words, the northern entrance into the outer court. Thus the prophet was conducted out of the inner court through its northern gate into the outer court, and placed in front of the northern gate, which led out into the open air. There he saw a hole in the wall, and on breaking through the wall, by the command of God, he saw a door, and having entered it, he saw all kinds of figures of animals engraved on the wall round about, in front of which seventy of the elders of Israel were standing and paying reverence to the images of beasts with burning incense. According to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the prophet was thereby shown what the elders of Israel did in the dark, every one in his image-chamber. From this explanation on the part of God concerning the picture shown to the prophet, it is very evident that it had no reference to any idolatrous worship practised by the elders in one or more of the cells of the outer court of the temple. For even though the objection raised by Kliefoth to this view, namely, that it cannot be proved that there were halls with recesses in the outer court, is neither valid nor correct, since the existence of such halls is placed beyond the reach of doubt by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 35:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 28:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; such a supposition is decidedly precluded by the fact, that the cells and recesses at the gates cannot have been large enough to allow of seventy-one men taking part in a festive idolatrous service. The supposition that the seventy-one men were distributed in different chambers is at variance with the distinct words of the text. The prophet not only sees the seventy elders standing along with Jaazaniah, but he could not look through one door into a number of chambers at once, and see the pictures draw all round upon their walls. The assembling of the seventy elders in a secret cell by the northern gate of the outer temple to worship the idolatrous images engraved on the walls of the cell, is one feature in the visionary form given to the revelation of what the elders of the people were doing secretly throughout the whole land. To bring out more strikingly the secrecy of this idolatrous worship, the cell is so completely hidden in the wall, that the prophet is obliged to enlarge the hole by breaking through the wall before he can see the door which leads to the cell and gain a view of them and of the things it contains, and the things that are done therein.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: \"Because the whole is exhibited pictorially and figuratively, he says that he saw one hole in a wall, and was directed to dig through and make it larger, that he might enter as if through an open door, and see the things which he could not possibly have seen while stationed outside.\" - Jerome.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the number of the persons assembled there suggests the idea of a symbolical representation, as well as the secrecy of the cell. The seventy elders represent the whole nation; and the number is taken from Exodus 24:1. and Numbers 11:16; Numbers 24:25, where Moses, by the command of God, chooses seventy of the elders to represent the whole congregation at the making of the covenant, and afterwards to support his authority. This representation of the congregation was not a permanent institution, as we may see from the fact that in Numbers 11 seventy other men are said to have been chosen for the purpose named. The high council, consisting of seventy members, the so-called Sanhedrim, was formed after the captivity on the basis of these Mosaic types. In the midst of the seventy was Jaazaniah the son of Shaphan, a different man therefore from the Jaazaniah mentioned in Ezekiel 11:1. Shaphan is probably the person mentioned as a man of distinction in 2 Kings 22:3.; Jeremiah 29:3; Jeremiah 36:10; Jeremiah 39:14. It is impossible to decide on what ground Jaazaniah is specially mentioned by name; but it can hardly be on account of the meaning of the name he bore, \"Jehovah heard,\" as Hvernick supposes. It is probable that he held a prominent position among the elders of the nation, so that he is mentioned here by name as the leader of this national representation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the number of the persons assembled there suggests the idea of a symbolical representation, as well as the secrecy of the cell. The seventy elders represent the whole nation; and the number is taken from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 24:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where Moses, by the command of God, chooses seventy of the elders to represent the whole congregation at the making of the covenant, and afterwards to support his authority. This representation of the congregation was not a permanent institution, as we may see from the fact that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " seventy other men are said to have been chosen for the purpose named. The high council, consisting of seventy members, the so-called Sanhedrim, was formed after the captivity on the basis of these Mosaic types. In the midst of the seventy was Jaazaniah the son of Shaphan, a different man therefore from the Jaazaniah mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Shaphan is probably the person mentioned as a man of distinction in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 22:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 29:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 36:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 39:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is impossible to decide on what ground Jaazaniah is specially mentioned by name; but it can hardly be on account of the meaning of the name he bore, \"Jehovah heard,\" as Hvernick supposes. It is probable that he held a prominent position among the elders of the nation, so that he is mentioned here by name as the leader of this national representation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "On the wall of the chamber round about there were drawn all kinds of figures of רמשׂ וּבהמה, reptiles and quadrupeds (see Genesis 1:24). שׁקץ is in apposition not only to בּהמה, but also to רמשׂ, and therefore, as belonging to both, is not to be connected with בּהמה in the construct state. The drawing of reptiles and quadrupeds became a sheqetz, or abomination, from the fact that the pictures had been drawn for the purpose of religious worship. The following clause, \"and all the idols of the house of Israel,\" is co-ordinate with 'כּל־תּבנית וגו. Besides the animals drawn on the walls, there were idols of other kinds in the chamber. The drawing of reptiles and quadrupeds naturally suggests the thought of the animal-worship of Egypt. We must not limit the words to this, however, since the worship of animals is met with in the nature-worship of other heathen nations, and the expression כּל־תּבנית, \"all kinds of figures,\" as well as the clause, \"all kinds of idols of the house of Israel,\" points to every possible form of idol-worship as spread abroad in Israel. עתר, according to the Aramaean usage, signifies suffimentum, perfume, בּחשׁך, in the dark, i.e., in secret, like בּסּתר in 2 Samuel 12:12; not in the sacred darkness of the cloud of incense (Hvernick). חדרי משׂכּית, image-chambers, is the term applied to the rooms or closets in the dwelling-houses of the people in which idolatrous images were set up and secretly worshipped. משׂכּית signifies idolatrous figures, as in Leviticus 26:1 and Numbers 33:52. This idolatry was justified by the elders, under the delusion that \"Jehovah seeth us not;\" that is to say, not: \"He does not trouble Himself about us,\" but He does not see what we do, because He is not omniscient (cf. Isaiah 29:15); and He has forsaken the land, withdrawn His presence and His help. Thus they deny both the omniscience and omnipresence of God (cf. Ezekiel 9:9). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On the wall of the chamber round about there were drawn all kinds of figures of רמשׂ וּבהמה, reptiles and quadrupeds (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). שׁקץ is in apposition not only to בּהמה, but also to רמשׂ, and therefore, as belonging to both, is not to be connected with בּהמה in the construct state. The drawing of reptiles and quadrupeds became a sheqetz, or abomination, from the fact that the pictures had been drawn for the purpose of religious worship. The following clause, \"and all the idols of the house of Israel,\" is co-ordinate with 'כּל־תּבנית וגו. Besides the animals drawn on the walls, there were idols of other kinds in the chamber. The drawing of reptiles and quadrupeds naturally suggests the thought of the animal-worship of Egypt. We must not limit the words to this, however, since the worship of animals is met with in the nature-worship of other heathen nations, and the expression כּל־תּבנית, \"all kinds of figures,\" as well as the clause, \"all kinds of idols of the house of Israel,\" points to every possible form of idol-worship as spread abroad in Israel. עתר, according to the Aramaean usage, signifies suffimentum, perfume, בּחשׁך, in the dark, i.e., in secret, like בּסּתר in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 12:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; not in the sacred darkness of the cloud of incense (Hvernick). חדרי משׂכּית, image-chambers, is the term applied to the rooms or closets in the dwelling-houses of the people in which idolatrous images were set up and secretly worshipped. משׂכּית signifies idolatrous figures, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 33:52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This idolatry was justified by the elders, under the delusion that \"Jehovah seeth us not;\" that is to say, not: \"He does not trouble Himself about us,\" but He does not see what we do, because He is not omniscient (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and He has forsaken the land, withdrawn His presence and His help. Thus they deny both the omniscience and omnipresence of God (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]