[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Took me by a lock of mine head.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Not, of course, literally, in the body, but in vision. Ezekiel did not actually leave Chaldæa at all, as is shown by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The door of the inner gate.—This is one of the gates which led from the court of the people to the court of the priests which was on a higher level. In the account of the building of the temple there is no mention of gates leading from the one to the other, but they would naturally have been placed there, as we know they were in the later temple of Herod. The particular gate was the one “which looketh toward the north,” as the one by which the priests went directly to the great altar.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The door of the inner gate.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This is one of the gates which led from the court of the people to the court of the priests which was on a higher level. In the account of the building of the temple there is no mention of gates leading from the one to the other, but they would naturally have been placed there, as we know they were in the later temple of Herod. The particular gate was the one “which looketh toward the north,” as the one by which the priests went directly to the great altar.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The image of jealousy is explained in the following clause, “which provoketh to jealousy.” It is not necessary to consider “jealousy” as a proper name—the name of any particular heathen divinity—but rather as a descriptive name, an image which aroused the Divine indignation. It has even been thought that it is not meant to indicate any particular idol, but is only a picture to set forth the prevailing idolatry. It is, however, altogether probable that at this time there actually were heathen idols set up in the temple, and nothing could give a more vivid picture of the corruption of priests and people alike than the mention of their presence. Idolatry had been growing more general and more bold from the time of Solomon. He built places of worship for the various idols of his wives “in the hill that is before Jerusalem” (1Kings 11:7); but Ahaz, under the influence of the Assyrian king, had placed an idolatrous altar in the temple itself, removing the brazen altar to make room (2Kings 16:10-16), and Manasseh afterwards did the same (2Kings 21:4). All the subsequent kings of Judah, except Josiah, were wicked men, and although this particular sin is not distinctly recorded of Zedekiah, yet it seems altogether likely that he too made use of the temple for idolatrous worship, and that Ezekiel in vision now saw his idols standing in the court.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The image of jealousy",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is explained in the following clause, “which provoketh to jealousy.” It is not necessary to consider “jealousy” as a proper name—the name of any particular heathen divinity—but rather as a descriptive name, an image which aroused the Divine indignation. It has even been thought that it is not meant to indicate any particular idol, but is only a picture to set forth the prevailing idolatry. It is, however, altogether probable that at this time there actually were heathen idols set up in the temple, and nothing could give a more vivid picture of the corruption of priests and people alike than the mention of their presence. Idolatry had been growing more general and more bold from the time of Solomon. He built places of worship for the various idols of his wives ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "“",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "in the hill that is before Jerusalem” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Kings 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but Ahaz, under the influence of the Assyrian king, had placed an idolatrous altar in the temple itself, removing the brazen altar to make room (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 16:10-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and Manasseh afterwards did the same (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 21:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). All the subsequent kings of Judah, except Josiah, were wicked men, and although this particular sin is not distinctly recorded of Zedekiah, yet it seems altogether likely that he too made use of the temple for idolatrous worship, and that Ezekiel in vision now saw his idols standing in the court.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 8:3-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:3-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he put forth the form of a hand ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He appeared so to do. This, and all that follows, to the end of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was done in vision only, as appears from the expression here used: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and brought me in the visions of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — In a similar manner, it was represented to the Prophet Elisha’s mind, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) what Gehazi was doing when he took the presents from Naaman, which the prophet there calls being present with Gehazi. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To Jerusalem, to the door of the inner gate — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To the entrance that goes into the inner court, called the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "court of the priests, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "where the altar of burnt-offerings stood; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "where was the seat of the image of jealousy — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“An image set up within the precincts of the temple, to provoke God to jealousy, by setting up a rival against him in the place dedicated to his own worship.” This was most probably an image of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Baal, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for that, we find, was the idol they chiefly worshipped. As it was exceedingly provoking to God to set up another object of worship besides him; so it was still more so to do this in the place which had been built for, and was dedicated to, his worship only. To speak in the figurative sense in which God is spoken of, with regard to the Jewish nation, namely, as being a husband to it, it was just the same as if the adulterer were brought into the house of the husband whom he had injured, in his very sight; therefore it is very properly called here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the image of jealousy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or that exciteth jealousy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That I should go far off from my sanctuary — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which are provocations sufficient to cause me to forsake my sanctuary, and deliver it up to be profaned by the heathen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 7:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is significantly represented by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "departing of the divine glory from the threshold of the temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-6 The glorious personage Ezekiel beheld in vision, seemed to take hold upon him, and he was conveyed in spirit to Jerusalem. There, in the inner court of the temple, was prepared a place for some base idol. The whole was presented in vision to the prophet. If it should please God to give any man a clear view of his glory and majesty, and of all the abominations committing in any one city, he would then admit the justice of the severest punishments God should inflict thereon.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the visions of God - Ezekiel was not transported \"in the body,\" but rapt \"in spirit,\" while he still sat amidst the elders of Judah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The inner gate - Or, the gate of the inner court. This gate, leading from the outer to the inner court (the court of the priests), is called Ezekiel 8:5 \"the gate of the altar,\" because it was from this side that the priests approached the brass altar. The prophet is on the \"outside\" of this gate, so that the \"image of jealousy\" was set up in the outer or people's court over against the northern entrance to the priest's court. This image was the image of a false god provoking Yahweh to \"jealousy\" Deuteronomy 32:16, Deuteronomy 32:21; 1 Kings 14:22. It may be doubted whether the scenes described in this chapter are intended to represent what actually occurred. They may be ideal pictures to indicate the idolatrous corruption of priests and people. And this is in accordance with the symbolic character of the number \"four;\" the four idolatries representing the idolatries in all the four quarters of the world. The false gods of pagandom are brought into the temple in order that they may be detected and exposed by being brought face to face with the God of revelation. Still history proves that the ideal picture was supported by actual facts which had occurred and were occurring. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The inner gate - Or, the gate of the inner court. This gate, leading from the outer to the inner court (the court of the priests), is called ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"the gate of the altar,\" because it was from this side that the priests approached the brass altar. The prophet is on the \"outside\" of this gate, so that the \"image of jealousy\" was set up in the outer or people's court over against the northern entrance to the priest's court. This image was the image of a false god provoking Yahweh to \"jealousy\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 14:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It may be doubted whether the scenes described in this chapter are intended to represent what actually occurred. They may be ideal pictures to indicate the idolatrous corruption of priests and people. And this is in accordance with the symbolic character of the number \"four;\" the four idolatries representing the idolatries in all the four quarters of the world. The false gods of pagandom are brought into the temple in order that they may be detected and exposed by being brought face to face with the God of revelation. Still history proves that the ideal picture was supported by actual facts which had occurred and were occurring. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. Instead of prompting him to address directly the elders before him, the Spirit carried him away in vision (not in person bodily) to the temple at Jerusalem; he proceeds to report to them what he witnessed: his message thus falls into two parts: (1) The abominations reported in Eze 8:1-18. (2) The dealings of judgment and mercy to be adopted towards the impenitent and penitent Israelites respectively (Eze 9:1-11:25). The exiles looked hopefully towards Jerusalem and, so far from believing things there to be on the verge of ruin, expected a return in peace; while those left in Jerusalem eyed the exiles with contempt, as if cast away from the Lord, whereas they themselves were near God and ensured in the possessions of the land (Eze 11:15). Hence the vision here of what affected those in Jerusalem immediately was a seasonable communication to the exiles away from it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "door of the inner gate—facing the north, the direction in which he came from Chebar, called the \"altar-gate\" (Eze 8:5); it opened into the inner court, wherein stood the altar of burnt offering; the inner court (1Ki 6:36) was that of the priests; the outer court (Eze 10:5), that of the people, where they assembled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "seat—the pedestal of the image.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "image of jealousy—Astarte, or Asheera (as the Hebrew for \"grove\" ought to be translated, 2Ki 21:3, 7; 23:4, 7), set up by Manasseh as a rival to Jehovah in His temple, and arresting the attention of all worshippers as they entered; it was the Syrian Venus, worshipped with licentious rites; the \"queen of heaven,\" wife of Phœnician Baal. Havernick thinks all the scenes of idolatry in the chapter are successive portions of the festival held in honor of Tammuz or Adonis (Eze 8:14). Probably, however, the scenes are separate proofs of Jewish idolatry, rather than restricted to one idol.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "provoketh to jealousy—calleth for a visitation in wrath of the \"jealous God,\" who will not give His honor to another (compare the second commandment, Ex 20:5). Jerome refers this verse to a statue of Baal, which Josiah had overthrown and his successors had replaced.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He put forth a hand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Christ. This was acted visionally, not corporally or actually, and so all that is here spoken of to the end of the 16th verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The spirit; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which indeed is the hand which took him by the head, gently, but with mighty strength. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lifted me up; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " very probably in the sight of the elders who were with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Between the earth and the heaven; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he seemed to fly as a swift bird through the air. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Brought me in the visions of God to Jerusalem; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " carried me to see Jerusalem, where in visions strange and glorious I beheld what was done there. This was no delusion, but a revelation from heaven; though all was done in an ecstasy, yet he was fully assured of every particular he saw done in the temple, whither he was carried in his spirit, not body, by the hand or Spirit of Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To the door of the inner gate; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the door of the gate of the inner court, or court of the priests, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 4:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 4:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The temple courts had four gates towards the four quarters of the world, and this was the north gate, which opened into the great court, where Ahaz had set up his Damascene altar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 16:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 16:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and where the idols were set up too. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The image, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Baal, which Manasseh had set up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 21:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 21:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Josiah had destroyed, and succeeding kings had again set up. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of jealousy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because it was so notorious an affront to God, who had married Israel to himself, that above all other it provoked him to anger against this people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he put forth the form of an hand,.... That is, he that appeared in the likeness of a man, and with so much glory and splendour, out of the midst of the fire and brightness which were about him, put forth the form of a hand, that looked like a man's hand; for this appearance was not real, only visionary; and this seems to design the Spirit of God sent forth by Christ, sometimes called the finger of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as appears by what follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and took me by a lock of mine head; without hurting him, showing his power over him; and by this means raising him from his seat, as it seemed to the prophet: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the spirit lifted me up between the earth and heaven; took him off of his seat, and out of his house, lifted him up in the air, and carried him through it, as he thought; for this was not real and local; in like manner as the spirit caught away Philip, Acts 8:39; but in vision, as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the spirit lifted me up between the earth and heaven; took him off of his seat, and out of his house, lifted him up in the air, and carried him through it, as he thought; for this was not real and local; in like manner as the spirit caught away Philip, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 8:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but in vision, as follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and brought me in the visions of God to Jerusalem; so it was represented to him in a true vision, which was of God, and not of Satan, that he was carried from Chaldea to Jerusalem; not that he really was, for he was still in Chaldea; and here in vision was he brought again, and found himself to be when that vision was over, Ezekiel 11:24; but things so appeared to him, as if he was actually brought to Jerusalem by the power of the Spirit of God: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and brought me in the visions of God to Jerusalem; so it was represented to him in a true vision, which was of God, and not of Satan, that he was carried from Chaldea to Jerusalem; not that he really was, for he was still in Chaldea; and here in vision was he brought again, and found himself to be when that vision was over, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but things so appeared to him, as if he was actually brought to Jerusalem by the power of the Spirit of God: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "to the door of the inner gate: not of Jerusalem, but the temple, or rather the court, the inner court; see Ezekiel 10:3; and so it should be rendered \"to the door of the gate of the inner court\" (s); and thus it is explained by Jarchi, Kimchi, and Ben Melech: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to the door of the inner gate: not of Jerusalem, but the temple, or rather the court, the inner court; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 10:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so it should be rendered \"to the door of the gate of the inner court\" (s); and thus it is explained by Jarchi, Kimchi, and Ben Melech: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "that looketh toward the north; for there were gates on every side: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "where was the seat of the image of jealousy, which provoketh to jealousy; some graven image, perhaps the image of Baal; so called, because it provoked the Lord to jealousy, Deuteronomy 32:21. Gussetius (t) suggests, that  \"Semel\", here may be the same with Semele; who, in the opinion of the Heathens, made Juno jealous. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "where was the seat of the image of jealousy, which provoketh to jealousy; some graven image, perhaps the image of Baal; so called, because it provoked the Lord to jealousy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Gussetius (t) suggests, that  \"Semel\", here may be the same with Semele; who, in the opinion of the Heathens, made Juno jealous. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s)    \"ad ostium portae interioris, sub. atrii\", Pagninus, Vatablus, Piscator. (t) Ebr. Comment. p. 903. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s)    \"ad ostium portae interioris, sub. atrii\", Pagninus, Vatablus, Piscator. (t) Ebr. Comment. p. 903. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he put forth the form of an hand, and took me by a lock of my head; and the spirit lifted me up between the earth and the heaven, and brought me in the {d} visions of God to Jerusalem, to the door of the inner {e} gate that looketh toward the north; where was the seat of the image of {f} jealousy, which provoketh to jealousy.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he put forth the form of an hand, and took me by a lock of my head; and the spirit lifted me up between the earth and the heaven, and brought me in the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " visions of God to Jerusalem, to the door of the inner ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gate that looketh toward the north; where ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "was",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the seat of the image of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " jealousy, which provoketh to jealousy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Meaning that he was thus carried in spirit, and not in body.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Which was the porch or the court where the people assembled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) So called, because it provoked God's indignation, which was the idol of Baal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He does not even say that it ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the divine hand that carried him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " carried him, the form of the divine hand was merely symbolical.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the visions of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. shewn him by God, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "door of the inner gate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather: door of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the gate of the inner court",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " looking toward the north, i.e. the northern gate of the inner court. The word “inner” is wanting in LXX. The general opinion has been that the prophet was set down in the inner court, at the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " door of the northern gateway into that court. The term “door,” however, seems in usage to mean the outside entrance; and if the prophet had stood in the inner court he would have had to look northward through the gateway in order to see the image of jealousy, which was certainly not in the inner court. It is more natural to suppose him set down in the outer court, in front of the gateway leading into the inner court. In front of this gateway, in the outer court, stood the image of jealousy, near the entrance. Having seen this the prophet is next brought ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "into",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the gateway (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 8:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), where he enters the chamber of imagery, some one of the cells in the gateway building. From there he is carried outside the sacred enclosure altogether to the north door of the outer court (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 8:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), where he finds the women bewailing Tammuz. And finally he is transported into the inner court where he beholds the sun-worship practised in front of the temple-house itself. Previous to this he had not been in the inner court, for when being shewn the idolatries he is always taken to the precise place where they are practised.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "image of jealousy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not an image of “jealousy” itself, considered as a deity, but an image which because it provoked to jealousy was named image of jealousy. The “jealousy” of God is a violent emotion or resentment arising from the feeling of being injured (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is uncertain what this image was. The word occurs again, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the sense of similitude or “figure,” and in Phenician with the meaning of “statue,” e.g. in an inscription from Idalion (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Corp. Ins. Sem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., vol. i. 88, 3, 7, &c.). According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 21:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Manasseh put a graven image of Ashera in the house of the Lord, which Josiah brought out and burnt (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 33:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 33:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In earlier times the Ashera (A.V. grove) was a tree or pole planted beside an altar. It is not quite certain whether the pole or stock was a substitute for the evergreen tree, when this could not be had, or whether like the sun-image it was the symbol of a goddess. In later times the term seems used as the name of a goddess. The expression “in the house of the Lord” is hardly to be pressed so far as to imply that Manasseh placed the Ashera in the temple proper, “house” is used of the whole temple buildings, including the courts. The image here may be this Ashera, whether we are to suppose it replaced after Josiah had burnt it, or whether the prophet be here taking a comprehensive view of the idolatries of Israel, including the time of Manasseh. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reference is made to the horses of the sun placed “at the entering in of the house of the Lord,” but these would scarcely be called an “image.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The form of an hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For the mode of transit, see Bel and the Dragon, ver. 36. as probably a direct imitation. The touch of the \"hand\" was followed by the action of the Spirit, in visions which he knew to be more than dreams, visions that came from God (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 40:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The word is not the same as that commonly used by Daniel (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "chazon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and often by Ezekiel himself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 12:22, 23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mareh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which implies a more direct act of intuition. The word appears again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 11:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 8:26, 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et al. To the door of the gate,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "et al. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "To the door of the gate,",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. From the first we trace the priest's familiarity with the structure of the temple. He is brought, as it were, after his journey in the spirit, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "to the door of the gate of the inner court that looketh towards the north",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). This is identified in ver. 5 with the \"gate of the altar.\" It may probably also be identified with the \"upper gate\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the \"high gate\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the \"higher gate\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", built by Jotham; the \"new gate\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 36:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Obviously it was one of the most conspicuous portions of the temple, where the people gathered in large numbers. And here the prophet sees what he calls ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the image of jealousy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words that follow probably give his explanation of the strange phrase, not found elsewhere, though it might naturally be suggested by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:16, 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What this image was we can only conjecture. The word for \"image\" is a rare one, and is found only here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 33:7, 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It may have been the Asherah (the \"grove\" of the Authorized Version), or conical stone, such as Manasseh had made and placed, with an altar dedicated to it, in the house of the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 21:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or one of Baal, or of Ashtaroth, or even of Tammuz (see ver. 14). As the word \"grove\" does not occur in Ezekiel, it may be sufficient to state that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Ashera",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was a pillar symbolical either of a goddess of the same name, or, as some think, of the Phoenician Astarte. The worship seems to have first become popular under Jezebel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and took deep root both in Israel and Judah. The cultus, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 23:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", seems to have been connected with the foulest licence, like that of the Babylonian Mylitta (Herod., 1:199; Baruch 6:43). The work of Josiah had clearly had but a temporary success, and the people had gone back to the confluent polytheism of the reign of Manasseh. In such a state of things the worst was possible. For recent discussions on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Ashera",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see Kuenen. 'Relig. Isr.' (Eng. transl.), 1:88; Schrader; Robertson Smith, 'Relig. of Semites,' p. 172; and T.K. Cheyne, in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Academy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of December 14, 1889. Ezekiel 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abominations of the Idolatry of the House of Israel",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Time and place of the divine revelation. - Ezekiel 8:1. And it came to pass in the sixth year, in the sixth (month), on the fifth (day) of the month, I was sitting in my house, and the elders of Judah were sitting before me; there fell upon me the hand of the Lord Jehovah there. Ezekiel 8:2. And I saw, and behold a figure like the look of fire, from the look of its loins downwards fire, and from its loins upwards like a look of brilliance, like the sight of red-hot brass. Ezekiel 8:3. And he stretched out the form of a hand, and took me by the locks of my head, and wind carried me away between earth and heaven, and brought me to Jerusalem in visions of God, to the entrance of the gate of the inner court, which faces towards the north, where the image of jealousy exciting jealousy had its stand. Ezekiel 8:4. And, behold, the glory of the God of Israel was there, like the vision which I have seen in the valley. - The place where Ezekiel received this new theophany agrees with the statements in Ezekiel 3:24 and Ezekiel 4:4, Ezekiel 4:6, that he was to shut himself up in his house, and lie 390 days upon the left side, and 40 days upon the right side - in all, 430 days. The use of the word יושׁב, \"I sat,\" is not at variance with this, as ישׁב does not of necessity signify sitting as contrasted with lying, but may also be used in the more general sense of staying, or living, in the house. Nor is the presence of the elders of Judah opposed to the command, in Ezekiel 3:24, to shut himself up in the house, as we have already observed in the notes on that passage. The new revelation is made to him in the presence of these elders, because it is of the greatest importance to them. They are to be witnesses of his ecstasy; and after this has left the prophet, are to hear from his lips the substance of the divine revelation (Ezekiel 11:25). It is otherwise with the time of the revelation. If we compare the date given in Ezekiel 8:1 with those mentioned before, this new vision apparently falls within the period required for carrying out the symbolical actions of the previous vision. Between Ezekiel 1:1-2 (the fifth day of the fourth month in the fifth year) and Ezekiel 8:1 (the fifth day of the sixth month in the sixth year) we have one year and two months, that is to say (reckoning the year as a lunar year at 354 days, and the two months at 59 days), 413 days; whereas the two events recorded in Ezekiel 1-7 require at least 437 days, namely 7 days for Ezekiel 3:15, and 390 + 40  equals  430 days for Ezekiel 4:5-6. Consequently the new theophany would fall within the 40 days, during which Ezekiel was to lie upon the right side for Judah. To get rid of this difficulty, Hitzig conjectures that the fifth year of Jehoiachin (Ezekiel 1:2) was a leap year of 13 months or 385 days, by which he obtains an interval of 444 days after adding 59 for the two months, - a period sufficient not only to include the 7 days (Ezekiel 3:15) and 390 + 40 days (Ezekiel 4:5-6), but to leave 7 days for the time that elapsed between Ezekiel 7 and 8. But however attractive this reckoning may appear, the assumption that the fifth year of the captivity of Jehoiachin was a leap year is purely conjectural; and there is nothing whatever to give it probability. Consequently the only thing that could lead us to adopt such a solution, would be the impossibility of reconciling the conclusion to be drawn from the chronological data, as to the time of the two theophanies, with the substance of these divine revelations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Time and place of the divine revelation. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And it came to pass in the sixth year, in the sixth (month), on the fifth (day) of the month, I was sitting in my house, and the elders of Judah were sitting before me; there fell upon me the hand of the Lord Jehovah there. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And I saw, and behold a figure like the look of fire, from the look of its loins downwards fire, and from its loins upwards like a look of brilliance, like the sight of red-hot brass. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And he stretched out the form of a hand, and took me by the locks of my head, and wind carried me away between earth and heaven, and brought me to Jerusalem in visions of God, to the entrance of the gate of the inner court, which faces towards the north, where the image of jealousy exciting jealousy had its stand. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And, behold, the glory of the God of Israel was there, like the vision which I have seen in the valley. - The place where Ezekiel received this new theophany agrees with the statements in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that he was to shut himself up in his house, and lie 390 days upon the left side, and 40 days upon the right side - in all, 430 days. The use of the word יושׁב, \"I sat,\" is not at variance with this, as ישׁב does not of necessity signify sitting as contrasted with lying, but may also be used in the more general sense of staying, or living, in the house. Nor is the presence of the elders of Judah opposed to the command, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to shut himself up in the house, as we have already observed in the notes on that passage. The new revelation is made to him in the presence of these elders, because it is of the greatest importance to them. They are to be witnesses of his ecstasy; and after this has left the prophet, are to hear from his lips the substance of the divine revelation (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is otherwise with the time of the revelation. If we compare the date given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with those mentioned before, this new vision apparently falls within the period required for carrying out the symbolical actions of the previous vision. Between ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (the fifth day of the fourth month in the fifth year) and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (the fifth day of the sixth month in the sixth year) we have one year and two months, that is to say (reckoning the year as a lunar year at 354 days, and the two months at 59 days), 413 days; whereas the two events recorded in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " require at least 437 days, namely 7 days for ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and 390 + 40  equals  430 days for ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Consequently the new theophany would fall within the 40 days, during which Ezekiel was to lie upon the right side for Judah. To get rid of this difficulty, Hitzig conjectures that the fifth year of Jehoiachin (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") was a leap year of 13 months or 385 days, by which he obtains an interval of 444 days after adding 59 for the two months, - a period sufficient not only to include the 7 days (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and 390 + 40 days (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but to leave 7 days for the time that elapsed between ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 8. But however attractive this reckoning may appear, the assumption that the fifth year of the captivity of Jehoiachin was a leap year is purely conjectural; and there is nothing whatever to give it probability. Consequently the only thing that could lead us to adopt such a solution, would be the impossibility of reconciling the conclusion to be drawn from the chronological data, as to the time of the two theophanies, with the substance of these divine revelations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If we assume that Ezekiel carried out the symbolical acts mentioned in Ezekiel 4 and 5 in all their entirety, we can hardly imagine that the vision described in the chapters before us, by which he was transported in spirit to Jerusalem, occurred within the period of forty days, during which he was to typify the siege of Jerusalem by lying upon his right side. Nevertheless, Kliefoth has decided in favour of this view, and argues in support of it, that the vision described in Ezekiel 8:1. took place in the prophet's own house, that it is identical in substance with what is contained in Ezekiel 3:22-7:27, and that there is no discrepancy, because all that occurred here was purely internal, and the prophet himself was to address the words contained in Ezekiel 11:4-12 and Ezekiel 11:14-21 to the inhabitants of Jerusalem in his state of ecstasy. Moreover, when it is stated in Ezekiel 11:25 that Ezekiel related to the exiles all that he had seen in the vision, it is perfectly open to us to assume that this took place at the same time as his report to them of the words of God in Ezekiel 6:1-14 and 7, and those which follow in Ezekiel 12. But. on the other hand, it may be replied that the impression produced by Ezekiel 11:25 is not that the prophet waited several weeks after his visionary transport to Jerusalem before communicating to the elders what he saw in the vision. And even if the possibility of this cannot be disputed, we cannot imagine any reason why the vision should be shown to the prophet four weeks before it was to be related to the exiles. Again, there is not sufficient identity between the substance of the vision in Ezekiel 8-11 and the revelation in Ezekiel 4-7, to suggest any motive for the two to coincide. It is true that the burning of Jerusalem, which Ezekiel sees in Ezekiel 8-11, is consequent upon the siege and conquest of that city, which he has already predicted in Ezekiel 4-7 both in figure and word; but they are not so closely connected, that it was necessary on account of this connection for it to be shown to him before the completion of the symbolical siege of Jerusalem. And, lastly, although the ecstasy as a purely internal process is so far reconcilable with the prophet's lying upon his right side, that this posture did not preclude a state of ecstasy or render it impossible, yet this collision would ensue, that while the prophet was engaged in carrying out the former word of God, a new theophany would be received by him, which must necessarily abstract his mind from the execution of the previous command of God, and place him in a condition in which it would be impossible for him to set his face firmly upon the siege of Jerusalem, as he had been commanded to do in Ezekiel 4:7. On account of this collision, we cannot subscribe to the assumption, that it was during the time that Ezekiel was lying bound by God upon his right side to bear the sin of Jerusalem, that he was transported in spirit to the temple at Jerusalem. On the contrary, the fact that this transport occurred, according to Ezekiel 8:1, at a time when he could not have ended the symbolical acts of Ezekiel 4, if he had been required to carry them out in all their external reality, furnishes us with conclusive evidence of the correctness of the view we have already expressed, that the symbolical acts of Ezekiel 4 and 5 did not lie within the sphere of outward reality (see comm. on Ezekiel 5:4). - And if Ezekiel did not really lie for 430 days, there was nothing to hinder his having a fresh vision 14 months after the theophany in Ezekiel 1 and Ezekiel 3:22. For 'תּפּל עלי יד , see at Ezekiel 3:22 and Ezekiel 1:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If we assume that Ezekiel carried out the symbolical acts mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 5 in all their entirety, we can hardly imagine that the vision described in the chapters before us, by which he was transported in spirit to Jerusalem, occurred within the period of forty days, during which he was to typify the siege of Jerusalem by lying upon his right side. Nevertheless, Kliefoth has decided in favour of this view, and argues in support of it, that the vision described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". took place in the prophet's own house, that it is identical in substance with what is contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:22-7:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and that there is no discrepancy, because all that occurred here was purely internal, and the prophet himself was to address the words contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:4-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:14-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the inhabitants of Jerusalem in his state of ecstasy. Moreover, when it is stated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that Ezekiel related to the exiles all that he had seen in the vision, it is perfectly open to us to assume that this took place at the same time as his report to them of the words of God in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 6:1-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 7, and those which follow in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But. on the other hand, it may be replied that the impression produced by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not that the prophet waited several weeks after his visionary transport to Jerusalem before communicating to the elders what he saw in the vision. And even if the possibility of this cannot be disputed, we cannot imagine any reason why the vision should be shown to the prophet four weeks before it was to be related to the exiles. Again, there is not sufficient identity between the substance of the vision in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and the revelation in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to suggest any motive for the two to coincide. It is true that the burning of Jerusalem, which Ezekiel sees in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is consequent upon the siege and conquest of that city, which he has already predicted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " both in figure and word; but they are not so closely connected, that it was necessary on account of this connection for it to be shown to him before the completion of the symbolical siege of Jerusalem. And, lastly, although the ecstasy as a purely internal process is so far reconcilable with the prophet's lying upon his right side, that this posture did not preclude a state of ecstasy or render it impossible, yet this collision would ensue, that while the prophet was engaged in carrying out the former word of God, a new theophany would be received by him, which must necessarily abstract his mind from the execution of the previous command of God, and place him in a condition in which it would be impossible for him to set his face firmly upon the siege of Jerusalem, as he had been commanded to do in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On account of this collision, we cannot subscribe to the assumption, that it was during the time that Ezekiel was lying bound by God upon his right side to bear the sin of Jerusalem, that he was transported in spirit to the temple at Jerusalem. On the contrary, the fact that this transport occurred, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", at a time when he could not have ended the symbolical acts of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", if he had been required to carry them out in all their external reality, furnishes us with conclusive evidence of the correctness of the view we have already expressed, that the symbolical acts of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 5 did not lie within the sphere of outward reality (see comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). - And if Ezekiel did not really lie for 430 days, there was nothing to hinder his having a fresh vision 14 months after the theophany in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For 'תּפּל עלי יד , see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The figure which Ezekiel sees in the vision is described in Ezekiel 8:2 in precisely the same terms as the appearance of God in Ezekiel 1:27. The sameness of the two passages is a sufficient defence of the reading כּמראה־אשׁ against the arbitrary emendation אישׁ 'כם, after the Sept. rendering ὁμοίωμα ἀνδρός, in support of which Ewald and Hitzig appeal to Ezekiel 1:26, though without any reason, as the reading there is not אישׁ, but אדם. It is not expressly stated here that the apparition was in human form - the fiery appearance is all that is mentioned; but this is taken for granted in the allusion to the מתנים (the loins), either as self-evident, or as well known from Ezekiel 1. זהר is synonymous with נגהּ in Ezekiel 1:4, Ezekiel 1:27. What is new in the present theophany is the stretching out of the hand, which grasps the prophet by the front hair of his head, whereupon he is carried by wind between heaven and earth, i.e., through the air, to Jerusalem, not in the body, but in visions of God (cf. Ezekiel 1:1), that is to say, in spiritual ecstasy, and deposited at the entrance of the inner northern door of the temple. הפּנימית is not an adjective belonging to שׁער, for this is not a feminine noun, but is used as a substantive, as in Ezekiel 43:5 ( equals  החצר הפּנימית: cf. Ezekiel 40:40): gate of the inner court, i.e., the gate on the north side of the inner court which led into the outer court. We are not informed whether Ezekiel was placed on the inner or outer side of this gate, i.e., in the inner or outer court; but it is evident from Ezekiel 8:5 that he was placed in the inner court, as his position commanded a view of the image which stood at the entrance of the gate towards the north. The further statement, \"where the standing place of the image of jealousy was,\" anticipates what follows, and points out the reason why the prophet was placed just there. The expression \"image of jealousy\" is explained by המּקנה, which excites the jealousy of Jehovah (see the comm. on Exodus 20:5). Consequently, we have not to think of any image of Jehovah, but of an image of a heathen idol (cf. Deuteronomy 32:21); probably of Baal or Asherah, whose image had already been placed in the temple by Manasseh (2 Kings 21:7); certainly not the image of the corpse of Adonis moulded in wax or clay. This opinion, which Hvernick advances, is connected with the erroneous assumption that all the idolatrous abominations mentioned in this chapter relate to the celebration of an Adonis-festival in the temple. There (Ezekiel 8:4) in the court of the temple Ezekiel saw once more the glory of the God of Israel, as he had seen it in the valley (Ezekiel 3:22) by the Chaboras, i.e., the appearance of God upon the throne with the cherubim and wheels; whereas the divine figure, whose hand grasped him in his house, and transported him to the temple (Ezekiel 8:2), showed neither throne nor cherubim. The expression \"God of Israel,\" instead of Jehovah (Ezekiel 3:23), is chosen as an antithesis to the strange god, the heathen idol, whose image stood in the temple. As the God of Israel, Jehovah cannot tolerate the image and worship of another god in His temple. To set up such an image in the temple of Jehovah was a practical renunciation of the covenant, a rejection of Jehovah on the part of Israel as its covenant God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The figure which Ezekiel sees in the vision is described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in precisely the same terms as the appearance of God in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The sameness of the two passages is a sufficient defence of the reading כּמראה־אשׁ against the arbitrary emendation אישׁ 'כם, after the Sept. rendering ὁμοίωμα ἀνδρός, in support of which Ewald and Hitzig appeal to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though without any reason, as the reading there is not אישׁ, but אדם. It is not expressly stated here that the apparition was in human form - the fiery appearance is all that is mentioned; but this is taken for granted in the allusion to the מתנים (the loins), either as self-evident, or as well known from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". זהר is synonymous with נגהּ in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". What is new in the present theophany is the stretching out of the hand, which grasps the prophet by the front hair of his head, whereupon he is carried by wind between heaven and earth, i.e., through the air, to Jerusalem, not in the body, but in visions of God (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that is to say, in spiritual ecstasy, and deposited at the entrance of the inner northern door of the temple. הפּנימית is not an adjective belonging to שׁער, for this is not a feminine noun, but is used as a substantive, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 43:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ( equals  החצר הפּנימית: cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): gate of the inner court, i.e., the gate on the north side of the inner court which led into the outer court. We are not informed whether Ezekiel was placed on the inner or outer side of this gate, i.e., in the inner or outer court; but it is evident from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that he was placed in the inner court, as his position commanded a view of the image which stood at the entrance of the gate towards the north. The further statement, \"where the standing place of the image of jealousy was,\" anticipates what follows, and points out the reason why the prophet was placed just there. The expression \"image of jealousy\" is explained by המּקנה, which excites the jealousy of Jehovah (see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Consequently, we have not to think of any image of Jehovah, but of an image of a heathen idol (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); probably of Baal or Asherah, whose image had already been placed in the temple by Manasseh (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 21:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); certainly not the image of the corpse of Adonis moulded in wax or clay. This opinion, which Hvernick advances, is connected with the erroneous assumption that all the idolatrous abominations mentioned in this chapter relate to the celebration of an Adonis-festival in the temple. There (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in the court of the temple Ezekiel saw once more the glory of the God of Israel, as he had seen it in the valley (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") by the Chaboras, i.e., the appearance of God upon the throne with the cherubim and wheels; whereas the divine figure, whose hand grasped him in his house, and transported him to the temple (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), showed neither throne nor cherubim. The expression \"God of Israel,\" instead of Jehovah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is chosen as an antithesis to the strange god, the heathen idol, whose image stood in the temple. As the God of Israel, Jehovah cannot tolerate the image and worship of another god in His temple. To set up such an image in the temple of Jehovah was a practical renunciation of the covenant, a rejection of Jehovah on the part of Israel as its covenant God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Here, in the temple, Jehovah shows to the prophet the various kinds of idolatry which Israel is practising both publicly and privately, not merely in the temple, but throughout the whole land. The arrangement of these different forms of idolatry in four groups of abomination scenes (Ezekiel 8:5, Ezekiel 8:6, Ezekiel 8:7-12, Ezekiel 8:13-15, and Ezekiel 8:16-18), which the prophet sees both in and from the court of the temple, belong to the visionary drapery of this divine revelation. It is altogether erroneous to interpret the vision as signifying that all these forms of idolatry were practised in the temple itself; an assumption which cannot be carried out without doing violence to the description, more especially of the second abomination in Ezekiel 8:7-12. Still more untenable is Hvernick's view, that the four pictures of idolatrous practices shown to the prophet are only intended to represent different scenes of a festival of Adonis held in the temple. The selection of the courts of the temple for depicting the idolatrous worship, arises from the fact that the temple was the place where Israel was called to worship the Lord its God. Consequently the apostasy of Israel from the Lord could not be depicted more clearly and strikingly than by the following series of pictures of idolatrous abominations practised in the temple under the eyes of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Here, in the temple, Jehovah shows to the prophet the various kinds of idolatry which Israel is practising both publicly and privately, not merely in the temple, but throughout the whole land. The arrangement of these different forms of idolatry in four groups of abomination scenes (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:7-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:13-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:16-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which the prophet sees both in and from the court of the temple, belong to the visionary drapery of this divine revelation. It is altogether erroneous to interpret the vision as signifying that all these forms of idolatry were practised in the temple itself; an assumption which cannot be carried out without doing violence to the description, more especially of the second abomination in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 8:7-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Still more untenable is Hvernick's view, that the four pictures of idolatrous practices shown to the prophet are only intended to represent different scenes of a festival of Adonis held in the temple. The selection of the courts of the temple for depicting the idolatrous worship, arises from the fact that the temple was the place where Israel was called to worship the Lord its God. Consequently the apostasy of Israel from the Lord could not be depicted more clearly and strikingly than by the following series of pictures of idolatrous abominations practised in the temple under the eyes of God. ",
            "children": []
          }
        ]
      }
    ]
  }
]