[{"header":"What contaminates a life?"},{"num":7,"verse":"The Pharisees and some legal experts from Jerusalem gathered around Jesus."},{"num":2,"verse":"They saw some of his disciples eating food with unclean hands. (They were eating without first ritually purifying their hands through washing."},{"num":3,"verse":"The Pharisees and all the Jews don’t eat without first washing their hands carefully. This is a way of observing the rules handed down by the elders."},{"num":4,"verse":"Upon returning from the marketplace, they don’t eat without first immersing themselves. They observe many other rules that have been handed down, such as the washing of cups, jugs, pans, and sleeping mats.)"},{"num":5,"verse":"So the Pharisees and legal experts asked Jesus, “Why are your disciples not living according to the rules handed down by the elders but instead eat food with ritually unclean hands?”"},{"num":6,"verse":"He replied, “Isaiah really knew what he was talking about when he prophesied about you hypocrites. He wrote,"},{"num":8,"verse":"You ignore God’s commandment while holding on to rules created by humans and handed down to you.”"},{"num":9,"verse":"Jesus continued, “Clearly, you are experts at rejecting God’s commandment in order to establish these rules."},{"num":10,"verse":"Moses said, Honor your father and your mother, and The person who speaks against father or mother will certainly be put to death."},{"num":11,"verse":"But you say, ‘If you tell your father or mother, “Everything I’m expected to contribute to you is corban(that is, a gift I’m giving to God),”"},{"num":12,"verse":"then you are no longer required to care for your father or mother.’"},{"num":13,"verse":"In this way you do away with God’s word in favor of the rules handed down to you, which you pass on to others. And you do a lot of other things just like that.”"},{"num":14,"verse":"Then Jesus called the crowd again and said, “Listen to me, all of you, and understand."},{"num":15,"verse":"Nothing outside of a person can enter and contaminate a person in God’s sight; rather, the things that come out of a person contaminate the person.”"},{"num":17,"verse":"After leaving the crowd, he entered a house where his disciples asked him about that riddle."},{"num":18,"verse":"He said to them, “Don’t you understand either? Don’t you know that nothing from the outside that enters a person has the power to contaminate?"},{"num":19,"verse":"That’s because it doesn’t enter into the heart but into the stomach, and it goes out into the sewer.” By saying this, Jesus declared that no food could contaminate a person in God’s sight."},{"num":20,"verse":"“It’s what comes out of a person that contaminates someone in God’s sight,” he said."},{"num":21,"verse":"“It’s from the inside, from the human heart, that evil thoughts come: sexual sins, thefts, murders,"},{"num":22,"verse":"adultery, greed, evil actions, deceit, unrestrained immorality, envy, insults, arrogance, and foolishness."},{"num":23,"verse":"All these evil things come from the inside and contaminate a person in God’s sight.”"},{"header":"An immigrant’s daughter is delivered"},{"num":24,"verse":"Jesus left that place and went into the region of Tyre. He didn’t want anyone to know that he had entered a house, but he couldn’t hide."},{"num":25,"verse":"In fact, a woman whose young daughter was possessed by an unclean spirit heard about him right away. She came and fell at his feet."},{"num":26,"verse":"The woman was Greek, Syrophoenician by birth. She begged Jesus to throw the demon out of her daughter."},{"num":27,"verse":"He responded, “The children have to be fed first. It isn’t right to take the children’s bread and toss it to the dogs.”"},{"num":28,"verse":"But she answered, “Lord, even the dogs under the table eat the children’s crumbs.”"},{"num":29,"verse":"“Good answer!” he said. “Go on home. The demon has already left your daughter.”"},{"num":30,"verse":"When she returned to her house, she found the child lying on the bed and the demon gone."},{"header":"A deaf man is healed"},{"num":31,"verse":"After leaving the region of Tyre, Jesus went through Sidon toward the Galilee Sea through the region of the Ten Cities."},{"num":32,"verse":"Some people brought to him a man who was deaf and could hardly speak, and they begged him to place his hand on the man for healing."},{"num":33,"verse":"Jesus took him away from the crowd by himself and put his fingers in the man’s ears. Then he spit and touched the man’s tongue."},{"num":34,"verse":"Looking into heaven, Jesus sighed deeply and said, “Ephphatha,” which means, “Open up.”"},{"num":35,"verse":"At once, his ears opened, his twisted tongue was released, and he began to speak clearly."},{"num":36,"verse":"Jesus gave the people strict orders not to tell anyone. But the more he tried to silence them, the more eagerly they shared the news."},{"num":37,"verse":"People were overcome with wonder, saying, “He does everything well! He even makes the deaf to hear and gives speech to those who can’t speak.”"}]