[{"header":"Chapter 7"},{"num":1,"verse":"The Tradition of the Elders. Now when the Pharisees with some scribes who had come from Jerusalem gathered around him, "},{"num":2,"verse":"they observed that some of his disciples ate their meals with unclean, that is, unwashed, hands. "},{"num":3,"verse":"(For the Pharisees and, in fact, all Jews, do not eat without carefully washing their hands, keeping the tradition of the elders. "},{"num":4,"verse":"And on coming from the marketplace they do not eat without purifying themselves. And there are many other things that they have traditionally observed, the purification of cups and jugs and kettles [and beds].) "},{"num":5,"verse":"So the Pharisees and scribes questioned him, “Why do your disciples not follow the tradition of the elders but instead eat a meal with unclean hands?” "},{"num":6,"verse":"He responded, “Well did Isaiah prophesy about you hypocrites, as it is written:"},{"num":8,"verse":"You disregard God’s commandment but cling to human tradition.” "},{"num":9,"verse":"He went on to say, “How well you have set aside the commandment of God in order to uphold your tradition! "},{"num":10,"verse":"For Moses said, ‘Honor your father and your mother,’ and ‘Whoever curses father or mother shall die.’ "},{"num":11,"verse":"Yet you say, ‘If a person says to father or mother, “Any support you might have had from me is qorban”’ (meaning, dedicated to God), "},{"num":12,"verse":"you allow him to do nothing more for his father or mother. "},{"num":13,"verse":"You nullify the word of God in favor of your tradition that you have handed on. And you do many such things.” "},{"num":14,"verse":"He summoned the crowd again and said to them, “Hear me, all of you, and understand. "},{"num":15,"verse":"Nothing that enters one from outside can defile that person; but the things that come out from within are what defile.” "},{"num":16,"verse":"[]"},{"num":17,"verse":"When he got home away from the crowd his disciples questioned him about the parable. "},{"num":18,"verse":"He said to them, “Are even you likewise without understanding? Do you not realize that everything that goes into a person from outside cannot defile, "},{"num":19,"verse":"since it enters not the heart but the stomach and passes out into the latrine?” (Thus he declared all foods clean.) "},{"num":20,"verse":"“But what comes out of a person, that is what defiles. "},{"num":21,"verse":"From within people, from their hearts, come evil thoughts, unchastity, theft, murder, "},{"num":22,"verse":"adultery, greed, malice, deceit, licentiousness, envy, blasphemy, arrogance, folly. "},{"num":23,"verse":"All these evils come from within and they defile.”"},{"num":24,"verse":"The Syrophoenician Woman’s Faith. From that place he went off to the district of Tyre. He entered a house and wanted no one to know about it, but he could not escape notice. "},{"num":25,"verse":"Soon a woman whose daughter had an unclean spirit heard about him. She came and fell at his feet. "},{"num":26,"verse":"The woman was a Greek, a Syrophoenician by birth, and she begged him to drive the demon out of her daughter. "},{"num":27,"verse":"He said to her, “Let the children be fed first. For it is not right to take the food of the children and throw it to the dogs.” "},{"num":28,"verse":"She replied and said to him, “Lord, even the dogs under the table eat the children’s scraps.” "},{"num":29,"verse":"Then he said to her, “For saying this, you may go. The demon has gone out of your daughter.” "},{"num":30,"verse":"When the woman went home, she found the child lying in bed and the demon gone."},{"num":31,"verse":"The Healing of a Deaf Man. Again he left the district of Tyre and went by way of Sidon to the Sea of Galilee, into the district of the Decapolis. "},{"num":32,"verse":"And people brought to him a deaf man who had a speech impediment and begged him to lay his hand on him. "},{"num":33,"verse":"He took him off by himself away from the crowd. He put his finger into the man’s ears and, spitting, touched his tongue; "},{"num":34,"verse":"then he looked up to heaven and groaned, and said to him, “Ephphatha!” (that is, “Be opened!”) "},{"num":35,"verse":"And [immediately] the man’s ears were opened, his speech impediment was removed, and he spoke plainly. "},{"num":36,"verse":"He ordered them not to tell anyone. But the more he ordered them not to, the more they proclaimed it. "},{"num":37,"verse":"They were exceedingly astonished and they said, “He has done all things well. He makes the deaf hear and [the] mute speak.”"}]