[{"num":8,"verse":"1 The destruction of Judah and Israel, because of their idolatry."},{"num":1,"verse":"Set the trumpet to thy mouth: he shall come as an eagle against the House of the Lord, because they have transgressed my covenant, and trespassed against my Law."},{"num":2,"verse":"Israel shall cry unto me, My God, we know thee."},{"num":3,"verse":"Israel hath cast off the thing that is good: the enemy shall pursue him."},{"num":4,"verse":"They have set up a king, but not by me: they have made princes, and I knew it not: of their silver and their gold have they made them idols: therefore shall they be destroyed."},{"num":5,"verse":"Thy calf, O Samaria, hath cast thee off: mine anger is kindled against them: how long will they be without innocency!"},{"num":6,"verse":"For it came even from Israel: the workman made it, therefore it is not God: but the calf of Samaria shall be broken in pieces."},{"num":7,"verse":"For they have sown the wind, and they shall reap the whirlwind: it hath no stalk: the bud shall bring forth no meal: if so be it brought forth, the strangers shall devour it."},{"num":8,"verse":"Israel is devoured, now shall they be among the Gentiles as a vessel wherein is no pleasure."},{"num":9,"verse":"For they are gone up to Assyria: they are as a wild ass alone by himself: Ephraim hath hired lovers."},{"num":10,"verse":"Yet though they have hired among the nations, now will I gather them and they shall sorrow a little for the burden of the king and the princes."},{"num":11,"verse":"Because Ephraim hath made many altars to sin, his altars shall be to sin."},{"num":12,"verse":"I have written to them the great things of my Law: but they were counted as a strange thing."},{"num":13,"verse":"They sacrifice flesh for the sacrifices of mine offerings, and eat it: but the Lord accepteth them not: now will he remember their iniquity, and visit their sins: they shall return to Egypt."},{"num":14,"verse":"For Israel hath forgotten his maker, and buildeth Temples, and Judah hath increased strong cities: but I will send a fire upon his cities, and it shall devour the palaces thereof."}]