[{"num":1,"verse":"Dear Theophilos:"},{"num":2,"verse":"until the day when, after giving instructions through the Ruach HaKodesh to the emissaries whom he had chosen, he was taken up into heaven."},{"num":3,"verse":"After his death he showed himself to them and gave many convincing proofs that he was alive. During a period of forty days they saw him, and he spoke with them about the Kingdom of God."},{"num":4,"verse":"At one of these gatherings, he instructed them not to leave Yerushalayim but to wait for “what the Father promised, which you heard about from me. "},{"num":5,"verse":"For Yochanan used to immerse people in water; but in a few days, you will be immersed in the Ruach HaKodesh!”"},{"num":6,"verse":"When they were together, they asked him, “Lord, are you at this time going to restore self-rule to Isra’el?” "},{"num":7,"verse":"He answered, “You don’t need to know the dates or the times; the Father has kept these under his own authority. "},{"num":8,"verse":"But you will receive power when the Ruach HaKodesh comes upon you; you will be my witnesses both in Yerushalayim and in all Y’hudah and Shomron, indeed to the ends of the earth!”"},{"num":9,"verse":"After saying this, he was taken up before their eyes; and a cloud hid him from their sight. "},{"num":10,"verse":"As they were staring into the sky after him, suddenly they saw two men dressed in white standing next to them. "},{"num":11,"verse":"The men said, “You Galileans! Why are you standing, staring into space? This Yeshua, who has been taken away from you into heaven, will come back to you in just the same way as you saw him go into heaven.”"},{"num":12,"verse":"Then they returned the Shabbat-walk distance from the Mount of Olives to Yerushalayim. "},{"num":13,"verse":"After entering the city, they went to the upstairs room where they were staying. The names of the emissaries were Kefa, Ya‘akov, Yochanan, Andrew, Philip, T’oma, Bar-Talmai, Mattityahu, Ya‘akov Ben-Halfai, Shim‘on “the Zealot,” and Y’hudah Ben-Ya‘akov. "},{"num":14,"verse":"These all devoted themselves single-mindedly to prayer, along with some women, including Miryam (Yeshua’s mother), and his brothers."},{"num":15,"verse":"During this period, when the group of believers numbered about 120, Kefa stood up and addressed his fellow-believers: "},{"num":16,"verse":"“Brothers, the Ruach HaKodesh spoke in advance through David about Y’hudah, and these words of the Tanakh had to be fulfilled. He was guide for those who arrested Yeshua — "},{"num":17,"verse":"he was one of us and had been assigned a part in our work.” "},{"num":18,"verse":"(With the money Y’hudah received for his evil deed, he bought a field; and there he fell to his death. His body swelled up and burst open, and all his insides spilled out. "},{"num":19,"verse":"This became known to everyone in Yerushalayim, so they called that field Hakal-D’ma — which in their language means “Field of Blood”). "},{"num":20,"verse":"“Now,” said Kefa, “it is written in the book of Psalms,"},{"num":21,"verse":"Therefore, one of the men who have been with us continuously throughout the time the Lord Yeshua traveled around among us, "},{"num":22,"verse":"from the time Yochanan was immersing people until the day Yeshua was taken up from us — one of these must become a witness with us to his resurrection.”"},{"num":23,"verse":"They nominated two men — Yosef Bar-Sabba, surnamed Justus, and Mattityahu. "},{"num":24,"verse":"Then they prayed, “Lord, you know everyone’s heart. Show us which of these two you have chosen "},{"num":25,"verse":"to take over the work and the office of emissary that Y’hudah abandoned to go where he belongs.” "},{"num":26,"verse":"Then they drew lots to decide between the two, and the lot fell to Mattityahu. So he was added to the eleven emissaries."}]