[{"header":"Here Comes the Sequel!"},{"num":1,"verse":"Dear Theophilus,"},{"num":2,"verse":"I took the story as far as the day when he was taken up, once he had given instructions through the holy spirit to his chosen apostles."},{"num":3,"verse":"He showed himself to them alive, after his suffering, by many proofs. He was seen by them for forty days, during which he spoke about God’s kingdom. "},{"num":4,"verse":"As they were having a meal together, he told them not to go away from Jerusalem, but to wait, as he put it, ‘for the father’s promise, which I was telling you about earlier. "},{"num":5,"verse":"John baptized with water, you see; but in a few days from now you will be baptized with the holy spirit.’"},{"header":"When, What and How?"},{"num":6,"verse":"So when the apostles came together, they put this question to Jesus."},{"num":7,"verse":"‘It’s not your business to know about times and dates,’ he replied. ‘The father has placed all that under his own direct authority. "},{"num":8,"verse":"What will happen, though, is that you will receive power when the holy spirit comes upon you. Then you will be my witnesses in Jerusalem, in all Judaea and Samaria, and to the very ends of the earth.’"},{"header":"Ascension!"},{"num":9,"verse":"As Jesus said this, he was lifted up while they were watching, and a cloud took him out of their sight. "},{"num":10,"verse":"They were gazing into heaven as he disappeared. Then, lo and behold, two men appeared, dressed in white, standing beside them."},{"num":11,"verse":"‘Galileans,’ they said, ‘why are you standing here staring into heaven? This Jesus, who has been taken from you into heaven, will come back in the same way you saw him go into heaven.’"},{"num":12,"verse":"Then they went back to Jerusalem from the hill called the Mount of Olives, which is close to Jerusalem, about the distance you could travel on a sabbath. "},{"num":13,"verse":"They then entered the city (‘they’ here means Peter, John, James, Andrew, Philip, Thomas, Bartholomew, Matthew, James the son of Alphaeus, Simon the zealot, and Judas the son of James) and went to the upstairs room where they were staying. "},{"num":14,"verse":"They all gave themselves single-heartedly to prayer, with the women, including Mary, Jesus’ mother, and his brothers."},{"header":"Restoring the Twelve"},{"num":15,"verse":"Around that time Peter stood up in the middle of the gathering, which by this stage numbered about a hundred and twenty."},{"num":16,"verse":"‘My dear family,’ he said, ‘the holy spirit spoke long ago, through the mouth of David, about Judas, who became a guide to the people who arrested Jesus. There it is in the Bible, and it had to come true. "},{"num":17,"verse":"He was counted along with us, and he had his own share in the work we’ve been given.’"},{"num":18,"verse":"(Judas, you see, had bought a field with the money his wickedness had brought him, where he fell headlong and burst open, with all his innards gushing out. "},{"num":19,"verse":"This became known to everyone who lived in Jerusalem, so that the field was called, in their local language, ‘Akeldamach’, which means ‘Blood-place’.)"},{"num":20,"verse":"‘For this is what it says in the book of the Psalms:"},{"num":21,"verse":"‘So this is what has to be done. There are plenty of people who have gone about with us all the time that our master Jesus was coming and going among us, "},{"num":22,"verse":"starting from John’s baptism until the day he was taken from us. Let one of them be chosen to be alongside us as a special witness of his resurrection.’"},{"num":23,"verse":"So they chose two: Joseph who was called Barsabbas, with the surname Justus, and Matthias."},{"num":24,"verse":"‘Lord,’ they prayed, ‘you know the hearts of all people. Show us which one of these two you have chosen "},{"num":25,"verse":"to receive this particular place of service and apostleship, from which Judas went away to go to his own place.’"},{"num":26,"verse":"So they cast lots for them. The lot fell on Matthias, and he was enrolled along with the eleven apostles."}]