[{"num":1,"verse":"I have made the first account, O Theophilus, of all that Jesus began to do and teach"},{"num":2,"verse":"until the day He was taken up (after He, through the Holy Ghost, had given commandments to the Apostles whom He had chosen -"},{"num":3,"verse":"and to whom He presented Himself alive by many sure signs after He had suffered - being seen by them over forty days and speaking of those things concerning the Kingdom of God)."},{"num":4,"verse":"And when He had gathered them together, He commanded them not to depart from Jerusalem, but to wait for the promise of the Father, which, He said, “You have heard from Me."},{"num":5,"verse":"“For John indeed baptized with water. But you shall be baptized with the Holy Ghost within a few days.”"},{"num":6,"verse":"Therefore, when they had come together, they asked of Him, saying, “Lord, will You restore the Kingdom to Israel at this time?"},{"num":7,"verse":"And He said to them, “It is not for you to know the times or the seasons which the Father has put in place by His own authority."},{"num":8,"verse":"“But you shall receive power from the Holy Ghost when He shall come upon you. And you shall be witnesses to Me, both in Jerusalem and in all Judea, and in Samaria, and to the outermost part of the earth.”"},{"num":9,"verse":"And when He had spoken these things, while they looked on, He was taken up. For a cloud took Him up out of their sight."},{"num":10,"verse":"And as He went, while they were looking toward Heaven, behold, two men stood by them in white apparel,"},{"num":11,"verse":"who also said, “You men of Galilee, why do you stand gazing into Heaven? This Jesus Who is taken up from you into Heaven, shall also come as you have seen Him go into Heaven.”"},{"num":12,"verse":"Then they returned to Jerusalem from the mount that is called ‘Olivet’, which is near Jerusalem, being from it a Sabbath’s journey."},{"num":13,"verse":"And when they had come in, they went up into an upper room, where both Peter and James were, and John and Andrew, Philip and Thomas, Bartholomew, and Matthew, James the son of Alphaeus, and Simon Zealot, and Judas James’ brother."},{"num":14,"verse":"These all continued, with one mind, in prayer and supplication, with the women, and Mary the mother of Jesus, and with His brothers."},{"num":15,"verse":"And in those days, Peter stood up in the midst of the disciples, and said (now the number of names that were in one place were about a hundred and twenty)."},{"num":16,"verse":"“You men, and brothers, this Scripture which the Holy Ghost, through David, spoke of Judas (guide to those who took Jesus) must have been fulfilled."},{"num":17,"verse":"“For he was numbered with us and had obtained fellowship in this ministry."},{"num":18,"verse":"“Therefore, he has purchased a field with the reward of iniquity. And when he had thrown himself down headlong, he burst asunder in the middle, and all his bowels gushed out."},{"num":19,"verse":"“And it is known to all the inhabitants of Jerusalem, insomuch that that field is called, in their own language, ‘Akel Dama’, which means, ‘Field of Blood’."},{"num":20,"verse":"“For it is written in the Book of Psalms, ‘Let his house be empty, and let no one dwell therein.’ Also, ‘Let another take his position.’"},{"num":21,"verse":"“Therefore, of these men who have been with us all the time that the Lord Jesus went in and out among us,"},{"num":22,"verse":"“beginning from the baptism of John until the day that He was taken up from us, one of them must be made a fellow witness of His resurrection.”"},{"num":23,"verse":"And they presented two: Joseph, called Barsabas (whose surname was Justus) and Matthias."},{"num":24,"verse":"And they prayed, saying, “You Lord, Who knows the hearts of all, show us which of these two You have chosen,"},{"num":25,"verse":"“so that he may take the part of this ministry and Apostleship from which Judas has gone astray to go to his own place.”"},{"num":26,"verse":"Then they cast their lots. And the lot fell on Matthias. And he was counted with the eleven Apostles."}]