[{"num":30,"verse":"1 The Amalekites burn Ziklag. 5 David’s two wives are taken prisoners. 6 The people would stone him. 8 He asketh counsel of the Lord, and pursuing his enemies recovereth the prey. 24 He divideth it equally, 26 And sendeth part to his friends."},{"num":1,"verse":"But when David and his men were come to Ziklag the third day, the Amalekites had invaded upon the South, even unto Ziklag, and had smitten Ziklag, and burnt it with fire,"},{"num":2,"verse":"And had taken the women that were therein, prisoners, both small and great, and slew not a man, but carried them away, and went their ways."},{"num":3,"verse":"¶ So David and his men came to the city, and behold, it was burnt with fire, and their wives and their sons, and their daughters were taken prisoners."},{"num":4,"verse":"Then David and the people that were with him, lift up their voices and wept, until they could weep no more."},{"num":5,"verse":"David’s two wives were taken prisoners also, Ahinoam the Jezreelite, and Abigail the wife of Nabal the Carmelite."},{"num":6,"verse":"And David was in great sorrow: for the people intended to stone him, because the hearts of all the people were vexed every man for his sons and for his daughters: but David comforted himself in the Lord his God."},{"num":7,"verse":"¶ And David said to Abiathar the Priest Ahimelech’s son, I pray thee, bring me the Ephod. And Abiathar brought the Ephod to David."},{"num":8,"verse":"Then David asked counsel of the Lord, saying, Shall I follow after this company? shall I overtake them? And he answered him, Follow: for thou shalt surely overtake them, and recover all."},{"num":9,"verse":"¶ So David and the six hundred men that were with him, went, and came to the river Besor, where a part of them abode:"},{"num":10,"verse":"But David and four hundred men followed (for two hundred abode behind, being too weary to go over the river Besor.)"},{"num":11,"verse":"And they found an Egyptian in the field, and brought him to David, and gave him bread, and he did eat, and they gave him water to drink."},{"num":12,"verse":"Also they gave him a few figs, and two clusters of raisins: and when he had eaten, his spirit came again to him: for he had eaten no bread, nor drunk any water in three days, and three nights."},{"num":13,"verse":"¶ And David said unto him, To whom belongest thou? and whence art thou? And he said, I am a young man of Egypt, and servant to an Amalekite: and my master left me three days ago because I fell sick."},{"num":14,"verse":"We roved upon the South of Chereth, and upon the coast belonging to Judah, and upon the South of Caleb, and we burnt Ziklag with fire."},{"num":15,"verse":"And David said unto him, Canst thou bring me to this company? And he said, Swear unto me by God, that thou will neither kill me, nor deliver me into the hands of my master, and I will bring thee to this company."},{"num":16,"verse":"¶ And when he had brought him thither, behold, they lay scattered abroad upon all the earth, eating and drinking, and dancing, because of all the great prey that they had taken out of the land of the Philistines, and out of the land of Judah."},{"num":17,"verse":"And David smote them from the twilight even unto the evening of the next morrow, so that there escaped not a man of them, save four hundred young men, which rode upon camels, and fled."},{"num":18,"verse":"And David recovered all that the Amalekites had taken: also David rescued his two wives."},{"num":19,"verse":"And they lacked nothing, small or great, son or daughter, or of the spoil of all that they had taken away: David recovered them all."},{"num":20,"verse":"David also took all the sheep, and the oxen, and they drove them before his cattle, and said, This is David’s prey."},{"num":21,"verse":"¶ And David came to the two hundred men that were too weary for to follow David: whom they had made also to abide at the river Besor: and they came to meet David, and to meet the people that were with him: so when David came near to the people, he saluted them."},{"num":22,"verse":"Then answered all the evil and wicked of the men that went with David, and said, Because they went not with us, therefore will we give them none of the prey that we have recovered, save to every man his wife and his children: therefore let them carry them away and depart."},{"num":23,"verse":"Then said David, Ye shall not do so, my brethren, with that which the Lord hath given us, who hath preserved us, and delivered the company that came against us, into our hands."},{"num":24,"verse":"For who will obey you in this matter? but as his part is that goeth down to the battle, so shall his part be, that tarrieth by the stuff: they shall part alike."},{"num":25,"verse":"So from that day forward he made it a statute and a law in Israel, until this day."},{"num":26,"verse":"¶ When David therefore came to Ziklag, he sent of the prey unto the Elders of Judah and to his friends, saying, See there is a blessing for you of the spoil of the enemies of the Lord."},{"num":27,"verse":"He sent to them of Bethel, and to them of South Ramoth, and to them of Jattir,"},{"num":28,"verse":"And to them of Aroer, and to them of Siphmoth, and to them of Eshtemoa,"},{"num":29,"verse":"And to them of Rachal, and to them of the cities of the Jerahmeelites, and to them of the cities of the Kenites,"},{"num":30,"verse":"And to them of Hormah, and to them of Chorashan, and to them of Athach,"},{"num":31,"verse":"And to them of Hebron, and to all the places where David and his men had haunted."}]