[{"header":"Israel Is Not Cast Away"},{"num":11,"verse":"I say then, has God rejected and disowned His people? Certainly not! For I too am an Israelite, a descendant of Abraham, of the tribe of Benjamin. "},{"num":2,"verse":"God has not rejected His [chosen] people whom He foreknew. Or do you not know what the Scripture says of Elijah, how he pleads with God against Israel? "},{"num":3,"verse":"“Lord, they have killed Your prophets, they have torn down Your altars, and I alone am left [of the prophets], and they are seeking my life.” "},{"num":4,"verse":"But what is God’s response to him? “I have kept for Myself seven thousand men who have not bowed the knee to Baal.” "},{"num":5,"verse":"So too then, at the present time there has come to be a remnant [a small believing minority] according to God’s gracious choice. "},{"num":6,"verse":"But if it is by grace [God’s unmerited favor], it is no longer on the basis of works, otherwise grace is no longer grace [it would not be a gift but a reward for works]."},{"num":7,"verse":"What then? Israel failed to obtain what it was seeking [that is, God’s favor by obedience to the Law], but the elect [those chosen few] obtained it, while the rest of them became hardened and callously indifferent; "},{"num":8,"verse":"just as it is written [in Scripture],"},{"num":9,"verse":"And David says,"},{"num":11,"verse":"So I say, have they stumbled so as to fall [to spiritual ruin]? Certainly not! But by their transgression [their rejection of the Messiah] salvation has come to the Gentiles, to make Israel jealous [when they realize what they have forfeited]. "},{"num":12,"verse":"Now if Israel’s transgression means riches for the world [at large] and their failure means riches for the Gentiles, how much more will their fulfillment and reinstatement be! "},{"num":13,"verse":"But now I am speaking to you who are Gentiles. Inasmuch then as I am an apostle to the Gentiles, I magnify my ministry, "},{"num":14,"verse":"in the hope of somehow making my fellow countrymen jealous [by stirring them up so that they will seek the truth] and perhaps save some of them. "},{"num":15,"verse":"For if their [present] rejection [of salvation] is for the reconciliation of the world [to God], what will their acceptance [of salvation] be but [nothing less than] life from the dead? "},{"num":16,"verse":"If the first portion [of dough offered as the first fruits] is holy, so is the whole batch; and if the root (Abraham, the patriarchs) is holy, so are the branches (the Israelites)."},{"num":17,"verse":"But if some of the branches were broken off, and you [Gentiles], being like a wild olive shoot, were grafted in among them to share with them the rich root of the olive tree, "},{"num":18,"verse":"do not boast over the [broken] branches and exalt yourself at their expense. If you do boast and feel superior, remember that it is not you who supports the root, but the root that supports you. "},{"num":19,"verse":"You will say then, “Branches were broken off so that I might be grafted in.” "},{"num":20,"verse":"That is true. They were broken off because of their unbelief, but you stand by your faith [as believers understanding the truth of Christ’s deity]. Do not be conceited, but [rather stand in great awe of God and] fear [Him]; "},{"num":21,"verse":"for if God did not spare the natural branches [because of unbelief], He will not spare you either. "},{"num":22,"verse":"Then appreciate the gracious kindness and the severity of God: to those who fell [into spiritual ruin], severity, but to you, God’s gracious kindness—if you continue in His kindness [by faith and obedience to Him]; otherwise you too will be cut off. "},{"num":23,"verse":"And even they [the unbelieving Jews], if they do not continue in their unbelief, will be grafted in; for God has the power to graft them in again. "},{"num":24,"verse":"For if you were cut off from what is by nature a wild olive tree, and against nature were grafted into a cultivated olive tree, how much easier will it be to graft these who are the natural branches back into [the original parent stock of] their own olive tree?"},{"num":25,"verse":"I do not want you, believers, to be unaware of this mystery [God’s previously hidden plan]—so that you will not be wise in your own opinion—that a partial hardening has [temporarily] happened to Israel [to last] until the full number of the Gentiles has come in; "},{"num":26,"verse":"and so [at that time] all Israel [that is, all Jews who have a personal faith in Jesus as Messiah] will be saved; just as it is written [in Scripture],"},{"num":28,"verse":"From the standpoint of the gospel, the Jews [at present] are enemies [of God] for your sake [which is for your benefit], but from the standpoint of God’s choice [of the Jews as His people], they are still loved by Him for the sake of the fathers. "},{"num":29,"verse":"For the gifts and the calling of God are irrevocable [for He does not withdraw what He has given, nor does He change His mind about those to whom He gives His grace or to whom He sends His call]. "},{"num":30,"verse":"Just as you once were disobedient and failed to listen to God, but have now obtained mercy because of their disobedience, "},{"num":31,"verse":"so they too have now become disobedient so that they too may one day receive mercy because of the mercy shown to you. "},{"num":32,"verse":"For God has imprisoned all in disobedience so that He may show mercy to all [Jew and Gentile alike]."},{"num":33,"verse":"Oh, the depth of the riches and wisdom and knowledge of God! How unsearchable are His judgments and decisions and how unfathomable and untraceable are His ways! "},{"num":34,"verse":"For who has known the mind of the Lord, or who has been His counselor? "},{"num":35,"verse":"Or who has first given to Him that it would be paid back to him? "},{"num":36,"verse":"For from Him [all things originate] and through Him [all things live and exist] and to Him are all things [directed]. To Him be glory and honor forever! Amen."}]