[{"header":"God Graciously Chose a Remnant"},{"num":11,"verse":"So I say, did God reject his people? Absolutely not! For I myself am an Israelite, a descendant of Abraham from the tribe of Benjamin. "},{"num":2,"verse":"God did not reject his people whom he foreknew—or don’t you know what Scripture says about Elijah, how he was pleading with God against Israel: "},{"num":3,"verse":"“Lord, they have killed your prophets and torn down your altars. I am the only one left, and they are trying to take my life.” "},{"num":4,"verse":"But what did God’s answer tell him? “I have reserved for myself seven thousand men who have not bowed the knee to Baal.”"},{"num":5,"verse":"So in the same way at the present time there is a remnant chosen by grace. "},{"num":6,"verse":"Now if it is by grace, then it is not the result of works—otherwise grace would no longer be grace."},{"header":"God Planned a Way to Recover Some Hardened Jews"},{"num":7,"verse":"What then? Israel did not receive what it was striving to get. The elect did, but the rest were hardened. "},{"num":8,"verse":"Just as it is written:"},{"num":9,"verse":"And David says:"},{"num":11,"verse":"So I ask, “Did they stumble in order to fall permanently?” Absolutely not! Rather, by their trespass, salvation came to the Gentiles to make the Israelites jealous. "},{"num":12,"verse":"Now if their trespass meant riches for the world, and their failure meant riches for the Gentiles, how much more will their fullness mean!"},{"num":13,"verse":"I am speaking to you Gentiles. For as long as I am an apostle to the Gentiles, I am going to speak highly of my ministry. "},{"num":14,"verse":"Perhaps I may make my own people jealous, and so save some of them. "},{"num":15,"verse":"For if their rejection meant the reconciliation of the world, what does their acceptance mean other than the dead coming to life?"},{"header":"Gentiles Should Not Become Proud"},{"num":16,"verse":"If the part offered as firstfruits is holy, so is the whole batch. And if the root is holy, so are the branches. "},{"num":17,"verse":"But if some of the branches were broken off, and you—a wild olive branch—were grafted in among them and share in the rich sap from the root of the olive tree, "},{"num":18,"verse":"do not boast that you are better than the branches. If you do boast, remember that you are not supporting the root, but the root is supporting you. "},{"num":19,"verse":"Then you will say: “Branches were broken off so that I am grafted in.” "},{"num":20,"verse":"That is true—but remember that they were broken off because of unbelief, and you remain in place by faith. Do not be conceited, but stand in awe. "},{"num":21,"verse":"For if God did not spare the natural branches, he will not spare you. "},{"num":22,"verse":"So take note of God’s kindness and his severity: severity on those who have fallen, but God’s kindness on you—if you remain in his kindness; otherwise, you also will be cut off."},{"header":"Some Jews Will Be Grafted in Again"},{"num":23,"verse":"And if they do not remain in unbelief, those branches will be grafted in again, because God is able to graft them in again. "},{"num":24,"verse":"For if you were cut off from a wild olive tree and, contrary to nature, were grafted into a cultivated olive tree, how much more easily will these natural branches be grafted back into their own olive tree?"},{"num":25,"verse":"For I do not want you to be uninformed about this mystery, brothers, so that you are not conceited in your opinion of yourselves. There has been a hardening of part of Israel until the full number of Gentiles has come in. "},{"num":26,"verse":"And in this way all Israel will be saved, as it is written:"},{"header":"The Paradox of How God Shows Mercy"},{"num":28,"verse":"In regard to the gospel, they are enemies for your sake. But, in regard to election, they are especially dear for the sake of the patriarchs, "},{"num":29,"verse":"because God’s gracious gifts and call are not regretted. "},{"num":30,"verse":"For just as you were once disobedient to God, but now have been shown mercy due to their disobedience, "},{"num":31,"verse":"so also now they have become disobedient, so that by the mercy shown to you they may be shown mercy too. "},{"num":32,"verse":"For God imprisoned all in disobedience so that he may show mercy to all."}]