[{"header":"The Loyal Minority"},{"num":1,"verse":"Does this mean, then, that God is so fed up with Israel that he’ll have nothing more to do with them? Hardly. Remember that I, the one writing these things, am an Israelite, a descendant of Abraham out of the tribe of Benjamin. You can’t get much more Semitic than that! So we’re not talking about repudiation. God has been too long involved with Israel, has too much invested, to simply wash his hands of them."},{"num":2,"verse":"Do you remember that time Elijah was agonizing over this same Israel and cried out in prayer?"},{"num":7,"verse":"And then what happened? Well, when Israel tried to be right with God on her own, pursuing her own self-interest, she didn’t succeed. The chosen ones of God were those who let God pursue his interest in them, and as a result received his stamp of legitimacy. The “self-interest Israel” became thick-skinned toward God. Moses and Isaiah both commented on this:"},{"header":"Pruning and Grafting Branches"},{"num":11,"verse":"The next question is, “Are they down for the count? Are they out of this for good?” And the answer is a clear-cut No. Ironically when they walked out, they left the door open and the outsiders walked in. But the next thing you know, the Jews were starting to wonder if perhaps they had walked out on a good thing. Now, if their leaving triggered this worldwide coming of non-Jewish outsiders to God’s kingdom, just imagine the effect of their coming back! What a homecoming!"},{"num":13,"verse":"But I don’t want to go on about them. It’s you, the outsiders, that I’m concerned with now. Because my personal assignment is focused on the so-called outsiders, I make as much of this as I can when I’m among my Israelite kin, the so-called insiders, hoping they’ll realize what they’re missing and want to get in on what God is doing. If their falling out initiated this worldwide coming together, their recovery is going to set off something even better: mass homecoming! If the first thing the Jews did, even though it was wrong for them, turned out for your good, just think what’s going to happen when they get it right!"},{"num":16,"verse":"Behind and underneath all this there is a holy, God-planted, God-tended root. If the primary root of the tree is holy, there’s bound to be some holy fruit. Some of the tree’s branches were pruned and you wild olive shoots were grafted in. Yet the fact that you are now fed by that rich and holy root gives you no cause to gloat over the pruned branches. Remember, you aren’t feeding the root; the root is feeding you."},{"num":19,"verse":"It’s certainly possible to say, “Other branches were pruned so that I could be grafted in!” Well and good. But they were pruned because they were deadwood, no longer connected by belief and commitment to the root. The only reason you’re on the tree is because your graft “took” when you believed, and because you’re connected to that belief-nurturing root. So don’t get cocky and strut your branch. Be humbly mindful of the root that keeps you lithe and green."},{"num":21,"verse":"If God didn’t think twice about taking pruning shears to the natural branches, why would he hesitate over you? He wouldn’t give it a second thought. Make sure you stay alert to these qualities of gentle kindness and ruthless severity that exist side by side in God—ruthless with the deadwood, gentle with the grafted shoot. But don’t presume on this gentleness. The moment you become deadwood, it’s game over."},{"num":23,"verse":"And don’t get to feeling superior to those pruned branches down on the ground. If they don’t persist in remaining deadwood, they could very well get grafted back in. God can do that. He can perform miracle grafts. Why, if he could graft you—branches cut from a tree out in the wild—into an orchard tree, he certainly isn’t going to have any trouble grafting branches back into the tree they grew from in the first place. Just be glad you’re in the tree, and hope for the best for the others."},{"header":"A Complete Israel"},{"num":25,"verse":"I want to lay all this out on the table as clearly as I can, friends. This is complicated. It would be easy to misinterpret what’s going on and arrogantly assume that you’re royalty and they’re just rabble, out on their ears for good. But that’s not it at all. This hardness on the part of insider Israel toward God is temporary. Its effect is to open things up to all the outsiders so that we end up with a full house. Before it’s all over, there will be a complete Israel. As it is written,"},{"num":30,"verse":"There was a time not so long ago when you were on the outs with God. But then the Jews slammed the door on him and things opened up for you. Now they are on the outs. But with the door held wide open for you, they have a way back in. In one way or another, God makes sure that we all experience what it means to be outside so that he can personally open the door and welcome us back in."},{"num":33,"verse":"Have you ever come on anything quite like this extravagant generosity of God, this deep, deep wisdom? It’s way over our heads. We’ll never figure it out."}]