[{"num":66,"verse":"To victory, the song of [the] psalm. All the earth, make ye joy heartily to God (All the earth, heartily make ye joy to God),"},{"num":2,"verse":"say ye psalm to his name; give ye glory to his praising. (sing ye a song to his name; give ye him glorious praise.)"},{"num":3,"verse":"Say ye to God, Lord, thy works be full dreadful; in the multitude of thy virtue thine enemies shall lie (down) to thee. (Say ye to God, Lord, thy works be very fearful/how awesome be thy works; because of thy great strength thy enemies shall fall down before thee.)"},{"num":4,"verse":"God, all the earth worship thee, and sing to thee; say it psalm to thy name. (God, let all the earth worship thee, and sing to thee; yea, sing they a song to thy name.)"},{"num":5,"verse":"Come ye and see ye the works of God; fearedful in counsels on the sons of men (fearful, or awesome, in his counsels toward the sons and daughters of men)."},{"num":6,"verse":"Which turned the sea into dry land; in the flood they shall pass [through] with foot, there we shall be glad in him. (Who turned the sea into dry land; yea, they passed through the river on foot, and there we rejoiced in him.)"},{"num":7,"verse":"The which is Lord in his virtue [into] without end, his eyes behold on folks; they that make sharp be not enhanced in themselves. (Who is the ruler by his might, or his power, forever, and his eyes look on the nations; let not they who rebel against him exalt themselves.)"},{"num":8,"verse":"Ye heathen men, bless our God; and make ye heard the voice of his praising. (All ye heathen, bless our God; and make ye the sound of your praises heard.)"},{"num":9,"verse":"That hath set my soul to life, and gave not my feet into stirring. (He hath given life to my soul/He hath given life to me, and kept my feet from slipping, or stumbling.)"},{"num":10,"verse":"For thou, God, hast proved us; thou hast examined us by fire, as silver is examined (thou hast assayed us by fire, like silver is proved, or assayed)."},{"num":11,"verse":"Thou leddest us into a snare, thou puttedest tribulations in our back (thou puttedest troubles upon our backs);"},{"num":12,"verse":"thou settedest men on our heads. We passed by fire and water; and thou leddest us out into refreshing. (thou settedest men to ride upon our heads. We passed through fire and water; and then thou leddest us out into refreshing.)"},{"num":13,"verse":"I shall enter into thine house in burnt sacrifices; I shall yield to thee my vows, (I shall enter into thy House with burnt sacrifices; I shall pay my vows to thee,)"},{"num":14,"verse":"which my lips spake distinctly. And my mouth spake in my tribulation; (which my lips shall speak clearly, or distinctly. Yea, what I said I would do, when I was in trouble, and you helped me.)"},{"num":15,"verse":"I shall offer to thee burnt sacrifices full of marrow, with the burning of rams; I shall offer to thee oxes with bucks of goats."},{"num":16,"verse":"All ye that dread God, come and hear, and I shall tell; how great things he hath done to my soul. (All ye who fear God, come and listen; and I shall tell you what great things he hath done for my soul./All ye who revere God, come and listen; and I shall tell you what great things he hath done for me.)"},{"num":17,"verse":"I cried to him with my mouth; and I joyed fully under my tongue. (I cried to him with my mouth; and I praised him with my tongue.)"},{"num":18,"verse":"If I beheld wickedness in mine heart; the Lord shall not hear. (And if I had still held wickedness in my heart; then the Lord would not have heard me.)"},{"num":19,"verse":"Therefore God heard; and he perceived the voice of my beseeching. (But truly God did hear me; and he hath listened to the words of my plea.)"},{"num":20,"verse":"Blessed be God; that removed not my prayer, nor his mercy from me. (Blessed be God; who did not turn my prayer away, nor kept back his love from me.)"}]