[{"header":"King Rehoboam Acts Foolishly"},{"num":12,"verse":"Rehoboam went to Shechem, for all Israel had come to Shechem to make him king. "},{"num":2,"verse":"Now when Jeroboam the son of Nebat heard about it, he was living in Egypt (for he was still in Egypt, where he had fled from King Solomon). "},{"num":3,"verse":"So they sent word and called for him, and Jeroboam and all the assembly of Israel came and spoke to Rehoboam, saying, "},{"num":4,"verse":"“Your father made our yoke (burden) heavy; so now lighten the hard labor and the heavy yoke your father imposed on us, and we will serve you.” "},{"num":5,"verse":"Rehoboam replied to them, “Leave for three days, then come back to me [for my decision].” So the people left."},{"num":6,"verse":"King Rehoboam consulted with the elders who had served and advised his father Solomon while he was still alive and said, “How do you advise me to answer this people?” "},{"num":7,"verse":"They spoke to him, saying, “If you will be a servant to this people today, and will serve them and grant their request, and speak good words to them, then they will be your servants forever.” "},{"num":8,"verse":"But he ignored the advice which the elders gave him and consulted the young men who grew up with him and served him. "},{"num":9,"verse":"He said to them, “What do you advise that we answer this people who have said to me, ‘Lighten the yoke (burden) which your father put on us’?” "},{"num":10,"verse":"The young men who had grown up with him answered, “This is what you should say to this people who told you, ‘Your father made our yoke heavy, but as for you, make our yoke lighter’—say this to them: ‘My little finger is thicker than my father’s loins [and my reign will be even more severe]. "},{"num":11,"verse":"And now, whereas my father loaded you with a heavy yoke, I will add to your yoke. My father disciplined you with whips, but I will discipline you with scorpions.’”"},{"num":12,"verse":"Jeroboam and all the people came back to Rehoboam on the third day, just as the king had instructed, saying, “Return to me on the third day.” "},{"num":13,"verse":"The king answered the people harshly and ignored the advice which the elders had given him, "},{"num":14,"verse":"and spoke to them in accordance with the advice of the young men, saying, “My father made your yoke heavy, but as for me, I will add to your yoke; my father disciplined you with whips, but I will discipline you with scorpions.” "},{"num":15,"verse":"So the king did not listen to the people; for the situation was from the Lord, so that He might fulfill His word which He spoke through Ahijah the Shilonite to Jeroboam the son of Nebat."},{"header":"The Kingdom Divided; Jeroboam Rules Israel"},{"num":16,"verse":"So when all [the ten northern tribes of] Israel saw that the king did not listen to them, the people replied to the king, saying,"},{"num":17,"verse":"But as for the sons (descendants) of Israel who lived in the cities of Judah [including Benjamin], Rehoboam reigned over them. "},{"num":18,"verse":"Then King Rehoboam sent Adoram, who was in charge of the forced labor [to represent him], and all Israel stoned him to death. And King Rehoboam quickly mounted his chariot to escape to Jerusalem. "},{"num":19,"verse":"So Israel (the ten northern tribes) has rebelled against the house (royal line) of David to this day (the date of this writing)."},{"num":20,"verse":"It came about when all Israel heard that Jeroboam had returned, that they sent word and called him to the assembly and made him king over all Israel. None followed the house of David except the tribe of Judah [including Benjamin]."},{"num":21,"verse":"Now when Rehoboam arrived in Jerusalem, he assembled all the [fighting men from the] house of Judah, with the tribe of Benjamin, 180,000 chosen warriors, to fight against the house of Israel to bring the kingdom back to Rehoboam the son of Solomon. "},{"num":22,"verse":"But the word of God came to Shemaiah the man of God, saying, "},{"num":23,"verse":"“Tell Rehoboam the son of Solomon, king of Judah, and all the house (fighting men) of Judah and Benjamin and the rest of the people, "},{"num":24,"verse":"‘Thus says the Lord, “You shall not go up and fight against your brothers, the sons of Israel. Let every man return to his house, for this thing has come about from Me.”’” So they listened to the word of the Lord and returned to go home, in accordance with the word of the Lord."},{"header":"Jeroboam’s Idolatry"},{"num":25,"verse":"Then Jeroboam built Shechem [as his royal city] in the hill country of Ephraim and lived there. He went out from there and rebuilt Penuel [as a stronghold]. "},{"num":26,"verse":"Jeroboam [doubted God’s promise to him and] said in his heart, “Now the kingdom will return to the house of David. "},{"num":27,"verse":"If these people go up to the house of the Lord in Jerusalem to offer sacrifices, then their heart will turn to their lord, to Rehoboam king of Judah; and they will kill me and return to Rehoboam king of Judah.” "},{"num":28,"verse":"So the king took counsel [and followed bad advice] and made two calves of gold. And he said to the people, “It is too much for you to go [all the way] up to Jerusalem; behold your gods, O Israel, who brought you up out of the land of Egypt.” "},{"num":29,"verse":"He set the one [golden calf] in Bethel, and the other he put in Dan. "},{"num":30,"verse":"Now this thing became a sin [for Israel]; because the people went to worship before the one [or the other of them] as far as Dan. "},{"num":31,"verse":"And Jeroboam also made houses on high places, and he made priests from all people who were not of the sons (descendants) of Levi. "},{"num":32,"verse":"Jeroboam held a feast on the fifteenth day of the eighth month, like the feast which is kept in Judah, and he went up to the altar; he did this in Bethel, sacrificing to the calves which he had made. And he stationed in Bethel the priests of the high places which he had made. "},{"num":33,"verse":"So he went up to the altar which he had made in Bethel on the fifteenth day of the eighth month, in the month which he had devised in his own heart [in defiance of God’s commandments]; and he held a feast for the Israelites and he went up to the altar to burn incense [in defiance of God’s law.]"}]