[{"header":"Chapter 12"},{"num":1,"verse":"Revolt against Rehoboam. Rehoboam went to Shechem, for all of Israel had gone to Shechem to make him king."},{"num":2,"verse":"When Jeroboam, the son of Nebat, heard about this in Egypt where he had fled from King Solomon, he returned from Egypt."},{"num":3,"verse":"They sent for Jeroboam, and when he arrived, he and the whole assembly of Israel spoke to Rehoboam, saying,"},{"num":4,"verse":"“Your father made our yoke heavy. If you make our service and our heavy yoke lighter than the heavy load your father laid on us, then we will serve you.”"},{"num":5,"verse":"Rehoboam answered, “Go away for three days, and then come back to me.” So the people departed."},{"num":6,"verse":"King Rehoboam consulted with the elders who had stood before Solomon, his father, during his lifetime. He said, “How do you advise me to answer this people, so that I can give them an answer?”"},{"num":7,"verse":"They answered him, “If you become a servant to this people today and you serve them and you give them a favorable answer, then they will be your servants forever.”"},{"num":8,"verse":"But he ignored the advice that the elders had given him, and instead, he consulted with the young men who had grown up with him and who stood before him."},{"num":9,"verse":"He asked them, “What advice do you give me so that we can give an answer to this people who have spoken to me, saying, ‘Make the yoke lighter than that which your father laid upon us?’ ”"},{"num":10,"verse":"The young men who had grown up with him answered, “Say the following to the people who said to you, ‘Your father made our yoke heavy; will you lighten it for us?’ Say this to them: ‘My little finger is thicker than my father’s waist!"},{"num":11,"verse":"My father laid a heavy yoke on you, but I will add to your yoke. My father chastised you with whips, but I will chastise you with scorpions.’ ”"},{"num":12,"verse":"Three days later Jeroboam and all of the people returned to Rehoboam as the king had decreed when he said, “Come back to me in three days.”"},{"num":13,"verse":"The king responded harshly to the people. He ignored the counsel that the elders had given him."},{"num":14,"verse":"He said to them what the young men had advised him saying, “My father laid a heavy yoke on you, but I will add to your yoke. My father chastised you with whips, but I will chastise you with scorpions.”"},{"num":15,"verse":"Thus the king would not listen to the people, for the Lord had brought this about to fulfill what he said when the Lord spoke through Ahijah the Shilonite to Jeroboam, the son of Nebat."},{"num":16,"verse":"When all of Israel realized that the king would not listen to them, the people answered the king, “What share do we have in David? What inheritance do we have in the son of Jesse? To your own tents, O Israel. Look after your own house, O David.” So the people of Israel returned to their homes."},{"num":17,"verse":"Rehoboam still ruled over those Israelites who were living in the cities of Judah."},{"num":18,"verse":"King Rehoboam sent out Adoniram who was in charge of the forced labor, but all of Israel stoned him to death. King Rehoboam, however, mounted his chariot and fled to Jerusalem."},{"num":19,"verse":"Israel has been in rebellion against the house of David up to the present day."},{"num":20,"verse":"When all of Israel heard that Jeroboam had come back, they sent for him and summoned him to an assembly. They made him king over all of Israel. No one followed the house of David except for the tribe of Judah."},{"num":21,"verse":"When Rehoboam arrived in Jerusalem, he assembled the entire house of Judah along with the tribe of Benjamin, one hundred and eighty thousand fighting men to battle against the house of Israel and to restore the kingdom to Rehoboam, the son of Solomon."},{"num":22,"verse":"But the word of God came to Shemaiah, the man of God, saying,"},{"num":23,"verse":"“Speak to Rehoboam, the son of Solomon, the king of Judah, and to all of the house of Judah and Benjamin, and to the rest of the people, saying,"},{"num":24,"verse":"‘Thus says the Lord, You are not to go up or fight against your brothers, the Israelites. Let each man return home, for this thing is from me.’ ” They obeyed the word of the Lord, and they turned around and left, as the Lord had instructed."},{"num":25,"verse":"Jeroboam built Shechem in the hill country of Ephraim and he dwelt there. He went out from there and built Penuel."},{"num":26,"verse":"Jeroboam’s Idolatry. Jeroboam said to himself, “The kingdom is going to return to the house of David."},{"num":27,"verse":"If this people goes up to sacrifice in the temple of the Lord in Jerusalem, the heart of this people will return to their lord, to Rehoboam, the king of Judah. They will kill me and they will return to Rehoboam, the king of Judah.”"},{"num":28,"verse":"The king sought counsel, and so he made two golden calves. He said to them, “It is too difficult for you to go up to Jerusalem. Behold, your gods, O Israel, which brought you up out of the land of Egypt.”"},{"num":29,"verse":"He placed one in Bethel, and he placed the other in Dan."},{"num":30,"verse":"This thing became a sin, for the people went to worship before one of them, even to Dan."},{"num":31,"verse":"He built shrines upon the high places, and he appointed priests from the lowliest of people who were not Levites."},{"num":32,"verse":"He established a festival on the fifteenth day of the eighth month like the one that was celebrated in Judah, and he offered sacrifices upon the altar. He did this in Bethel, offering sacrifices to the calves that he had made. In Bethel he also appointed priests for the high places that he had made."},{"num":33,"verse":"And so he established a festival for the Israelites on the fifteenth day of the eighth month, a date of his own choosing, and he offered up a sacrifice on the altar he had built in Bethel. He offered up a sacrifice and burned incense on the altar."}]