[{"header":"Israel and Rehoboam"},{"num":12,"verse":"Rehoboam went to Shechem. For all Israel had come to Shechem to make him king. "},{"num":2,"verse":"Now Jeroboam the son of Nebat was still in Egypt where he had run away from King Solomon. When Jeroboam heard the news, he returned from Egypt. "},{"num":3,"verse":"They sent for him. Then Jeroboam and all the people of Israel came and said to Rehoboam, "},{"num":4,"verse":"“Your father made our load heavy. Take away some of the hard work and heavy load your father put on us, and we will serve you.” "},{"num":5,"verse":"Rehoboam said to them, “Leave for three days. Then return to me.” So the people left."},{"num":6,"verse":"King Rehoboam spoke with the leaders who had worked for his father Solomon while he was still alive. He asked them, “What answer do you think I should give to these people?” "},{"num":7,"verse":"They said to him, “Help these people today. Serve them. Answer them with good words. If you do, then they will be your servants forever.” "},{"num":8,"verse":"But Rehoboam turned away from the wise words the leaders gave him. Instead he spoke with the young men who grew up with him and stood by him. "},{"num":9,"verse":"He said to them, “What answer do you say we should give to these people who have said to me, ‘Take away some of the heavy load your father put on us’?” "},{"num":10,"verse":"The young men who grew up with him said, “This is what you should say to these people who said to you, ‘Your father made our load heavy. Now you take some of the load from us.’ You should say to them, ‘My little finger is bigger around than my father’s body! "},{"num":11,"verse":"My father gave you a heavy load. I will add to your load. My father punished you with whips. But I will punish you with scorpions.’”"},{"num":12,"verse":"Then Jeroboam and all the people came to Rehoboam on the third day as the king had told them, saying, “Return to me on the third day.” "},{"num":13,"verse":"And the king was hard in his answer to them. For he turned away from the wise words the leaders had given him. "},{"num":14,"verse":"He spoke to them as he had been told by the young men. He said, “My father made your load heavy. I will add to your load. My father punished you with whips. But I will punish you with scorpions.” "},{"num":15,"verse":"So the king did not listen to the people. The Lord had let this happen, that He might keep His Word, which the Lord spoke through Ahijah the Shilonite to Jeroboam the son of Nebat."},{"num":16,"verse":"All Israel saw that the king did not listen to them. So they said to the king, “What share do we have in David? We have no share in the son of Jesse! To your tents, O Israel! Now look after your own house, David!” So Israel went to their tents. "},{"num":17,"verse":"But as for the people of Israel who lived in the cities of Judah, Rehoboam ruled over them. "},{"num":18,"verse":"Then King Rehoboam sent Adoram, who ruled over those who were made to work, and all Israel killed him with stones. So King Rehoboam got on his war-wagon in a hurry to go to Jerusalem. "},{"num":19,"verse":"So Israel turned against the family of David to this day. "},{"num":20,"verse":"When all Israel heard that Jeroboam had returned, they sent for him to meet with the people and made him king of all Israel. Only the family of Judah followed the family of David."},{"num":21,"verse":"When Rehoboam came to Jerusalem, he gathered all the family of Judah and the family of Benjamin. He gathered together 180,000 chosen men of war to fight against the family of Israel and return the nation to Rehoboam the son of Solomon. "},{"num":22,"verse":"But the Word of God came to Shemaiah the man of God, saying, "},{"num":23,"verse":"“Speak to Solomon’s son Rehoboam king of Judah, and to all the family of Judah and Benjamin, and to the rest of the people. Tell them, "},{"num":24,"verse":"’This is what the Lord says. “You must not go up and fight against your brothers the sons of Israel. Every man return to his house. For I have let this thing happen.”’” So they listened to the word of the Lord, and returned, as the Lord told them."},{"header":"Jeroboam’s Gold Calves"},{"num":25,"verse":"Then Jeroboam built Shechem in the hill country of Ephraim, and lived there. And he went out from there and built Penuel. "},{"num":26,"verse":"Jeroboam said in his heart, “Now the nation will return to the family of David. "},{"num":27,"verse":"If these people go up to give gifts in the house of the Lord at Jerusalem, then their hearts will turn to their lord Rehoboam king of Judah. They will kill me and follow Rehoboam king of Judah.” "},{"num":28,"verse":"So the king asked the leaders what he should do. And he made two calves of gold. Then he said to the people, “It is too much for you to go up to Jerusalem. Here are your gods, O Israel, that brought you up from the land of Egypt.” "},{"num":29,"verse":"He put one in Bethel, and the other in Dan. "},{"num":30,"verse":"Now this thing became a sin. For the people went to worship in front of them, even as far as Dan. "},{"num":31,"verse":"Jeroboam made houses on high places. He made religious leaders from among all the people, who were not of the sons of Levi."},{"header":"Worship of Calves at Bethel"},{"num":32,"verse":"He made a special supper on the fifteenth day of the eighth month, like the special supper which is in Judah. And he gave gifts on the altar. He did the same in Bethel, giving gifts to the calves he had made. And he placed in Bethel the religious leaders of the high places he had made. "},{"num":33,"verse":"Then he went up to the altar he had made in Bethel on the fifteenth day of the eighth month, a day he chose in his own heart. He made a special supper for the people of Israel, and went up to the altar to burn special perfume."}]