[{"num":12,"verse":"And Rehoboam goeth to Shechem, for to Shechem hath all Israel come to make him king."},{"num":2,"verse":"And it cometh to pass, at Jeroboam son of Nebat's hearing (and he [is] yet in Egypt where he hath fled from the presence of Solomon the king, and Jeroboam dwelleth in Egypt),"},{"num":3,"verse":"that they send and call for him; and they come -- Jeroboam and all the assembly of Israel -- and speak unto Rehoboam, saying,"},{"num":4,"verse":"`Thy father made hard our yoke, and thou, now, make light [some] of the hard service of thy father, and his heavy yoke that he put upon us, and we serve thee.'"},{"num":5,"verse":"And he saith unto them, `Go -- yet three days, and come back unto me;' and the people go."},{"num":6,"verse":"And king Rehoboam consulteth with the elders who have been standing in the presence of Solomon his father, in his being alive, saying, `How are ye counselling to answer this people?'"},{"num":7,"verse":"And they speak unto him, saying, `If, to-day, thou art servant to this people, and hast served them, and answered them, and spoken unto them good words, then they have been to thee servants all the days.'"},{"num":8,"verse":"And he forsaketh the counsel of the elders which they counselled him, and consulteth with the lads who have grown up with him, who are standing before him;"},{"num":9,"verse":"and he saith unto them, `What are ye counselling, and we answer this people, who have spoken unto me, saying, Lighten [somewhat] of the yoke that thy father put upon us?'"},{"num":10,"verse":"And they speak unto him -- the lads who had grown up with him -- saying, `Thus dost thou say to this people who have spoken unto thee, saying, Thy father made our yoke heavy, and thou, make [it] light upon us; thus dost thou speak unto them, My little [finger] is thicker than the loins of my father;"},{"num":11,"verse":"and now, my father laid on you a heavy yoke, and I add to your yoke; my father chastised you with whips, and I -- I chastise you with scorpions.'"},{"num":12,"verse":"And they come -- Jeroboam and all the people -- unto Rehoboam, on the third day, as the king had spoken, saying, `Come back unto me on the third day.'"},{"num":13,"verse":"And the king answereth the people sharply, and forsaketh the counsel of the elders which they counselled him,"},{"num":14,"verse":"and speaketh unto them, according to the counsel of the lads, saying, `My father made your yoke heavy, and I add to your yoke; my father chastised you with whips, and I -- I chastise you with scorpions;'"},{"num":15,"verse":"and the king hearkened not unto the people, for the revolution was from Jehovah, in order to establish His word that Jehovah spake by the hand of Ahijah the Shilonite unto Jeroboam son of Nebat."},{"num":16,"verse":"And all Israel see that the king hath not hearkened unto them, and the people send the king back word, saying, `What portion have we in David? yea, there is no inheritance in the son of Jesse; to thy tents, O Israel; now see thy house, O David!' and Israel goeth to its tents."},{"num":17,"verse":"As to the sons of Israel, those dwelling in the cities of Judah -- over them reign doth Rehoboam."},{"num":18,"verse":"And king Rehoboam sendeth Adoram who [is] over the tribute, and all Israel cast at him stones, and he dieth; and king Rehoboam hath strengthened himself to go up into a chariot to flee to Jerusalem;"},{"num":19,"verse":"and Israel transgresseth against the house of David unto this day."},{"num":20,"verse":"And it cometh to pass, at all Israel's hearing that Jeroboam hath returned, that they send and call him unto the company, and cause him to reign over all Israel; none hath been after the house of David save the tribe of Judah alone."},{"num":21,"verse":"And Rehoboam cometh to Jerusalem, and assembleth all the house of Judah and the tribe of Benjamin, a hundred and eighty thousand chosen warriors, to fight with the house of Israel, to bring back the kingdom to Rehoboam son of Solomon."},{"num":22,"verse":"And the word of God is unto Shemaiah a man of God, saying,"},{"num":23,"verse":"`Speak unto Rehoboam son of Solomon, king of Judah, and unto all the house of Judah and Benjamin, and the rest of the people, saying,"},{"num":24,"verse":"Thus said Jehovah, Ye do not go up nor fight with your brethren the sons of Israel; turn back each to his house, for from Me hath this thing been;' and they hear the word of Jehovah, and turn back to go according to the word of Jehovah."},{"num":25,"verse":"And Jeroboam buildeth Shechem in the hill-country of Ephraim, and dwelleth in it, and goeth out thence, and buildeth Penuel;"},{"num":26,"verse":"and Jeroboam saith in his heart, `Now doth the kingdom turn back to the house of David --"},{"num":27,"verse":"if this people go up to make sacrifices in the house of Jehovah in Jerusalem, then hath the heart of this people turned back unto their lord, unto Rehoboam king of Judah, and they have slain me, and turned back unto Rehoboam king of Judah.'"},{"num":28,"verse":"And the king taketh counsel, and maketh two calves of gold, and saith unto them, `Enough to you of going up to Jerusalem; lo, thy gods, O Israel, which brought thee up out of the land of Egypt.'"},{"num":29,"verse":"And he setteth the one in Beth-El, and the other he hath put in Dan,"},{"num":30,"verse":"and this thing becometh a sin, and the people go before the one -- unto Dan."},{"num":31,"verse":"And he maketh the house of high places, and maketh priests of the extremities of the people, who were not of the sons of Levi;"},{"num":32,"verse":"and Jeroboam maketh a festival in the eighth month, in the fifteenth day of the month, like the festival that [is] in Judah, and he offereth on the altar -- so did he in Beth-El -- to sacrifice to the calves which he made, and he hath appointed in Beth-El the priests of the high places that he made."},{"num":33,"verse":"And he offereth up on the altar that he made in Beth-El, on the fifteenth day of the eighth month, in the month that he devised of his own heart, and he maketh a festival to the sons of Israel, and offereth on the altar -- to make perfume."}]