[{"num":25,"verse":"So King Nebuchadnezzar of Babylon and all his army came to fight against Jerusalem. This happened on the 10th day of the tenth month of Zedekiah’s ninth year as king. Nebuchadnezzar put his army around Jerusalem to stop people from going in and out of the city. Then he built a wall of dirt around the city."},{"num":2,"verse":"His army stayed around Jerusalem until Zedekiah’s eleventh year as king of Judah."},{"num":3,"verse":"The famine was getting worse and worse in the city. By the 9th day of the fourth month, there was no more food for the common people in the city."},{"num":4,"verse":"Nebuchadnezzar’s army finally broke through the city wall. That night King Zedekiah and all his soldiers ran away. They used the secret gate that went through the double walls. It was by the king’s garden. The enemy soldiers were all around the city, but Zedekiah and his men escaped on the road to the desert."},{"num":5,"verse":"The Babylonian army chased King Zedekiah and caught him near Jericho. All of Zedekiah’s soldiers left him and ran away."},{"num":6,"verse":"The Babylonians took King Zedekiah to the king of Babylon at Riblah. The Babylonians decided to punish Zedekiah."},{"num":7,"verse":"They killed Zedekiah’s sons in front of him. Then they put out Zedekiah’s eyes. They put chains on him and took him to Babylon."},{"header":"Jerusalem Is Destroyed"},{"num":8,"verse":"Nebuchadnezzar came to Jerusalem on the 7th day of the fifth month of his nineteenth year as king of Babylon. The captain of Nebuchadnezzar’s best soldiers was Nebuzaradan."},{"num":9,"verse":"Nebuzaradan burned the Lord’s Temple, the king’s palace, and all the houses in Jerusalem. He destroyed even the largest houses."},{"num":10,"verse":"Then the Babylonian army that was with Nebuzaradan pulled down the walls around Jerusalem."},{"num":11,"verse":"Nebuzaradan captured all the people who were still left in the city. He took all the people as prisoners, even those who had tried to surrender."},{"num":12,"verse":"He let only the poorest of the common people stay there. He let them stay so that they could take care of the grapes and other crops."},{"num":13,"verse":"The Babylonian soldiers broke into pieces all the bronze things in the Lord’s Temple. They broke the bronze columns, the bronze carts, and the large bronze tank that were in the Lord’s Temple. Then they took all of that bronze to Babylon."},{"num":14,"verse":"The Babylonians also took the pots, the shovels, the tools for trimming the lamps, the spoons, and all the bronze dishes that were used in the Temple."},{"num":15,"verse":"Nebuzaradan took all the firepans and bowls. He took all the things made of gold for the gold. And he took everything made of silver for the silver."},{"num":16,"verse":"So Nebuzaradan took the large bronze tank and the 2 bronze columns. (Each column was about 31 feet tall. The capitals on the columns were over 5 feet tall. They were made from bronze and had a design like a net and pomegranates. Both columns had the same kind of design.) He also took the carts that Solomon made for the Lord’s Temple. The bronze from these things was too heavy to be weighed."},{"header":"The People of Judah Taken as Prisoners"},{"num":18,"verse":"From the Temple, Nebuzaradan took Seraiah the high priest, Zephaniah the second priest, and the three men who guarded the entrance."},{"num":19,"verse":"From the city Nebuzaradan took one official who was in charge of the army and five of the king’s advisors who were still in the city. He took one secretary of the commander of the army who was in charge of counting the common people and choosing some of them to be soldiers and 60 people who just happened to be in the city."},{"num":20,"verse":"Then Nebuzaradan took all these people to the king of Babylon at Riblah in the area of Hamath. The king of Babylon killed them there at Riblah. And the people of Judah were led away as prisoners from their land."},{"header":"Gedaliah, Governor of Judah"},{"num":22,"verse":"King Nebuchadnezzar of Babylon left some people in the land of Judah. There was a man named Gedaliah son of Ahikam son of Shaphan. Nebuchadnezzar made Gedaliah governor over the people in Judah."},{"num":23,"verse":"The army captains were Ishmael son of Nethaniah, Johanan son of Kareah, Seraiah son of Tanhumeth from Netophah, and Jaazaniah son of the Maacathite. These army captains and their men heard that the king of Babylon had made Gedaliah governor, so they went to Mizpah to meet with him."},{"num":24,"verse":"Gedaliah made promises to these officers and their men. He said to them, “Don’t be afraid of the Babylonian officers. Stay here and serve the king of Babylon. Then everything will be all right with you.”"},{"num":25,"verse":"Ishmael son of Nethaniah son of Elishama was from the king’s family. In the seventh month, Ishmael and ten of his men attacked Gedaliah and killed all the men of Judah and Babylonians who were with Gedaliah at Mizpah."},{"num":26,"verse":"Then the army officers and all the people ran away to Egypt. Everyone, from the least important to the most important, ran away because they were afraid of the Babylonians."},{"num":27,"verse":"Later, Evil Merodach became the king of Babylon. He let King Jehoiachin of Judah out of prison. This happened in the 37th year after Jehoiachin was captured. This was on the 27th day of the twelfth month from the time that Evil Merodach began to rule."},{"num":28,"verse":"Evil Merodach was kind to Jehoiachin. He gave him a more important place to sit than the other kings who were with him in Babylon."},{"num":29,"verse":"Evil Merodach let Jehoiachin stop wearing prison clothes. And every day for the rest of his life, he ate at the same table with the king."},{"num":30,"verse":"And each day, for as long as Jehoiachin lived, the king gave him enough money to pay for whatever he needed."}]