[{"num":25,"verse":"Then Nebuchadnezzar king of Babylon marched against Jerusalem with his whole army. This happened during Zedekiah’s ninth year, tenth month and tenth day as king. He made a camp around the city. Then he built devices all around the city walls to attack it. "},{"num":2,"verse":"The city was under attack until Zedekiah’s eleventh year as king. "},{"num":3,"verse":"By the ninth day of the fourth month, the hunger was terrible in the city. There was no food for the people to eat. "},{"num":4,"verse":"Then the city wall was broken through. And the whole army ran away at night. They went through the gate between the two walls by the king’s garden. The Babylonians were still surrounding the city. Zedekiah and his men ran toward the Jordan Valley. "},{"num":5,"verse":"But the Babylonian army chased King Zedekiah. They caught up with him in the plains of Jericho. All of his army was scattered from him. "},{"num":6,"verse":"So they captured Zedekiah and took him to the king of Babylon at Riblah. There he passed sentence on Zedekiah. "},{"num":7,"verse":"They killed Zedekiah’s sons as he watched. Then they put out his eyes. They put bronze chains on him and took him to Babylon."},{"num":8,"verse":"Nebuzaradan was the commander of the king’s special guards. This officer of the king of Babylon came to Jerusalem. This was on the seventh day of the fifth month. This was in Nebuchadnezzar’s nineteenth year as king of Babylon. "},{"num":9,"verse":"Nebuzaradan set fire to the Temple of the Lord and the palace. He also set fire to all the houses of Jerusalem. Every important building was burned."},{"num":10,"verse":"The whole Babylonian army broke down the walls around Jerusalem. That army was led by the commander of the king’s special guards. "},{"num":11,"verse":"Nebuzaradan, the commander of the guards, took captive the people left in Jerusalem. And he took captive those who had surrendered to the king of Babylon. The rest of the people were also taken away. "},{"num":12,"verse":"But the commander left behind some of the poorest people of the land. They were to take care of the vineyards and fields."},{"num":13,"verse":"The Babylonians broke up the bronze pillars, the bronze stands and the large bronze bowl, which was called the Sea. These were in the Temple of the Lord. Then they carried the bronze to Babylon. "},{"num":14,"verse":"They also took the pots, shovels, wick trimmers, dishes and all the bronze objects. These were used to serve in the Temple. "},{"num":15,"verse":"The commander of the king’s special guards took away the pans for carrying hot coals. He also took the bowls and everything made of pure gold or silver. "},{"num":16,"verse":"There was so much bronze that it could not be weighed. There were two pillars and the large bronze bowl. There were also the movable stands which Solomon had made for the Temple of the Lord. "},{"num":17,"verse":"Each pillar was about 27 feet high. The bronze capital on top of the pillar was about 4½ feet high. It was decorated with a net design and bronze pomegranates all around it. The other pillar also had a net design. It was like the first pillar."},{"header":"Judah Is Taken Prisoner"},{"num":18,"verse":"The commander of the guards took some prisoners. He took Seraiah the chief priest, Zephaniah the priest next in rank, and the three doorkeepers. "},{"num":19,"verse":"The commander also took other people who were still in the city. He took the officer in charge of the fighting men. He also took five people who advised the king. And he took the royal assistant who selected people for the army. And he took 60 other men who were in the city. "},{"num":20,"verse":"Nebuzaradan, the commander, took all these people. And he brought them to the king of Babylon at Riblah. "},{"num":21,"verse":"There at Riblah, in the land of Hamath, the king had them killed. So the people of Judah were led away from their country as captives."},{"header":"Gedaliah Becomes Governor"},{"num":22,"verse":"Nebuchadnezzar king of Babylon left some people in the land of Judah. He appointed Gedaliah son of Ahikam as governor. (Ahikam was the son of Shaphan.)"},{"num":23,"verse":"The army captains and their men heard that the king of Babylon had made Gedaliah governor. So they all came to Gedaliah at Mizpah. They were Ishmael son of Nethaniah and Johanan son of Kareah. Also there were Seraiah son of Tanhumeth the Netophathite, Jaazaniah son of the Maacathite and their men. "},{"num":24,"verse":"Then Gedaliah made promises to these army captains and their men. He said, “Don’t be afraid of the Babylonian officers. Live in the land and serve the king of Babylon. Then everything will go well for you.”"},{"num":25,"verse":"Ishmael was the son of Nethaniah. Nethaniah was the son of Elishama from the king’s family. In the seventh month Ishmael came with ten men and killed Gedaliah. They also killed the men of Judah and Babylon who were with Gedaliah at Mizpah. "},{"num":26,"verse":"Then all the people, from the least important to the most important, ran away to Egypt. The army leaders also went. This was because they were afraid of the Babylonians."},{"header":"Jehoiachin Is Set Free"},{"num":27,"verse":"Jehoiachin king of Judah was held in Babylon for 37 years. In the thirty-seventh year Evil-Merodach became king of Babylon. He let Jehoiachin out of prison on the twenty-seventh day of the twelfth month. "},{"num":28,"verse":"Evil-Merodach spoke kindly to Jehoiachin. He gave Jehoiachin a seat of honor. It was above the seats of the other kings who were with him in Babylon. "},{"num":29,"verse":"So Jehoiachin put away his prison clothes. For the rest of his life, he ate at the king’s table. "},{"num":30,"verse":"Every day the king gave Jehoiachin an allowance. This lasted as long as he lived."}]