[{"header":"A deeper revealing of God’s character"},{"num":34,"verse":"The Lord said to Moses, “Cut two stone tablets like the first ones. I’ll write on these tablets the words that were on the first tablets, which you broke into pieces."},{"num":2,"verse":"Get ready in the morning and come up to Mount Sinai. Stand there on top of the mountain in front of me."},{"num":3,"verse":"No one else can come up with you. Don’t allow anyone even to be seen anywhere on the mountain. Don’t even let sheep and cattle graze in front of the mountain.”"},{"num":4,"verse":"So Moses cut two stone tablets like the first ones. He got up early in the morning and climbed up Mount Sinai, just as the Lord had commanded him. He carried the two stone tablets in his hands."},{"num":5,"verse":"The Lord came down in the cloud and stood there with him, and proclaimed the name, “The Lord.”"},{"num":6,"verse":"The Lord passed in front of him and proclaimed:"},{"num":8,"verse":"At once Moses bowed to the ground and worshipped."},{"num":9,"verse":"He said, “If you approve of me, my Lord, please go along with us. Although these are stubborn people, forgive our guilt and our sin and take us as your own possession.”"},{"header":"Renewing the broken covenant"},{"num":10,"verse":"The Lord said: I now make a covenant. In front of all your people, I’ll perform dramatic displays of power that have never been done before anywhere on earth or in any nation. All the people who are around you will see what the Lord does, because I will do an awesome thing with you."},{"num":11,"verse":"Be sure to obey what I command you today. I’m about to drive out before you the Amorites, the Canaanites, the Hittites, the Perizzites, the Hivites, and the Jebusites."},{"num":12,"verse":"Be careful that you don’t make a covenant with the inhabitants of the land to which you are going, or it will become a dangerous trap for you."},{"num":13,"verse":"You must tear down their altars, smash their sacred stone pillars, and cut down their sacred poles."},{"num":14,"verse":"You must not bow down to another god, because the Lord is passionate: the Lord’s name means “a passionate God.”"},{"num":15,"verse":"Don’t make a covenant with those who live in the land. When they prostitute themselves with their gods and sacrifice to their gods, they may invite you and you may end up eating some of the sacrifice."},{"num":16,"verse":"Then you might go and choose their daughters as wives for your sons. And their daughters who prostitute themselves with their gods might lead your sons to prostitute themselves with their gods."},{"num":17,"verse":"Don’t make metal gods for yourself."},{"num":18,"verse":"Observe the Festival of Unleavened Bread. You should eat unleavened bread for seven days, as I commanded you, at the set time in the month of Abib, because it was in the month of Abib that you came out of Egypt."},{"num":19,"verse":"Every first offspring is mine. That includes all your male livestock, the oldest offspring of cows and sheep."},{"num":20,"verse":"But a donkey’s oldest offspring you may ransom with a sheep. Or if you don’t ransom it, you must break its neck. You should ransom all of your oldest sons."},{"num":21,"verse":"You should do your work for six days, but on the seventh day you should rest. Even during plowing or harvesttime you should rest."},{"num":22,"verse":"You should observe the Festival of Weeks, for the early produce of the wheat harvest, and the Gathering Festival at the end of the year."},{"num":23,"verse":"All your males should appear three times a year before the Lord God, Israel’s God."},{"num":24,"verse":"I will drive out nations before you and extend your borders. No one will desire and try to take your land if you go up and appear before the Lord your God three times a year."},{"num":25,"verse":"Don’t slaughter the blood of my sacrifice with anything leavened. The sacrifice of the Passover Festival shouldn’t be left over until the morning."},{"num":26,"verse":"Bring the best of the early produce of your farmland to the Lord your God’s temple."},{"num":27,"verse":"The Lord said to Moses: “Write down these words because by these words I hereby make a covenant with you and with Israel.”"},{"num":28,"verse":"Moses was there with the Lord forty days and forty nights. He didn’t eat any bread or drink any water. He wrote on the tablets the words of the covenant, the ten words."},{"header":"Moses’ brightly shining face"},{"num":29,"verse":"Moses came down from Mount Sinai. As he came down from the mountain with the two covenant tablets in his hand, Moses didn’t realize that the skin of his face shone brightly because he had been talking with God."},{"num":30,"verse":"When Aaron and all the Israelites saw the skin of Moses’ face shining brightly, they were afraid to come near him."},{"num":31,"verse":"But Moses called them closer. So Aaron and all the leaders of the community came back to him, and Moses spoke with them."},{"num":32,"verse":"After that, all the Israelites came near as well, and Moses commanded them everything that the Lord had spoken with him on Mount Sinai."},{"num":33,"verse":"When Moses finished speaking with them, he put a veil over his face."},{"num":34,"verse":"Whenever Moses went into the Lord’s presence to speak with him, Moses would take the veil off until he came out again. When Moses came out and told the Israelites what he had been commanded,"},{"num":35,"verse":"the Israelites would see that the skin of Moses’ face was shining brightly. So Moses would put the veil on his face again until the next time he went in to speak with the Lord."}]