[{"header":"Chapter 34"},{"num":1,"verse":"Renewal of the Tablets. The Lord said to Moses: “Cut two stone tablets like the former, that I may write on them the words which were on the former tablets that you broke. "},{"num":2,"verse":"Get ready for tomorrow morning, when you are to go up Mount Sinai and there present yourself to me on the top of the mountain. "},{"num":3,"verse":"No one shall come up with you, and let no one even be seen on any part of the mountain; even the sheep and the cattle are not to graze in front of this mountain.” "},{"num":4,"verse":"Moses then cut two stone tablets like the former, and early the next morning he went up Mount Sinai as the Lord had commanded him, taking in his hand the two stone tablets."},{"num":5,"verse":"The Lord came down in a cloud and stood with him there and proclaimed the name, “Lord.” "},{"num":6,"verse":"So the Lord passed before him and proclaimed: The Lord, the Lord, a God gracious and merciful, slow to anger and abounding in love and fidelity, "},{"num":7,"verse":"continuing his love for a thousand generations, and forgiving wickedness, rebellion, and sin; yet not declaring the guilty guiltless, but bringing punishment for their parents’ wickedness on children and children’s children to the third and fourth generation! "},{"num":8,"verse":"Moses at once knelt and bowed down to the ground. "},{"num":9,"verse":"Then he said, “If I find favor with you, Lord, please, Lord, come along in our company. This is indeed a stiff-necked people; yet pardon our wickedness and sins, and claim us as your own.”"},{"num":10,"verse":"Religious Laws. The Lord said: Here is the covenant I will make. Before all your people I will perform marvels never before done in any nation anywhere on earth, so that all the people among whom you live may see the work of the Lord. Awe-inspiring are the deeds I will perform with you! "},{"num":11,"verse":"As for you, observe what I am commanding you today."},{"num":12,"verse":"Take care not to make a covenant with the inhabitants of the land that you are to enter; lest they become a snare among you. "},{"num":13,"verse":"Tear down their altars; smash their sacred stones, and cut down their asherahs. "},{"num":14,"verse":"You shall not bow down to any other god, for the Lord—“Jealous” his name—is a jealous God. "},{"num":15,"verse":"Do not make a covenant with the inhabitants of the land; else, when they prostitute themselves with their gods and sacrifice to them, one of them may invite you and you may partake of the sacrifice. "},{"num":16,"verse":"And when you take their daughters as wives for your sons, and their daughters prostitute themselves with their gods, they will make your sons do the same."},{"num":17,"verse":"You shall not make for yourselves molten gods."},{"num":18,"verse":"You shall keep the festival of Unleavened Bread. For seven days at the appointed time in the month of Abib you are to eat unleavened bread, as I commanded you; for in the month of Abib you came out of Egypt."},{"num":19,"verse":"To me belongs every male that opens the womb among all your livestock, whether in the herd or in the flock. "},{"num":20,"verse":"The firstling of a donkey you shall redeem with a lamb; if you do not redeem it, you must break its neck. The firstborn among your sons you shall redeem."},{"num":21,"verse":"Six days you may labor, but on the seventh day you shall rest; even during the seasons of plowing and harvesting you must rest."},{"num":22,"verse":"You shall keep the feast of Weeks with the first fruits of the wheat harvest, likewise, the feast of the Ingathering at the close of the year. "},{"num":23,"verse":"Three times a year all your men shall appear before the Lord, the Lord God of Israel. "},{"num":24,"verse":"Since I will drive out the nations before you and enlarge your territory, no one will covet your land when you go up three times a year to appear before the Lord, your God."},{"num":25,"verse":"You shall not offer me the blood of sacrifice with anything leavened, nor shall the sacrifice of the Passover feast be kept overnight for the next day."},{"num":26,"verse":"The choicest first fruits of your soil you shall bring to the house of the Lord, your God."},{"num":27,"verse":"Radiance of Moses’ Face. Then the Lord said to Moses: Write down these words, for in accordance with these words I have made a covenant with you and with Israel. "},{"num":28,"verse":"So Moses was there with the Lord for forty days and forty nights, without eating any food or drinking any water, and he wrote on the tablets the words of the covenant, the ten words."},{"num":29,"verse":"As Moses came down from Mount Sinai with the two tablets of the covenant in his hands, he did not know that the skin of his face had become radiant while he spoke with the Lord. "},{"num":30,"verse":"When Aaron, then, and the other Israelites saw Moses and noticed how radiant the skin of his face had become, they were afraid to come near him. "},{"num":31,"verse":"Only after Moses called to them did Aaron and all the leaders of the community come back to him. Moses then spoke to them. "},{"num":32,"verse":"Later, all the Israelites came up to him, and he enjoined on them all that the Lord had told him on Mount Sinai. "},{"num":33,"verse":"When Moses finished speaking with them, he put a veil over his face. "},{"num":34,"verse":"Whenever Moses entered the presence of the Lord to speak with him, he removed the veil until he came out again. On coming out, he would tell the Israelites all that he had been commanded. "},{"num":35,"verse":"Then the Israelites would see that the skin of Moses’ face was radiant; so he would again put the veil over his face until he went in to speak with the Lord."}]