[{"header":"The Two Tablets Replaced"},{"num":34,"verse":"Now the Lord said to Moses, “Cut out for yourself two stone tablets like the former ones, and I will write on the tablets the words that were on the former tablets which you smashed."},{"num":2,"verse":"So be ready by morning, and come up in the morning to Mount Sinai, and present yourself there to Me on the top of the mountain."},{"num":3,"verse":"And no one is to come up with you, nor let anyone be seen anywhere on the mountain; even the flocks and the herds are not to graze in front of that mountain.”"},{"num":4,"verse":"So he cut out two stone tablets like the former ones, and Moses got up early in the morning and went up to Mount Sinai, as the Lord had commanded him, and he took the two stone tablets in his hand."},{"num":5,"verse":"And the Lord descended in the cloud and stood there with him as he called upon the name of the Lord."},{"num":6,"verse":"Then the Lord passed by in front of him and proclaimed, “The Lord, the Lord God, compassionate and merciful, slow to anger, and abounding in faithfulness and truth;"},{"num":7,"verse":"who keeps faithfulness for thousands, who forgives wrongdoing, violation of His Law, and sin; yet He will by no means leave the guilty unpunished, inflicting the punishment of fathers on the children and on the grandchildren to the third and fourth generations.”"},{"num":8,"verse":"And Moses hurried to bow low toward the ground and worship."},{"num":9,"verse":"Then he said, “If in any way I have found favor in Your sight, Lord, please may the Lord go along in our midst, even though the people are so obstinate, and pardon our wrongdoing and our sin, and take us as Your own possession.”"},{"header":"The Covenant Renewed"},{"num":10,"verse":"Then God said, “Behold, I am going to make a covenant. Before all your people I will perform miracles which have not been produced in all the earth nor among any of the nations; and all the people among whom you live will see the working of the Lord, for it is a fearful thing that I am going to perform with you."},{"num":11,"verse":"“Be sure to comply with what I am commanding you this day: behold, I am going to drive out the Amorite from you, and the Canaanite, the Hittite, the Perizzite, the Hivite, and the Jebusite."},{"num":12,"verse":"Be careful that you do not make a covenant with the inhabitants of the land into which you are going, or it will become a snare in your midst."},{"num":13,"verse":"But rather, you are to tear down their altars and smash their memorial stones, and cut down their Asherim"},{"num":14,"verse":"—for you shall not worship any other god, because the Lord, whose name is Jealous, is a jealous God—"},{"num":15,"verse":"otherwise you might make a covenant with the inhabitants of the land, and they would prostitute themselves with their gods and sacrifice to their gods, and someone might invite you to eat of his sacrifice,"},{"num":16,"verse":"and you might take some of his daughters for your sons, and his daughters might prostitute themselves with their gods and cause your sons also to prostitute themselves with their gods."},{"num":17,"verse":"You shall not make for yourself any gods cast in metal."},{"num":18,"verse":"“You shall keep the Feast of Unleavened Bread. For seven days you are to eat unleavened bread, as I commanded you, at the appointed time in the month of Abib; for in the month of Abib you came out of Egypt."},{"num":19,"verse":"“The firstborn from every womb belongs to Me, and all your male livestock, the firstborn from cattle and sheep."},{"num":20,"verse":"You shall redeem with a lamb the firstborn from a donkey; and if you do not redeem it, then you shall break its neck. You shall redeem all the firstborn of your sons. None are to appear before Me empty-handed."},{"num":21,"verse":"“You shall work six days, but on the seventh day you shall rest; even during plowing time and harvest you shall rest."},{"num":22,"verse":"And you shall celebrate the Feast of Weeks, that is, the first fruits of the wheat harvest, and the Feast of Ingathering at the turn of the year."},{"num":23,"verse":"Three times a year all your males are to appear before the Lord God, the God of Israel."},{"num":24,"verse":"For I will drive out nations from you and enlarge your borders, and no one will covet your land when you go up three times a year to appear before the Lord your God."},{"num":25,"verse":"“You shall not offer the blood of My sacrifice with leavened bread, nor is the sacrifice of the Feast of the Passover to be left over until morning."},{"num":26,"verse":"“You shall bring the very first of the first fruits of your soil into the house of the Lord your God."},{"num":27,"verse":"Then the Lord said to Moses, “Write down these words, for in accordance with these words I have made a covenant with you and with Israel.”"},{"num":28,"verse":"So he was there with the Lord for forty days and forty nights; he did not eat bread or drink water. And He wrote on the tablets the words of the covenant, the Ten Commandments."},{"header":"Moses’ Face Shines"},{"num":29,"verse":"And it came about, when Moses was coming down from Mount Sinai (and the two tablets of the testimony were in Moses’ hand as he was coming down from the mountain), that Moses did not know that the skin of his face shone because of his speaking with Him."},{"num":30,"verse":"So when Aaron and all the sons of Israel saw Moses, behold, the skin of his face shone, and they were afraid to approach him."},{"num":31,"verse":"Then Moses called to them, and Aaron and all the rulers in the congregation returned to him; and Moses spoke to them."},{"num":32,"verse":"Afterward all the sons of Israel came near, and he commanded them to do everything that the Lord had spoken to him on Mount Sinai."},{"num":33,"verse":"When Moses had finished speaking with them, he put a veil over his face."},{"num":34,"verse":"But whenever Moses went in before the Lord to speak with Him, he would take off the veil until he came out; and whenever he came out and spoke to the sons of Israel what he had been commanded,"},{"num":35,"verse":"the sons of Israel would see the face of Moses, that the skin of Moses’ face shone. So Moses would put the veil back over his face until he went in to speak with Him."}]