[{"num":33,"verse":"These be the dwellings of the sons of Israel, that went out of the land of Egypt, by their companies, in the hand of Moses and Aaron; (These be the dwelling places of the Israelites, after they went out of the land of Egypt, by their companies, or their tribes, under the hand of Moses and Aaron;)"},{"num":2,"verse":"which dwellings Moses described by the places of (the) tents, that were changed by commandment of the Lord. (and Moses wrote down each place where they pitched their tents, by the Lord’s command.)"},{"num":3,"verse":"Therefore the sons of Israel went forth in an high hand from Rameses, in the first month, in the fifteenth day of the first month, in the tother day of pask, that is, in the morrow of the offering of the lamb of pask, while all [the] Egyptians saw, (And so the Israelites went forth defiantly from Rameses, in the first month, on the fifteenth day of the first month, on the day after the first Passover, that is, in the morning after the offering of the lamb of the first Passover, while all the Egyptians watched,)"},{"num":4,"verse":"and (while) the Egyptians buried their first begotten (male) children, which the Lord had slain; for the Lord took vengeance also upon their gods. (and while the Egyptians buried their first-born sons, whom the Lord had killed; and the Lord also took vengeance upon their gods, and their animals.)"},{"num":5,"verse":"The sons of Israel (first) setted tents in Succoth, (The Israelites first pitched their tents at Succoth,)"},{"num":6,"verse":"and from Succoth they came into Etham, which is in the last coasts of the wilderness; (and from Succoth they went to Etham, which is on the edge of the wilderness;)"},{"num":7,"verse":"from thence they went forth, and came against Pihahiroth, which beholdeth Baalzephon, and setted tents before Migdol. (and they went forth from Etham, and turned back near Pihahiroth, east of Baalzephon, and pitched their tents near Migdol.)"},{"num":8,"verse":"And they went forth from Pihahiroth, and they passed through the midst of the sea into wilderness, and they went three days by the desert of Etham, and setted tents in Marah. (And they went forth from Pihahiroth, and they passed through the midst of the Red Sea to the wilderness, and went for three days in the wilderness of Etham, and pitched their tents at Marah.)"},{"num":9,"verse":"And they went forth from Marah, and came into Elim, where (there) were twelve wells of water, and seventy palm trees; and there they setted tents (and they pitched their tents at Elim)."},{"num":10,"verse":"But also they went forth from thence, and setted tents on the Red Sea. (And they went forth from Elim, and pitched their tents by the Red Sea.)"},{"num":11,"verse":"And they went forth from the Red Sea, and setted tents in the desert of Sin (and pitched their tents in the wilderness of Sin),"},{"num":12,"verse":"from whence they went forth, and came into Dophkah. (and they went forth from the wilderness of Sin, and pitched their tents at Dophkah.)"},{"num":13,"verse":"And they went forth from Dophkah, and setted tents in Alush (and pitched their tents at Alush)."},{"num":14,"verse":"And they went forth from Alush, and setted tents in Rephidim, where water failed to the people (for) to drink (where there was no water for the people to drink)."},{"num":15,"verse":"And they went forth from Rephidim, and setted tents in the desert of Sinai (and pitched their tents in the Sinai Desert)."},{"num":16,"verse":"But also they went out of the wilderness of Sinai, and came to the Sepulchres of Covetousness, or Lust. (And they went forth from the Sinai Desert, and came to Kibrothhattaavah.)"},{"num":17,"verse":"And they went forth from the Sepulchres of Covetousness, or Lust, and setted tents in Hazeroth. (And they went forth from Kibrothhattaavah, and pitched their tents at Hazeroth.)"},{"num":18,"verse":"And from Hazeroth they came into Rithmah. (And they went forth from Hazeroth, and pitched their tents at Rithmah.)"},{"num":19,"verse":"And they went forth from Rithmah, and setted tents in Rimmonparez (and pitched their tents at Rimmonparez);"},{"num":20,"verse":"from whence they went forth, and came into Libnah. (and they went forth from Rimmonparez, and pitched their tents at Libnah.)"},{"num":21,"verse":"And from Libnah they setted tents in Rissah. (And they went forth from Libnah, and pitched their tents at Rissah.)"},{"num":22,"verse":"And they went forth from Rissah, and came into Kehelathah (and pitched their tents at Kehelathah);"},{"num":23,"verse":"from whence they went forth, and setted tents in the hill of Shapher. (and they went forth from Kehelathah, and pitched their tents on Mount Shapher.)"},{"num":24,"verse":"And they went forth from the hill of Shapher, and they came into Haradah; (And they went forth from Mount Shapher, and pitched their tents at Haradah;)"},{"num":25,"verse":"from thence they went forth, and setted tents in Makheloth. (and they went forth from Haradah, and pitched their tents at Makheloth.)"},{"num":26,"verse":"And they went forth from Makheloth, and came into Tahath (and pitched their tents at Tahath)."},{"num":27,"verse":"From Tahath they setted tents in Tarah; (And they went forth from Tahath, and pitched their tents at Tarah;)"},{"num":28,"verse":"from whence they went forth, and setted tents in Mithcah. (and they went forth from Tarah, and pitched their tents at Mithcah.)"},{"num":29,"verse":"And from Mithcah they setted tents in Hashmonah. (And they went forth from Mithcah, and pitched their tents at Hashmonah.)"},{"num":30,"verse":"And they went forth from Hashmonah, and came into Moseroth (and pitched their tents at Moseroth);"},{"num":31,"verse":"and from Moseroth they setted tents in Benejaakan. (and they went forth from Moseroth, and pitched their tents at Benejaakan.)"},{"num":32,"verse":"And they went forth from Benejaakan, and came into the hill of Gidgad (and pitched their tents at Horhaggidgad);"},{"num":33,"verse":"from whence they went forth, and setted tents in Jotbathah. (and they went forth from Horhaggidgad, and pitched their tents at Jotbathah.)"},{"num":34,"verse":"And from Jotbathah they came into Ebronah. (And they went forth from Jotbathah, and pitched their tents at Ebronah.)"},{"num":35,"verse":"And they went forth from Ebronah, and setted tents in Eziongaber (and pitched their tents at Eziongaber);"},{"num":36,"verse":"from thence they went forth, and came into the desert of Zin; this is Kadesh. (and they went forth from Eziongaber, and pitched their tents in the wilderness of Zin; that is, Kadesh.)"},{"num":37,"verse":"And they went forth from Kadesh, and they setted tents in the hill of Hor, in the last coasts of the land of Edom. (And they went forth from Kadesh, and they pitched their tents on Mount Hor, on the border of Edom.)"},{"num":38,"verse":"And Aaron, the priest, ascended into the hill of Hor, for the Lord commanded, and there he was dead, in the fortieth year of the going out of the sons of Israel from Egypt, in the fifth month, in the first day of the month; (And Aaron, the priest, went up on Mount Hor, as the Lord commanded, and he died there, in the fortieth year of the going out of the Israelites from Egypt, in the fifth month, on the first day of the month;)"},{"num":39,"verse":"when he was of an hundred and three and twenty years old."},{"num":40,"verse":"And (the) Canaanite, the king of Arad, that dwelled at the south (who lived in the south), in the land of Canaan, heard that the sons of Israel came thither."},{"num":41,"verse":"And they went forth from the hill of Hor, and setted tents in Zalmonah; (And they went forth from Mount Hor, and pitched their tents at Zalmonah;)"},{"num":42,"verse":"from thence they went forth, and came into Punon. (and they went forth from Zalmonah, and pitched their tents at Punon.)"},{"num":43,"verse":"And they went forth from Punon, and setted tents in Oboth (and pitched their tents at Oboth)."},{"num":44,"verse":"And from Oboth they came into Iyeabarim, that is, into the wilderness of Abarim, which is in the ends of Moabites. (And they went forth from Oboth, and pitched their tents at Iyeabarim, that is, in the wilderness of Abarim, which is on the border of Moab.)"},{"num":45,"verse":"And they went forth from Iyeabarim, and they setted tents in Dibon of Gad; (And they went forth from Iyeabarim, or Iyim, and they pitched their tents at Dibongad;)"},{"num":46,"verse":"from whence they went forth, and setted tents in Almon of Diblathaim, (and they went forth from Dibongad, and pitched their tents at Almon of Diblathaim,)"},{"num":47,"verse":"And they went forth from Almon of Diblathaim, and they came to the hills of Abarim, against Nebo (and they pitched their tents in the Abarim mountains, near Nebo)."},{"num":48,"verse":"And they went forth from the hills of Abarim, and passed to the field places of Moab, over Jordan, against Jericho. (And they went forth from the Abarim mountains, and came to the plains of Moab, across the Jordan River, opposite Jericho.)"},{"num":49,"verse":"And there they setted tents, from Bethjesimoth till to Abelshittim, in the plainer places of Moabites, (And they pitched their tents there, from Bethjesimoth to Abelshittim, on the plains of Moab,)"},{"num":50,"verse":"where the Lord spake to Moses, (and said,)"},{"num":51,"verse":"Command thou to the sons of Israel, and say thou to them, When ye have passed (over) Jordan (When ye have crossed over the Jordan River), and have entered into the land of Canaan,"},{"num":52,"verse":"destroy ye all the dwellers of that country; break ye the titles, that is, altars, and drive ye to powder the images, and destroy ye all high things, (destroy ye all the inhabitants of that country; break ye up their titles, that is, their altars, and drive ye into powder their images, and destroy ye all their high places of worship, or the hill shrines,)"},{"num":53,"verse":"and cleanse ye (out) the land, and (kill ye) all the men dwelling therein. For I have given to you that land into possession (For I have given you that land for a possession),"},{"num":54,"verse":"which ye shall part to you by lot; to more men in number ye shall give larger land, and to fewer men in number straiter, or less, land, as the lot falleth to all men, so [the] heritage shall be given; the possession shall be parted to lineages and families. (which ye shall divide among yourselves by lot; to those greater in number ye shall give more land, and to those fewer in number, less land, as the lot falleth to all, so the inheritance shall be given; the possession shall be divided among tribes and families.)"},{"num":55,"verse":"But if ye will not slay the dwellers of the land, they, that abide, shall be to you as nails in the eyes, and as spears in the sides; and they shall be adversaries to you in the land of your habitation; (But if ye do not kill all the inhabitants of the land, they, who remain, shall be to you like nails in your eyes, and like spears in your sides; and they shall be your adversaries in the very land where you live;)"},{"num":56,"verse":"and whatever thing I (had) thought to do to them, I shall do to you."}]