[{"num":11,"verse":"1 Athaliah putteth to death all the King’s sons, except Joash the son of Ahaziah. 4 Joash is appointed King. 15 Jehoiada causeth Athaliah to be slain. 17 He maketh a covenant between God and the people. 18 Baal and his priests are destroyed."},{"num":1,"verse":"Then Athaliah the mother of Ahaziah when she saw that her son was dead, she arose, and destroyed all the King’s seed."},{"num":2,"verse":"But Jehosheba the daughter of king Joram, and sister to Ahaziah took Joash the son of Ahaziah, and stole him from among the King’s sons that should be slain, both him and his nurse, keeping them in the bedchamber, and they hid him from Athaliah, so that he was not slain."},{"num":3,"verse":"And he was with her hid in the house of the Lord six years, and Athaliah did reign over the land."},{"num":4,"verse":"¶ And the seventh year Jehoiada sent and took the captains over hundreds, with other captains and them of the guard, and caused them to come unto him into the house of the Lord, and made a covenant with them, and took an oath of them in the house of the Lord, and showed them the King’s son."},{"num":5,"verse":"And he commanded them, saying, This is it that ye must do, The third part of you, that cometh on the Sabbath, shall ward toward the King’s house:"},{"num":6,"verse":"And another third part in the gate of Sur: and another third part in the gate behind them of the guard: and ye shall keep watch in the house of Massah."},{"num":7,"verse":"And two parts of you, that is, all that go out on the Sabbath day, shall keep the watch of the house of the Lord about the king."},{"num":8,"verse":"And ye shall compass the King round about, every man with his weapon in his hand, and whosoever cometh within the ranges, let him be slain: be you with the King, as he goeth out and in."},{"num":9,"verse":"¶ And the captains of the hundreds did according to all that Jehoiada the Priest commanded, and they took every man of his men that entered into their charge on the Sabbath, with them that went out of it on the Sabbath, and came to Jehoiada the Priest."},{"num":10,"verse":"And the Priest gave to the captains of hundreds the spears and the shields that were King David’s, and were in the house of the Lord."},{"num":11,"verse":"And the guard stood, every man with his weapon in his hand, from the right side of the house to the left side, about the altar and about the house, round about the King."},{"num":12,"verse":"Then he brought out the king’s son, and put the crown upon him, and gave him the Testimony, and they made him king: also they anointed him, and clapped their hands, and said, God save the King."},{"num":13,"verse":"¶ And when Athaliah heard the noise of the running of the people, she came into the people in the house of the Lord."},{"num":14,"verse":"And when she looked, behold, the King stood by a pillar, as the manner was, and the princes and the trumpeters by the King, and all the people of the land rejoiced, and blew with trumpets. Then Athaliah rent her clothes, and cried, Treason, treason."},{"num":15,"verse":"But Jehoiada the Priest commanded the captains of the hundreds that had the rule of the host, and said unto them, Have her forth of the ranges, and he that followeth her, let him die by the sword: for the Priest had said, Let her not be slain in the house of the Lord."},{"num":16,"verse":"Then they laid hands on her, and she went by the way, by the which the horses go to the house of the King, and there was she slain."},{"num":17,"verse":"And Jehoiada made a covenant between the Lord, and the King and the people, that they should be the Lord’s people: likewise between the King and the people."},{"num":18,"verse":"Then all the people of the land went into the house of Baal, and destroyed it with his altars, and his images brake they down courageously, and slew Mattan the Priest of Baal before the altars: and the Priest set a guard over the house of the Lord."},{"num":19,"verse":"Then he took the captains of hundreds, and the other captains, and the guard, and all the people of the land: and they brought the King from the house of the Lord, and came by the way of the gate of the guard to the King’s house: and he sat him down on the throne of the kings."},{"num":20,"verse":"And all the people of the land rejoiced, and the city was in quiet: for they had slain Athaliah with the sword beside the king’s house."},{"num":21,"verse":"Seven years old was Jehoash when he began to reign."}]