[{"header":"The Priest Jehoiada Opposes Queen Athaliah(A)"},{"num":11,"verse":"When Ahaziah’s mother, Athaliah, saw that her son was dead, she began to destroy the entire royal family. "},{"num":2,"verse":"But Jehosheba, daughter of King Jehoram and sister of Ahaziah, took Ahaziah’s son Joash. She saved him from being killed with the king’s other sons, and in a bedroom she hid him and his nurse from Athaliah. So Joash wasn’t killed "},{"num":3,"verse":"but was hidden with her in the Lord’s temple for six years while Athaliah ruled the country."},{"num":4,"verse":"In the seventh year of Athaliah’s reign, Jehoiada sent for the company commanders of the Carites and the guards and had them come to him in the Lord’s temple. He made an agreement with them, put them under oath in the Lord’s temple, and showed them the king’s son. "},{"num":5,"verse":"He ordered them, “This is what you must do: One third of you, those who are on duty on the day of rest—a holy day, must guard the royal palace. "},{"num":6,"verse":"Another third must be at Sur Gate. And another third must be at the gate behind the guards. You will guard the king’s residence. "},{"num":7,"verse":"Then your two groups who ⌞normally⌟ go off duty on the day of rest—a holy day, must guard the king at the Lord’s temple. "},{"num":8,"verse":"Surround the king. Each man should have his weapons in his hand. Kill anyone who tries to break through your ranks. Stay with the king wherever he goes.”"},{"num":9,"verse":"The company commanders did as the priest Jehoiada had ordered them. Each commander took his men who were coming on duty on the day of rest—a holy day, as well as those who were about to go off duty and came to the priest Jehoiada. "},{"num":10,"verse":"He gave the commanders the spears and the shields that had belonged to King David but were now in the Lord’s temple. "},{"num":11,"verse":"The guards stood with their weapons in their hands. They were stationed around the king and around the altar and the temple (from the south side to the north side of the temple). "},{"num":12,"verse":"Then Jehoiada brought out the king’s son, gave him the crown and the religious instructions, and made him king by anointing him. As the guards clapped their hands, they said, “Long live the king!”"},{"num":13,"verse":"When Athaliah heard the noise made by the guards and the other people, she went into the Lord’s temple, where the people were. "},{"num":14,"verse":"She looked, and the king was standing by the pillar according to custom. The commanders and the trumpeters were by his side. All the people of the land were rejoicing and blowing trumpets. As Athaliah tore her clothes ⌞in distress⌟, she cried, “Treason, treason!”"},{"num":15,"verse":"Then the priest Jehoiada ordered the company commanders who were in charge of the army, “Take her out of the temple. Use your sword to kill anyone who follows her.” (The priest had said, “She must not be killed in the Lord’s temple.”) "},{"num":16,"verse":"So they arrested her as she came to the street where the horses enter the royal palace, and there she was killed."},{"num":17,"verse":"Jehoiada made a promise to the Lord on behalf of the king and his people that they would be the Lord’s people. He made other promises between the king and the people. "},{"num":18,"verse":"Then all the people of the land went to the temple of Baal and tore it down. They smashed Baal’s altars and his statues and killed Mattan, the priest of Baal, in front of the altars."},{"num":19,"verse":"He took the company commanders of the Carites and the guards and all the people of the land, and they brought the king from the Lord’s temple. They went down the street that goes through Guards’ Gate to the royal palace. Then Joash sat on the royal throne. "},{"num":20,"verse":"All the people of the land were celebrating. But the city was quiet because they had killed Athaliah with a sword at the royal palace."},{"header":"King Joash of Judah(B)"},{"num":21,"verse":"Joash  was seven years old when he began to rule."}]