[{"num":17,"verse":"And [Jesus] said to His disciples, Temptations (snares, traps set to entice to sin) are sure to come, but woe to him by or through whom they come!"},{"num":2,"verse":"It would be more profitable for him if a millstone were hung around his neck and he were hurled into the sea than that he should cause to sin or be a snare to one of these little ones [lowly in rank or influence]."},{"num":3,"verse":"Pay attention and always be on your guard [looking out for one another]. If your brother sins (misses the mark), solemnly tell him so and reprove him, and if he repents (feels sorry for having sinned), forgive him."},{"num":4,"verse":"And even if he sins against you seven times in a day, and turns to you seven times and says, I repent [I am sorry], you must forgive him (give up resentment and consider the offense as recalled and annulled)."},{"num":5,"verse":"The apostles said to the Lord, Increase our faith (that trust and confidence that spring from our belief in God)."},{"num":6,"verse":"And the Lord answered, If you had faith (trust and confidence in God) even [so small] like a grain of mustard seed, you could say to this mulberry tree, Be pulled up by the roots, and be planted in the sea, and it would obey you."},{"num":7,"verse":"Will any man of you who has a servant plowing or tending sheep say to him when he has come in from the field, Come at once and take your place at the table?"},{"num":8,"verse":"Will he not instead tell him, Get my supper ready and gird yourself and serve me while I eat and drink; then afterward you yourself shall eat and drink?"},{"num":9,"verse":"Is he grateful and does he praise the servant because he did what he was ordered to do?"},{"num":10,"verse":"Even so on your part, when you have done everything that was assigned and commanded you, say, We are unworthy servants [possessing no merit, for we have not gone beyond our obligation]; we have [merely] done what was our duty to do."},{"num":11,"verse":"As He went on His way to Jerusalem, it occurred that [Jesus] was passing [along the border] between Samaria and Galilee."},{"num":12,"verse":"And as He was going into one village, He was met by ten lepers, who stood at a distance."},{"num":13,"verse":"And they raised up their voices and called, Jesus, Master, take pity and have mercy on us!"},{"num":14,"verse":"And when He saw them, He said to them, Go [at once] and show yourselves to the priests. And as they went, they were cured and made clean."},{"num":15,"verse":"Then one of them, upon seeing that he was cured, turned back, recognizing and thanking and praising God with a loud voice;"},{"num":16,"verse":"And he fell prostrate at Jesus’ feet, thanking Him [over and over]. And he was a Samaritan."},{"num":17,"verse":"Then Jesus asked, Were not [all] ten cleansed? Where are the nine?"},{"num":18,"verse":"Was there no one found to return and to recognize and give thanks and praise to God except this alien?"},{"num":19,"verse":"And He said to him, Get up and go on your way. Your faith (your trust and confidence that spring from your belief in God) has restored you to health."},{"num":20,"verse":"Asked by the Pharisees when the kingdom of God would come, He replied to them by saying, The kingdom of God does not come with signs to be observed or with visible display,"},{"num":21,"verse":"Nor will people say, Look! Here [it is]! or, See, [it is] there! For behold, the kingdom of God is within you [in your hearts] and among you [surrounding you]."},{"num":22,"verse":"And He said to the disciples, The time is coming when you will long to see [even] one of the days of the Son of Man, and you will not see [it]."},{"num":23,"verse":"And they will say to you, Look! [He is] there! or, Look! [He is] here! But do not go out or follow [them]."},{"num":24,"verse":"For like the lightning, that flashes and lights up the sky from one end to the other, so will the Son of Man be in His [own] day."},{"num":25,"verse":"But first He must suffer many things and be disapproved and repudiated and rejected by this age and generation."},{"num":26,"verse":"And [just] as it was in the days of Noah, so will it be in the time of the Son of Man."},{"num":27,"verse":"[People] ate, they drank, they married, they were given in marriage, right up to the day when Noah went into the ark, and the flood came and destroyed them all."},{"num":28,"verse":"So also [it was the same] as it was in the days of Lot. [People] ate, they drank, they bought, they sold, they planted, they built;"},{"num":29,"verse":"But on the [very] day that Lot went out of Sodom, it rained fire and brimstone from heaven and destroyed [them] all."},{"num":30,"verse":"That is the way it will be on the day that the Son of Man is revealed."},{"num":31,"verse":"On that day let him who is on the housetop, with his belongings in the house, not come down [and go inside] to carry them away; and likewise let him who is in the field not turn back."},{"num":32,"verse":"Remember Lot’s wife!"},{"num":33,"verse":"Whoever tries to preserve his life will lose it, but whoever loses his life will preserve and quicken it."},{"num":34,"verse":"I tell you, in that night there will be two men in one bed; one will be taken and the other will be left."},{"num":35,"verse":"There will be two women grinding together; one will be taken and the other will be left."},{"num":36,"verse":"Two men will be in the field; one will be taken and the other will be left."},{"num":37,"verse":"Then they asked Him, Where, Lord? He said to them, Wherever the dead body is, there will the vultures or eagles be gathered together."}]