[{"header":"Sin, Forgiveness, Faith, and Service"},{"num":17,"verse":"And he said to his disciples, “It is impossible for causes for stumbling not to come, but woe to him through whom they come! "},{"num":2,"verse":"It would be better for him if a millstone is placed around his neck and he is thrown into the sea than that he causes one of these little ones to sin."},{"num":3,"verse":"“Be concerned about yourselves! If your brother sins, rebuke him, and if he repents, forgive him. "},{"num":4,"verse":"And if he sins against you seven times in a day, and seven times he returns to you saying, ‘I repent,’ you must forgive him.”"},{"num":5,"verse":"And the apostles said to the Lord, “Increase our faith!” "},{"num":6,"verse":"So the Lord said, “If you have faith like a mustard seed, you could say to this mulberry tree, ‘Be uprooted and planted in the sea,’ and it would obey you."},{"num":7,"verse":"“And which of you who has a slave plowing or shepherding sheep who comes in from the field will say to him, ‘Come here at once and recline at the table’? "},{"num":8,"verse":"Will he not rather say to him, ‘Prepare something that I may eat, and dress yourself to serve me while I eat and drink, and after these things you will eat and drink.’ "},{"num":9,"verse":"He will not be grateful to the slave because he did what was ordered, will he? "},{"num":10,"verse":"Thus you also, when you have done all the things you were ordered to do, say, ‘We are unworthy slaves; we have done what we were obligated to do.’”"},{"header":"Ten Lepers Cleansed"},{"num":11,"verse":"And it happened that while traveling toward Jerusalem, he was passing through the region between Samaria and Galilee. "},{"num":12,"verse":"And as he was entering into a certain village, ten men met him—lepers, who stood at a distance. "},{"num":13,"verse":"And they raised their voices, saying, “Jesus, Master, have mercy on us!” "},{"num":14,"verse":"And when he saw them he said to them, “Go and show yourselves to the priests.” And it happened that as they were going, they were cleansed. "},{"num":15,"verse":"But one of them, when he saw that he was healed, turned back, praising God with a loud voice. "},{"num":16,"verse":"And he fell on his face at his feet, giving thanks to him. And he was a Samaritan. "},{"num":17,"verse":"So Jesus answered and said, “Were not ten cleansed? And where are the nine? "},{"num":18,"verse":"Was no one found to turn back and give praise to God except this foreigner?” "},{"num":19,"verse":"And he said to him, “Get up and go your way. Your faith has saved you.”"},{"header":"The Coming of the Kingdom of God"},{"num":20,"verse":"Now when he was asked by the Pharisees when the kingdom of God would come, he answered them and said, “The kingdom of God does not come with things that can be observed, "},{"num":21,"verse":"nor will they say, ‘Behold, here it is!’ or ‘There!’ For behold, the kingdom of God is in your midst.”"},{"header":"The Coming of the Son of Man"},{"num":22,"verse":"And he said to the disciples, “Days will come when you will desire to see one of the days of the Son of Man, and you will not see it. "},{"num":23,"verse":"And they will say to you, ‘Behold, there!’ ‘Behold, here!’ Do not go out or run after them! "},{"num":24,"verse":"For just as the lightning shines forth, flashing from one place under heaven to another place under heaven, so the Son of Man will be in his day. "},{"num":25,"verse":"But first it is necessary for him to suffer many things, and to be rejected by this generation. "},{"num":26,"verse":"And just as it was in the days of Noah, so also it will be in the days of the Son of Man—"},{"num":27,"verse":"they were eating, they were drinking, they were marrying, they were being given in marriage, until the day Noah entered into the ark, and the flood came and destroyed them all. "},{"num":28,"verse":"Likewise, just as it was in the days of Lot—they were eating, they were drinking, they were buying, they were selling, they were planting, they were building. "},{"num":29,"verse":"But on the day that Lot went out from Sodom, it rained fire and sulphur from heaven and destroyed them all. "},{"num":30,"verse":"It will be just the same on the day that the Son of Man is revealed. "},{"num":31,"verse":"On that day, whoever is on the housetop and his goods are in the house must not come down to take them away. And likewise the one who is in the field must not turn back "},{"num":32,"verse":"Remember Lot’s wife! "},{"num":33,"verse":"Whoever seeks to preserve his life will lose it, but whoever loses it will keep it. "},{"num":34,"verse":"I tell you that in that night there will be two in one bed; one will be taken and the other will be left. "},{"num":35,"verse":"There will be two women grinding at the same place; one will be taken and the other will be left.”"},{"num":37,"verse":"And they answered and said to him, “Where, Lord?” So he said to them, “Where the dead body is, there also the vultures will be gathered.”"}]