[{"header":"Various Episodes and Instructions"},{"header":"Chapter 17"},{"num":1,"verse":"Warning against Giving Scandal. Jesus said to his disciples, “Scandals are bound to occur, but woe to the man through whom they come!"},{"num":2,"verse":"It would be better for him if a millstone were fastened around his neck and he were thrown into the sea than for him to cause one of these little ones to sin."},{"num":3,"verse":"Be on your guard!"},{"num":5,"verse":"Faith Knows How To Make Miracles. The apostles said to the Lord, “Increase our faith.”"},{"num":6,"verse":"The Lord replied, “If you had faith as tiny as a mustard seed, you could say to this mulberry tree, ‘Be uprooted and planted in the sea,’ and it would obey you."},{"num":7,"verse":"Unprofitable Servants. “Which of you, when your servant returns from plowing or tending sheep in the fields, would say to him, ‘Come right away and sit down to eat’?"},{"num":8,"verse":"Would you not rather say, ‘Prepare my dinner, put on your apron, and wait on me while I eat and drink, and then afterward you yourself may eat and drink’?"},{"num":9,"verse":"Would you be grateful to that servant for doing what he was commanded?"},{"num":10,"verse":"So should it be with you. When you have done all that you were ordered to do, say, ‘We are unprofitable servants; we have only done our duty.’ ”"},{"num":11,"verse":"Jesus Heals Ten Men with Leprosy. As he continued on his journey to Jerusalem, he traveled along the border between Samaria and Galilee."},{"num":12,"verse":"When he entered a village, ten lepers approached him. Standing some distance away,"},{"num":13,"verse":"they called out to him, “Jesus, Master, have pity on us.”"},{"num":14,"verse":"When he saw them, he said, “Go and show yourselves to the priests.” And as they went, they were cleansed."},{"num":15,"verse":"One of them, when he realized that he had been cured, came back, praising God in a loud voice."},{"num":16,"verse":"He prostrated himself at the feet of Jesus and thanked him. This man was a Samaritan."},{"num":17,"verse":"Jesus asked, “Were not all ten made clean? Where are the other nine?"},{"num":18,"verse":"Has no one except this foreigner returned to give thanks to God?”"},{"num":19,"verse":"Then he said to him, “Stand up and go on your way. Your faith has made you well.”"},{"num":20,"verse":"The Coming of the Kingdom of God. Once, the Pharisees asked him when the kingdom of God was coming. He answered, “The coming of the kingdom of God will not occur with signs that can be observed."},{"num":21,"verse":"Nor will people say, ‘Here it is,’ or ‘There it is.’ For the kingdom of God is in your midst.”"},{"num":22,"verse":"The Day of the Son of Man. Then he said to his disciples, “The time will come when you will long to see one of the days of the Son of Man, and you will not see it."},{"num":23,"verse":"People will say to you, ‘Look, there he is,’ or ‘Look, here he is.’ Do not go running after them."},{"num":24,"verse":"For just as lightning flashes and lights up the sky from one end to the other, so will the Son of Man be in his day."},{"num":25,"verse":"But first he must endure great suffering and be rejected by this generation."},{"num":26,"verse":"“Just as it was in the days of Noah, so will it also be in the days of the Son of Man."},{"num":27,"verse":"People were eating and drinking, marrying and being given in marriage, up to the day that Noah entered the ark. Then the flood came and destroyed all of them."},{"num":28,"verse":"“The same thing happened in the days of Lot. People were eating and drinking, buying and selling, planting and building."},{"num":29,"verse":"But on the day that Lot left Sodom, fire and brimstone rained down from heaven and destroyed all of them."},{"num":30,"verse":"“It will be like that on the day that the Son of Man is revealed."},{"num":31,"verse":"On that day, the one who is standing on the roof, with his possessions inside, must not come down to collect them, and someone who is in the field must not turn back."},{"num":32,"verse":"Remember Lot’s wife."},{"num":33,"verse":"Whoever tries to preserve his life will lose it, and whoever loses his life will save it."},{"num":34,"verse":"“I tell you, on that night two people will be in one bed. One will be taken and the other will be left."},{"num":35,"verse":"And there will be two women grinding grain together. One will be taken and the other will be left. ["},{"num":36,"verse":"Two men will be out in the field. One will be taken and the other will be left.]”"},{"num":37,"verse":"They asked him, “Where, Lord?” He said in reply, “Where the corpse is, there the vultures will gather.”"}]