[{"num":32,"verse":"This is the word that came to Yirmeyahu from Adonai in the tenth year of Tzidkiyahu king of Y’hudah, which was the eighteenth year of N’vukhadretzar. "},{"num":2,"verse":"At that time the army of the king of Bavel was besieging Yerushalayim; and Yirmeyahu the prophet was imprisoned in the guards’ quarters attached to the king of Y’hudah’s palace, "},{"num":3,"verse":"where Tzidkiyahu king of Y’hudah had imprisoned him after demanding, “How dare you prophesy that Adonai says, ‘I will hand this city over to the king of Bavel, and he will capture it; "},{"num":4,"verse":"Tzidkiyahu king of Y’hudah will not escape from the Kasdim but will certainly be handed over to the king of Bavel, who will address him face to face, with their eyes meeting; "},{"num":5,"verse":"and he will lead Tzidkiyahu to Bavel, where he will stay until I remember him,’ says Adonai, ‘and even if you fight the Kasdim, you will fail’?”"},{"num":6,"verse":"Yirmeyahu said, “This word of Adonai came to me: "},{"num":7,"verse":"‘Hanam’el, the son of your uncle Shalum, will approach you and say, “Buy my field at ‘Anatot; you have next-of-kin’s right to redeem it; so buy it.”’” "},{"num":8,"verse":"As Adonai had said, my cousin Hanam’el came to me in the guards’ quarters and said, “Please buy my field at ‘Anatot, in the territory of Binyamin; because you will inherit it, and you have next-of-kin’s right to redeem it, so buy it for yourself.” Then I was certain that this was Adonai’s word."},{"num":9,"verse":"So I bought the field at ‘Anatot which belonged to my cousin Hanam’el and weighed out the money for him, seven ounces of silver shekels. "},{"num":10,"verse":"I signed on the purchase contract, sealed it, called witnesses and weighed out the money for him on a balance scale. "},{"num":11,"verse":"I took the purchase contract, both the sealed copy with the terms and conditions, and the unsealed copy, "},{"num":12,"verse":"and gave the purchase contract to Barukh the son of Neriyah, the son of Machseyah, in the presence of my cousin Hanam’el, the witnesses who had signed the purchase contract and the people from Y’hudah sitting by the guards’ quarters. "},{"num":13,"verse":"In their presence I instructed Barukh as follows: "},{"num":14,"verse":"“Here is what Adonai-Tzva’ot, the God of Isra’el, says: ‘Take these contracts, both the sealed and unsealed copies, and place them in a clay jar, so that they can be preserved for a long time.’ "},{"num":15,"verse":"For Adonai-Tzva’ot, the God of Isra’el, says that one day homes, fields and vineyards will again be bought in this land.”"},{"num":16,"verse":"After giving the purchase contract to Barukh son of Neriyah, I prayed to Adonai: "},{"num":17,"verse":"“Adonai, God! You made heaven and earth by your great power and outstretched arm; nothing is too hard for you. "},{"num":18,"verse":"You display your grace to thousands but also repay the guilt of the fathers into the lap of their children who follow them. Great, powerful God, whose name is Adonai-Tzva’ot, "},{"num":19,"verse":"great in counsel, mighty in deed! Your eyes are open to all the ways of human beings in order to repay each one according to his ways, according to the consequences of what he does. "},{"num":20,"verse":"You gave signs and performed miracles in the land of Egypt which continue to this day, also in Isra’el and among other people; thus you made yourself the reputation you have today. "},{"num":21,"verse":"You brought your people of Isra’el out of the land of Egypt with signs and miracles, with a strong hand and an outstretched arm and with great terror. "},{"num":22,"verse":"Then you gave them this land, which you had sworn to their ancestors that you would give them, a land flowing with milk and honey. "},{"num":23,"verse":"They entered and took possession of it; but they did not pay attention to your voice, did not live according to your Torah, and did nothing of all you ordered them to do. Therefore you made this complete disaster befall them — "},{"num":24,"verse":"the siege-works are already there; they have come to the city to capture it; and the city, by means of sword, famine and plague, is being handed over to the Kasdim fighting against it. What you foretold is being fulfilled; here, you see it, yourself. "},{"num":25,"verse":"Yet you, Adonai, God, have said to me, ‘Buy the field for money, and call witnesses; even as the city is being turned over to the Kasdim!’”"},{"num":26,"verse":"Then this word of Adonai came to Yirmeyahu: "},{"num":27,"verse":"“Look, I am Adonai, the God of every living creature; is there anything too hard for me? "},{"num":28,"verse":"Therefore, here is what Adonai says: ‘I will hand this city over to the Kasdim and to N’vukhadretzar king of Bavel; and he will capture it. "},{"num":29,"verse":"The Kasdim who are fighting against this city will enter and set this city on fire; they will burn it down, including its houses, on whose roofs they offered to Ba‘al and poured out drink offerings to other gods, in order to make me angry. "},{"num":30,"verse":"For from their youth, the people of Isra’el and the people of Y’hudah have done only what is evil from my perspective; the people of Isra’el have done nothing but provoke me with what their hands make,’ says Adonai. "},{"num":31,"verse":"‘This city has so provoked my anger and fury from the day they built it to this day that I ought to remove it from my presence, "},{"num":32,"verse":"because of all the evil that the people of Isra’el and the people of Y’hudah have done in order to make me angry — they, their kings, their leaders, their cohanim, their prophets, the men of Y’hudah and the inhabitants of Yerushalayim. "},{"num":33,"verse":"They have turned their backs on me, not their faces; and although I taught them, taught them frequently, they have not listened so as to receive instruction. "},{"num":34,"verse":"Instead they put their detestable idols in the house that bears my name, to defile it; "},{"num":35,"verse":"and they built the high places for Ba‘al which are in the Ben-Hinnom Valley, to burn alive their sons and daughters to Molekh — something I did not order them to do, it never even entered my mind that they would do such an abominable thing — and thus they caused Y’hudah to sin.’"},{"num":36,"verse":"“Therefore, thus says Adonai the God of Isra’el concerning this city, of which you say that it is handed over to the king of Bavel by sword, famine and plague: "},{"num":37,"verse":"‘I will gather them out of all the countries where I drove them in my anger, fury and great wrath; and I will bring them back to this place and have them live here in safety. "},{"num":38,"verse":"They will be my people, and I will be their God. "},{"num":39,"verse":"I will give them singleness of heart and singleness of purpose, so that they will fear me forever — this will be for their own good and for the good of their children after them. "},{"num":40,"verse":"I will make with them an everlasting covenant not to turn away from them, but to do them good; I will put fear of me in their hearts, so that they will not leave me. "},{"num":41,"verse":"I will take joy in them, so as to do them good. I will plant them in this land truly, with my whole heart and being.’ "},{"num":42,"verse":"For here is what Adonai says: ‘Just as I have brought this complete disaster on this people, so likewise I will bring on them all the good I have promised them. "},{"num":43,"verse":"Fields will be bought in this land, even though you say about it that it is desolate, devoid of human beings or animals, and given over to the Kasdim. "},{"num":44,"verse":"Yes, people will buy fields for money, sign the purchase contracts, seal them and call witnesses, in the territory of Binyamin, in the areas around Yerushalayim, in the cities of Y’hudah, in the cities of the hill-country, in the cities of the Sh’felah and in the cities of the Negev. For I will cause their exiles to return,’ says Adonai.”"}]