[{"num":32,"verse":"The word that hath been unto Jeremiah from Jehovah, in the tenth year of Zedekiah king of Judah -- it [is] the eighteenth year of Nebuchadrezzar,"},{"num":2,"verse":"And then the forces of the king of Babylon are laying siege against Jerusalem, and Jeremiah the prophet hath been shut up in the court of the prison that [is] in the house of the king of Judah,"},{"num":3,"verse":"Where Zedekiah king of Judah hath shut him up, saying, `Wherefore art thou prophesying, saying, Thus said Jehovah, Lo, I am giving this city into the hand of the king of Babylon, and he hath captured it;"},{"num":4,"verse":"And Zedekiah king of Judah doth not escape out of the hand of the Chaldeans, but is certainly given into the hand of the king of Babylon, and his mouth hath spoken with his mouth, and his eyes see his eyes,"},{"num":5,"verse":"And [to] Babylon he leadeth Zedekiah, and there he is till My inspecting him, -- an affirmation of Jehovah -- because ye fight with the Chaldeans, ye do not prosper.'"},{"num":6,"verse":"And Jeremiah saith, `A word of Jehovah hath been unto me saying,"},{"num":7,"verse":"Lo, Hanameel son of Shallum, thine uncle, is coming unto thee, saying, Buy for thee my field that [is] in Anathoth, for thine [is] the right of redemption -- to buy."},{"num":8,"verse":"And Hanameel, my uncle's son, cometh in unto me, according to the word of Jehovah, unto the court of the prison, and saith unto me, `Buy, I pray thee, my field that [is] in Anathoth, that [is] in the land of Benjamin, for thine [is] the right of possession, and thine of redemption -- buy for thee.' And I know that it [is] the word of Jehovah,"},{"num":9,"verse":"And I buy the field, that [is] in Anathoth, from Hanameel, my uncle's son, and I weigh to him the money -- seventeen shekels of silver."},{"num":10,"verse":"And I write in a book, and seal, and cause witnesses to testify, and weigh the silver in balances;"},{"num":11,"verse":"And I take the purchase-book, the sealed one, according to law and custom, and the open one."},{"num":12,"verse":"And I give the purchase-book unto Baruch son of Neriah, son of Maaseiah, before the eyes of Hanameel, my uncle's son, and before the eyes of the witnesses, those writing in the purchase-book, before the eyes of all the Jews who are sitting in the court of the prison."},{"num":13,"verse":"And I charge Baruch before their eyes, saying,"},{"num":14,"verse":"`Thus said Jehovah of Hosts, God of Israel, Take these books, this purchase-book, both the sealed one and the open one, and thou hast put them in an earthen vessel, that they may remain many days;"},{"num":15,"verse":"For thus said Jehovah of Hosts, God of Israel, Again are houses and fields and vineyards bought in this land.'"},{"num":16,"verse":"And I pray unto Jehovah -- after my giving the purchase-book unto Baruch son of Neriah -- saying,"},{"num":17,"verse":"`Ah, Lord Jehovah, lo, Thou hast made the heavens and the earth by Thy great power, and by Thy stretched-out arm; there is nothing too wonderful for Thee:"},{"num":18,"verse":"Doing kindness to thousands, and recompensing iniquity of fathers into the bosom of their sons after them; God, the great, the mighty, Jehovah of Hosts [is] His name,"},{"num":19,"verse":"Great in counsel, and mighty in act, in that Thine eyes are open on all the ways of the sons of Adam, to give to each according to his ways, and according to the fruit of his doings:"},{"num":20,"verse":"In that thou hast done signs and wonders in the land of Egypt unto this day, and in Israel, and among men, and Thou dost make for Thee a name as [at] this day."},{"num":21,"verse":"`And Thou bringest forth Thy people Israel from the land of Egypt, with signs and with wonders, and by a strong hand, and by a stretched-out arm, and by great fear,"},{"num":22,"verse":"And thou givest to them this land that thou didst swear to their fathers to give to them, a land flowing with milk and honey,"},{"num":23,"verse":"And they come in, and possess it, and they have not hearkened to Thy voice, and in Thy law have not walked, all that which Thou didst lay a charge on them to do they have not done, and Thou dost proclaim [to] them all this evil."},{"num":24,"verse":"`Lo, the mounts -- they have come in to the city to capture it, and the city hath been given into the hand of the Chaldeans who are fighting against it, because of the sword, and the famine, and the pestilence; and that which Thou hast spoken hath come to pass, and lo, Thou art seeing;"},{"num":25,"verse":"Yet Thou hast said unto me, O Lord Jehovah, Buy for thee the field with money, and cause witnesses to testify -- and the city hath been given into the hand of the Chaldeans!'"},{"num":26,"verse":"And the word of Jehovah is unto Jeremiah, saying:"},{"num":27,"verse":"`Lo, I [am] Jehovah, God of all flesh: For Me is anything too wonderful?"},{"num":28,"verse":"`Therefore, thus said Jehovah, Lo, I am giving this city into the hand of the Chaldeans, and into the hand of Nebuchadrezzar king of Babylon, and he hath captured it;"},{"num":29,"verse":"And come in have the Chaldeans who are fighting against this city, and they have set this city on fire, and have burned it, and the houses on whose roofs they made perfume to Baal, and poured out libations to other gods, so as to provoke Me to anger."},{"num":30,"verse":"For the sons of Israel and the sons of Judah have been only doing evil in Mine eyes, from their youth; for the sons of Israel are only provoking Me with the work of their hands -- an affirmation of Jehovah."},{"num":31,"verse":"`For a cause of Mine anger, and a cause of My fury, hath this city been to Me, even from the day that they built it, and unto this day -- to turn it aside from before My face,"},{"num":32,"verse":"Because of all the evil of the sons of Israel, and of the sons of Judah that they have done, so as to provoke Me -- they, their kings, their heads, their priests, and their prophets, and the men of Judah, and the inhabitants of Jerusalem."},{"num":33,"verse":"And they turn unto Me the neck, and not the face, and teaching them, rising early and teaching, and they are not hearkening to accept instruction."},{"num":34,"verse":"`And they set their abominations in the house over which My name is called, so as to defile it;"},{"num":35,"verse":"And they build the high places of Baal, that [are] in the valley of the son of Hinnom, to cause their sons and their daughters to pass through to Molech, which I did not command them, nor did it come up on my heart to do this abomination, so as to cause Judah to sin."},{"num":36,"verse":"`And now, therefore, thus said Jehovah, God of Israel, concerning this city, of which ye are saying, It hath been given into the hand of the king of Babylon by sword, and by famine, and by pestilence,"},{"num":37,"verse":"Lo, I am gathering them out of all the lands whither I have driven them in Mine anger, and in My fury, and in great wrath, and I have brought them back unto this place, and have caused them to dwell confidently;"},{"num":38,"verse":"and they have been to Me for a people, and I am to them for God;"},{"num":39,"verse":"and I have given to them one heart, and one way, to fear Me all the days, for good to them, and to their sons after them:"},{"num":40,"verse":"and I have made for them a covenant age-during, in that I turn not back from after them for My doing them good, and My fear I put in their heart, so as not to turn aside from me;"},{"num":41,"verse":"and I have rejoiced over them to do them good, and have planted them in this land in truth, with all my heart, and with all My soul."},{"num":42,"verse":"`For thus said Jehovah: As I brought in unto this people all this great evil, so I am bringing in on them all the good that I am speaking concerning them;"},{"num":43,"verse":"and bought hath been the field in this land of which ye are saying, A desolation it [is], without man and beast, it hath been given into the hand of the Chaldeans."},{"num":44,"verse":"Fields with money they buy, so as to write in a book, and to seal, and to cause witnesses to testify, in the land of Benjamin, and in suburbs of Jerusalem, and in cities of Judah, and in cities of the hill-country, and in cities of the low country, and in cities of the south, for I turn back their captivity -- an affirmation of Jehovah.'"}]