[{"header":"Israel’s Family"},{"num":2,"verse":"The sons of Israel, also called Jacob, were Reuben, Simeon, Levi, Judah, Issachar, Zebulun, "},{"num":2,"verse":"Dan, Joseph, Benjamin, Naphtali, Gad and Asher."},{"header":"Judah’s Family"},{"num":3,"verse":"Judah’s sons were Er, Onan and Shelah. A Canaanite woman, the daughter of Shua, was their mother. Judah’s first son, Er, did what the Lord said was wicked. So the Lord put him to death. "},{"num":4,"verse":"Judah’s daughter-in-law Tamar gave birth to Perez and Zerah. Judah was the father. So Judah had five sons."},{"num":5,"verse":"Perez’s sons were Hezron and Hamul."},{"num":6,"verse":"Zerah had five sons. They were Zimri, Ethan, Heman, Calcol and Darda."},{"num":7,"verse":"Carmi’s son was Achan. He caused trouble for Israel because he took things that had been given to the Lord to be destroyed."},{"num":8,"verse":"Ethan’s son was Azariah."},{"num":9,"verse":"Hezron’s sons were Jerahmeel, Ram and Caleb."},{"num":10,"verse":"Ram was Amminadab’s father. And Amminadab was Nashon’s father. Nahshon was the leader of the people of Judah. "},{"num":11,"verse":"Nahshon was the father of Salmon. Salmon was the father of Boaz. "},{"num":12,"verse":"Boaz was the father of Obed. Obed was the father of Jesse."},{"num":13,"verse":"Jesse’s first son was Eliab. His second son was Abinadab. His third son was Shimea. "},{"num":14,"verse":"His fourth son was Nethanel. His fifth son was Raddai. "},{"num":15,"verse":"Jesse’s sixth son was Ozem, and his seventh son was David. "},{"num":16,"verse":"Their sisters were Zeruiah and Abigail. Zeruiah’s three sons were Abishai, Joab and Asahel. "},{"num":17,"verse":"Abigail was the mother of Amasa. Amasa’s father was an Ishmaelite named Jether."},{"header":"Caleb’s Family"},{"num":18,"verse":"Caleb son of Hezron had children by his wife Azubah and by Jerioth. Caleb and Azubah’s sons were Jesher, Shobab and Ardon. "},{"num":19,"verse":"When Azubah died, Caleb married Ephrath. They had a son named Hur. "},{"num":20,"verse":"Hur was the father of Uri. Uri was the father of Bezalel."},{"num":21,"verse":"Later, when Hezron was 60 years old, he married the daughter of Makir. Makir was Gilead’s father. Hezron had intimate relations with Makir’s daughter, and she had a son named Segub. "},{"num":22,"verse":"Segub was the father of Jair. Jair controlled 23 cities in the country of Gilead. "},{"num":23,"verse":"(But Geshur and Aram captured the Towns of Jair. They also captured Kenath and the small towns around it. There were 60 towns in all.) All these were descendants of Makir, the father of Gilead."},{"num":24,"verse":"After Hezron died in Caleb Ephrathah, his wife Abijah had his son. He was named Ashur. Ashur became the father of Tekoa."},{"header":"Jerahmeel’s Family"},{"num":25,"verse":"Jerahmeel was Hezron’s first son. Jerahmeel’s sons were Ram, Bunah, Oren, Ozem and Ahijah. Ram was Jerahmeel’s first son. "},{"num":26,"verse":"Jerahmeel had another wife, who was named Atarah. She was the mother of Onam."},{"num":27,"verse":"Jerahmeel’s first son, Ram, had sons. They were Maaz, Jamin and Eker."},{"num":28,"verse":"Onam’s sons were Shammai and Jada."},{"num":29,"verse":"Abishur’s wife was named Abihail. Abishur and Abihail’s sons were Ahban and Molid."},{"num":30,"verse":"Nadab’s sons were Seled and Appaim. Seled died without having children."},{"num":31,"verse":"Appaim’s son was Ishi. Ishi was the father of Sheshan."},{"num":32,"verse":"Jada was Shammai’s brother. Jada’s sons were Jether and Jonathan. Jether died without having children."},{"num":33,"verse":"Jonathan’s sons were Peleth and Zaza."},{"num":34,"verse":"Sheshan did not have any sons, only daughters. He had a servant from Egypt named Jarha. "},{"num":35,"verse":"Sheshan let his daughter marry his servant Jarha. Then she had a son named Attai."},{"num":36,"verse":"Attai was the father of Nathan. Nathan was the father of Zabad. "},{"num":37,"verse":"Zabad was the father of Ephlal. Ephlal was the father of Obed. "},{"num":38,"verse":"Obed was the father of Jehu. Jehu was the father of Azariah. "},{"num":39,"verse":"Azariah was the father of Helez. Helez was the father of Eleasah. "},{"num":40,"verse":"Eleasah was the father of Sismai. Sismai was the father of Shallum. "},{"num":41,"verse":"Shallum was the father of Jekamiah. And Jekamiah was the father of Elishama."},{"header":"Caleb’s Family"},{"num":42,"verse":"Caleb was Jerahmeel’s brother. Caleb’s first son was Mesha. Mesha was the father of Ziph. And his son Mareshah was the father of Hebron."},{"num":43,"verse":"Hebron’s sons were Korah, Tappuah, Rekem and Shema. "},{"num":44,"verse":"Shema was the father of Raham. Raham was the father of Jorkeam. Rekem was the father of Shammai. "},{"num":45,"verse":"Shammai’s son was Maon. Maon was the father of Beth Zur."},{"num":46,"verse":"Caleb’s slave woman was named Ephah. She was the mother of Haran, Moza and Gazez. Haran was the father of Gazez."},{"num":47,"verse":"Jahdai’s sons were Regem, Jotham, Geshan, Pelet, Ephah and Shaaph."},{"num":48,"verse":"Caleb had another slave woman named Maacah. She was the mother of Sheber and Tirhanah. "},{"num":49,"verse":"She was also the mother of Shaaph and Sheva. Shaaph was the father of Madmannah. Sheva was the father of Macbenah and Gibea. Caleb’s daughter was Acsah."},{"num":50,"verse":"These were Caleb’s descendants: Caleb’s son Hur was the first son of his mother Ephrathah. Hur’s sons were Shobal, Salma and Hareph. Shobal was the father of Kiriath Jearim. Salma was the father of Bethlehem. And Hareph was the father of Beth Gader."},{"num":52,"verse":"Shobal was the father of Kiriath Jearim. These were Shobal’s descendants: Haroeh, half the Manahathites, "},{"num":53,"verse":"and the family groups of Kiriath Jearim. Shobal was also the ancestor of the Ithrites, Puthites, Shumathites and the Mishraites. The Zorathites and the Eshtaolites came from the Mishraite people."},{"num":54,"verse":"Salma’s descendants were Bethlehem, the Netophathites, Atroth Beth Joab, half the Manahathites and the Zorites. "},{"num":55,"verse":"His descendants were also the families who lived at Jabez. These were the people who wrote and copied important papers. These people were the Tirathites, Shimeathites and Sucathites. They were from the Kenite family group who came from Hammath. He was the father of the people living in Recab."}]