[{"header":"Israel’s Family"},{"num":2,"verse":"The sons of Israel were Reuben, Simeon, Levi, Judah, Issachar, Zebulun, "},{"num":2,"verse":"Dan, Joseph, Benjamin, Naphtali, Gad, and Asher."},{"header":"Judah’s Family"},{"num":3,"verse":"Judah’s sons were Er, Onan, and Shelah. A Canaanite woman, the daughter of Shua, was their mother. Judah’s first son, Er, did what the Lord said was wicked, so the Lord put him to death. "},{"num":4,"verse":"Judah’s daughter-in-law Tamar gave birth to Perez and Zerah. Judah was the father, so Judah had five sons."},{"num":5,"verse":"Perez’s sons were Hezron and Hamul."},{"num":6,"verse":"Zerah had five sons: Zimri, Ethan, Heman, Calcol, and Darda."},{"num":7,"verse":"Carmi’s son was Achan, who caused trouble for Israel because he took things that had been given to the Lord to be destroyed."},{"num":8,"verse":"Ethan’s son was Azariah."},{"num":9,"verse":"Hezron’s sons were Jerahmeel, Ram, and Caleb."},{"num":10,"verse":"Ram was Amminadab’s father, and Amminadab was Nahshon’s father. Nahshon was the leader of the people of Judah. "},{"num":11,"verse":"Nahshon was the father of Salmon, who was the father of Boaz. "},{"num":12,"verse":"Boaz was the father of Obed, and Obed was the father of Jesse."},{"num":13,"verse":"Jesse’s first son was Eliab. His second son was Abinadab, his third was Shimea, "},{"num":14,"verse":"his fourth was Nethanel, his fifth was Raddai, "},{"num":15,"verse":"his sixth was Ozem, and his seventh son was David. "},{"num":16,"verse":"Their sisters were Zeruiah and Abigail. Zeruiah’s three sons were Abishai, Joab, and Asahel. "},{"num":17,"verse":"Abigail was the mother of Amasa, and his father was Jether, an Ishmaelite."},{"header":"Caleb’s Family"},{"num":18,"verse":"Caleb son of Hezron had children by his wife Azubah and by Jerioth. Caleb and Azubah’s sons were Jesher, Shobab, and Ardon. "},{"num":19,"verse":"When Azubah died, Caleb married Ephrath. They had a son named Hur, "},{"num":20,"verse":"who was the father of Uri, who was the father of Bezalel."},{"num":21,"verse":"Later, when Hezron was sixty years old, he married the daughter of Makir, Gilead’s father. Hezron had sexual relations with Makir’s daughter, and she had a son named Segub. "},{"num":22,"verse":"Segub was the father of Jair. Jair controlled twenty-three cities in the country of Gilead. "},{"num":23,"verse":"(But Geshur and Aram captured the Towns of Jair, as well as Kenath and the small towns around it—sixty towns in all.) All these were descendants of Makir, the father of Gilead."},{"num":24,"verse":"After Hezron died in Caleb Ephrathah, his wife Abijah had his son, named Ashhur. Ashhur became the father of Tekoa."},{"header":"Jerahmeel’s Family"},{"num":25,"verse":"Hezron’s first son was Jerahmeel. Jerahmeel’s sons were Ram, Bunah, Oren, Ozem, and Ahijah. Ram was Jerahmeel’s first son. "},{"num":26,"verse":"Jerahmeel had another wife, named Atarah. She was the mother of Onam."},{"num":27,"verse":"Jerahmeel’s first son, Ram, had sons. They were Maaz, Jamin, and Eker."},{"num":28,"verse":"Onam’s sons were Shammai and Jada."},{"num":29,"verse":"Abishur’s wife was named Abihail, and their sons were Ahban and Molid."},{"num":30,"verse":"Nadab’s sons were Seled and Appaim. Seled died without having children."},{"num":31,"verse":"Appaim’s son was Ishi, who became the father of Sheshan."},{"num":32,"verse":"Jada was Shammai’s brother, and Jada’s sons were Jether and Jonathan. Jether died without having children."},{"num":33,"verse":"Jonathan’s sons were Peleth and Zaza."},{"num":34,"verse":"Sheshan did not have any sons, only daughters. He had a servant from Egypt named Jarha. "},{"num":35,"verse":"Sheshan let his daughter marry his servant Jarha, and she had a son named Attai."},{"num":36,"verse":"Attai was the father of Nathan. Nathan was the father of Zabad. "},{"num":37,"verse":"Zabad was the father of Ephlal. Ephlal was the father of Obed. "},{"num":38,"verse":"Obed was the father of Jehu. Jehu was the father of Azariah. "},{"num":39,"verse":"Azariah was the father of Helez. Helez was the father of Eleasah. "},{"num":40,"verse":"Eleasah was the father of Sismai. Sismai was the father of Shallum. "},{"num":41,"verse":"Shallum was the father of Jekamiah, and Jekamiah was the father of Elishama."},{"header":"Caleb’s Family"},{"num":42,"verse":"Caleb was Jerahmeel’s brother. Caleb’s first son was Mesha. Mesha was the father of Ziph, and his son Mareshah was the father of Hebron."},{"num":43,"verse":"Hebron’s sons were Korah, Tappuah, Rekem, and Shema. "},{"num":44,"verse":"Shema was the father of Raham, who was the father of Jorkeam. Rekem was the father of Shammai. "},{"num":45,"verse":"Shammai was the father of Maon, and Maon was the father of Beth Zur."},{"num":46,"verse":"Caleb’s slave woman was named Ephah, and she was the mother of Haran, Moza, and Gazez. Haran was the father of Gazez."},{"num":47,"verse":"Jahdai’s sons were Regem, Jotham, Geshan, Pelet, Ephah, and Shaaph."},{"num":48,"verse":"Caleb had another slave woman named Maacah. She was the mother of Sheber, Tirhanah, "},{"num":49,"verse":"Shaaph, and Sheva. Shaaph was the father of Madmannah. Sheva was the father of Macbenah and Gibea. Caleb’s daughter was Acsah."},{"num":50,"verse":"These were Caleb’s descendants: Caleb’s son Hur was the first son of his mother Ephrathah. Hur’s sons were Shobal, Salma, and Hareph. Shobal was the father of Kiriath Jearim. Salma was the father of Bethlehem. And Hareph was the father of Beth Gader."},{"num":52,"verse":"Shobal was the father of Kiriath Jearim. Shobal’s descendants were Haroeh, half the Manahathites, "},{"num":53,"verse":"and the family groups of Kiriath Jearim: the Ithrites, Puthites, Shumathites, and Mishraites. The Zorathites and the Eshtaolites came from the Mishraite people."},{"num":54,"verse":"Salma’s descendants were Bethlehem, the Netophathites, Atroth Beth Joab, half the Manahathites, and the Zorites. "},{"num":55,"verse":"His descendants included the families who lived at Jabez, who wrote and copied important papers. They were called the Tirathites, Shimeathites, and Sucathites and were from the Kenite family group who came from Hammath. He was the father of the people living in Recab."}]