[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:10-32 The cleansed leper was to be presented to the Lord, with his offerings. When God has restored us to enjoy public worship again, after sickness, distance, or otherwise, we should testify our thanksgiving by our diligent use of the liberty. And both we and our offerings must be presented before the Lord, by the Priest that made us clean, even our Lord Jesus. Beside the usual rites of the trespass-offering, some of the blood, and some of the oil, was to be put upon him that was to be cleansed. Wherever the blood of Christ is applied for justification, the oil of the Spirit is applied for sanctification; these two cannot be separated. We have here the gracious provision the law made for poor lepers. The poor are as welcome to God's altar as the rich. But though a meaner sacrifice was accepted from the poor, yet the same ceremony was used for the rich; their souls are as precious, and Christ and his gospel are the same to both. Even for the poor one lamb was necessary. No sinner could be saved, had it not been for the Lamb that was slain, and hath redeemed us to God with his blood.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The cleansed leper was now in a position to avail himself of the accustomed law of sacrifice as one completely restored. The ewe lamb was now offered in his behalf as a sin-offering, one of the young rams as a burnt-offering, and the fine flour mingled with oil as a meat-offering. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-32. if he be poor, and cannot get so much; then he shall take one lamb—a kind and considerate provision for an extension of the privilege to lepers of the poorer class. The blood of their smaller offering was to be applied in the same process of purification and they were as publicly and completely cleansed as those who brought a costlier offering (Ac 10:34).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the priest shall sprinkle with his right finger some of the oil,.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the priest shall sprinkle with his right finger some of the oil that is in his left hand seven times before the LORD:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In cases of poverty on the part of the person to be consecrated, the burnt-offering and sin-offering were reduced to a pair of turtle-doves or young pigeons, and the meat-offering to a tenth of an ephah of meal and oil; but no diminution was allowed in the trespass-offering as the consecration-offering, since this was the conditio sine qua non of reinstatement in full covenant rights. On account of the importance of all the details of this law, every point is repeated a second time in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:21-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]