[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:33-53 The leprosy in a house is unaccountable to us, as well as the leprosy in a garment; but now sin, where that reigns in a house, is a plague there, as it is in a heart. Masters of families should be aware, and afraid of the first appearance of sin in their families, and put it away, whatever it is. If the leprosy is got into the house, the infected part must be taken out. If it remain in the house, the whole must be pulled down. The owner had better be without a dwelling, than live in one that was infected. The leprosy of sin ruins families and churches. Thus sin is so interwoven with the human body, that it must be taken down by death.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Cleanse the house - Strictly, \"purge the house from sin.\" The same word is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is said, \"and make an atonement for it.\" Such language is used figuratively when it is applied to things, not to persons. The leprosy in houses, the leprosy in clothing, and the terrible disease in the human body, were representative forms of decay which taught the lesson that all created things, in their own nature, are passing away, and are only maintained for their destined uses during an appointed period, by the power of Yahweh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "48-57. the priest shall pronounce the house clean, because the plague is healed—The precautions here described show that there is great danger in warm countries from the house leprosy, which was likely to be increased by the smallness and rude architecture of the houses in the early ages of the Israelitish history. As a house could not contract any impurity in the sight of God, the \"atonement\" which the priest was to make for it must either have a reference to the sins of its occupants or to the ceremonial process appointed for its purification, the very same as that observed for a leprous person. This solemn declaration that it was \"clean,\" as well as the offering made on the occasion, was admirably calculated to make known the fact, to remove apprehension from the public mind, as well as relieve the owner from the aching suspicion of dwelling in an infected house.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he shall take the cedar wood, and the hyssop, and the scarlet, and the living bird,.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sprinkle the house seven times. See Gill on Leviticus 14:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and sprinkle the house seven times. See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 14:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he shall take the cedar wood, and the hyssop, and the scarlet, and the living bird, and dip them in the blood of the slain bird, and in the running water, and sprinkle the house seven times:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If the priest should find, however, that after the fresh plastering the mole had not appeared again, or spread (to other places), he was to pronounce the house clean, because the evil was cured, and (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:49-53",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to perform the same rite of purification as was prescribed for the restoration of a man, who had been cured of leprosy, to the national community (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:4-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The purpose was also the same, namely, to cleanse (חטּא cleanse from sin) and make atonement for the house, i.e., to purify it from the uncleanness of sin which had appeared in the leprosy. For, although it is primarily in the human body that sin manifests itself, it spreads from man to the things which he touches, uses, inhabits, though without our being able to represent this spread as a physical contagion. ",
        "children": []
      }
    ]
  }
]