[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall wash his clothes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This was done not to disinfect them, for leprosy, as we have seen, was not contagious, but as an act of purification, which was performed after every kind of defilement. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And shave off all his hair.—The razor had to pass over the whole of his body, even his secret parts. A similar process was undertaken at the consecration of the Levites. (Comp. Numbers 8:7.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And shave off all his hair.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The razor had to pass over the whole of his body, even his secret parts. A similar process was undertaken at the consecration of the Levites. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall tarry abroad out of his tent—But though permitted to return to the camp, yet he had to live the first week out of his own house. This the authorities during the second Temple rightly regarded as an euphemism for seclusion from connubial intercourse during the first seven days, in order that he might not contract impurity (see Leviticus 15:10), and thus interrupt the period of holy preparation. Hence the ancient Chaldee Version of the so-called Jonathan translates it: “He shall sit without the tent of the house of his habitation, and shall not come near to the side of his wife seven days.” With this ended the first stage of purification, which restored the convalescent to his social or civil privileges, but not to the sanctuary.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And shall tarry abroad out of his tent",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—But though permitted to return to the camp, yet he had to live the first week out of his own house. This the authorities during the second Temple rightly regarded as an euphemism for seclusion from connubial intercourse during the first seven days, in order that he might not contract impurity (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 15:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and thus interrupt the period of holy preparation. Hence the ancient Chaldee Version of the so-called Jonathan translates it: “He shall sit without the tent of the house of his habitation, and shall not come near to the side of his wife seven days.” With this ended the first stage of purification, which restored the convalescent to his social or civil privileges, but not to the sanctuary.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 14:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 14:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All his hair — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Partly to discover his perfect soundness, partly to preserve him from a relapse through any relics of it which might remain in his hair or in his clothes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Out of his tent — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Out of his former habitation, in some separate place, lest some of his leprosy, yet lurking in him, should break forth to the infection of his family.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-9 The priests could not cleanse the lepers; but when the Lord removed the plague, various rules were to be observed in admitting them again to the ordinances of God, and the society of his people. They represent many duties and exercises of truly repenting sinners, and the duties of ministers respecting them. If we apply this to the spiritual leprosy of sin, it intimates that when we withdraw from those who walk disorderly, we must not count them as enemies, but admonish them as brethren. And also that when God by his grace has brought to repentance, they ought with tenderness and joy, and sincere affection, to be received again. Care should always be taken that sinners may not be encouraged, nor penitents discouraged. If it were found that the leprosy was healed, the priest must declare it with the particular solemnities here described. The two birds, one killed, and the other dipped in the blood of the bird that was killed, and then let loose, may signify Christ shedding his blood for sinners, and rising and ascending into heaven. The priest having pronounced the leper clean from the disease, he must make himself clean from all remains of it. Thus those who have comfort of the remission of their sins, must with care and caution cleanse themselves from sins; for every one that has this hope in him, will be concerned to purify himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Seven times - The seal of the covenant, expressed in the number seven (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), was renewed in sprinkling him who, during his leprosy, had lived as an outcast. The details of a restoration to health and freedom appear to be well expressed in the whole ceremony. Each of the birds represented the leper. They were to be of a clean kind, because they stood for one of the chosen race. The death-like state of the leper during his exclusion from the camp was expressed by killing one of the birds. The living bird was identified with the slain one by being dipped in his blood mixed with the spring water that figured the process of purification, while the cured leper was identified with the rite by having the same water and blood sprinkled over him. The bird then liberated was a sign that the leper left behind him all the symbols of the death disease and of the remedies associated with it, and was free to enjoy health and social freedom with his kind. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5-9. the priest shall command that one of the birds be killed … over running water—As the blood of a single bird would not have been sufficient to immerse the body of another bird, it was mingled with spring water to increase the quantity necessary for the appointed sprinklings, which were to be repeated seven times, denoting a complete purification. (See 2Ki 5:10; Ps 51:2; Mt 8:4; Lu 5:14). The living bird being then set free, in token of the leper's release from quarantine, the priest pronounced him clean; and this official declaration was made with all solemnity, in order that the mind of the leper might be duly impressed with a sense of the divine goodness, and that others might be satisfied they might safely hold intercourse with him. Several other purifications had to be gone through during a series of seven days, and the whole process had to be repeated on the seventh, ere he was allowed to re-enter the camp. The circumstance of a priest being employed seems to imply that instruction suitable to the newly recovered leper would be given, and that the symbolical ceremonies used in the process of cleansing leprosy would be explained. How far they were then understood we cannot tell. But we can trace some instructive analogies between the leprosy and the disease of sin, and between the rites observed in the process of cleansing leprosy and the provisions of the Gospel. The chief of these analogies is that as it was only when a leper exhibited a certain change of state that orders were given by the priest for a sacrifice, so a sinner must be in the exercise of faith and penitence ere the benefits of the gospel remedy can be enjoyed by him. The slain bird and the bird let loose are supposed to typify, the one the death, and the other the resurrection of Christ; while the sprinklings on him that had been leprous typified the requirements which led a believer to cleanse himself from all filthiness of the flesh and spirit, and to perfect his holiness in the fear of the Lord.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shave off all his hair; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " partly, to discover his perfect soundness; partly, to preserve him from relapse through any seeds or relics of it which might remain in his hair, or in his clothes; and partly, to teach him to put off his old lusts, and become a new man. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Out of his tent; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " out of his former habitation, in some separate place, lest some of his leprosy yet lurking in him should break forth to the infection of his family. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he that is to be cleansed shall wash his clothes,.... That there may be no remains of the infection in them, and that they might not convey an ill scent to others: so the conversation garments of the saints are to be washed in the blood of the Lamb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shave off all his hair; what is here expressed in general is more particularly declared in Leviticus 14:9; the hair of his head, beard, and eyebrows; according to Gersom, this was done by the priest, and so Maimonides says (g), that none but a priest might shave him; and yet the text seems plainly to ascribe this, as well as the washing of his clothes and himself, to the leper that was to be cleansed; and the same writers say, that if two hairs were left it was no shaving; and so says the Misnah (h): the shaving of the leper's hairs signified the weakening of the strength of sin; the mortification of the deeds of the body, through the Spirit, and the laying aside all superfluity of naughtiness, and the excrescences of the flesh; a parting with every thing that grows out of a man's self, sin or self-righteousness; a laying a man bare and open, that nothing may lie hid and covered, and escape cleansing: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and shave off all his hair; what is here expressed in general is more particularly declared in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 14:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the hair of his head, beard, and eyebrows; according to Gersom, this was done by the priest, and so Maimonides says (g), that none but a priest might shave him; and yet the text seems plainly to ascribe this, as well as the washing of his clothes and himself, to the leper that was to be cleansed; and the same writers say, that if two hairs were left it was no shaving; and so says the Misnah (h): the shaving of the leper's hairs signified the weakening of the strength of sin; the mortification of the deeds of the body, through the Spirit, and the laying aside all superfluity of naughtiness, and the excrescences of the flesh; a parting with every thing that grows out of a man's self, sin or self-righteousness; a laying a man bare and open, that nothing may lie hid and covered, and escape cleansing: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and wash himself in water, that he may be clean: which was to be done by dipping in a collection of water, and not in running water, as Gersom observes, in a quantity of water sufficient to cover the whole body; which, according to the Talmud (i), was forty seahs, and was a cubit square in breadth, and three cubits deep: this may denote the washing of sinful men with the washing of regeneration, but more especially with the blood of Christ, the fountain opened for sin and uncleanness, Zechariah 13:1, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and wash himself in water, that he may be clean: which was to be done by dipping in a collection of water, and not in running water, as Gersom observes, in a quantity of water sufficient to cover the whole body; which, according to the Talmud (i), was forty seahs, and was a cubit square in breadth, and three cubits deep: this may denote the washing of sinful men with the washing of regeneration, but more especially with the blood of Christ, the fountain opened for sin and uncleanness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 13:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and after that he shall come into the camp; into the camp of Israel, while in the wilderness, and in after times into the city, where he used to dwell; and may sign try the admittance of such into the church of God again, who appear to be cleansed from sin, to have true repentance towards God for it, and faith in the blood of Christ: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall tarry abroad out of his tent seven days; that is, out of his own tent or house, where his wife and family dwelt: this precaution was taken, lest there should be any remains of his disorder lurking, in him that might endanger his wife and family, especially his wife, with whom he was to have no conjugal conversation as yet; so it is said in the Misnah (k), that he was to be separated from his house seven days, and forbid the use of the marriage bed; and this prohibition. Jarchi thinks is intended in this clause, and so Maimonides (l), to which agrees the Targum of Jonathan,\"he shall sit without the tent of the house of his habitation, and shall not come near to the side of his wife seven days.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Hilchot Tumaat Tzarat, c. 11. sect. 3.((h) Negaim, c. 14. sect. 4. (i) T. Bab. Eruvin, fol. 14. 1, 2.((k) Ut supra, (Misn. Negaim, c. 11) sect. 2.((l) Ut supra, (Hilchot Tumaat Tzarat, c. 11.) sect. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(g) Hilchot Tumaat Tzarat, c. 11. sect. 3.((h) Negaim, c. 14. sect. 4. (i) T. Bab. Eruvin, fol. 14. 1, 2.((k) Ut supra, (Misn. Negaim, c. 11) sect. 2.((l) Ut supra, (Hilchot Tumaat Tzarat, c. 11.) sect. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he that is to be cleansed shall wash his clothes, and shave off all his hair, and wash himself in water, that he may be clean: and after that he shall come into the camp, and shall tarry abroad out of his tent seven days.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The person to be cleansed now began to take part in the ceremonial. He must wash his clothes, shave and wash himself; he was then admitted into the camp, but not allowed to enter his own dwelling.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - After the healed leper has ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "washed his clothes, and shaved off all his hair, and washed himself with water,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so as to leave no remnant of his former defilement that can be removed, the first stage of his purification is over. He is restored to the camp, but not yet to the sanctuary, nor to his position as head or member of his family. He has still to undergo another week's purgation, and until that time has elapsed he may not live in his tent. Leviticus 14:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After this symbolical purification from the mortal ban of leprosy, the person cleansed had to purify himself bodily, by washing his clothes, shaving off all his hair - i.e., not merely the hair of his head and beard, but that of his whole body (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), - and bathing in water; and he could then enter into the camp. But he had still to remain outside his tent for seven days, not only because he did not yet feel himself at home in the congregation, or because he was still to retain the consciousness that something else was wanting before he could be fully restored, but, as the Chaldee has explained it by adding the clause, et non accedat ad latus uxoris suae, that he might not defile himself again by conjugal rights, and so interrupt his preparation for readmission into fellowship with Jehovah.",
        "children": []
      }
    ]
  }
]