[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "We will set up our banners.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we will wave our banners. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The whole army, or their representatives, assembled in the Temple courts, raise the encouraging shout.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 20:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We will rejoice in thy salvation — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hereby they show their confidence in God, and their assurance of the victory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the name of our God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, to the honour of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we will set up our banners — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the way of triumph, which, among other ways, was celebrated by the setting up of banners, or trophies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now know I, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — I am already assured of victory by the consideration of God’s power and faithfulness, and love to his people. These words seem to have been spoken by David himself; or rather, by the high-priest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord saveth his anointed — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Will certainly save, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with the saving strength of his right hand — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This shows how God would hear him, even by saving him with a strong hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:1-9 This psalm is a prayer for the kings of Israel, but with relation to Christ. - Even the greatest of men may be much in trouble. Neither the crown on the king's head, nor the grace in his heart, would make him free from trouble. Even the greatest of men must be much in prayer. Let none expect benefit by the prayers of the church, or their friends, who are capable of praying for themselves, yet neglect it. Pray that God would protect his person, and preserve his life. That God would enable him to go on in his undertakings for the public good. We may know that God accepts our spiritual sacrifices, if by his Spirit he kindles in our souls a holy fire of piety and love to God. Also, that the Lord would crown his enterprises with success. Our first step to victory in spiritual warfare is to trust only in the mercy and grace of God; all who trust in themselves will soon be cast down. Believers triumph in God, and his revelation of himself to them, by which they distinguish themselves from those that live without God in the world. Those who make God and his name their praise, may make God and his name their trust. This was the case when the pride and power of Jewish unbelief, and pagan idolatry, fell before the sermons and lives of the humble believers in Jesus. This is the case in every conflict with our spiritual enemies, when we engage them in the name, the spirit, and the power of Christ; and this will be the case at the last day, when the world, with the prince of it, shall be brought down and fall; but believers, risen-from the dead, through the resurrection of the Lord, shall stand, and sing his praises in heaven. In Christ's salvation let us rejoice; and set up our banners in the name of the Lord our God, assured that by the saving strength of his right hand we shall be conquerors over every enemy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We will rejoice in thy salvation - According to the idea of the psalm suggested in the introduction, this is a response of the king and those associated with him in going forth to battle. It expresses the joy which they would have in the expected deliverance from danger, and their conviction that through his strength they would be able to obtain it. The word salvation here means deliverance; to wit, from the anticipated danger. The phrase implies that God would interpose to save them; it expresses alike their confidence in that, and the fact that such a deliverance would fill their hearts with joy and rejoicing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And in the name of our God - This indicates a sense of dependence on God, and also that the enterprise undertaken was in order to promote his honor and glory. It was not in their own strength, nor was it to promote the purposes of conquest and the ends of ambition; it was that God might be honored, and it was with confidence of success derived from his anticipated aid.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We will set up our banners - We will erect our standards; or, as we should say, we will unfurl our flag. All people, when they go to war, have standards or banners, whether flags or some other ensigns, around which they rally; which they follow; under which they fight; and which they feel bound to defend. Each nation has its own standard; but it is difficult to determine what precisely was the form of the standards used among the ancient Hebrews. Military standards, however, were early used (compare Numbers 1:52; Numbers 2:2-3, Numbers 2:10, Numbers 2:18, Numbers 2:25; Numbers 10:14, Numbers 10:25), and indeed were necessary whenever armies were mustered for war, For the forms of ancient standards, see the article in Kitto's Cyclopaedia of the Bible, \"Standards.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We will set up our banners - We will erect our standards; or, as we should say, we will unfurl our flag. All people, when they go to war, have standards or banners, whether flags or some other ensigns, around which they rally; which they follow; under which they fight; and which they feel bound to defend. Each nation has its own standard; but it is difficult to determine what precisely was the form of the standards used among the ancient Hebrews. Military standards, however, were early used (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 1:52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 2:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 2:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and indeed were necessary whenever armies were mustered for war, For the forms of ancient standards, see the article in Kitto's Cyclopaedia of the Bible, \"Standards.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord fulfil all thy petitions - The prayers offered in connection with the sacrifice referred to in Psalm 20:3 (compare Psalm 20:4). This, according to the view suggested in the introduction, is the response of the people, expressing their desire that the king might be successful in what he had undertaken, and that the prayers which had been offered for success might be answered. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord fulfil all thy petitions - The prayers offered in connection with the sacrifice referred to in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This, according to the view suggested in the introduction, is the response of the people, expressing their desire that the king might be successful in what he had undertaken, and that the prayers which had been offered for success might be answered. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. salvation—that wrought and experienced by him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "set up our banners—(Nu 2:3, 10). In usual sense, or, as some render, \"may we be made great.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "set up our banners—(Nu 2:3, 10). In usual sense, or, as some render, \"may we be made great.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5 We will rejoice in thy salvation, and in the name of our God we will set up our banners: the Lord fulfil all thy petitions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 Now know I that the Lord saveth his anointed; he will hear him from his holy heaven with the saving strength of his right hand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 Some trust in chariots, and some in horses: but we will remember the name of the Lord our God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 20:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:5",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"We will rejoice in thy salvation.\" In Jesus there is salvation; it is his own, and hence it is called thy salvation; but it is ours to receive and ours to rejoice in. We should fixedly resolve that come what may, we will rejoice in the saving arm of the Lord Jesus. The people in this Psalm, before their king went to battle, felt sure of victory, and therefore began to rejoice beforehand; how much more ought we to do this who have seen the victory completely won! Unbelief begins weeping for the funeral before the man is dead; why should not faith commence piping before the dance of victory begins? Buds are beautiful, and promises not yet fulfilled are worthy to be admired. If joy were more general among the Lord's people, God would be more glorified among men; the happiness of the subjects is the honour of the sovereign. \"And in the name of our God we will set up our banners.\" We lift the standard of defiance in the face of the foe, and wave the flag of victory over the fallen adversary. Some proclaim war in the name of one king and some of another but the faithful go to war in Jesus' name, the name of the incarnate God, Immanuel, God with us. The times are evil at present, but so long as Jesus lives and reigns in his church we need not furl our banners in fear, but advance them with sacred courage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Jesus' tremendous name",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Puts all our foes to flight;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jesus, the meek, the angry Lamb",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A lion is in fight.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The church cannot forget that Jesus is her advocate before the throne, and therefore she sums up the desires already expressed in the short sentence, \"The Lord fulfil all thy petitions.\" Be it never forgotten that among those petitions is that choice one, \"Father, I will that they also whom thou hast given me be with me where Iam.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 20:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:6",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Now know I that the Lord sayeth his anointed.\" We live and learn, and what we learn we are not ashamed to acknowledge. He who thinks he knows everything will miss the joy of finding out new truth; he will never be able to cry, \"now know I,\" for he is so wise in his own conceit that he knows all that can be revealed and more. Souls conscious of ignorance shall be taught of the Lord, and rejoice as they learn. Earnest prayer frequently leads to assured confidence. The church pleaded that the Lord Jesus might win the victory in his great struggle, and now by faith she sees him saved by the omnipotent arm. She evidently finds a sweet relish in the fragrant title of \"anointed;\" she thinks of him as ordained before all worlds to his great work, and then endowed with the needful qualifications by being anointed of the Spirit of the Lord; and this is evermore the choicest solace of the believer, that Jehovah himself hath anointed Jesus to be a Prince and a Saviour, and that our shield is thus the Lord's own anointed. \"He will hear him from his holy heaven with the saving strength of his right hand.\" It is here asserted confidently that God's holiness and power would both come to the rescue of the Saviour in his conflict, and surely these two glorious attributes found congenial work in answering the sufferer's cries. Since Jesus was heard, we shall be; God is in heaven, but our prayers can scale those glorious heights; those heavens are holy, but Jesus purifies our prayers, and so they gain admittance; our need is great, but the divine arm is strong, and all its strength is \"saving strength;\" that strength, moreover, is in the hand which is most used and which is used most readily - the right hand. What encouragements are these for pleading saints!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 20:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:7",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "We will rejoice:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hereby they show their confidence in God, and their assurance of the victory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the name of our God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. to the honour of God, as the Conqueror. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "We will set up our banners, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in way of triumph; which among other ways was celebrated by the setting up of banners or trophies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We will rejoice in thy salvation,.... That is, \"so will we\", &c. or \"that we may\" (p), &c. or \"let us\"; these words, with what follow, point at the end of the church's requests, and what she resolved to do upon the accomplishment of the above things; for instance, she would rejoice in the salvation of the Messiah; meaning either the salvation and deliverance from death and the grave, and all other enemies, which he himself is possessed of, and which enters into, and is the occasion of the joy of his people; for not his sufferings and death only, but chiefly his resurrection from the dead, session at God's right hand, and intercession for them, cause the triumph of faith in him, and further the joy of it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or else the salvation he is the author of, which being so great, so suitable, so complete and perfect, and an everlasting one; is matter of joy to all sensible of their need of it, and who have a comfortable hope of interest in it; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the name of our God we will set up our banners; either as a preparation for war; see Jeremiah 51:27; so when Caesar (q) set up his banner, it was a sign to his soldiers to run to their arms and prepare to fight; and then the sense is, putting our trust in the Lord, relying on his strength, and not on our own, we will cheerfully and courageously engage with all his and our enemies, sin, Satan, and the world; as good soldiers of Christ, we will endure hardness, fight his battles under the banners of the Lord of hosts, in whose service we are enlisted; or as a sign of victory, when standards were set up, and flags hung out (r); see Jeremiah 50:2; and then the meaning is, Christ, the great Captain of our salvation, having obtained a complete victory over all enemies, and made us more than conquerors thereby, we will set up our banners, hang out the flag, and in his name triumph over sin, Satan, the world, death, and hell; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and in the name of our God we will set up our banners; either as a preparation for war; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; so when Caesar (q) set up his banner, it was a sign to his soldiers to run to their arms and prepare to fight; and then the sense is, putting our trust in the Lord, relying on his strength, and not on our own, we will cheerfully and courageously engage with all his and our enemies, sin, Satan, and the world; as good soldiers of Christ, we will endure hardness, fight his battles under the banners of the Lord of hosts, in whose service we are enlisted; or as a sign of victory, when standards were set up, and flags hung out (r); see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and then the meaning is, Christ, the great Captain of our salvation, having obtained a complete victory over all enemies, and made us more than conquerors thereby, we will set up our banners, hang out the flag, and in his name triumph over sin, Satan, the world, death, and hell; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord fulfil all thy petitions: the same as in Psalm 20:4; this is put here to show that the church will be in such a frame as before described, when the Lord shall have fulfilled all the petitions of his Anointed; of which she had a full assurance, as appears from the following words. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the Lord fulfil all thy petitions: the same as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 20:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; this is put here to show that the church will be in such a frame as before described, when the Lord shall have fulfilled all the petitions of his Anointed; of which she had a full assurance, as appears from the following words. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) So Ainsworth; \"ovemus\", Vatablus, Piscator, Michaelis; \"cantemus\", Gejerus. (q) De Bello Gallico, l. 2. c. 20. (r) Schindler. Pentaglott. col. 1126. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) So Ainsworth; \"ovemus\", Vatablus, Piscator, Michaelis; \"cantemus\", Gejerus. (q) De Bello Gallico, l. 2. c. 20. (r) Schindler. Pentaglott. col. 1126. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "We will rejoice in thy {d} salvation, and in the name of our God we will set up our banners: the LORD fulfil all thy petitions.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We will rejoice in thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " salvation, and in the name of our God we will set up ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "our",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " banners: the LORD fulfil all thy petitions.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Granted to the king in whose wealth our happiness stands.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prayer is still continued. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That we may) shout for joy at thy salvation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Jehovah Himself was Israel’s Saviour (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 21:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the king was His chosen instrument for saving His people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "set up our banners",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, wave them in token of triumph, than set them up as a memorial of the victory. The cognate substantive is specially used of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "standards",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the tribes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.). Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The LXX however has, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we shall be magnified",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "petitions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "We will rejoice in thy salvation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". David's\" salvation\" is here his triumph over his enemies, which the people confidently anticipate, and promise themselves the satisfaction of speedily celebrating with joy and rejoicing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And in the Name of our God we will set up our banners",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Plant them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the enemy's forts and strongholds. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord fulfil all thy petitions.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A comprehensive prayer, re-echoing the first clause of ver. 1 and the whole of ver. 4, but reaching out further to all that the monarch may at any future time request of God, The first part of the psalm here ends, and the people pause for a while. Psalm 20:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 20:2-6) Litany for the king in distress, who offers sacrifices for himself in the sanctuary. The futures in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", standing five times at the head of the climactic members of the parallelism, are optatives. ימלּא, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 20:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", also continues the chain of wishes, of which even נרננה (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") forms one of the links. The wishes of the people accompany both the prayer and the sacrifice. \"The Name of the God of Jacob\" is the self-manifesting power and grace of the God of Israel. יעקב is used in poetry interchangeably with ישראל, just like אלהים with יהוה. Alshךch refers to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and it is not improbable that the desire moulds itself after the fashion of the record of the fact there handed down to us. May Jahve, who, as the history of Jacob shows, hears (and answers) in the day of distress, hear the king; may the Name of the God of Jacob bear him away from his foes to a triumphant height. שׂגּב alternates with רומם (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in this sense. This intercession on the behalf of the praying one is made in the sanctuary on the heights of Zion, where Jahve sits enthroned. May He send him succour from thence, like auxiliary troops that decide the victory. The king offers sacrifice. He offers sacrifice according to custom before the commencement of the battle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., and cf. the phrase קדּשׁ מלחמה), a whole burnt-offering and at the same time a meat or rather meal offering also, מנחות;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: This, though not occurring in the Old Testament, is the principal form of the plural, which, as even David Kimchi recognises in his Lexicon, points to a verb מנח (just as שׂמלות, גּבעות, שׁפחות point to שׂמל, גּבע, שׂפח); whereas other old grammarians supposed נחה to be the root, and were puzzled with the traditional pronunciation menachôth, but without reason.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for every whole offering and every shelamim - or peace-offering had a meat-offering and a drink-offering as its indispensable accompaniment. The word זכר is perfectly familiar in the ritual of the meal-offering. That portion of the meal-offering, only a part of which was placed upon the altar (to which, however, according to traditional practice, does not belong the accompanying meal-offering of the מנחת נסכים, which was entirely devoted to the altar), which ascended with the altar fire is called אזכּרה, μνημόσυνον (cf. Acts 10:4), that which brings to remembrance with God him for whom it is offered up (not \"incense,\" as Hupfeld renders it); for the designation of the offering of jealousy, Numbers 5:15, as \"bringing iniquity to remembrance before God\" shows, that in the meal-offering ritual זכר retains the very same meaning that it has in other instances. Every meal-offering is in a certain sense a מנחת זכּרון a esnes . Hence here the prayer that Jahve would graciously remember them is combined with the meal-offerings.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for every whole offering and every shelamim - or peace-offering had a meat-offering and a drink-offering as its indispensable accompaniment. The word זכר is perfectly familiar in the ritual of the meal-offering. That portion of the meal-offering, only a part of which was placed upon the altar (to which, however, according to traditional practice, does not belong the accompanying meal-offering of the מנחת נסכים, which was entirely devoted to the altar), which ascended with the altar fire is called אזכּרה, μνημόσυνον (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), that which brings to remembrance with God him for whom it is offered up (not \"incense,\" as Hupfeld renders it); for the designation of the offering of jealousy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 5:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as \"bringing iniquity to remembrance before God\" shows, that in the meal-offering ritual זכר retains the very same meaning that it has in other instances. Every meal-offering is in a certain sense a מנחת זכּרון a esnes . Hence here the prayer that Jahve would graciously remember them is combined with the meal-offerings.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "As regards the ‛olah, the wish \"let fire from heaven (Leviticus 9:24; 1 Kings 18:38; 1 Chronicles 21:26) turn it to ashes,\" would not be vain. But the language does not refer to anything extraordinary; and in itself the consumption of the offering to ashes (Bttcher) is no mark of gracious acceptance. Moreover, as a denominative from דּשׁן, fat ashes, דּשּׁן means \"to clean from ashes,\" and not: to turn into ashes. On the other hand, דּשּׁן also signifies \"to make fat,\" Psalm 23:5, and this effective signification is applied declaratively in this instance: may He find thy burnt-offering fat, which is equivalent to: may it be to Him a ריח ניחח [an odour of satisfaction, a sweet-smelling savour]. The voluntative ah only occurs here and in Job 11:17 (which see) and Isaiah 5:19, in the 3 pers.; and in this instance, just as with the cohortative in 1 Samuel 28:15, we have a change of the lengthening into a sharpening of the sound (cf. the exactly similar change of forms in 1 Samuel 28:15; Isaiah 59:5; Zechariah 5:4; Proverbs 24:14; Ezekiel 25:13) as is very frequently the case in מה for מה. The alteration to ידשּׁנה or ידשׁנהּ (Hitzig) is a felicitous but needless way of getting rid of the rare form. The explanation of the intensifying of the music here is, that the intercessory song of the choir is to be simultaneous with the presentation upon the altar (הקטרה). עצה is the resolution formed in the present wartime. \"Because of thy salvation,\" i.e., thy success in war, is, as all the language is here, addressed to the king, cf. Psalm 21:2, where it is addressed to Jahve, and intended of the victory accorded to him. It is needless to read נגדּל instead of נדגּל, after the rendering of the lxx megaluntheeso'metha. נדגּל is a denominative from דּגל: to wave a banner. In the closing line, the rejoicing of hope goes back again to the present and again assumes the form of an intercessory desire. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As regards the ‛olah, the wish \"let fire from heaven (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") turn it to ashes,\" would not be vain. But the language does not refer to anything extraordinary; and in itself the consumption of the offering to ashes (Bttcher) is no mark of gracious acceptance. Moreover, as a denominative from דּשׁן, fat ashes, דּשּׁן means \"to clean from ashes,\" and not: to turn into ashes. On the other hand, דּשּׁן also signifies \"to make fat,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and this effective signification is applied declaratively in this instance: may He find thy burnt-offering fat, which is equivalent to: may it be to Him a ריח ניחח [an odour of satisfaction, a sweet-smelling savour]. The voluntative ah only occurs here and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (which see) and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the 3 pers.; and in this instance, just as with the cohortative in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we have a change of the lengthening into a sharpening of the sound (cf. the exactly similar change of forms in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 59:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 25:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as is very frequently the case in מה for מה. The alteration to ידשּׁנה or ידשׁנהּ (Hitzig) is a felicitous but needless way of getting rid of the rare form. The explanation of the intensifying of the music here is, that the intercessory song of the choir is to be simultaneous with the presentation upon the altar (הקטרה). עצה is the resolution formed in the present wartime. \"Because of thy salvation,\" i.e., thy success in war, is, as all the language is here, addressed to the king, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 21:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is addressed to Jahve, and intended of the victory accorded to him. It is needless to read נגדּל instead of נדגּל, after the rendering of the lxx megaluntheeso'metha. נדגּל is a denominative from דּגל: to wave a banner. In the closing line, the rejoicing of hope goes back again to the present and again assumes the form of an intercessory desire. ",
            "children": []
          }
        ]
      }
    ]
  }
]