[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16, 17) These verses seem rightly placed in a parenthesis. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 29:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 29:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Egypt — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Where you have seen their idolatries, and learned too much of them, as the golden calf showed, and therefore have need to renew your covenant with God; where also we were in dreadful bondage, whence God alone hath delivered us; to whom therefore we are deeply obliged, and have all reason to renew our covenant with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We came through the nations — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "With what hazard, if God had not appeared for us!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:10-21 The national covenant made with Israel, not only typified the covenant of grace made with true believers, but also represented the outward dispensation of the gospel. Those who have been enabled to consent to the Lord's new covenant of mercy and grace in Jesus Christ, and to give up themselves to be his people, should embrace every opportunity of renewing their open profession of relation to him, and their obligation to him, as the God of salvation, walking according thereto. The sinner is described as one whose heart turns away from his God; there the mischief begins, in the evil heart of unbelief, which inclines men to depart from the living God to dead idols. Even to this sin men are now tempted, when drawn aside by their own lusts and fancies. Such men are roots that bear gall and wormwood. They are weeds which, if let alone, overspread the whole field. Satan may for a time disguise this bitter morsel, so that thou shalt not have the natural taste of it, but at the last day, if not before, the true taste shall be discerned. Notice the sinner's security in sin. Though he hears the words of the curse, yet even then he thinks himself safe from the wrath of God. There is scarcely a threatening in all the book of God more dreadful than this. Oh that presumptuous sinners would read it, and tremble! for it is a real declaration of the wrath of God, against ungodliness and unrighteousness of man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With him that is not here with us - i. e. as the Jews explain, posterity; which throughout all generations was to be taken as bound by the act and deed of those present and living. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10-29. Ye stand this day all of you before the Lord your God—The whole congregation of Israel, of all ages and conditions, all—young as well as old; menials as well as masters; native Israelites as well as naturalized strangers—all were assembled before the tabernacle to renew the Sinaitic covenant. None of them were allowed to consider themselves as exempt from the terms of that national compact, lest any lapsing into idolatry might prove a root of bitterness, spreading its noxious seed and corrupt influence all around (compare Heb 12:15). It was of the greatest consequence thus to reach the heart and conscience of everyone, for some might delude themselves with the vain idea that by taking the oath (De 29:12) by which they engaged themselves in covenant with God, they would surely secure its blessings. Then, even though they would not rigidly adhere to His worship and commands, but would follow the devices and inclinations of their own hearts, yet they would think that He would wink at such liberties and not punish them. It was of the greatest consequence to impress all with the strong and abiding conviction, that while the covenant of grace had special blessings belonging to it, it at the same time had curses in reserve for transgressors, the infliction of which would be as certain, as lasting and severe. This was the advantage contemplated in the law being rehearsed a second time. The picture of a once rich and flourishing region, blasted and doomed in consequence of the sins of its inhabitants, is very striking, and calculated to awaken awe in every reflecting mind. Such is, and long has been, the desolate state of Palestine; and, in looking at its ruined cities, its blasted coast, its naked mountains, its sterile and parched soil—all the sad and unmistakable evidences of a land lying under a curse—numbers of travellers from Europe, America, and the Indies (\"strangers from a far country,\" De 29:22) in the present day see that the Lord has executed His threatening. Who can resist the conclusion that it has been inflicted \"because the inhabitants had forsaken the covenant of the Lord God of their fathers. … and the anger of the Lord was kindled against this land, to bring upon it all the curses that are written in this book\"?",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the land of Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where you have seen their idolatries, and learned too much of them, as the golden calf showed, and therefore need to renew your covenant with God; where also we were in dreadful bondage, whence God alone hath delivered us, to whom therefore we are deeply obliged, and have all reason to renew our covenant with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "How we came through the nations, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. with what hazards, if God had not appeared for us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For ye know how we have dwelt in the land of Egypt,.... How long they and their fathers had dwelt there, the number of years they had been in the land, as the Targum of Jonathan, which was upwards of two hundred years; and being a country the inhabitants of which were much given to idolatry, they had seen many of their idols, and much of their idolatrous worship; and their hearts had been apt to be ensnared by it, and the minds of some tinctured with it, and the remembrance thereof might make ill impressions on them; to remove or prevent which this covenant was made: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and how we came through the nations which ye passed by; as the Edomites, Ammonites, Moabites, and Midianites, as Aben Ezra observes, through whose borders they came, as they passed by their countries in their journeys in the wilderness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and how we came through the nations which ye passed by; as the Edomites, Ammonites, Moabites, and Midianites, as Aben Ezra observes, through whose borders they came, as they passed by their countries in their journeys in the wilderness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "(For ye know how we have dwelt in the land of Egypt; and how we came through the nations which ye passed by;",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ye know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] The necessity for such a covenant with Jehovah: viz. Israel’s experiences of the idolatry of other peoples, which otherwise might seduce them to itself. The Egyptian idolatry has not before been mentioned in Deut. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Came through",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "passed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are the same vb.: the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "idem per idem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " construction, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 16-29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The summons to renew the covenant is enforced by a fresh exposition of the evil and danger of apostasy from the Lord. This is introduced by a reference to the experience which the people already had of idolatry in Egypt, and among the nations with whom they had come in contact during their march through the wilderness, from which they must have learned the utter worthlessness of all idols, that they were no gods, but only wood and stone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 16, 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - These verses are not a parenthesis, as in the Authorized Version. Ver. 18 is connected, not with ver. 15, but with ver. 17; there should be a full stop at the end of ver. 15. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Their idols",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "their blocks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "logs",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "גִלוּלִים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "גָלַל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to roll something too heavy to be carried), a term of contempt used frequently in Scripture of idols. Deuteronomy 29:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The summons to enter into the covenant of the Lord is explained by Moses first of all by an exposition of the evil results which would follow from apostasy from the Lord, or the breach of His covenant. This exposition he introduces with an allusion to the experience of the people with reference to the worthlessness of idols, both in Egypt itself, and upon their march through the nations, whose territory they passed through (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The words, \"for ye have learned how we dwelt in Egypt, and passed through the nations...and have seen their abominations and their idols\" (gillulim: lit., clods, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), have this signification: In our abode in Egypt, and upon our march through different lands, ye have become acquainted with the idols of these nations, that they are not gods, but only wood and stone (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), silver and gold. את־אשׁר, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", literally \"ye know that which we dwelt,' i.e., know what our dwelling there showed, what experience we gained there of the nature of heathen idols. ",
        "children": []
      }
    ]
  }
]