[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All nations shall say, Wherefore . . .?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The people of Israel are represented as asking a similar question in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “And it shall come to pass, when ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye shall say, Wherefore ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "doeth the Lord our God all these things unto us? Then shalt thou answer them, Like as ye have forsaken me, and served strange gods in your land; so shall ye serve strangers in a land that is not yours.” Compare also the warning given to Solomon after the completion of the Temple (marginal reference).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:22-28 Idolatry would be the ruin of their nation. It is no new thing for God to bring desolating judgments on a people near to him in profession. He never does this without good reason. It concerns us to seek for the reason, that we may give glory to God, and take warning to ourselves. Thus the law of Moses leaves sinners under the curse, and rooted out of the Lord's land; but the grace of Christ toward penitent, believing sinners, plants them again in their land; and they shall no more be pulled up, being kept by the power of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The description is borrowed from the local features of the Dead Sea and its vicinity. The towns of the vale of Siddim were fertile and well watered (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") until devastated by the wrath of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ruin of Israel and its land should be of the like sort (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 26:31-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The desolate state of Palestine at present, and the traces of former fertility and prosperity, are attested by every traveler. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10-29. Ye stand this day all of you before the Lord your God—The whole congregation of Israel, of all ages and conditions, all—young as well as old; menials as well as masters; native Israelites as well as naturalized strangers—all were assembled before the tabernacle to renew the Sinaitic covenant. None of them were allowed to consider themselves as exempt from the terms of that national compact, lest any lapsing into idolatry might prove a root of bitterness, spreading its noxious seed and corrupt influence all around (compare Heb 12:15). It was of the greatest consequence thus to reach the heart and conscience of everyone, for some might delude themselves with the vain idea that by taking the oath (De 29:12) by which they engaged themselves in covenant with God, they would surely secure its blessings. Then, even though they would not rigidly adhere to His worship and commands, but would follow the devices and inclinations of their own hearts, yet they would think that He would wink at such liberties and not punish them. It was of the greatest consequence to impress all with the strong and abiding conviction, that while the covenant of grace had special blessings belonging to it, it at the same time had curses in reserve for transgressors, the infliction of which would be as certain, as lasting and severe. This was the advantage contemplated in the law being rehearsed a second time. The picture of a once rich and flourishing region, blasted and doomed in consequence of the sins of its inhabitants, is very striking, and calculated to awaken awe in every reflecting mind. Such is, and long has been, the desolate state of Palestine; and, in looking at its ruined cities, its blasted coast, its naked mountains, its sterile and parched soil—all the sad and unmistakable evidences of a land lying under a curse—numbers of travellers from Europe, America, and the Indies (\"strangers from a far country,\" De 29:22) in the present day see that the Lord has executed His threatening. Who can resist the conclusion that it has been inflicted \"because the inhabitants had forsaken the covenant of the Lord God of their fathers. … and the anger of the Lord was kindled against this land, to bring upon it all the curses that are written in this book\"?",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Even all nations shall say,.... For the destruction of this land, and the people of it, would be, as it has been, so very great and awful, and so very remarkable and surprising, that the fame of it would be heard among all the nations of the world, as it has been; who, upon hearing the sad report of it, would ask the following questions: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "wherefore hath the Lord done thus unto this land? so distinguished from all others for the fruitfulness and pleasantness of it; the people, the inhabitants of which, he chose, above all others, to be a special and peculiar people; and where he had a temple built for him, and where he had his residence, and worship used to be given unto him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "what meaneth the heat of this great anger? what is the reason of his stirring up his fierce wrath, and causing it to burn in so furious a manner? surely it must be something very horrible and provoking indeed! ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "what meaneth the heat of this great anger? what is the reason of his stirring up his fierce wrath, and causing it to burn in so furious a manner? surely it must be something very horrible and provoking indeed! ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Even all nations shall say, Wherefore hath the LORD done thus unto this land? what meaneth the heat of this great anger?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What meaneth the heat of this great anger?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The reply to this question comes in what follows (vers. 25-28). Deuteronomy 29:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"What is this great burning of wrath?\" i.e., what does it mean - whence does it come? The reply to such a question would be (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:25-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): The inhabitants of the land have forsaken the covenant of the Lord, the God of their fathers; therefore has the wrath of the Lord burned over the land. ",
        "children": []
      }
    ]
  }
]