[{"header":"Descendants of Issachar"},{"num":7,"verse":"The four sons of Issachar were Tola, Puah, Jashub, and Shimron."},{"num":2,"verse":"The sons of Tola were Uzzi, Rephaiah, Jeriel, Jahmai, Ibsam, and Shemuel. Each of them was the leader of an ancestral clan. At the time of King David, the total number of mighty warriors listed in the records of these clans was 22,600."},{"num":3,"verse":"The son of Uzzi was Izrahiah. The sons of Izrahiah were Michael, Obadiah, Joel, and Isshiah. These five became the leaders of clans."},{"num":4,"verse":"All of them had many wives and many sons, so the total number of men available for military service among their descendants was 36,000."},{"num":5,"verse":"The total number of mighty warriors from all the clans of the tribe of Issachar was 87,000. All of them were listed in their genealogical records."},{"header":"Descendants of Benjamin"},{"num":6,"verse":"Three of Benjamin’s sons were Bela, Beker, and Jediael."},{"num":7,"verse":"The five sons of Bela were Ezbon, Uzzi, Uzziel, Jerimoth, and Iri. Each of them was the leader of an ancestral clan. The total number of mighty warriors from these clans was 22,034, as listed in their genealogical records."},{"num":8,"verse":"The sons of Beker were Zemirah, Joash, Eliezer, Elioenai, Omri, Jeremoth, Abijah, Anathoth, and Alemeth."},{"num":9,"verse":"Each of them was the leader of an ancestral clan. The total number of mighty warriors and leaders from these clans was 20,200, as listed in their genealogical records."},{"num":10,"verse":"The son of Jediael was Bilhan. The sons of Bilhan were Jeush, Benjamin, Ehud, Kenaanah, Zethan, Tarshish, and Ahishahar."},{"num":11,"verse":"Each of them was the leader of an ancestral clan. From these clans the total number of mighty warriors ready for war was 17,200."},{"num":12,"verse":"The sons of Ir were Shuppim and Huppim. Hushim was the son of Aher."},{"header":"Descendants of Naphtali"},{"num":13,"verse":"The sons of Naphtali were Jahzeel, Guni, Jezer, and Shillem. They were all descendants of Jacob’s concubine Bilhah."},{"header":"Descendants of Manasseh"},{"num":14,"verse":"The descendants of Manasseh through his Aramean concubine included Asriel. She also bore Makir, the father of Gilead."},{"num":15,"verse":"Makir found wives for Huppim and Shuppim. Makir had a sister named Maacah. One of his descendants was Zelophehad, who had only daughters."},{"num":16,"verse":"Makir’s wife, Maacah, gave birth to a son whom she named Peresh. His brother’s name was Sheresh. The sons of Peresh were Ulam and Rakem."},{"num":17,"verse":"The son of Ulam was Bedan. All these were considered Gileadites, descendants of Makir son of Manasseh."},{"num":18,"verse":"Makir’s sister Hammoleketh gave birth to Ishhod, Abiezer, and Mahlah."},{"num":19,"verse":"The sons of Shemida were Ahian, Shechem, Likhi, and Aniam."},{"header":"Descendants of Ephraim"},{"num":20,"verse":"The descendants of Ephraim were Shuthelah, Bered, Tahath, Eleadah, Tahath,"},{"num":21,"verse":"Zabad, Shuthelah, Ezer, and Elead. These two were killed trying to steal livestock from the local farmers near Gath."},{"num":22,"verse":"Their father, Ephraim, mourned for them a long time, and his relatives came to comfort him."},{"num":23,"verse":"Afterward Ephraim slept with his wife, and she became pregnant and gave birth to a son. Ephraim named him Beriah because of the tragedy his family had suffered."},{"num":24,"verse":"He had a daughter named Sheerah. She built the towns of Lower and Upper Beth-horon and Uzzen-sheerah."},{"num":25,"verse":"The descendants of Ephraim included Rephah, Resheph, Telah, Tahan,"},{"num":26,"verse":"Ladan, Ammihud, Elishama,"},{"num":27,"verse":"Nun, and Joshua."},{"num":28,"verse":"The descendants of Ephraim lived in the territory that included Bethel and its surrounding towns to the south, Naaran to the east, Gezer and its villages to the west, and Shechem and its surrounding villages to the north as far as Ayyah and its towns."},{"num":29,"verse":"Along the border of Manasseh were the towns of Beth-shan, Taanach, Megiddo, Dor, and their surrounding villages. The descendants of Joseph son of Israel lived in these towns."},{"header":"Descendants of Asher"},{"num":30,"verse":"The sons of Asher were Imnah, Ishvah, Ishvi, and Beriah. They had a sister named Serah."},{"num":31,"verse":"The sons of Beriah were Heber and Malkiel (the father of Birzaith)."},{"num":32,"verse":"The sons of Heber were Japhlet, Shomer, and Hotham. They had a sister named Shua."},{"num":33,"verse":"The sons of Japhlet were Pasach, Bimhal, and Ashvath."},{"num":34,"verse":"The sons of Shomer were Ahi, Rohgah, Hubbah, and Aram."},{"num":35,"verse":"The sons of his brother Helem were Zophah, Imna, Shelesh, and Amal."},{"num":36,"verse":"The sons of Zophah were Suah, Harnepher, Shual, Beri, Imrah,"},{"num":37,"verse":"Bezer, Hod, Shamma, Shilshah, Ithran, and Beera."},{"num":38,"verse":"The sons of Jether were Jephunneh, Pispah, and Ara."},{"num":39,"verse":"The sons of Ulla were Arah, Hanniel, and Rizia."},{"num":40,"verse":"Each of these descendants of Asher was the head of an ancestral clan. They were all select men—mighty warriors and outstanding leaders. The total number of men available for military service was 26,000, as listed in their genealogical records."}]