[{"header":"The Lampstand and the Holy Bread"},{"num":24,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Command the people of Israel to bring you pure oil from crushed olives. That oil is for the lamps. These lamps must never go out. "},{"num":3,"verse":"Aaron will keep the lamps burning in the Meeting Tent. They will burn from evening until morning before the Lord. This will be in front of the curtain of the Ark of the Covenant. This law will continue from now on. "},{"num":4,"verse":"Aaron must always keep the lamps burning. They are on the lampstands of pure gold before the Lord."},{"num":5,"verse":"“Take fine flour and bake 12 loaves of bread with it. Use four quarts of flour for each loaf. "},{"num":6,"verse":"Put them in two rows on the golden table before the Lord. Six loaves will be in each row. "},{"num":7,"verse":"Put pure incense on each row. This is the memorial portion to take the place of the bread. It is an offering made by fire to the Lord. "},{"num":8,"verse":"Every Sabbath day Aaron will put the bread in order before the Lord. This agreement with the people of Israel will continue forever. "},{"num":9,"verse":"That bread will belong to Aaron and his sons. They will eat it in a holy place. This is because it is a most holy part of the offerings made by fire to the Lord. That bread is their share forever.”"},{"header":"The Man Who Cursed God"},{"num":10,"verse":"Now there was a son of an Israelite woman and an Egyptian father. The son was walking among the Israelites. And a fight broke out in the camp between him and an Israelite. "},{"num":11,"verse":"The son of the Israelite woman began cursing and speaking against the Lord. So the people took him to Moses. (The mother’s name was Shelomith. She was the daughter of Debri from the family of Dan.) "},{"num":12,"verse":"The people held him as a prisoner. They waited for the Lord’s command to be made clear to them."},{"num":13,"verse":"Then the Lord said to Moses, "},{"num":14,"verse":"“Take the one who spoke against me outside the camp. Then bring together all the people who heard him. They must put their hands on his head. Then all the people must throw stones at him and kill him. "},{"num":15,"verse":"Tell the people of Israel this: ‘If anyone curses his God, he is guilty of sin. "},{"num":16,"verse":"Anyone who speaks against the Lord must be put to death. All the people must kill him by throwing stones at him. Foreigners must be punished just like the person born in Israel. If someone speaks against the Lord, he must be put to death."},{"num":17,"verse":"“‘If someone kills another person, he must be put to death. "},{"num":18,"verse":"Someone might kill an animal that belongs to another person. If he does, he must give that person another animal to take its place. "},{"num":19,"verse":"And someone might cause an injury to his neighbor. If he does, the same kind of injury must be given back to him. "},{"num":20,"verse":"A broken bone must be paid for a broken bone, an eye for an eye and a tooth for a tooth. In the same way someone injures another person, he must be injured in return. "},{"num":21,"verse":"So anyone who kills another person’s animal must give that person another animal to take its place. But the person who kills another person must be put to death."},{"num":22,"verse":"“‘The law will be the same for the foreigner as for those from your own country. I am the Lord your God.’”"},{"num":23,"verse":"Then Moses spoke to the people of Israel. And they took the person who had cursed outside the camp. Then they killed him with stones. So the people of Israel did as the Lord had commanded Moses."}]