[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(43) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To day shalt thou be with me in paradise.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We have first to consider the word, then the thought expressed by it. The former first appears as a Persian word applied to land enclosed as a park or garden for a king or satrap. As such it meets us often in Xenophon’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Anabasis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i. 2, § 7; 4, § 9, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "et al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Finding it so used, the LXX. translators used it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and, above all, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", taking what we treat as a proper name as a description, and giving “the Paradise of Delight” for “the Garden of Eden.” In the figurative language in which the current Jewish belief clothed its thoughts of the unseen world, the Garden of Eden took its place side by side with “Abraham’s bosom,” as a synonym for the eternal blessedness of the righteous, presenting a vivid contrast to the foul horrors of Gehenna. It is remarkable, however, that this is the one occasion on which the word appears as part of our Lord’s teaching. In the mystical language of the Apocalypse, “the tree of life which is in the midst of the paradise of God,” is one of the promises to “him that overcometh” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). St. Paul speaks of himself as having been caught up in ecstasy and vision into “paradise” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Corinthians 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In this instance we may trace in our Lord’s use of the word a subtle tenderness of sympathy. What He said in answer to the penitent’s prayer was, in part, a contrast to it, in part, its most complete fulfilment. Not in the far-off “Coming,” but that very day; not “remembered “only, but in closest companionship; not in the tumult and battle which his thoughts had connected with the Kingdom, but in the fair garden, with its green lawns and still waters, its trees of Knowledge and of Life. No picture could meet the cravings of the tortured robber more completely than that; none, probably, could be more different from his expectations. Yet the “paradise” of Eastern lands was essentially the kingly garden, that of which the palace was the centre. The promise implied that the penitent should enter at once into the highest joy of the Kingdom. Are we right in thinking that there was no fulfilment of the words till death had released the spirit from its thraldom? May there not even then have been an ineffable joy, such as made the flames of the fiery furnace to be as a “moist whistling wind” (Song of Three Childr. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Apocrypha",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " such as martyrs have in a thousand cases known, acting almost as a physical anæsthetic acts? The penitent thief is naturally prominent in the Apocryphal legends of our Lord’s descent into Hades, seen by His side as He enters Paradise (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Gosp. of Nicodemus,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ii. 10).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Luke",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "WORDS FROM THE CROSSLuke 23:33 - Luke 23:46",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "WORDS FROM THE CROSS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:46",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The calm tone of all the narratives of the Crucifixion is very remarkable. Each Evangelist limits himself to the bare recording of facts, without a trace of emotion. They felt too deeply to show feeling. It was fitting that the story which, till the end of time, was to move hearts to a passion of love and devotion, should be told without any colouring. Let us beware of reading it coldly! This passage is more adapted to be pondered in solitude, with the thought, ‘All this was borne for me,’ than to be commented on. But a reverent word or two is permissible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke’s account is noticeably independent of the other three. The three sayings of Christ’s, round which his narrative is grouped, are preserved by him alone. We shall best grasp the dominant impression which the Evangelist unconsciously had himself received, and sought to convey, by gathering the whole round these three words from the Cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The first word sets Jesus forth as the all-merciful Intercessor and patient friend of sinners.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The first word sets Jesus forth as the all-merciful Intercessor and patient friend of sinners. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is very significantly set in the centre of the paragraph {vs. 33-38} which recounts the heartless cruelty and mockery of soldiers and rulers. Surrounded by that whirlwind of abuse, contempt and ferocious glee at His sufferings, He gave back no taunt, nor uttered any cry of pain, nor was moved to the faintest anger, but let His heart go out in pity for all who took part in that wicked tragedy; and, while ‘He opened not His mouth’ in complaint or reviling, He did open it in intercession. But the wonderful prayer smote no heart with compunction, and, after it, the storm of mocking and savage triumph hurtled on as before.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke gathers all the details together in summary fashion, and piles them on one another without enlarging on any. The effect produced is like that of a succession of breakers beating on some lonely rock, or of blows struck by a battering-ram on a fortress.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘They crucified Him,’-there is no need to say who ‘they’ were. Others than the soldiers, who did the work, did the deed. Contempt gave Him two malefactors for companions and hung the King of the Jews in the place of honour in the midst. Did John remember what his brother and he had asked? Matter-of-fact indifference as to a piece of military duty, and shameless greed, impelled the legionaries to cast lots for the clothes stripped from a living man. What did the crucifying of another Jew or two matter to them? Gaping curiosity, and the strange love of the horrible, so strong in the vulgar mind, led the people, who had been shouting Hosanna! less than a week ago, to stand gazing on the sight without pity but in a few hearts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The bitter hatred of the rulers, and their inhuman glee at getting rid of a heretic, gave them bad preeminence in sin. Their scoff acknowledged that He had ‘saved others,’ and their hate had so blinded their eyes that they could not see how manifestly His refusal to use His power to save Himself proved Him the Son of God. He could not save Himself, just because He would save these scoffing Rabbis and all the world. The rough soldiers knew little about Him, but they followed suit, and thought it an excellent jest to bring the ‘vinegar,’ provided in kindness, to Jesus with a mockery of reverence as to a king. The gibe was double-barrelled, like the inscription over the Cross; for it was meant to hit both this Pretender to royalty and His alleged subjects.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And to all this Christ’s sole answer was the ever-memorable prayer. One of the women who bravely stood at the Cross must have caught the perhaps low-voiced supplication, and it breathed so much of the aspect of Christ’s character in which Luke especially delights that he could not leave it out. It opens many large questions which cannot be dealt with here. All sin has in it an element of ignorance, but it is not wholly ignorance as some modern teachers affirm. If the ignorance were complete, the sin would be nonexistent. The persons covered by the ample folds of this prayer were ignorant in very different degrees, and had had very different opportunities of changing ignorance for knowledge. The soldiers and the rulers were in different positions in that respect. But none were so entirely blind that they had no sin, and none were so entirely seeing that they were beyond the reach of Christ’s pity or the power of His intercession. In that prayer we learn, not only His infinite forgivingness for insults and unbelief levelled at Himself, but His exaltation as the Intercessor, whom the Father heareth always. The dying Christ prayed for His enemies; the glorified Christ lives to make intercession for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. In the second saying Christ is revealed as having the keys of Hades, the invisible world of the dead.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. In the second saying Christ is revealed as having the keys of Hades, the invisible world of the dead. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "How differently the same circumstances work on different natures! In the one malefactor, physical agony and despair found momentary relief in taunts, flung from lips dry with torture, at the fellow-sufferer whose very innocence provoked hatred from the guilty heart. The other had been led by his punishment to recognise in it the due reward of his deeds, and thus softened, had been moved by Christ’s prayer, and by his knowledge of Christ’s innocence, to hope that the same mercy which had been lavished on the inflicters of His sufferings, might stretch to enfold the partakers in it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " At that moment the dying thief had clearer faith in Christ’s coming in His kingdom than any of the disciples had. Their hopes were crumbling as they watched Him hanging unresisting and gradually dying. But this man looked beyond the death so near for both Jesus and himself, and believed that, after it, He would come to reign. We may call him the only disciple that Christ then had.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How pathetic is that petition, ‘Remember me’! It builds the hope of sharing in Christ’s royalty on the fact of having shared in His Cross. ‘Thou wilt not forget Thy companion in that black hour, which will then lie behind us.’ Such trust and clinging, joined with such penitence and submission, could not go unrewarded.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " From His Cross Jesus speaks in royal style, as monarch of that dim world. His promise is sealed with His own sign-manual, ‘Verily, I say.’ It claims to have not only the clear vision of, but the authority to determine, the future. It declares the unbroken continuance of personal existence, and the reality of a state of conscious blessedness, in which men are aware of their union with Him, the Lord of the realm and the Life of its inhabitants. It graciously accepts the penitent’s petition, and assures him that the companionship, begun on the Cross, will be continued there. ‘With Me’ makes ‘Paradise’ wherever a soul is.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The third word from the Cross, as recorded by Luke, reveals Jesus as, in the act of dying, the Master of death, and its Transformer for all who trust Him into a peaceful surrender of themselves into the Father’s hands.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The third word from the Cross, as recorded by Luke, reveals Jesus as, in the act of dying, the Master of death, and its Transformer for all who trust Him into a peaceful surrender of themselves into the Father’s hands. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The circumstances grouped round the act of His death bring out various aspects of its significance. The darkness preceding had passed before He died, and it bore rather on His sense of desertion, expressed in the unfathomably profound and awful cry, ‘Why hast Thou forsaken Me?’ The rent veil is generally taken to symbolise the unrestricted access into the presence of God, which we have through Christ’s death; but it is worth considering whether it does not rather indicate the divine leaving of the desecrated shrine, and so is the beginning of the fulfilment of the deep word, ‘Destroy this Temple.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the centre-point of the section is the last cry which, in its loudness, indicated physical strength quite incompatible with the exhaustion to which death by crucifixion was generally due. It thus confirms the view which sees, both in the words of Jesus and in the Evangelist’s expression for His death, clear indications that He died, not because His physical powers were unable to live longer, but by the exercise of His own volition. He died because He chose, and He chose because He loved and would save. As St. Bernard says, ‘Who is He who thus easily falls asleep when He wills? To die is indeed great weakness, but to die thus is immeasurable power. Truly the weakness of God is stronger than men.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor let us forget that, in thus dying, Jesus gave us an imitable example, as well as revealed inimitable power. For, if we trust ourselves, living and dying, to Him, we shall not be dragged reluctantly, by an overmastering grasp against which we vainly struggle, out of a world where we would fain stay, but we may yield ourselves willingly, as to a Father’s hand, which draws His children gently to His own side, and blesses them, when there, with His fuller presence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 23:43",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:43",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus said ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— In answer to his prayer; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Verily I say unto thee ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— I, the Amen, the faithful Witness, give thee assurance, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This day thou shalt be with me in paradise ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— As if he had said, I will not only remember thee when I come into my kingdom, but this very day; and will confer upon thee more than thou hast asked. Christ here lets us know, 1st, That he was going, not only to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αδης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the invisible world, but to that part of it termed paradise. His human soul was removing to the place of separate souls; not to the place of the damned, but to the place of the blessed. This was the beginning of the joy set before him, with the prospect of which he comforted himself. He went by the cross to the crown, and we must not think of going any other way, or of being perfected save by sufferings. 2d, That when penitent believers die, they go to be with him there. He was now as a priest, purchasing this happiness for them, and is ready, as a king, to confer it upon them. Observe, reader, how the state of happiness, prepared for holy souls after death, is set forth. 1st, It is being in paradise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a garden of pleasure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the paradise of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", alluding to those gardens in which the eastern monarchs made their magnificent banquets, or rather to the garden of Eden, in which our first parents were placed, when they were innocent. It is termed ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Abraham’s bosom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the story of Lazarus, and was a common expression among the Jews, for the mansion of beatified souls in their separate state. In the second Adam we are restored to all we lost in the first Adam; and more, to a heavenly paradise instead of an earthly one. 2d, It is being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with Christ ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "there. It is the happiness of paradise and of heaven, to see Christ, to be with him, and to share in his glory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Father, I will that they whom thou hast given me, be with me where I am, that they may behold my glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 17:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus St. Paul expected, when he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "departed, to be with Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the first Christians in general were confident, that when they were ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "absent from the body, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "they should ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be present with the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "3d, Holy souls enter this place, or state, immediately upon death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, before six o’clock in the evening, when their day ended. “The souls of the faithful, after they are delivered from the burden of the flesh, are immediately in joy and felicity.” Observe, 1st, “That the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σημερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to-day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is not to be connected with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as if the sense were this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I say to thee to-day; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but with the words following, so as to contain a promise, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the thief ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[with respect to his soul] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "should even that day be in paradise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "appears from the familiar phrase of the Jews, who say of the just man dying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To-day he shall sit in the bosom of Abraham. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2d, Christ doubtless spake in that sense in which the thief could, and in which Christ knew he would, understand him; now he, being a Jew, would surely understand him according to the received opinion of his nation concerning paradise, which was, that it was the place into which pious souls, separated from the body, were immediately received.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:32-43 As soon as Christ was fastened to the cross, he prayed for those who crucified him. The great thing he died to purchase and procure for us, is the forgiveness of sin. This he prays for. Jesus was crucified between two thieves; in them were shown the different effects the cross of Christ would have upon the children of men in the preaching the gospel. One malefactor was hardened to the last. No troubles of themselves will change a wicked heart. The other was softened at the last: he was snatched as a brand out of the burning, and made a monument of Divine mercy. This gives no encouragement to any to put off repentance to their death-beds, or to hope that they shall then find mercy. It is certain that true repentance is never too late; but it is as certain that late repentance is seldom true. None can be sure they shall have time to repent at death, but every man may be sure he cannot have the advantages this penitent thief had. We shall see the case to be singular, if we observe the uncommon effects of God's grace upon this man. He reproved the other for railing on Christ. He owned that he deserved what was done to him. He believed Jesus to have suffered wrongfully. Observe his faith in this prayer. Christ was in the depth of disgrace, suffering as a deceiver, and not delivered by his Father. He made this profession before the wonders were displayed which put honour on Christ's sufferings, and startled the centurion. He believed in a life to come, and desired to be happy in that life; not like the other thief, to be only saved from the cross. Observe his humility in this prayer. All his request is, Lord, remember me; quite referring it to Jesus in what way to remember him. Thus he was humbled in true repentance, and he brought forth all the fruits for repentance his circumstances would admit. Christ upon the cross, is gracious like Christ upon the throne. Though he was in the greatest struggle and agony, yet he had pity for a poor penitent. By this act of grace we are to understand that Jesus Christ died to open the kingdom of heaven to all penitent, obedient believers. It is a single instance in Scripture; it should teach us to despair of none, and that none should despair of themselves; but lest it should be abused, it is contrasted with the awful state of the other thief, who died hardened in unbelief, though a crucified Saviour was so near him. Be sure that in general men die as they live.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Today ... - It is not probable that the dying thief expected that his prayer would be so soon answered. It is rather to be supposed that he looked to some \"future\" period when the Messiah would rise or would return; but Jesus told him that his prayer would be answered that very day, implying, evidently, that it would be \"immediately\" at death. This is the more remarkable, as those who were crucified commonly lingered for several days on the cross before they died; but Jesus foresaw that measures would be taken to \"hasten\" their death, and assured him that \"that\" day he should receive an answer to his prayer and be with him in his kingdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Paradise - This is a word of \"Persian\" origin, and means \"a garden,\" particularly a garden of pleasure, filled with trees, and shrubs, and fountains, and flowers. In hot climates such gardens were especially pleasant, and hence, they were attached to the mansions of the rich and to the palaces of princes. The word came thus to denote any place of happiness, and was used particularly to denote the abodes of the blessed in another world. The Romans spoke of their Elysium, and the Greeks of the gardens of Hesperides, where the trees bore golden fruit. The garden of Eden means, also, the garden of \"pleasure,\" and in Genesis 2:8 the Septuagint renders the word \"Eden by Paradise.\" Hence, this name in the Scriptures comes to denote the abodes of the blessed in the other world. See the notes at 2 Corinthians 12:4. The Jews supposed that the souls of the righteous would be received into such a place, and those of the wicked cast down to Gehenna until the time of the judgment. They had many fables about this state which it is unnecessary to repeat. The plain meaning of the passage is, \"Today thou shalt be made happy, or be received to a state of blessedness with me after death.\" It is to be remarked that Christ says nothing about the \"place where\" it should be, nor of the condition of those there, excepting that it is a place of blessedness, and that its happiness is to commence immediately after death (see also Philippians 1:23); but from the narrative we may learn:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Paradise - This is a word of \"Persian\" origin, and means \"a garden,\" particularly a garden of pleasure, filled with trees, and shrubs, and fountains, and flowers. In hot climates such gardens were especially pleasant, and hence, they were attached to the mansions of the rich and to the palaces of princes. The word came thus to denote any place of happiness, and was used particularly to denote the abodes of the blessed in another world. The Romans spoke of their Elysium, and the Greeks of the gardens of Hesperides, where the trees bore golden fruit. The garden of Eden means, also, the garden of \"pleasure,\" and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the Septuagint renders the word \"Eden by Paradise.\" Hence, this name in the Scriptures comes to denote the abodes of the blessed in the other world. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Jews supposed that the souls of the righteous would be received into such a place, and those of the wicked cast down to Gehenna until the time of the judgment. They had many fables about this state which it is unnecessary to repeat. The plain meaning of the passage is, \"Today thou shalt be made happy, or be received to a state of blessedness with me after death.\" It is to be remarked that Christ says nothing about the \"place where\" it should be, nor of the condition of those there, excepting that it is a place of blessedness, and that its happiness is to commence immediately after death (see also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 1:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but from the narrative we may learn:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That the soul will exist separately from the body; for, while the thief and the Saviour would be in Paradise, their \"bodies\" would be on the cross or in the grave.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. That immediately after death - the same day - the souls of the righteous will be made happy. They will feel that they are secure; they will be received among the just; and they will have the assurance of a glorious immortality.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. That state will differ from the condition of the wicked. The promise was made to but one on the cross, and there is no evidence whatever that the other entered there. See also the parable of the rich man and Lazarus, Luke 16:19-31.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "3. That state will differ from the condition of the wicked. The promise was made to but one on the cross, and there is no evidence whatever that the other entered there. See also the parable of the rich man and Lazarus, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 16:19-31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "4. It is the chief glory of this state and of heaven to be permitted to see Jesus Christ and to be with him: \"Thou shalt be with me.\" \"I desire to depart and to be with Christ,\" Philippians 1:23. See also Revelation 21:23; Revelation 5:9-14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "4. It is the chief glory of this state and of heaven to be permitted to see Jesus Christ and to be with him: \"Thou shalt be with me.\" \"I desire to depart and to be with Christ,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 1:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 5:9-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43. Jesus said, &c.—The dying Redeemer speaks as if He Himself viewed it in this light. It was a \"song in the night.\" It ministered cheer to His spirit in the midnight gloom that now enwrapt it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Verily I say unto thee—\"Since thou speakest as to the king, with kingly authority speak I to thee.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To-day—\"Thou art prepared for a long delay before I come into My kingdom, but not a day's delay shall there be for thee; thou shalt not be parted from Me even for a moment, but together we shall go, and with Me, ere this day expire, shalt thou be in Paradise\" (future bliss, 2Co 12:4; Re 2:7). Learn (1) How \"One is taken and another left\"; (2) How easily divine teaching can raise the rudest and worst above the best instructed and most devoted servants of Christ; (3) How presumption and despair on a death hour are equally discountenanced here, the one in the impenitent thief, the other in his penitent fellow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 23:34\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jesus said unto him,.... Jesus immediately answered him, though he said not one word to the other that railed at him, or to the multitude that abused him; and promised him more than he asked for, and sooner than he expected. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Verily I say unto thee, today thou shall be with me in paradise; , \"in the garden of Eden\"; not the earthly paradise, nor the church militant, but the future place, and state of the happiness of the saints, even heaven, and eternal glory, which the Jews frequently call by this name; See Gill on 2 Corinthians 12:4 and is so called, because, as the earthly paradise, or Eden's garden, was of God's planting, so is the heavenly glory of his providing and preparing: as that was a place of delight and pleasure, so here are pleasures for evermore; as there was a river in it, which added to the delightfulness and advantage of it, so here runs the river of God's love, the streams whereof make glad the saints now, and will be a broad river to swim in to all eternity: as there were the tree of life, with a variety of other trees, both for delight and profit, so here, besides Christ, the tree of life, which stands in the midst of it, are an innumerable company of angels, and the spirits of just men made perfect: and as the inhabitants of that garden were pure and innocent creatures, so into this paradise shall nothing enter but what is righteous, pure, and holy: and whereas the principal enjoyment of man in Eden was conversation with God, and communion with him, the glory of the heavenly paradise will lie in fellowship with God, Father, Son, and Spirit, in beholding the face of God, and seeing him as he is: and this is the happiness promised by Christ to the penitent and believing thief, that he should be here; and not only so, but with him here, which is far better than being in this world, and than which nothing can be more desirable: and which, when enjoyed, will be for ever: and this he was to enter upon that very day; which shows, that Christ's soul did not descend into hell, locally and literally considered, or into the \"Limbus Patrum\", the Papists talk of, to fetch the souls of the patriarchs thence, but as soon as it was separated from the body was taken up into heaven; and also, that the souls of departed saints are immediately, upon their separation from the body, there; which was the case of this wonderful instance of the grace of God; and shows the swiftness of the soul, or the velocity of angels in conveying it thither immediately: and this agrees with the sense of the Jews, who say (b), that ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Verily I say unto thee, today thou shall be with me in paradise; , \"in the garden of Eden\"; not the earthly paradise, nor the church militant, but the future place, and state of the happiness of the saints, even heaven, and eternal glory, which the Jews frequently call by this name; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and is so called, because, as the earthly paradise, or Eden's garden, was of God's planting, so is the heavenly glory of his providing and preparing: as that was a place of delight and pleasure, so here are pleasures for evermore; as there was a river in it, which added to the delightfulness and advantage of it, so here runs the river of God's love, the streams whereof make glad the saints now, and will be a broad river to swim in to all eternity: as there were the tree of life, with a variety of other trees, both for delight and profit, so here, besides Christ, the tree of life, which stands in the midst of it, are an innumerable company of angels, and the spirits of just men made perfect: and as the inhabitants of that garden were pure and innocent creatures, so into this paradise shall nothing enter but what is righteous, pure, and holy: and whereas the principal enjoyment of man in Eden was conversation with God, and communion with him, the glory of the heavenly paradise will lie in fellowship with God, Father, Son, and Spirit, in beholding the face of God, and seeing him as he is: and this is the happiness promised by Christ to the penitent and believing thief, that he should be here; and not only so, but with him here, which is far better than being in this world, and than which nothing can be more desirable: and which, when enjoyed, will be for ever: and this he was to enter upon that very day; which shows, that Christ's soul did not descend into hell, locally and literally considered, or into the \"Limbus Patrum\", the Papists talk of, to fetch the souls of the patriarchs thence, but as soon as it was separated from the body was taken up into heaven; and also, that the souls of departed saints are immediately, upon their separation from the body, there; which was the case of this wonderful instance of the grace of God; and shows the swiftness of the soul, or the velocity of angels in conveying it thither immediately: and this agrees with the sense of the Jews, who say (b), that ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the souls of the fathers, or patriarchs have rest, and in a moment, immediately enter into their separate places, or apartments, and not as the rest of the souls; of whom it is said, all the twelve months the soul ascends and descends, (goes to and fro,) but the souls of the fathers, , \"immediately, upon their separation\", return to God that gave them.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some would remove the stop, and place it after \"today\", and read the words thus, \"I say unto thee today\"; as if Christ only signified the time when he said this, and not when the thief should be with him in paradise; which, besides it being senseless, and impertinent, and only contrived to serve an hypothesis, is not agreeably to Christ's usual way of speaking, and contrary to all copies and versions. Moreover, in one of Beza's exemplars it is read, \"I say unto thee,  that today thou shalt be with me\", &c. and so the Persic and Ethiopic versions seem to read, which destroys this silly criticism. And because this was a matter of great importance, and an instance of amazing grace, that so vile a sinner, one of the chief of sinners, should immediately enter into the kingdom of God, and enjoy uninterrupted, and everlasting communion with him and that it might not be a matter of doubt with him, or others, Christ, who is the \"Amen\", the faithful witness, and truth itself, prefaces it after this manner: \"verily I say unto thee\"; it is truth, it may be depended on. This instance of grace stands on record, not to cherish sloth, indolence, security and presumption, but to encourage faith and hope in sensible sinners, in their last moments, and prevent despair. The Papists pretend to know this man's name; they say his name was Disma; and reckon him as a martyr, and have put him in the catalogue of saints, and fixed him on the \"twenty fifth\" of March. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(The story of the penitent thief has sometimes been considered the most surprising, the most suggestive, the most instructive incident in all the Gospel narrative. ... In the salvation of one of the thieves \\@@vital\\@@ \\@@theology finds one of its finest demonstrations.\\@@ ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\\@@Sacrementalism was refuted,\\@@ for the thief was saved without recourse to baptism, the Lord's Supper, church, ceremony, or good works. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\\@@The dogma of purgatory was refuted,\\@@ for this vile sinner was instantly transformed into a saint and made fit for paradise apart from his personal expiation of a single sin. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\\@@The teaching of universalism was refuted,\\@@ for only one was saved of all who might have been saved. Jesus did not say, \"Today shall ye be with me in paradise\", but \"Today shalt thou be with me in paradise.\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\\@@The notion of soul-sleep was refuted,\\@@ for the clear implication of the entire incident is that the redeemed thief would be in conscious fellowship with his Saviour in paradise even while his body disintegrated in some grave. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Too, it is doubtful whether any other gospel incident presents the plan of salvation more clearly or simply.--Dr. Charles R. Erdman) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Tzeror Hammor, fol. 58. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) Tzeror Hammor, fol. 58. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Jesus said unto him, Verily I say unto thee, To day shalt thou be with me in {i} paradise.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Jesus said unto him, Verily I say unto thee, To day shalt thou be with me in ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " paradise.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) God made the visible paradise in the eastern part of the world: but that which we behold with the eyes of our mind is the place of everlasting joy and salvation, through the goodness and mercy of God, a most pleasant rest for the souls of the godly, and a most quiet and joyful dwelling.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σήμερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": to be connected with what follows, not with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λέγω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to-day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as opposed to a boon expected at some future time (which makes for the reading ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῇ β",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Or the point may be: this very day, not tomorrow or the next day, as implying speedy release by death, instead of a slow lingering process of dying, as often in cases of crucifixion.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ παραδείσῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in paradise; either the division of Hades in which the blessed dwell, which would make for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "descensus ad inferos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or heaven; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is a synonym for heaven, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it denotes the perfected Kingdom of God, the ideal state of bliss realised. The use of “paradise” in this sense is analogous to the various representations in Hebrews of the perfect future drawn from the primeval condition of man: lordship in the world to come, deliverance from the fear of death, a Sabbatism (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The use of the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παράδεισος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by St. Paul makes its use by our Lord credible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "43.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An unexpected boon,—for the crucified often lingered in agony for more than two days.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To day shalt thou be with me in paradise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": " Paradeisos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is derived from the Persian word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pardes,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " meaning a king’s garden or pleasaunce. Here it is ‘a garden’ in which are more blessed trees than those in the garden of Golgotha. (Bengel.) It is used (1) for the garden of Eden (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.); and (2) for that region of Hades (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sheol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in which the spirits of the blest await the general Resurrection, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 2:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Sapphic verse on the tomb of the great Copernicus alludes to the prayer of the Penitent Robber:",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Non parem Paulo veniam requiro",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Gratiam Petri neque posco, sed quam",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In crucis ligno dederis latroni",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Sedulus oro.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:43",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Σήμερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to-day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") On that day the converted robber could have hardly looked for death.[262] But the breaking of the legs was made subservient to this end. Thereby the Lord’s promise was fulfilled. [The marking of the time by the expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to-day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is not to be referred (joined) to the verb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as if the robber should have to wait for his entrance into Paradise during I know not how long periods of time. That the words were spoken to him on that day, is of itself evident (without it being necessary to say so). Jesus never used the expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To-day I say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; whereas He repeatedly used the expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore we must read the words thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To-day shalt thou be with Me in paradise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus the power and grace of the Lord, and also His own ready and immediate entrance into Paradise, is openly declared.—V. g. That was indeed to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "save",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which the impenitent robber had taunted Him with, as unable to effect it).—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Harm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., p. 570].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μετʼ ἐμοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Much more then did Jesus Himself come to Paradise. [A fact which must have been very consolatory to Mary, wife of Cleopas, and Mary Magdalene, against men’s bitter taunts, and to the Virgin mother and John, when communicated to them.—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Harm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., p. 570].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῷ Παραδείσῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in Paradise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in which there are happier trees than in Golgotha (especially “the tree of life which is in the Paradise of God”), associated with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "immortality",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.[263] Jesus employs the most august appellation for the seat of happiness in the profoundest depth of His own suffering. Comp. note on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", [The Jews called the good state of the dead ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the bosom of Abraham",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the garden of Eden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] This departure to Paradise differs no doubt from the ascension to heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 20:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“I am ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not yet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ascended to My Father”), but yet it shows that His descent to ‘hell’ (the lower regions unseen) is to be explained in a good sense.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[262] So tedious a death is crucifixion.—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[263] No other tree but “the tree of life” is mentioned there; whereas in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", many others grow, and it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the midst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—words not in the best MSS. of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 43.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Jesus said unto him, Verily I say unto thee, To-day shalt thou be with me in paradise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". No strengthening angel could have been more welcome to the dying Redeemer than these words of intense penitence and strong faith. Very beautifully Stier suggests that the crucified King \"cannot see these two criminals, cannot direct his glance to this last without adding to his own agony by movement upon the cross. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "But that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he forgets, and turns with an impulse of joy as well as he can to the soul that speaks to him, thus making the nails more firm.\" With those solemn words, \"Verily I say unto thee,\" with which he had so often in old days begun his sacred sayings, he replied to the sufferer by his side. One at least, St. John, of his disciples would have heard the well-known words from the well-known voice. What memories must they not have recalled to that disciple whom Jesus loved, as he stood hard by the cross with the Mother of sorrows! The Lord's answer was very striking, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Remember him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who could call on him with such reverent faith at the moment of his deepest humiliation! Remember him! yes; but not in the far-off \"coming,\" but on ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " very day, before the sun then scorching their tortured bodies set; he would not be remembered by him only, but would be in closest companionship with him, not, as he prayed, in some far-off time in the midst of the awful tumult of the bloody and fiery dawn of the judgment advent, but almost directly in the fair garden, the quiet home of the blessed, the object of all Jewish hopes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "There",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would he be remembered, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in company with his Lord, would the tortured condemned find himself in a few short hours. Are we right in thinking that there was no fulfilment of the words till death had released the spirit from its thraldom? May there not even then have been an ineffable joy, such as made the flames of the fiery furnace to be as a \"moist, whistling wind\" (Song of the Three Children, ver. 27), such as martyrs have in a thousand cases known, acting almost as a physical anaesthetic acts? (Dean Plumptre). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"Non parem Paulo veniam require,Gratiam Petri neque posco, sed quamIn crucis ligno dederis latroniSedulus oro.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Non parem Paulo veniam require,",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Gratiam Petri neque posco, sed quam",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In crucis ligno dederis latroni",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Sedulus oro.\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This striking verse is engraved on the tomb of the great Copernicus, and alludes to this prayer and its answer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Paradise.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is the only instance we have of our Lord's using this well-known word. In the ordinary language used by the Jews, of the unseen world, it signifies the\" Garden of Eden,\" or \"Abraham's bosom;\" it represented the locality where the souls of the righteous would find a home, after death separated soul and body. The New Testament writers, Luke and Paul and John, use it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 2:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To Luke and Paul, probably, this was a memory of the word spoken on the cross, which they alone record in their Gospel. It may have been told Luke by the Mother of sorrows herself. John, who uses it in his Revelation, doubtless heard it himself as he stood at the foot of the cross. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Paradeisos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is derived from the Persian word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pardes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which signifies a park or garden. Luke 23:43",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In Paradise (παραδείσῳ)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Originally an enclosed park, or pleasure-ground. Xenophon uses it of the parks of the Persian kings and nobles. \"There (at Celaenae) Cyrus had a palace and a great park (παράδεισος), full of wild animals, which he hunted on horseback....Through the midst of the park flows the river Maeander (\"Anabasis,\" i., 2, 7). And again' \"The Greeks encamped near a great and beautiful park, thickly grown with all kinds of trees\" (ii., 4, 14.) In the Septuagint, Genesis 2:8, of the garden of Eden. In the Jewish theology, the department of Hades where the blessed souls await the resurrection; and therefore equivalent to Abraham's bosom (Luke 16:22, Luke 16:23). It occurs three times in the New Testament: here; 2 Corinthians 12:4; Revelation 2:7; and always of the abode of the blessed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Originally an enclosed park, or pleasure-ground. Xenophon uses it of the parks of the Persian kings and nobles. \"There (at Celaenae) Cyrus had a palace and a great park (παράδεισος), full of wild animals, which he hunted on horseback....Through the midst of the park flows the river Maeander (\"Anabasis,\" i., 2, 7). And again' \"The Greeks encamped near a great and beautiful park, thickly grown with all kinds of trees\" (ii., 4, 14.) In the Septuagint, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of the garden of Eden. In the Jewish theology, the department of Hades where the blessed souls await the resurrection; and therefore equivalent to Abraham's bosom (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 16:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 16:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It occurs three times in the New Testament: here; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and always of the abode of the blessed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Where'er thou roam'st, one happy soul, we know,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Seen at thy side in woe,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Waits on thy triumph - even as all the blest",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With him and Thee shall rest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Each on his cross, by Thee we hang awhile,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Watching thy patient smile,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Till we have learn'd to say, ' 'Tis justly done,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only in glory, Lord, thy sinful servant own.'\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Keble, Christian Year.",
        "children": []
      }
    ]
  }
]