[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He answered him nothing.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We can hardly help asking ourselves what were likely to have been among Herod’s questions. Did the Prisoner who stood before him really claim to be a King? Did He proclaim Himself as the Christ? Was He John the Baptist, risen from the dead? If not, who and what were his earthly parents? The unbroken silence of the Accused must have been strangely impressive at the time, and is singularly suggestive when we remember how He had answered Caiaphas when He had been adjured in the name of the living God. He had spoken to Pilate in the tones of a sad gentleness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 19:33-37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To Herod alone, the incestuous adulterer, the murderer of the Forerunner, He does not vouchsafe, from first to last, to utter a single syllable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Luke",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘THE RULERS TAKE COUNSEL TOGETHER’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A SOUL’S TRAGEDYLuke 23:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A SOUL’S TRAGEDY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Four Herods play their parts in the New Testament story. The first of them is the grim old tiger who slew the infants at Bethlehem, and soon after died. This Herod is the second-a cub of the litter, with his father’s ferocity and lust, but without his force. The third is the Herod of the earlier part of the Acts of the Apostles, a grandson of the old man, who dipped his hands in the blood of one Apostle, and would fain have slain another. And the last is Herod Agrippa, a son of the third, who is only remembered because he once came across Paul’s path, and thought it such a good jest that anything should be supposed capable of making a Christian out of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a singular family likeness in the whole of them, and a very ugly likeness it is. This one was sensual, cruel, cunning, infirm of purpose, capricious like a child or a savage. Roman policy amused him with letting him play at being a ruler, but kept him well in hand. And I suppose he was made a worse man by the difficulties of his position as a subject-prince.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now I wish to put together the various incidents in this man’s life recorded in the Gospels, and try to gather some lessons from them for you.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, I take him as an example of half-and-half convictions, and of the inner discord that comes from these. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, I take him as an example of half-and-half convictions, and of the inner discord that comes from these.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I do not need to remind you of the shameful story of his repudiation of his own wife, and of his disgusting alliance with the wife of his half-brother, who was herself his niece. She was the stronger spirit, a Biblical Lady Macbeth, the Jezebel to this Ahab; and, to complete the parallel, Elijah was not far away. John the Baptist’s outspoken remonstrances of course made an implacable enemy of Herodias, who did all she could to compass his death, but was unable to manage that, though she secured his imprisonment. The reason for her inability is given by the Evangelist Mark, in words which are very inadequately rendered by our Authorised Version, but may be found more correctly translated in the Revised Version. It is there said that King ‘Herod feared John’-the gaoler afraid of his prisoner!-’knowing that he was a just man and a holy’-goodness is awful. The worst men know it, and it extorts respect. ‘And kept him safe’-from Herodias, that is. ‘And when he heard him he was perplexed’-drawn this way and that way by these two magnets, alternately veering to lust and to purity, hesitating between the kisses of the beautiful temptress at his side and the words of the prophet. And yet, with strange inconsistency, in all his vacillations ‘he heard him gladly’; for his better part approved the nobler voice. And so he staggered on, having religion enough to spoil some of his sinful delights, but not enough to shake them off.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is a picture for which in its essence many a man and woman among us might have sat. For I suppose that there is nothing more common than these half-and-half convictions which, like inefficient bullets, get part way through the armoured shell of a ship, and there stick harmless. Many of us have the clearest convictions in our understandings, which have never penetrated to that innermost chamber of all, where the will sits sovereign. It is so about little things, it is so about great ones. Nothing is more common than that a man shall know perfectly well that some possibly trivial habit stands in the way of something that it is his interest or his duty to pursue; but the knowledge lies inoperative in the outermost part of him. It is so in regard to graver things. The majority of the slaves of any vice whatsoever know perfectly well that they ought to give it up, and yet nothing comes of the conviction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘He was much perplexed.’ What a picture that is of the state of unrest and conflict into which such half-and-half impressions of duty cast a man. Such a one is like a vessel with its head now East, now West, because there is some weak or ignorant steersman at the helm. I know nothing more sure to produce inward unrest and disturbance and desolation than that a man’s knowledge of duty should be clear, and his obedience to that knowledge partial. If we have John down in the dungeon, if conscience is not allowed to be master, there may be feasting and revelry going on above, but the stern voice will come up through the grating now and then, and that will spoil all the laughter. ‘When he heard him, he was much perplexed.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The reason for these imperfect convictions is generally found, as Herod shows us, in the unwillingness to get rid of something which has fastened its claws around us, and which we love too well, although we know it is a serpent, to shake off. If Herod had once been man enough to screw himself up, and say to Herodias, ‘Now you pack, and go about your business!’ everything else would have come right in time. But he could not make up his mind to sacrifice the honeyed poison, and so everything went wrong in time. My friend, how many of us are prevented from following out our clearest convictions because they demand a sacrifice? ‘If thine eye cause thee to stumble, pluck it out, and cast it from thee. It is better for thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then, further, note that these irresolute convictions and shirking of plain duty are not atoned for by, though they are often accompanied with, a strange acquiescence in, and approval of, God’s truth. Herod fancied, inconsistently enough, that he was making some kind of compensation for disobedience to the message, by liking to listen to the messenger. And there are a great many of us, all whose Christianity consists in giving ear to the words which we never think of obeying. I wonder how many of you there are who fancy that you have no more concern with this sermon of mine than approving or disapproving of it, as the case may be; and how many of us there are who, all our lives long, have substituted criticism of the Gospel as ministered by us poor preachers-be it approving or disapproving criticism-for obedience to the Christ and acceptance of His salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We see in Herod an example of the utter powerlessness of such partial convictions and reformation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We see in Herod an example of the utter powerlessness of such partial convictions and reformation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I am not going to tell over again the ghastly story of John’s death, which no other words than the Evangelist’s can tell half so powerfully. I need only remind you of the degradation of the poor child Salome to the position of a dancing girl, the half-tipsy generosity of the excited monarch, the grim request from lips so young and still reddened by the excitement of the dance, Herod’s unavailing sorrow, his fantastic sense of honour which scrupled to break a wicked promise, but did not scruple to kill a righteous man, and the ghastly picture of the girl carrying a bleeding head-such a gift!-to her mother.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But out of that jumble of lust and blood I desire to gather one lesson. There you have-in an extreme form, it is true-a tremendous illustration of what half-and-half convictions may come to. Whether or no we ever get anything like as far on the road as this man did matters very little. The process which brought him there is the thing that I seek to point to. It was because he had so long tampered with the voice of his conscience that it was lulled into silence at that last critical moment. And this is always the case, that if a man is false to the feeblest conviction that he has in regard to the smallest duty, he is a worse man all over ever after. We cannot neglect any conviction of what we ought to do, without lowering the whole tone of our characters and laying ourselves open to assaults of evil from which we would once have turned shuddering and disgusted. A partial thaw is generally followed by intenser frost. An abortive insurrection is sure to issue in a more grinding tyranny. A soul half melted and then cooled off is less easy to melt than it was before. And so, dear brethren, remember this, that if you do not swiftly and fully carry out in life and conduct whatsoever you know you ought to be or do, you cannot set a limit to what, some time or other, if a strong and sudden temptation is sprung upon you, you may become. ‘Is thy servant a dog that he should do this thing?’ Yes! But he did it. No mortal reaches the extreme of evil all at once, says the wise old proverb; and the path by which a man is let down into depths that he never thought it was possible that he should traverse is by the continual neglect of the small admonitions of conscience. Neglected convictions mean, sooner or later, an outburst of evil.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " John’s murder may illustrate another thing too-viz. how simple, facile weakness of character may be the parent of all enormities. Herod did not want to kill John. He very much wanted to keep him alive. But he was not man enough to put his foot down, and say, ‘There! I have said it; and there is to be no more talk about slaying this prophet of God.’ So the continual drop, drop, drop, of Herodias’ suggestions and wishes wore a hole, in the loose-textured stone at last; and he did the thing that he hated to do and had long fought against. Why? Because he was a poor weak creature.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The lesson from this is one that I would urge upon all you young people especially, that in a world like this, where there are so many more voices soliciting us to evil than inviting us to good, to be weak is, in the long run, to be wicked. So do you cultivate the wholesome habit of saying ‘No,’ and do not be afraid of anything but of hurting your conscience and sinning against God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Once more, we have in Herod an example of the awakening of conscience. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Once more, we have in Herod an example of the awakening of conscience.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "When Jesus began to be talked about beyond the narrow limits of the shores of the Sea of Galilee, and especially when He began to organise the Apostolate, and His name was spread abroad, some rumours reached even the court, and there were divergent opinions about Him. One man said, It is Elias; and another said, It is a prophet, ‘and Herod said, It is John, whom I beheaded. He has risen from the dead, and therefore mighty works do show forth themselves in him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah, brethren! when a man has, away back in the chambers of his memory, some wrong thing, be it great or be it little, he is at the mercy of any chance or accident to have it revived in all its vividness. It is an awful thing to walk this world with a whole magazine of combustibles in our memories, on which any spark may fall and light lurid and sulphurous flames. A chance thing may do it, a scent, a look upon a face, a sound, or any trifle may bring all at once before the wrongdoer that ancient evil. And no lapse of time makes it less dreadful when it is unveiled. The chance thrust of a boat-hook that gets tangled in the grey hairs of a corpse, brings it up grim to the surface. Press a button, by accident, upon a wall in some old castle, and a door flies open that leads away down into black depths. You and I have depths of that sort in our hearts. Then there are no more illusions about whose fault the deed was. When Herod killed John, he said, ‘Oh! It is not I! It is Herodias. It is Salome. It is my oath. It is the respect I bear to the people who heard me swear. I must do it, but I am not responsible.’ But when, in ‘the sessions of silent thought,’ the deed came back to him, Salome and Herodias, the oath, and the company were all out of sight, and he said, ‘I! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " did it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is what we all shall have to do some day, in this world possibly, in the next certainly. Men sophisticate themselves with talk about palliations, and excuses, and temptations, and companions and the like. And philosophers sophisticate themselves nowadays with a great many learned explanations, which tend to show that a man is not to blame for the wrong things he does. But all that rubbish gets burned up when conscience wakes, and the doer says, ‘Whom ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " beheaded.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren, unless we take refuge in the great sacrifice for the sins of the world which Jesus Christ has made, we shall, possibly in this life, and certainly hereafter, be surrounded by a company of our own evil deeds risen from the dead, and every one of them will shake its gory locks at us, and say, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " didst it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. The last lesson that I gather from this man’s life is the final insensibility which these half-and-half convictions tend to produce. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. The last lesson that I gather from this man’s life is the final insensibility which these half-and-half convictions tend to produce.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jesus Christ was sent by Pilate to Herod as a kind of peace-offering. The two had been squabbling about some question of jurisdiction; and so, partly to escape from the embarrassment of having to deal with this enigmatical Prisoner, and partly out of a piece of politic politeness, Pilate sends Jesus to Herod, because He was in his jurisdiction. Think of the Lord of men and angels being handed about from one to the other of these two scoundrels, as a piece of politeness!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " When Christ stands before Herod, note that all its former convictions, partial or entire, and all its terrors superficial or deep, have faded clean away from this frivolous soul. All that he feels now is a childish delight in having this well-known Man before him, and a hope that, for his delectation, Jesus will work a miracle; much as he might expect a conjurer to do one of his tricks! That is what killing John came to-an incapacity to see anything in Jesus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘And he asked Him many questions, and Jesus answered him nothing.’ He locked His lips. Why? He was doing what He Himself enjoined: ‘Give not that which is holy to the dogs. Cast not your pearls before swine.’ He said nothing, because He knew it was useless to say anything. So the Incarnate Word, whose very nature and property it is to speak, was silent before the frivolous curiosity of the man that had been false to his deepest convictions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is a parable, brother, of what is being repeated over and over again amongst us. I dare not say that Jesus Christ is ever absolutely dumb to any man on this side of the grave; but I dare not refrain from saying that this condition of insensibility to His words is one that we may indefinitely approach, and that the surest way to approach it and to reach it is to fight down, or to neglect, the convictions that lead up to Him. John was the forerunner of Christ, and if Herod had listened to John, to him John would have said: ‘Behold the Lamb of God!’ To you I say it, and beseech you to take that Lamb of God as the Sacrifice for your sins, for the Healer and Cleanser of your memories and your consciences, for the Helper who will enable you joyfully to make all sacrifices to duty, and to carry into effect every conviction which His own merciful hand writes upon your hearts. And oh, dear friends, many of you strangers to me, to whom my voice seldom comes, let me plead with you not to be content with ‘hearing’ any of us ‘gladly,’ but to do what our words point to, and to follow Christ the Saviour. If you hear the Gospel, however imperfectly, as you are hearing it proclaimed now, and if you neglect it as-must I say?-you are doing now, you will bring another film over your eyes which may grow thick enough to shut out all the light; you will wind another fold about your hearts which may prove impenetrable to the sword of the Spirit; you will put another plug in your ears which may make them deaf to the music of Christ’s voice. Do what you know you ought to do, yield yourselves to Jesus Christ. And do it now, whilst impressions are being made, lest, if you let them sleep, they may never return. Felix trembled when Paul reasoned; but he waved away the messenger and the message, and though he sent for Paul often, and communed with him, he never trembled any more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘There is a tide in the affairs of menWhich, taken at the flood,’",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘There is a tide in the affairs of men",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Which, taken at the flood,’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "would lead us into the haven of rest in Christ; and, if allowed to pass, may leave us, stranded and shipwrecked, among the rocks.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:6-12 Herod had heard many things of Jesus in Galilee, and out of curiosity longed to see him. The poorest beggar that asked a miracle for the relief of his necessity, was never denied; but this proud prince, who asked for a miracle only to gratify his curiosity, is refused. He might have seen Christ and his wondrous works in Galilee, and would not, therefore it is justly said, Now he would see them, and shall not. Herod sent Christ again to Pilate: the friendships of wicked men are often formed by union in wickedness. They agree in little, except in enmity to God, and contempt of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Herod's jurisdiction - Herod Antipas, a son of Herod the Great. This was the same Herod that put John the Baptist to death. Jesus had passed the most of his life in the part of the country where he ruled, and it was, therefore, considered that he belonged to his jurisdiction - that is, that it belonged to Herod, not to Pilate, to try this cause. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. answered … nothing—(See Mt 7:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 23:1\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then he questioned with him in many words,.... Or talked very much to him, inquiring who he was, whether John the Baptist, or no; whether it was true that he had wrought such miracles he had heard of, and how he wrought them, and by what power he performed them, and how he came by it; and used many arguments to persuade him to work a miracle at that time: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but he answered him nothing; would not give him one word in return to his many words, nor work any miracle in his presence; he answered him neither by words nor deeds; he would not indulge his curiosity, though he might have obtained his liberty by it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but he answered him nothing; would not give him one word in return to his many words, nor work any miracle in his presence; he answered him neither by words nor deeds; he would not indulge his curiosity, though he might have obtained his liberty by it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then he questioned with him in many words; but he answered him nothing.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν λόγοις ἱκανοῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": suggesting the idea of a desultory conversation, in which the king introduced topic after topic in a random, incoherent manner, showing no serious interest in any of his questions.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐδὲν ἀπεκρίνατο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", answered nothing, which would greatly astonish and pique this kingling, accustomed to courtier-servility. The fact that Jesus said nothing, and that nothing of importance came out of the appearance before Herod, may explain its omission by the other evangelists.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he answered him nothing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A murderer of the Prophets, who was living in open and flagrant incest, and who had no higher motive than mean curiosity, deserved no answer. Our Lord used of Antipas the only purely contemptuous word which He is ever recorded to have uttered (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Many (ἱκανοῖς)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare long, Luke 23:8. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare long, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]