[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Base in mine own sight.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The LXX., not understanding this expression, has changed it to “in thine eyes.” But the meaning is, that while Michal had charged him with making himself base in the eyes of the maidservants (who were no fit judges of such matters), he was ready to abase himself in his own eyes, to do anything, however humbling it might seem even to himself, which should be for the honour and glory of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:20-23 David returned to bless his household, to pray with them, and for them, and to offer up family thanksgiving for this national mercy. It is angels' work to worship God, surely that cannot lower the greatest of men. But even the palaces of princes are not free from family troubles. Exercises of religion appear mean in the eyes of those who have little or no religion themselves. If we can approve ourselves to God in what we do in religion, and do it as before the Lord, we need not heed reproach. Piety will have its praise: let us not be indifferent in it, nor afraid or ashamed to own it. David was contented to justify himself, and he did not further reprove or blame Michal's insolence; but God punished her. Those that honour God, he will honour; but those that despise him, and his servants and service, shall be lightly esteemed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Play - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. The speech might be paraphrased, Before the Lord which chose me, etc., yea, before the Lord have I danced. He humbles Michal's pride by the allusion to her father's rejection, and shows by Saul's example how little pride contributes to the stability of greatness. Therefore, for his part, he will not think anything done for the glory of God too mean for him; and if he cannot have honor from Saul's daughter, he will be content to be honored by the maid-servants. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2Sa 6:20-23. Michal's Barrenness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20-22. Michal … came out to meet David, &c.—Proud of her royal extraction, she upbraided her husband for lowering the dignity of the crown and acting more like a buffoon than a king. But her taunting sarcasm was repelled in a manner that could not be agreeable to her feelings while it indicated the warm piety and gratitude of David.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will be base in mine own sight; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will always be ready to humble and abase myself before God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of them shall I be had in honour; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I shall rather choose to get honour from the meanest of my people, in serving and praising God, than to gain esteem from thee by my lukewarmness in God’s service. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will yet be more vile than thus,.... If this is to be vile, I will endeavour to be viler still; if to dance before the ark, and sing the praises of God, be reckoned a lessening of me, I will more and more be found in doing such things, or what is similar to them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and will be base in mine own sight: humble himself, and lie low in his own eyes, admiring the grace and goodness of God to him, thinking he could never condescend too low to exalt the Lord, and magnify the riches of his goodness: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and of the maidservants which thou hast spoken of, of them shall I be had in honour; who the more humble I am, and the more I condescend, by laying aside all state in acts of devotion and religion, the more shall I be honoured and spoken well of by them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and of the maidservants which thou hast spoken of, of them shall I be had in honour; who the more humble I am, and the more I condescend, by laying aside all state in acts of devotion and religion, the more shall I be honoured and spoken well of by them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will yet be more vile than thus, and will be base in mine own sight: and of the maidservants which thou hast spoken of, of them shall I be had in honor.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I will yet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And I will make myself yet more contemptible than this, and will be humble in mine own eyes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Michal had taunted David with degrading himself in the eyes of the meanest servants. He replies that even if he humbled himself yet more deeply, instead of priding himself on his royal dignity, they would continue to honour him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And of the maidservants which thou hast spoken of, of them shall I be had in honour.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " These words have been variously interpreted, but their simplest meaning is also the best; that even the most uneducated women, though surprised at first at David's want of stateliness, would, on reflection, be led to a right understanding of the greatness of God; and would then feel that even a king was right in owning himself to be nothing in God's presence. 2 Samuel 6:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "David replied, \"Before Jehovah, who chose me before thy father and all his house, to appoint me prince over the people of Jehovah, over Israel, before Jehovah have I played (lit. joked, given utterance to my joy). And I will be still more despised, and become base in my eyes: and with the maidens of whom thou hast spoken, with them will I be honoured.\" The copula vav before שׂהקתּי serves to introduce the apodosis, and may be explained in this way, that the relative clause appended to \"before Jehovah\" acquired the power of a protasis on account of its length; so that, strictly speaking, there is an anakolouthon, as if the protasis read thus: \"Before Jehovah, as He hath chosen me over Israel, I have humbled myself before Jehovah\" (for \"before him\"). With the words \"who chose me before thy father and all his house,\" David humbles the pride of the king's daughter. His playing and dancing referred to the Lord, who had chosen him, and had rejected Saul on account of his pride. He would therefore let himself be still further despised before the Lord, i.e., would bear still greater contempt from men than that which he had just received, and be humbled in his own eyes (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 131:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): then would he also with the maidens attain to honour before the Lord. For whoso humbleth himself, him will God exalt (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). בּעיני is not to be altered into בּעיניך, as in the lxx. This alteration has arisen from a total misconception of the nature of true humility, which is of no worth in its own eyes. The rendering given by De Wette is at variance with both the grammar and the sense (\"with the maidens, ... with them will I magnify myself\"); and so also is that of Thenius (\"with them will I be honoured, i.e., indemnify myself for thy foolish contempt!\").",
        "children": []
      }
    ]
  }
]