[{"header":"Purification From Bodily Discharges"},{"num":15,"verse":"The Lord told Moses and Aaron to speak to the Israelites and to tell them this:"},{"num":2,"verse":"Whenever a man has a discharge flowing from his flesh, that discharge is unclean."},{"num":3,"verse":"This is the law about how a bodily discharge makes someone unclean: Whether his flesh secretes a discharge or it has a blocked discharge, ⎣he is unclean. As long as his flesh has a discharge or his body blocks a discharge,⎦ this makes him unclean."},{"num":4,"verse":"Any bedding that the man with a discharge lies on is unclean, and every object on which he sits becomes unclean. "},{"num":5,"verse":"Anyone who touches his bedding must wash his clothes, bathe in water, and remain unclean until sunset. "},{"num":6,"verse":"Whoever sits on any object on which the man with a discharge sat must wash his clothes, bathe in water, and remain unclean until sunset. "},{"num":7,"verse":"Whoever touches the body of the man with a discharge must wash his clothes, bathe in water, and remain unclean until sunset."},{"num":8,"verse":"If the man with a discharge spits on someone who is clean, that person must wash his clothes, bathe in water, and remain unclean until sunset."},{"num":9,"verse":"Any saddle on which the man with a discharge rides becomes unclean. "},{"num":10,"verse":"Everyone who touches anything that was under him will become unclean until sunset, and whoever carries these things must wash his clothes, bathe in water, and remain unclean until sunset. "},{"num":11,"verse":"If the man with a discharge touches anyone without washing his hands, that person must wash his clothes, bathe in water, and remain unclean until sunset. "},{"num":12,"verse":"Any clay pottery that the man with a discharge touches must be broken, and any vessel or utensil made of wood must be rinsed with water."},{"num":13,"verse":"When the man with a discharge has been cleansed from his discharge, he shall count off seven days for his process of purification, wash his clothes, and bathe his body in water from a flowing source; then, he will be clean. "},{"num":14,"verse":"On the eighth day he shall take two turtledoves or two pigeons and come before the Lord at the entrance to the Tent of Meeting and give them to the priest. "},{"num":15,"verse":"The priest shall present the offering for them—one bird as a sin offering and the other as a whole burnt offering. This is how the priest shall make atonement for the man in the presence of the Lord, from his discharge."},{"num":16,"verse":"When a man has an emission of semen, he must bathe his whole body in water and remain unclean until sunset. "},{"num":17,"verse":"Any garment or leather with an emission of semen on it must be washed in water and remain unclean until sunset."},{"num":18,"verse":"Also if a man lies down with a woman and has an emission of semen, they must bathe in water and remain unclean until sunset."},{"num":19,"verse":"When a woman has a discharge of blood from her flesh, her menstrual impurity will last for seven days. Anyone who touches her will remain unclean until sunset. "},{"num":20,"verse":"Everything on which she lies during her monthly period is unclean, and everything on which she sits becomes unclean. "},{"num":21,"verse":"Anyone who touches her bed must wash his clothes, bathe in water, and remain unclean until sunset, "},{"num":22,"verse":"and anyone who touches anything on which she sat must wash his clothes, bathe in water, and remain unclean until sunset. "},{"num":23,"verse":"If the uncleanness is on the bed or on anything else on which she is sitting when he touches it, he will become unclean until sunset. "},{"num":24,"verse":"And if a man lies down with her, and her menstrual impurity comes in contact with him, he will be unclean for seven days. Any bed on which he lies will be unclean."},{"num":25,"verse":"When a woman has a discharge of blood for many days besides during the time of her monthly period, or when she has a discharge that lasts longer than her monthly period, she will be unclean for as many days as her discharge continues, just as she is during her monthly period. "},{"num":26,"verse":"During her discharge any bed on which she lies is to be treated just like the bed during her monthly period, and every piece of furniture on which she sits will be unclean, as it would be during the impurity of her monthly period. "},{"num":27,"verse":"Anyone who touches them will become unclean. Any such people must wash their clothes, bathe in water, and remain unclean until sunset."},{"num":28,"verse":"When she is cleansed from her discharge, she shall count off seven days, and after that she will be clean. "},{"num":29,"verse":"On the eighth day she shall take two turtledoves or two pigeons for herself and bring them to the priest at the entrance to the Tent of Meeting. "},{"num":30,"verse":"The priest shall offer one dove as a sin offering and the other as a whole burnt offering. This is how the priest is to make atonement for her in the presence of the Lord, from the impurity of her discharge."},{"num":31,"verse":"In this way you shall separate the people of Israel from their impurity, so that they do not die in their impurity because they defiled my dwelling place that is in their midst."},{"num":32,"verse":"This is the law for those who have a discharge: for a man who has an emission of semen by which he becomes unclean, "},{"num":33,"verse":"for a woman who is not well because of her menstrual period, for anyone, male or female, who has a discharge, and for the man who lies down with a woman who is unclean."}]