[{"header":"The Law About Bodily Discharges"},{"num":15,"verse":"Then the Lord spoke to Moses and to Aaron, saying: "},{"num":2,"verse":"Speak to the children of Israel, and say to them: When any man has a discharge out of his body, his discharge is unclean. "},{"num":3,"verse":"This is the instruction for his uncleanness in his discharge, whether the discharge from his body flows or his body is stopped up by his discharge, it is his uncleanness."},{"num":4,"verse":"Every bed on which the man with the discharge lies shall be unclean, and everything on which he sits shall be unclean. "},{"num":5,"verse":"Whoever touches the bed shall wash his clothes, and bathe himself in water, and be unclean until the evening. "},{"num":6,"verse":"And whoever sits on anything where the man sat who has the discharge shall wash his clothes, and bathe himself in water, and be unclean until the evening."},{"num":7,"verse":"And whoever touches the body of him who has the discharge shall wash his clothes, and bathe himself in water, and be unclean until the evening."},{"num":8,"verse":"If the man with the discharge spits on someone who is clean, then he shall wash his clothes, and bathe himself in water, and be unclean until the evening."},{"num":9,"verse":"Any saddle on which the man with a discharge rides shall be unclean. "},{"num":10,"verse":"Whoever touches anything that was under him shall be unclean until the evening, and he who carries any of those things shall wash his clothes, and bathe himself in water, and be unclean until the evening."},{"num":11,"verse":"Whomever he who has the discharge touches, and has not rinsed his hands in water, he shall wash his clothes and bathe in water, and be unclean until evening."},{"num":12,"verse":"The earthen vessel that he who has the discharge touches shall be broken, and every vessel of wood shall be rinsed in water."},{"num":13,"verse":"When he who has a discharge is cleansed of his issue, then he shall count to himself seven days for his cleansing, and wash his clothes, and bathe his body in running water, and shall be clean. "},{"num":14,"verse":"On the eighth day he shall take two turtledoves or two pigeons and come before the Lord at the entrance of the tent of meeting and give them to the priest. "},{"num":15,"verse":"And the priest shall offer them, one for a sin offering and the other for a burnt offering, and the priest shall make atonement for him before the Lord for his discharge."},{"num":16,"verse":"If any man has a seminal emission, then he shall wash all his body in water and be unclean until the evening. "},{"num":17,"verse":"Every garment and all leather on which there is seminal emission shall be washed with water and be unclean until the evening. "},{"num":18,"verse":"If a man lies with a woman, and there is an emission of semen, they shall both bathe themselves in water and be unclean until the evening."},{"num":19,"verse":"If a woman has a discharge, and the discharge from her body is blood, she shall be set apart for seven days; and whoever touches her shall be unclean until the evening."},{"num":20,"verse":"Everything that she lies on in her menstrual impurity shall be unclean. Also, everything that she sits on shall be unclean. "},{"num":21,"verse":"Whoever touches her bed shall wash his clothes and bathe himself in water, and be unclean until the evening. "},{"num":22,"verse":"Whoever touches anything on which she sits shall wash his clothes and bathe himself in water, and be unclean until the evening. "},{"num":23,"verse":"Whether it is the bed or anything on which she sits, when he touches it he shall be unclean until the evening."},{"num":24,"verse":"If any man lies with her, and her menstrual impurity is on him, he shall be unclean seven days, and every bed where he lies shall be unclean."},{"num":25,"verse":"If a woman has a discharge of blood for many days, not at the time of her menstrual impurity, or if she has a discharge beyond the time of her impurity, all the days of the discharge she shall be in uncleanness, as in the days of her impurity. She shall be unclean. "},{"num":26,"verse":"Every bed that she lies on all the days of her discharge shall be for impurity, and whatever she sits on shall be unclean, as the uncleanness of her menstrual impurity. "},{"num":27,"verse":"Whoever touches those things shall be unclean and shall wash his clothes and bathe himself in water and be unclean until the evening."},{"num":28,"verse":"But if she is cleansed of her discharge, then she shall count to herself seven days, and after that she shall be clean. "},{"num":29,"verse":"On the eighth day she shall take two turtledoves or two pigeons and bring them to the priest at the entrance of the tent of meeting. "},{"num":30,"verse":"The priest shall offer one for a sin offering and the other for a burnt offering, and the priest shall make atonement for her before the Lord for her unclean discharge."},{"num":31,"verse":"Thus you shall separate the children of Israel from their uncleanness, so that they do not die in their uncleanness by defiling My tabernacle that is among them."},{"num":32,"verse":"This is the law for him who has a discharge and for him who has a seminal emission and thus becomes unclean, "},{"num":33,"verse":"and for her who is sick from her menstruation, and for him who has a discharge, for anyone male or female, and for the man who lies with a woman who is unclean."}]