[{"num":35,"verse":"2 The destruction that shall come on mount Seir, because they troubled the people of Israel."},{"num":1,"verse":"Moreover, the word of the Lord came unto me, saying,"},{"num":2,"verse":"Son of man, Set thy face against mount Seir, and prophesy against it,"},{"num":3,"verse":"And say unto it, Thus saith the Lord God, Behold, O mount Seir, I come against thee, and I will stretch out mine hand against thee, and I will make thee desolate and waste."},{"num":4,"verse":"I will lay thy cities waste, and thou shalt be desolate, and thou shalt know that I am the Lord."},{"num":5,"verse":"Because thou hast had a perpetual hatred, and hast put the children of Israel to flight by the force of the sword in the time of their calamity, when their iniquity had an end,"},{"num":6,"verse":"Therefore as I live, saith the Lord God, I will prepare thee unto blood, and blood shall pursue thee: except thou hate blood, even blood shall pursue thee."},{"num":7,"verse":"Thus will I make mount Seir desolate and waste, and cut off from it him that passeth out and him that returneth."},{"num":8,"verse":"And I will fill his mountains with his slain men: in thine hills, and in thy valleys, and in all thy rivers shall they fall, that are slain with the sword."},{"num":9,"verse":"I will make thee perpetual desolations, and thy cities shall not return, and ye shall know that I am the Lord."},{"num":10,"verse":"Because thou hast said, These two nations and these two countries shall be mine, and we will possess them (seeing the Lord was there)"},{"num":11,"verse":"Therefore as I live, saith the Lord God, I will even do according to thy wrath, and according to thine indignation, which thou hast used in thine hatred against them: and I will make myself known among them, when I have judged thee."},{"num":12,"verse":"And thou shalt know, that I the Lord have heard all the blasphemies which thou hast spoken against the mountains of Israel, saying, They lie waste, they are given us to be devoured."},{"num":13,"verse":"Thus with your mouths ye have boasted against me, and I have multiplied your words against me: I have heard them."},{"num":14,"verse":"Thus saith the Lord God, So shall all the world rejoice, when I shall make thee desolate."},{"num":15,"verse":"As thou didst rejoice at the inheritance of the house of Israel, because it was desolate, so will I do unto thee: thou shalt be desolate, O mount Seir, and all Idumea wholly, and they shall know that I am the Lord."}]