[{"header":"Prophecy Against Edom"},{"num":35,"verse":"The Lord spoke his word to me. He said: "},{"num":2,"verse":"“Human being, look toward Mount Edom and prophesy against it. "},{"num":3,"verse":"Say to it: ‘This is what the Lord God says: I am against you, Mount Edom. I will stretch out my hand against you. And I will make you an empty desert. "},{"num":4,"verse":"I will destroy your cities. And you will become empty. Then you will know that I am the Lord."},{"num":5,"verse":"“‘This is because you have always been an enemy of Israel. You let them be defeated in war when they were in trouble. It was the time of their final punishment. "},{"num":6,"verse":"So the Lord God says, As surely as I live, I will let you be murdered. Murder will chase you. You did not hate murdering people, so murder will chase you. "},{"num":7,"verse":"And I will make Mount Edom an empty ruin. And I will destroy everyone who goes in or comes out of it. "},{"num":8,"verse":"I will fill its mountains with those who are killed. Those killed in war will fall on your hills. They will fall in your valleys and in all your ravines. "},{"num":9,"verse":"I will make you a ruin forever. No one will live in your cities. Then you will know that I am the Lord."},{"num":10,"verse":"“‘You said, “These two nations, Israel and Judah, and these two lands will be ours. We will take them for our own.” But the Lord was there. "},{"num":11,"verse":"So this is what the Lord God says: As surely as I live, this is true. I will treat you just as you treated them. When you were angry and jealous, you acted hatefully against them. I will punish you. And that is how I will show the Israelites who I am. "},{"num":12,"verse":"Then you will know that I, the Lord God, have heard all your insults. Those insults were against the mountains of Israel. You said, “They have been ruined. They have been given to us to eat.” "},{"num":13,"verse":"You have not stopped your proud talk against me. I have heard you. "},{"num":14,"verse":"This is what the Lord God says: All the earth will be happy when I make you an empty ruin. "},{"num":15,"verse":"You were happy when the land of Israel was ruined. But I will do the same thing to you. Mount Edom and all Edom, you will become an empty ruin. Then you will know that I am the Lord God.’”"}]