[{"header":"Prophecy Against Mount Seir"},{"num":35,"verse":"The Lord’s message came to me: "},{"num":2,"verse":"“Son of man, turn toward Mount Seir, and prophesy against it. "},{"num":3,"verse":"Say to it, ‘This is what the Sovereign Lord says:"},{"num":5,"verse":"“‘You have shown unrelenting hostility and poured the people of Israel onto the blades of a sword at the time of their calamity, at the time of their final punishment. "},{"num":6,"verse":"Therefore, as surely as I live, declares the Sovereign Lord, I will subject you to bloodshed, and bloodshed will pursue you. Since you did not hate bloodshed, bloodshed will pursue you. "},{"num":7,"verse":"I will turn Mount Seir into a desolate ruin; I will cut off from it the one who passes through or returns. "},{"num":8,"verse":"I will fill its mountains with its dead; on your hills and in your valleys and in all your ravines, those killed by the sword will fall. "},{"num":9,"verse":"I will turn you into a perpetual desolation, and your cities will not be inhabited. Then you will know that I am the Lord."},{"num":10,"verse":"“‘You said, “These two nations, these two lands will be mine, and we will possess them,” (although the Lord was there); "},{"num":11,"verse":"therefore, as surely as I live, declares the Sovereign Lord, I will deal with you according to your anger and your envy, by which you acted spitefully against them. I will reveal myself to them when I judge you. "},{"num":12,"verse":"Then you will know that I, the Lord, have heard all the insults you spoke against the mountains of Israel, saying, “They are desolate; they have been given to us for food.” "},{"num":13,"verse":"You exalted yourselves against me with your speech and hurled many insults against me—I have heard them all! "},{"num":14,"verse":"This is what the Sovereign Lord says: While the whole earth rejoices, I will turn you into a desolation. "},{"num":15,"verse":"As you rejoiced over the inheritance of the house of Israel because it was desolate, so will I deal with you—you will be desolate, Mount Seir, and all Edom—all of it! Then they will know that I am the Lord.’”"}]