[{"num":35,"verse":"Again a message came from the Lord. He said:"},{"num":2,"verse":"“Son of dust, face toward Mount Seir and prophesy against the people saying, "},{"num":3,"verse":"‘The Lord God says: I am against you, and I will smash you with my fist and utterly destroy you. "},{"num":4,"verse":"Because you hate my people Israel, I will demolish your cities and make you desolate, and then you shall know I am the Lord. You butchered my people when they were helpless, when I had punished them for all their sins. "},{"num":6,"verse":"As I live, the Lord God says, since you enjoy blood so much, I will give you a blood bath—your turn has come! "},{"num":7,"verse":"I will utterly wipe out the people of Mount Seir, killing off all those who try to escape and all those who return. "},{"num":8,"verse":"I will fill your mountains with the dead—your hills, your valleys, and your rivers will be filled with those the sword has killed. "},{"num":9,"verse":"Never again will you revive. You will be abandoned forever; your cities will never be rebuilt. Then you shall know I am the Lord."},{"num":10,"verse":"“‘For you said, “Both Israel and Judah shall be mine. We will take possession of them. What do we care that God is there!” "},{"num":11,"verse":"Therefore as I live, the Lord God says, I will pay back your angry deeds with mine—I will punish you for all your acts of envy and of hate. And I will honor my name in Israel by what I do to you. "},{"num":12,"verse":"And you shall know that I have heard each evil word you spoke against the Lord, saying, “His people are helpless; they are food for us to eat!” "},{"num":13,"verse":"Saying that, you boasted great words against the Lord. And I have heard them all!"},{"num":14,"verse":"“‘The whole world will rejoice when I make you desolate. "},{"num":15,"verse":"You rejoiced at Israel’s fearful fate. Now I will rejoice at yours! You will be wiped out, O people of Mount Seir and all who live in Edom! And then you will know I am the Lord!’"}]