[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Proverbs",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A CONDENSED GUIDE FOR LIFE",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE AFTERWARDS AND OUR HOPEProverbs 23:17 - Proverbs 23:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE AFTERWARDS AND OUR HOPE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Book of Proverbs seldom looks beyond the limits of the temporal, but now and then the mists lift and a wider horizon is disclosed. Our text is one of these exceptional instances, and is remarkable, not only as expressing confidence in the future, but as expressing it in a very striking way. ‘Surely there is an end,’ says our Authorised Version, substituting in the margin, for end, ‘reward.’ The latter word is placed in the text of the Revised Version. But neither ‘end’ nor ‘reward’ conveys the precise idea. The word so translated literally means ‘something that comes after.’ So it is the very opposite of ‘end’, it is really that which lies beyond the end-the ‘sequel,’ or the ‘future’-as the margin of the Revised Version gives alternatively, or, more simply still, the afterwards. Surely there is an afterwards behind the end. And then the proverb goes on to specify one aspect of that afterwards: ‘Thine expectation’-or, better, because more simply, thy hope-shall not be cut off. And then, upon these two convictions that there is, if I might so say, an afterclap, and that it is the time and the sphere in which the fairest hopes that a man can paint to himself shall be surpassed by the reality, it builds the plain partial exhortation: ‘Be thou in the fear of the Lord all the day long.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So then, we have three things here, the certainty of the afterwards, the immortality of hope consequent thereon, and the bearing of these facts on the present.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The certainty of the hereafter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The certainty of the hereafter.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, this Book of Proverbs, as I have said in the great collection of popular sayings which makes the bulk of it, has no enthusiasm, no poetry, no mysticism. It has religion, and it has a very pure and lofty morality, but, for the most part, it deals with maxims of worldly prudence, and sometimes with cynical ones, and represents, on the whole, the wisdom of the market-place, and the ‘man in the street.’ But now and then, as I have said, we hear strains of a higher mood. My text, of course, might be watered down and narrowed so as to point only to sequels to deeds realised in this life. And then it would be teaching us simply the very much needed lessons that even in this life, ‘Whatever a man soweth that shall he also reap.’ But it seems to me that we are entitled to see here, as in one or two other places in the Book of Proverbs, a dim anticipation of a future life beyond the grave. I need not trouble you with quoting parallel passages which are sown thinly up and down the book, but I venture to take the words in the wider sense to which I have referred.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, the question comes to be, where did the coiners of Proverbs, whose main interest was in the obvious maxims of a prudential morality, get this conviction? They did not get it from any lofty experience of communion with God, like that which in the seventy-third Psalm marks the very high-water mark of Old Testament faith in regard to a future life, where the Psalmist finds himself so completely blessed and well in present fellowship with God, that he must needs postulate its eternal continuance, and just because he has made God the portion of his heart, and is holding fellowship with Him, is sure that nothing can intervene to break that sweet communion. They did not get it from any clear definite revelation, such as we have in the resurrection of Jesus Christ, which has made that future life far more than an inference for us, but they got it from thinking over the facts of this present life as they appeared to them, looked at from the standpoint of a belief in God, and in righteousness. And so they represent to us the impression that is made upon a man’s mind, if he has the ‘eye that hath kept watch o’er man’s mortality,’ that is made by the facts of this earthly life-viz. that it is so full of onward-looking, prophetic aspect, so manifestly and tragically, and yet wonderfully and hopefully. Incomplete and fragmentary in itself, that there must be something beyond in order to explain, in order to vindicate, the life that now is. And that aspect of fragmentary incompleteness is what I would insist upon for a moment now.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " You sometimes see a row of houses, the end one of them has, in its outer gable wall, bricks protruding here and there, and holes for chimney-pieces that are yet to be put in. And just as surely as that external wall says that the row is half built, and there are some more tenements to be added to it, so surely does the life that we now live here, in all its aspects almost, bear upon itself the stamp that it, too, is but initial and preparatory. You sometimes see, in the bookseller’s catalogue, a book put down ‘volume one; all that is published.’ That is our present life-volume one, all that is published. Surely there is going to be a sequel, volume two. Volume two is due, and will come, and it will be the continuation of volume one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What is the meaning of the fact that of all the creatures on the face of the earth only you and I, and our brethren and sisters, do not find in our environment enough for our powers? What is the meaning of the fact that, whilst ‘foxes have holes’ where they curl themselves up, and they are at rest, ‘and the birds of the air have roosting-places,’ where they tuck their heads beneath their wings and sleep, the ‘son of man’ hath not where to lay his head, but looks round upon the earth and says, ‘The earth, O Lord, is full of Thy mercy. I am a stranger on the earth.’ What is the meaning of it? Here is the meaning of it: ‘Surely there is a hereafter.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What is the meaning of the fact that lodged in men’s natures there lies that strange power of painting to themselves things that are not as though they were? So that minds and hearts go out wandering through Eternity, and having longings and possibilities which nothing beneath the stars can satisfy, or can develop? The meaning of it is this: Surely there is a hereafter. The man that wrote the book of Ecclesiastes, in his sceptical moment ere he had attained to his last conclusion, says, in a verse that is mistranslated in our rendering, ‘He hath set Eternity in their hearts, therefore the misery of man is great upon him.’ That is true, because the root of all our unrest and dissatisfaction is that we need God, and God in Eternity, in order that we may be at rest. But whilst on the one hand ‘therefore the misery of man is great upon him,’ on the other hand, because Eternity is in our hearts, therefore there is the answer to the longings, the adequate sphere for the capacities in that great future, and in the God that fills it. You go into the quarries left by reason of some great convulsion or disaster, by forgotten races, and you will find there half excavated and rounded pillars still adhering to the matrix of the rock from which they were being hewn. Such unfinished abortions are all human lives if, when Death drops its curtain, there is an end.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But, brethren, God does not so clumsily disproportion His creatures and their place. God does not so cruelly put into men longings that have no satisfaction, and desires which never can be filled, as that there should not be, beyond the gulf, the fair land of the hereafter. Every human life obviously has in it, up to the very end, the capacity for progress. Every human life, up to the very end, has been educated and trained, and that, surely, for something. There may be masters in workshops who take apprentices, and teach them their trade during the years that are needed, and then turn round and say, ‘I have no work for you, so you must go and look for it somewhere else.’ That is not how God does. When He has trained His apprentices He gives them work to do. Surely there is a hereafter, But that is only part of what is involved in this thought. It is not only a state subsequent to the present, but it is a state consequent on the present, and the outcome of it. The analogy of our earthly life avails here. To-day is the child of all the yesterdays, and the yesterdays and to-day are the parent of tomorrow. The past, our past, has made us what we are in the present, and what we are in the present is making us what we shall be in the future. And when we pass out of this life we pass out, notwithstanding all changes, the same men as we were. There may be much on the surface changed, there will be much taken away, thank God! dropped, necessarily, by the cessation of the corporeal frame, and the connection into which it brings us with things of sense. There will be much added, God only knows how much, but the core of the man will remain untouched. ‘We all are changed by still degrees,’ and suddenly at last ‘All but the basis of the evil.’ And so we carry ourselves with us into that future life, and, ‘what a man soweth, that shall he also reap.’ Oh that they were wise, that they understood this, that they would consider their afterward!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, my text suggests the immortality of hope.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now, secondly, my text suggests the immortality of hope. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Thine expectation’-or rather, as I said, ‘thy hope’-’shall not be cut off.’ This is a characteristic of that hereafter. What a wonderful saying that is which also occurs in this Book of Proverbs, ‘The righteous hath hope in his death.’ Ah! we all know how swiftly, as years increase, the things to hope for diminish, and how, as we approach the end, less and less do our imaginations go out into the possibilities of the sorrowing future. And when the end comes, if there is no afterwards, the dying man’s hopes must necessarily die before he does. If when we pass into the darkness we are going into a cave with no outlet at the other end, then there is no hope, and you may write over it Dante’s grim word: ‘All hope abandon, ye who enter here.’ But let in that thought, ‘surely there is an afterwards,’ and the enclosed cave becomes a rock-passage, in which one can see the arch of light at the far end of the tunnel; and as one passes through the gloom, the eye can travel on to the pale radiance beyond, and anticipate the ampler ether, the diviner air, ‘the brighter constellations burning, mellow moons and happy stars,’ that await us there. ‘The righteous hath hope in his death.’ ‘Thine expectation shall not be cut off.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But, further, that conviction of the afterward opens up for us a condition in which imagination is surpassed by the wondrous reality. Here, I suppose, nobody ever had all the satisfaction out of a fulfilled hope that he expected. The fish is always a great deal larger and heavier when we see it in the water than when it is lifted out and scaled. And I suppose that, on the whole, perhaps as much pain as pleasure comes from the hopes which are illusions far more often than they are realities. They serve their purpose in whirling us along the path of life and in stimulating effort, but they do not do much more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there does come a time, if you believe that there is an afterwards, when all we desired and painted to ourselves of possible good for our craving spirits shall be felt to be but a pale reflex of the reality, like the light of some unrisen sun on the snowfields, and we shall have to say ‘the half was not told to us.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And, further, if that afterwards is of the sort that we, through Jesus Christ and His resurrection and glory, know to be, then all through the timeless eternity hope will be our guide. For after each fresh influx of blessedness and knowledge we shall have to say ‘it doth not yet appear what we shall be.’ ‘Thus now abideth’-and not only now, but then and eternally-’these three-faith, hope, and charity,’ and hope will never be cut off through all the stretch of that great afterwards.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, finally, notice the bearing of all this on the daily present. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And now, finally, notice the bearing of all this on the daily present.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Be thou in the fear of the Lord all the day long.’ The conviction of the hereafter, and the blessed vision of hopes fulfilled, are not the only reasons for that exhortation. A great deal of harm has been done, I am afraid, by well-meaning preachers who have drawn the bulk of their strongest arguments to persuade men to Christian faith from the thought of a future life. Why, if there were no future, it would be just as wise, just as blessed, just as incumbent upon us to ‘be in the fear of the Lord all the day long.’ But seeing that there is that future, and seeing that only in it will hope rise to fruition, and yet subsist as longing, surely there comes to us a solemn appeal to ‘be in the fear of the Lord all the day long,’ which being turned into Christian language, is to live by habitual faith, in communion with, and love and obedience to, our Lord and Saviour Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Surely, surely the very climax and bad eminence of folly is shutting the eyes to that future that we all have to face; and to live here, as some of you are doing, ignoring it and God, and cribbing, cabining, and confining all our thoughts within the narrow limits of the things present and visible. For to live so, as our text enjoins, is the sure way, and the only way, to make these great hopes realities for ourselves.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren, that afterwards has two sides to it. The prophet Malachi, in almost his last words, has a magnificent apocalypse of what he calls ‘the day of the Lord,’ which he sets forth as having a double aspect. On the one hand, it is lurid as a furnace, and burns up the wicked root and branch. I saw a forest fire this last autumn, and the great pine-trees stood there for a moment pyramids of flame, and then came down with a crash. So that hereafter will be to godless men. And on the other side, that ‘day of the Lord’ in the prophet’s vision was radiant with the freshness and dew and beauty of morning, and the Sun of Righteousness arose with healing in his wings. Which of the two is it going to be to us? We have all to face it. We cannot alter that fact, but we can settle how we shall face it. It will be to either the fulfilment of blessed hope, the ‘appearance of the glory of the great God and our Saviour,’ or else, as is said in this same Book of Proverbs: ‘The hope of the godless’ shall be like one of those water plants, the papyrus or the flag, which, when the water is taken away, ‘withereth up before any other herb.’ It is for us to determine whether the afterwards that we must enter upon shall be the land in which our hopes shall blossom and fruit, and blossom again immortally, or whether we shall leave behind us, with all the rest that we would fain keep, the possibility of anticipating any good. ‘Surely there is an afterwards,’ and if thou wilt ‘be in the fear of the Lord all the day long,’ then for evermore ‘thy hope shall not be cut off.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 23:17-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:17-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let not thy heart envy sinners — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Let not the consideration of their present impunity and prosperity excite thee either to envy them, or to approve and imitate their evil courses; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but be thou in the fear of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Reverence the presence of the Divine Majesty, and dread his power and justice, and those judgments which he hath prepared for sinners, and thou wilt see no cause to envy, but rather to pity them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all the day long",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Not only when thou art in trouble, but in all times and conditions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For surely there is an end — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "An expected and happy end for such as fear God; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a reward, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אחרית",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here used, is rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 24:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And thine expectation shall not be cut off — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou shalt certainly enjoy that good which thou expectest, as the wicked shall lose that happiness which they enjoy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:12-16 Here is a parent instructing his child to give his mind to the Scriptures. Here is a parent correcting his child: accompanied with prayer, and blessed of God, it may prove a means of preventing his destruction. Here is a parent encouraging his child, telling him what would be for his good. And what a comfort it would be, if herein he answered his expectation! 17,18. The believer's expectation shall not be disappointed; the end of his trials, and of the sinner's prosperity, is at hand.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Envy sinners - Compare in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the feeling which looks half-longingly at the prosperity of evil doers. Some connect the verb \"envy\" with the second clause, \"envy not sinners, but envy, emulate, the fear of the Lord.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17, 18. (Compare Margin). The prosperity of the wicked is short.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let not thine heart envy sinners; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " let not the consideration of their present impunity and prosperity stir thee up, either to envy them, or to approve and imitate their evil courses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Be thou in the fear of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reverence the presence of the Divine Majesty, and dread his power and justice, and those judgments which he hath prepared for sinners, and thou wilt see no cause to envy, but rather to pity them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All the day long; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only when thou art in trouble, but in all times and conditions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let not thine heart envy sinners,.... Their present prosperity and happiness, the pleasure, profit, and honour, they seem to enjoy; all which is but a shadow, fading had temporary; and yet good men are apt to envy it in their hearts, if they do not express it with their lips; and are ready to murmur and think it hard that they should be in straitened circumstances while the wicked are in flourishing ones; and inwardly fret and are uneasy at it, which they should not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or do not \"emulate\" or \"imitate\" (z) them, or do as they do, thinking thereby to enjoy the same prosperity and happiness; choose not their ways, nor desire to be with them, to have their company, or be ranked among them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but be thou in the fear of the Lord all the day long; let the fear of God be always before thine eyes and in thine heart; be continually in the exercise of fear, which is attended with faith and trust in the Lord; with love and affection to him, and joy and delight in him; be constantly employed in the duties of religion, private and public, which the fear of God includes; and this will be a preservative from envying, murmuring, and fretting at the outward happiness of wicked men; and from joining with them in their evil ways. Aben Ezra, and who is followed by some others, render it, \"but emulate or imitate the men that fear the Lord all the day long\" (a); be followers of them, and do as they do; let their constant piety and devotion stir up a holy emulation in thee to copy after them and exceed them; but the former sense is best. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z)  \"ne aemuletur\", Pagninus, Montanus, Tigurine version, Junius et Tremellius, Piscator, Mercerus, Cocceius, Gejerus, Michaelis. (a) \"Aemulare virum timentem, Jehovam\", Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z)  \"ne aemuletur\", Pagninus, Montanus, Tigurine version, Junius et Tremellius, Piscator, Mercerus, Cocceius, Gejerus, Michaelis. (a) \"Aemulare virum timentem, Jehovam\", Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Let not thine heart envy sinners: but be thou in the fear of the LORD all the day long.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let not thine heart envy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "be thou] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (thy heart) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some scholars repeat ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "envy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the former clause: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but let it envy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with a nobler emulation (the Heb. word is frequently used in a good sense) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the fear of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Let not thine heart envy sinners,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when thou seest them apparently happy and prosperous (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 24:1, 19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Authorized Version, in agreement with the Septuagint, Vulgate, Arabic, and other versions, takes the second clause of this verse as an independent one: but it seems evidently to be constructionally connected with the preceding, and to be governed by the same verb, so that there is no occasion to insert \"be thou.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But be thou in the fear of the Lord all the day long.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jerome, corrected, would read, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Non aemuletur cor tuum peccatores, sed timorem Domini tota die",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", As Delitzsch and Hitzig, followed by Nowack, have pointed out, the Hebrew verb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "קָנָא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "kana",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is here used in two senses. In the first clause it signifies to be envious of a person: in the second, to be zealous for a thing, both senses combining in the thought of being moved with eager desire. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ζηλοτυπέω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used in this double sense, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "aemulor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Latin. So the gnome comes to this - Show your heart's desire, not by envy of the sinner's fortune, but by zeal for true religion, that fear of the Lord which leads to strict obedience and earnest desire to please him. Proverbs 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet now shows how one attains unto wisdom - the beginning of wisdom is the fear of God:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17 Let not thine heart strive after sinners,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     But after the fear of Jahve all the day.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18 Truly there is a future,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And thy hope shall not come to naught.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The lxx, Jerome, the Venet., and Luther, and the Arab. interpreters, render 17b as an independent clause: \"but be daily in the fear of the Lord.\" That is not a substantival clause (cf. Proverbs 22:7), nor can it be an interjectional clause, but it may be an elliptical clause (Fleischer: from the prohibitive אל־תקנא is to be taken for the second parallel member the v. subst. lying at the foundation of all verbs); but why had the author omitted היה dettim? Besides, one uses the expressions, to act (עשׂה), and to walk (הלך) in the fear of God, but not the expression to be (היה) in the fear of God. Thus בּיראת, like בחטּאים, is dependent on אל־תּקנּא; and Jerome, who translates: Non aemuletur cor tuum peccatores, sed in timore Domini esto tota die, ought to have continued: sed timorem Domini tota die; for, as one may say in Latin: aemulari virtutes, as well as aemulari aliquem, so also in Heb. קנּא ב, of the envying of those persons whose fortune excites to dissatisfaction, because one has not the same, and might yet have it, Proverbs 3:31; Proverbs 24:1, Proverbs 24:19, as well as of emulation for a thing in which one might not stand behind others: envy not sinners, envy much rather the fear of God, i.e., let thyself be moved with eager desire after it when its appearance is presented to thee. There is no O.T. parallel for this, but the Syr. tan and the Greek ζηλοτυποῦν are used in this double sense. Thus Hitzig rightly, and, among the moderns, Malbim; with Aben Ezra, it is necessary to take ביראת for באישׁ יראת, this proverb itself declares the fear of God to be of all things the most worthy of being coveted.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The lxx, Jerome, the Venet., and Luther, and the Arab. interpreters, render 17b as an independent clause: \"but be daily in the fear of the Lord.\" That is not a substantival clause (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 22:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), nor can it be an interjectional clause, but it may be an elliptical clause (Fleischer: from the prohibitive אל־תקנא is to be taken for the second parallel member the v. subst. lying at the foundation of all verbs); but why had the author omitted היה dettim? Besides, one uses the expressions, to act (עשׂה), and to walk (הלך) in the fear of God, but not the expression to be (היה) in the fear of God. Thus בּיראת, like בחטּאים, is dependent on אל־תּקנּא; and Jerome, who translates: Non aemuletur cor tuum peccatores, sed in timore Domini esto tota die, ought to have continued: sed timorem Domini tota die; for, as one may say in Latin: aemulari virtutes, as well as aemulari aliquem, so also in Heb. קנּא ב, of the envying of those persons whose fortune excites to dissatisfaction, because one has not the same, and might yet have it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 24:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 24:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as well as of emulation for a thing in which one might not stand behind others: envy not sinners, envy much rather the fear of God, i.e., let thyself be moved with eager desire after it when its appearance is presented to thee. There is no O.T. parallel for this, but the Syr. tan and the Greek ζηλοτυποῦν are used in this double sense. Thus Hitzig rightly, and, among the moderns, Malbim; with Aben Ezra, it is necessary to take ביראת for באישׁ יראת, this proverb itself declares the fear of God to be of all things the most worthy of being coveted.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Proverbs 23:18, Umbreit, Elster, Zckler, and others interpret the כּי as assigning a reason, and the אם as conditioning: for when the end (the hour of the righteous judgment) has come; Bertheau better, because more suitable to the ישׁ and the אחרית: when an end (an end adjusting the contradictions of the present time) comes, as no doubt it will come, then thy hope will not be destroyed; but, on the other hand, the succession of words in the conclusion (vid., at Proverbs 3:34) opposes this; also one does not see why the author does not say directly כי ישׁ אחרית, but expresses himself thus conditionally.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Umbreit, Elster, Zckler, and others interpret the כּי as assigning a reason, and the אם as conditioning: for when the end (the hour of the righteous judgment) has come; Bertheau better, because more suitable to the ישׁ and the אחרית: when an end (an end adjusting the contradictions of the present time) comes, as no doubt it will come, then thy hope will not be destroyed; but, on the other hand, the succession of words in the conclusion (vid., at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 3:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") opposes this; also one does not see why the author does not say directly כי ישׁ אחרית, but expresses himself thus conditionally.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The form כּי אם־ does not contradict the connection of the two particles. This use of the Makkeph is general, except in these three instances: Genesis 15:4; Numbers 35:33; Nehemiah 2:2.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The form כּי אם־ does not contradict the connection of the two particles. This use of the Makkeph is general, except in these three instances: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "If אם is meant hypothetically, then, with the lxx ἐὰν γὰρ τηρήσῃς αὐτὰ ἔκγονα, we should supply after it תּשׁמרנּה, that had fallen out. Ewald's: much rather there is yet a future (Dchsel: much rather be happy there is...), is also impossible; for the preceding clause is positive, not negative. The particles כּי אם, connected thus, mean: for if (e.g., Lamentations 3:32); or also relatively: that if (e.g., Jeremiah 26:15). After a negative clause they have the meaning of \"unless,\" which is acquired by means of an ellipsis; e.g., Isaiah 55:10, it turns not back thither, unless it has watered the earth (it returns back not before then, not unless this is done). This \"unless\" is, however, used like the Lat. nisi, also without the conditioning clause following, e.g., Genesis 28:17, hic locus non est nisi domus Dei. And hence the expression כי אם, after the negation going before, acquires the meaning of \"but,\" e.g., 17b: let not thy heart be covetous after sinners, for thou canst always be zealous for the fear of God, i.e., much rather for this, but for this. This pleonasm of אם sometimes occurs where כי is not used confirmatively, but affirmatively: the \"certainly if\" forms the transition, e.g., 1 Kings 20:6 (vid., Keil's Comm. l.c.), whose \"if\" is not seldom omitted, so that כי אם has only the meaning of an affirmative \"certainly,\" not \"truly no,\" which it may also have, 1 Samuel 25:34, but \"truly yes.\" Thus כי אם is used Judges 15:7; 2 Samuel 15:21 (where אם is omitted by the Kerı̂); 2 Kings 5:20; Jeremiah 51:14; and thus it is also meant here, 18a, notwithstanding that כי אם, in its more usual signification, \"besides only, but, nisi,\" precedes, as at 1 Samuel 21:6, cf. 5. The objection by Hitzig, that with this explanation: \"certainly there is a future,\" Proverbs 23:18 and Proverbs 23:17 are at variance, falls to the ground, if one reflects on the Heb. idiom, in which the affirmative signification of כי is interpenetrated by the confirmative. אחרית used thus pregnantly, as here (Proverbs 24:14), is the glorious final issue; the word in itself designates the end into which human life issues (cf. Psalm 37:37.); here, the end crowning the preceding course. Jeremiah (Jeremiah 29:11) in this sense connects אחרית ותקוה [end and expectation]. And what is here denied of the תּקיה, the hope (not as certain Jewish interpreters dream, the thread of life) of him who zealously strives after the fear of God, is affirmed, at Psalm 37:38, of the godless: the latter have no continuance, but the former have such as is the fulfilling of his hope. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If אם is meant hypothetically, then, with the lxx ἐὰν γὰρ τηρήσῃς αὐτὰ ἔκγονα, we should supply after it תּשׁמרנּה, that had fallen out. Ewald's: much rather there is yet a future (Dchsel: much rather be happy there is...), is also impossible; for the preceding clause is positive, not negative. The particles כּי אם, connected thus, mean: for if (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 3:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); or also relatively: that if (e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). After a negative clause they have the meaning of \"unless,\" which is acquired by means of an ellipsis; e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it turns not back thither, unless it has watered the earth (it returns back not before then, not unless this is done). This \"unless\" is, however, used like the Lat. nisi, also without the conditioning clause following, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", hic locus non est nisi domus Dei. And hence the expression כי אם, after the negation going before, acquires the meaning of \"but,\" e.g., 17b: let not thy heart be covetous after sinners, for thou canst always be zealous for the fear of God, i.e., much rather for this, but for this. This pleonasm of אם sometimes occurs where כי is not used confirmatively, but affirmatively: the \"certainly if\" forms the transition, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (vid., Keil's Comm. l.c.), whose \"if\" is not seldom omitted, so that כי אם has only the meaning of an affirmative \"certainly,\" not \"truly no,\" which it may also have, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but \"truly yes.\" Thus כי אם is used ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 15:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (where אם is omitted by the Kerı̂); ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 5:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and thus it is also meant here, 18a, notwithstanding that כי אם, in its more usual signification, \"besides only, but, nisi,\" precedes, as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 21:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. 5. The objection by Hitzig, that with this explanation: \"certainly there is a future,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are at variance, falls to the ground, if one reflects on the Heb. idiom, in which the affirmative signification of כי is interpenetrated by the confirmative. אחרית used thus pregnantly, as here (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is the glorious final issue; the word in itself designates the end into which human life issues (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".); here, the end crowning the preceding course. Jeremiah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 29:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in this sense connects אחרית ותקוה [end and expectation]. And what is here denied of the תּקיה, the hope (not as certain Jewish interpreters dream, the thread of life) of him who zealously strives after the fear of God, is affirmed, at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of the godless: the latter have no continuance, but the former have such as is the fulfilling of his hope. ",
            "children": []
          }
        ]
      }
    ]
  }
]