[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(26) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My son, give me thine heart.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For that is the one gift alone worthy of acceptance which man can offer to God, and the only one which God will accept; an offering which man endeavours to keep for himself, substituting for it alms, unreal prayers, outward observances of religion, and obedience in matters of little moment. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Proverbs 23:26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My son, give me thy heart — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Receive my counsels with thy whole heart; for the heart being esteemed by the ancients the seat of the affections, Solomon may, accordingly, be properly understood as calling upon his disciples to embrace his doctrine and injunctions with the warmest affection, and to reduce them to practice without any reluctance or delay; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and let thine eyes observe my ways — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Let thy mind seriously and practically consider the ways which I prescribe to thee. Or, rather, God is here speaking by Solomon, and saying to every true child of his, Son, daughter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "give me thy heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Certainly the heart is that which God especially requires, and calls for from every one of us; whatever we give, if we do not give him our hearts, it will not be accepted: he must be the chief object of our love. Our thoughts must dwell upon him; and on him, as our chief good and highest end, our most fervent affections must be placed. We must not think to divide our hearts between him and the world: he will have the whole heart, or no part of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt love the Lord thy God with all thy heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:19-28 The gracious Saviour who purchased pardon and peace for his people, with all the affection of a tender parent, counsels us to hear and be wise, and is ready to guide our hearts in his way. Here we have an earnest call to young people, to attend to the advice of their godly parents. If the heart be guided, the steps will be guided. Buy the truth, and sell it not; be willing to part with any thing for it. Do not part with it for pleasures, honours, riches, or any thing in this world. The heart is what the great God requires. We must not think to divide the heart between God and the world; he will have all or none. Look to the rule of God's word, the conduct of his providence, and the good examples of his people. Particular cautions are given against sins most destructive to wisdom and grace in the soul. It is really a shame to make a god of the belly. Drunkenness stupifies men, and then all goes to ruin. Licentiousness takes away the heart that should be given to God. Take heed of any approaches toward this sin, it is very hard to retreat from it. It bewitches men to their ruin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Observe - Another reading gives, \"let thine eyes delight in my ways.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26-35. A solemn warning against whoredom and drunkenness (Ho 4:11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "give me—This is the address of that divine wisdom so often presented (Pr 8:1; 9:3, &c.).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "heart—confidence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "observe—keep.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "my ways—such as I teach you (Pr 3:17; 9:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Give me thine heart; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " receive my counsels with thy whole heart. Solomon speaking in God’s name and cause, requires the heart to be given to him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let thine eyes observe, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " let thy mind seriously and practically consider, my ways; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The ways in which I have walked, my evil practices; take warning by my sad example. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The ways which I prescribe to you; as the apostles called the gospel which they preached their gospel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Thessalonians 1:5 2 Thessalonians 2:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Thessalonians 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My son, give me thine heart,.... These words are not the words of Solomon to his son, for a greater than Solomon is here; besides, the claim and possession of the heart do not belong to a creature, but to God; but they are the words of Wisdom, or Christ, to everyone of his sons, the children the Father has given him in covenant; who are adopted through him, regenerated by his Spirit and grace, begotten by his word and ministers as instruments, and born and brought up in his church, and to whom he stands in the relation of the everlasting Father. The heart of a wicked man is little worth, and not worth having; Satan has the possession of it, and fills it, and influences and draws it at his pleasure; the world is set in it, and there is no room for any other; sensual lusts and pleasures, whoredom, wine, and new wine, take away the heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and it is to those this exhortation is opposed, as appears from the following verses; and the sense is, give not thine heart to women, nor to wine, but to me. Christ should have the hearts and affections of his people, and he only; he is to be loved with the whole heart, sincerely, and above all things else; and it is a good man's heart he desires; a broken and a contrite heart is not despised by him, he binds it up; a heart purified by faith in his blood, a new heart and a new spirit, in which his laws are put and written; a heart to know him, fear him, love him, and believe in him: and as he requites the heart in the exercise of every grace, as faith, fear, and love; so in the performance of, every duty, which, without the heart, is of no avail; as in prayer, singing of praise, and hearing the word, and other religious services. And it is but reasonable service, that Christ should have the hearts of his children, since he stands in such near relations to them; as father, husband, friend, and brother; is all in all unto them; is so lovely a person himself, and has so loved them, and given himself, his life, his blood, his all, for them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and let thine eyes observe my ways; the ways which Wisdom, or Christ, took in eternity and time, in order to bring about the salvation of his people; his steps in the covenant of grace, as their surety; his coming down from heaven to earth, to do the will of his Father; his going away from hence, by submitting to the accursed death of the cross, thereby making peace and reconciliation for sin; his ascension to heaven, and session at the right hand of God, where he ever lives to intercede for us; the various methods of his grace, in calling and visiting his people, supplying their wants, protecting their persons, and preserving them safe to his kingdom and glory: these should be observed, with attention and wonder, to the encouragement of faith, and for the magnifying of the riches of grace: also the ways which he prescribes and directs his children to walk in; as himself, who is the way to the Father, the way of life and salvation; the way of faith in him, the way of truth concerning hath; the way of holiness and righteousness he leads in; the ways of his commandments; the ways in which he himself walked; all which should be observed by the enlightened eyes of the understanding, and be imitated, and copied after, and walked in; respect should be had unto them all; they should be observed and kept, as they are directed to, and in faith and love, without depending on them. Some render the words, \"let thine eyes run through my ways\" (f): take a thorough and exact view of them. There is a letter transposed in the word rendered \"observe\", which occasions a different reading; \"as is a man's heart, so are his eyes\"; if his heart is to Christ, his eyes will be in his ways; and, where Christ's ways are not observed, the heart is not given to him. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"currant\", Mercerus; \"currere edomentur\", Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) \"currant\", Mercerus; \"currere edomentur\", Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "My son, give me {l} thy heart, and let thy eyes observe my ways.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "My son, give me ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thy heart, and let thy eyes observe my ways.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) Give yourself wholly to wisdom.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "observe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is the corrected Heb. text to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "read",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "written",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " text is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "delight in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R.V. text.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 26-28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - A hexastich, in which Wisdom herself is the speaker, and warns against unchastity.  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 26.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Give me thine heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Do not waste thy powers and affections on evil objects, but set thy soul with all its best faculties on me, Wisdom, who alone can satisfy its desires and aspirations. There is an eloquent passage in a tract that has gone by St. Bernard's name, though not written by him ('Epist. de Reg. Vitae Spirit.,' 2:1604, Mab.), which is worth quoting: \"Cor nostrum nihil dignius perficere potest, quam ut ei se restituat a quo factum est: et hoc a nobis Dominus expetit dicens, 'Fili, da mihi cor tuum.' Tunc siquidem cor hominum Deo datur, quando omnia cogitatio terminatur in eum, gyrat et circumflectitur super eum, et nihil vult possidere praeter eum. Sicque colligato sibi animo, eum diligit, ut sine ipso amarus sit omnis amor. Nec aliud dixerim cor Domino dare, quam ipsum captivare in omni obsequium ejus, et ita voluntati ejus ex toto supponere, ut nihil aliud velit, quam quod noverit eum velle.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Let",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "thine eyes observe my ways",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; keep closely to the paths of virtue which I teach thee, especially the path of purity, as the next verse shows. Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Vias meas custodiant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἐμὰς ὁδοὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πήρειτωσαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is the reading of the Keri, ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "תִּלֺצרְנָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the Khetib, which Delitzsch and others prefer, reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "תִּרְצֶנָה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"delight in\" my ways. Proverbs 23:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This hexastich warns against unchastity. What, in chap. 1-9, extended discourses and representations exhibited to the youth is here repeated in miniature pictures. It is the teacher of wisdom, but by him Wisdom herself, who speaks:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "26 Give me, my son, thine heart;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And let thine eyes delight in my ways.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "27 For the harlot is a deep ditch,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And the strange woman a narrow pit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "28 Yea, she lieth in wait like a robber,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     And multiplieth the faithless among men",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have retained Luther's beautiful rendering of Proverbs 23:26,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We have retained Luther's beautiful rendering of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The right punctuation of 26a is תּנה־בני לבּך, as it is found in the editions: Ven. 1615; Basel 1619; and in those of Norzi and Michaelis.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in which this proverb, as a warning word of heavenly wisdom and of divine love, has become dear to us. It follows, as Symmachus and the Venet., the Chethı̂b תּרצנה (for תרצינה, like Exodus 2:16; Job 5:12), the stylistic appropriateness of which proceeds from Proverbs 16:7, as on the other hand the Kerı̂ תּצּרנה (cf. 1 Samuel 14:27) is supported by Proverbs 22:12, cf. Proverbs 5:2. But the correction is unnecessary, and the Chethı̂b sounds more affectionate, hence it is with right defended by Hitzig. The ways of wisdom are ways of correction, and particularly of chastity, thus placed over against \"the ways of the harlot,\" Proverbs 7:24. Accordingly the exhortation, Proverbs 23:26, verifies itself; warning, by Proverbs 23:27, cf. Proverbs 22:14, where עמקּה was written, here as at Job 12:22, with the long vowel עמוּקה (עמקה). בּאר צרה interchanges with שׁוּחה עמוקה, and means, not the fountain of sorrow (Lwenstein), but the narrow pit. בּאר is fem. gen., Proverbs 26:21., and צר means narrow, like troit (old French, estreit), from strictus. The figure has, after Proverbs 22:14, the mouth of the harlot in view. Whoever is enticed by her syren voice falls into a deep ditch, into a pit with a narrow mouth, into which one can more easily enter than escape from. Proverbs 23:28 says that it is the artifice of the harlot which draws a man into such depth of wickedness and guilt. With אף, which, as at Judges 5:29, belongs not to היא but to the whole sentence, the picture of terror is completed. The verb חתף (whence Arab. ḥataf, death, natural death) means to snatch away. If we take חתף as abstr.: a snatching away, then it would here stand elliptically for חתף (בּעל) אישׁ, which in itself is improbable (vid., Proverbs 7:22, עכס) and also unnecessary, since, as מלך, עבד, הלך, etc. show, such abstracta can pass immediately into concreta, so that חתף thus means the person who snatches away, i.e., the street robber, latro (cf. חטף .fc(, Arab. khaṭaf, Psalm 10:9, rightly explained by Kimchi as cogn.). In 28b, תוסיף cannot mean abripit (as lxx, Theodotion, and Jerome suppose), for which the word תּספּה (תּאסף) would have been used.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in which this proverb, as a warning word of heavenly wisdom and of divine love, has become dear to us. It follows, as Symmachus and the Venet., the Chethı̂b תּרצנה (for תרצינה, like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the stylistic appropriateness of which proceeds from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 16:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as on the other hand the Kerı̂ תּצּרנה (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is supported by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 22:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But the correction is unnecessary, and the Chethı̂b sounds more affectionate, hence it is with right defended by Hitzig. The ways of wisdom are ways of correction, and particularly of chastity, thus placed over against \"the ways of the harlot,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 7:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Accordingly the exhortation, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", verifies itself; warning, by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where עמקּה was written, here as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with the long vowel עמוּקה (עמקה). בּאר צרה interchanges with שׁוּחה עמוקה, and means, not the fountain of sorrow (Lwenstein), but the narrow pit. בּאר is fem. gen., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 26:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., and צר means narrow, like troit (old French, estreit), from strictus. The figure has, after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the mouth of the harlot in view. Whoever is enticed by her syren voice falls into a deep ditch, into a pit with a narrow mouth, into which one can more easily enter than escape from. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 23:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " says that it is the artifice of the harlot which draws a man into such depth of wickedness and guilt. With אף, which, as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", belongs not to היא but to the whole sentence, the picture of terror is completed. The verb חתף (whence Arab. ḥataf, death, natural death) means to snatch away. If we take חתף as abstr.: a snatching away, then it would here stand elliptically for חתף (בּעל) אישׁ, which in itself is improbable (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 7:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", עכס) and also unnecessary, since, as מלך, עבד, הלך, etc. show, such abstracta can pass immediately into concreta, so that חתף thus means the person who snatches away, i.e., the street robber, latro (cf. חטף .fc(, Arab. khaṭaf, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", rightly explained by Kimchi as cogn.). In 28b, תוסיף cannot mean abripit (as lxx, Theodotion, and Jerome suppose), for which the word תּספּה (תּאסף) would have been used.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The Targ. translates 28b (here free from the influence of the Peshito) in the Syro-Palestinian idiom by וצאד אבניּא שׁברי, i.e., she seizes thoughtless sons.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But this verbal idea does not harmonize with the connection; תוסיף means, as always, addit (auget), and that here in the sense of multiplicat. The same thing may be said of בּוגדים as is said (Proverbs 11:15) of תּוקעים. Hitzig's objection, \"הוסיף, to multiply, with the accusative of the person, is not at all used,\" is set aside by Proverbs 19:4. But we may translate: the faithless, or: the breach of faith she increases. Yet it always remains a question whether בּאדם is dependent on בוגדים, as Ecclesiastes 8:9, cf. 2 Samuel 23:3, on the verb of ruling (Hitzig), or whether, as frequently בּאדם, e.g., Psalm 78:60, it means inter homines (thus most interpreters). Uncleanness leads to faithlessness of manifold kinds: it makes not only the husband unfaithful to his wife, but also the son to his parents, the scholar to his teacher and pastor, the servant (cf. the case of Potiphar's wife) to his master. The adulteress, inasmuch as she entices now one and now another into her net, increases the number of those who are faithless towards men. But are they not, above all, faithless towards God? We are of opinion that not בוגדים, but תוסיף, has its complement in באדם, and needs it: the adulteress increases the faithless among men, she makes faithlessness of manifold kinds common in human society. According to this, also, it is accentuated; ובוגדים is placed as object by Mugrasch, and באדם is connected by Mercha with תוסיף. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But this verbal idea does not harmonize with the connection; תוסיף means, as always, addit (auget), and that here in the sense of multiplicat. The same thing may be said of בּוגדים as is said (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") of תּוקעים. Hitzig's objection, \"הוסיף, to multiply, with the accusative of the person, is not at all used,\" is set aside by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 19:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But we may translate: the faithless, or: the breach of faith she increases. Yet it always remains a question whether בּאדם is dependent on בוגדים, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 8:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", on the verb of ruling (Hitzig), or whether, as frequently בּאדם, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:60",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it means inter homines (thus most interpreters). Uncleanness leads to faithlessness of manifold kinds: it makes not only the husband unfaithful to his wife, but also the son to his parents, the scholar to his teacher and pastor, the servant (cf. the case of Potiphar's wife) to his master. The adulteress, inasmuch as she entices now one and now another into her net, increases the number of those who are faithless towards men. But are they not, above all, faithless towards God? We are of opinion that not בוגדים, but תוסיף, has its complement in באדם, and needs it: the adulteress increases the faithless among men, she makes faithlessness of manifold kinds common in human society. According to this, also, it is accentuated; ובוגדים is placed as object by Mugrasch, and באדם is connected by Mercha with תוסיף. ",
            "children": []
          }
        ]
      }
    ]
  }
]