[{"header":"Salutation"},{"num":1,"verse":"The elder to the beloved Ga′ius, whom I love in the truth."},{"header":"Gaius Commended for His Hospitality"},{"num":2,"verse":"Beloved, I pray that all may go well with you and that you may be in health; I know that it is well with your soul. "},{"num":3,"verse":"For I greatly rejoiced when some of the brethren arrived and testified to the truth of your life, as indeed you do follow the truth. "},{"num":4,"verse":"No greater joy can I have than this, to hear that my children follow the truth."},{"num":5,"verse":"Beloved, it is a loyal thing you do when you render any service to the brethren, especially to strangers, "},{"num":6,"verse":"who have testified to your love before the church. You will do well to send them on their journey as befits God’s service. "},{"num":7,"verse":"For they have set out for his sake and have accepted nothing from the heathen. "},{"num":8,"verse":"So we ought to support such men, that we may be fellow workers in the truth."},{"header":"Diotrephes and Demetrius"},{"num":9,"verse":"I have written something to the church; but Diot′rephes, who likes to put himself first, does not acknowledge my authority. "},{"num":10,"verse":"So if I come, I will bring up what he is doing, prating against me with evil words. And not content with that, he refuses himself to welcome the brethren, and also stops those who want to welcome them and puts them out of the church."},{"num":11,"verse":"Beloved, do not imitate evil but imitate good. He who does good is of God; he who does evil has not seen God. "},{"num":12,"verse":"Deme′trius has testimony from every one, and from the truth itself; I testify to him too, and you know my testimony is true."},{"header":"Final Greetings"},{"num":13,"verse":"I had much to write to you, but I would rather not write with pen and ink; "},{"num":14,"verse":"I hope to see you soon, and we will talk together face to face."},{"num":15,"verse":"Peace be to you. The friends greet you. Greet the friends, every one of them."}]