[{"header":"Rules for Priests"},{"num":2,"verse":"“Priests, this command is for you. "},{"num":2,"verse":"Listen to me. Pay attention to what I say. Honor my name,” says the Lord of heaven’s armies. “If you don’t, I will send a curse on you. I will curse your blessings. I have already cursed them because you don’t pay attention to what I say."},{"num":3,"verse":"“I will punish your descendants. I will smear your faces with the garbage from your feasts. And you will be thrown away with it. "},{"num":4,"verse":"Then you will know why I am giving you this command. It is so that my agreement with Levi will continue,” says the Lord of heaven’s armies. "},{"num":5,"verse":"“My agreement for priests was with the tribe of Levi. I promised them life and peace. And I gave these to them so they would honor me. They did honor me and fear me. "},{"num":6,"verse":"They taught the true teachings. They spoke no lies. With peace and honesty they did what I said they should do. They kept many people from sinning."},{"num":7,"verse":"“A priest should teach what he knows. People should learn the teachings from him because he is the messenger of the Lord of heaven’s armies. "},{"num":8,"verse":"But you priests have stopped obeying me. With your teachings you have caused many people to do wrong. You have broken the agreement with the tribe of Levi!” says the Lord of heaven’s armies. "},{"num":9,"verse":"“You have not been careful to do what I say. You take sides in court cases. So I have caused you to be hated and disgraced in front of everybody.”"},{"header":"Judah Was Not Loyal to God"},{"num":10,"verse":"We all have the same father. The same God made us. So why do people break their promises to each other? They don’t respect the agreement that our ancestors made with God. "},{"num":11,"verse":"The people of Judah have broken their promises. They have done something God hates in Israel and Jerusalem. The people of Judah did not respect the Temple that the Lord loves. The men of Judah married the women who worship foreign gods. "},{"num":12,"verse":"The man who does this might bring offerings to the Lord of heaven’s armies. But the Lord will still separate him from the community of Israel."},{"num":13,"verse":"This is another thing you do. You cover the Lord’s altar with your tears. You cry and moan because the Lord does not accept your offerings. He is not pleased with what you bring. "},{"num":14,"verse":"You ask, “Why?” It is because the Lord sees how you treated the wife you married when you were young. You broke your promise with her. She was your partner. You promised yourself to her. "},{"num":15,"verse":"God made husbands and wives to become one body and one spirit for his purpose. This is so they would have children who are true to God. So be careful. Do not break your promise with the wife you married when you were young."},{"num":16,"verse":"The Lord God of Israel says, “I hate divorce. And I hate people who do cruel things as easily as they put on clothes,” says the Lord of heaven’s armies. So be careful. And do not break your trust."},{"header":"The Special Day of Judging"},{"num":17,"verse":"You have tired the Lord with what you say."}]