[{"num":2,"verse":"¶ And now, O ye priests, this commandment is for you."},{"num":2,"verse":"If ye will not hear, and if ye will not lay it to heart, to give glory unto my name, said the LORD of the hosts, I will send a curse upon you, and I will curse your blessings; yea, I have cursed them already because ye do not lay it to heart."},{"num":3,"verse":"Behold, I reprehend your seed and spread the dung upon your faces, even the dung of your solemnities; and ye shall be removed with it."},{"num":4,"verse":"And ye shall know that I have sent this commandment unto you, that my covenant might be with Levi, said the LORD of the hosts."},{"num":5,"verse":"My covenant was with him of life and peace; and I gave them to him for the fear with which he feared me and was broken before my name."},{"num":6,"verse":"The law of truth was in his mouth, and iniquity was not found in his lips: he walked with me in peace and righteousness and turned many away from iniquity."},{"num":7,"verse":"For the priest’s lips keep wisdom, and they seek the law at his mouth; for he is an angel of the LORD of the hosts."},{"num":8,"verse":"But ye are departed out of the way; ye have caused many to stumble in the law; ye have corrupted the covenant of Levi, said the LORD of the hosts."},{"num":9,"verse":"Therefore I have also made you contemptible and base before all the people, according as ye have not kept my ways, but have been partial in the law."},{"num":10,"verse":"¶ Have we not all one father? has not one God created us? why do we despise each man his brother by breaking the covenant of our fathers?"},{"num":11,"verse":"Judah has dealt treacherously, and an abomination has been committed in Israel and in Jerusalem; for Judah has profaned the holiness of the LORD by loving and marrying the daughter of a strange god."},{"num":12,"verse":"The LORD will cut off the man that does this, the master and the scholar out of the tabernacles of Jacob and him that offers an offering unto the LORD of the hosts."},{"num":13,"verse":"And once again ye shall cover the altar of the LORD with tears, with weeping, and with crying out, for I shall not even look at the offering any more to receive a free will offering from your hand."},{"num":14,"verse":"Yet ye say, Why? Because the LORD has been witness between thee and the wife of thy youth, against whom thou hast dealt treacherously; yet she is thy companion and the wife of thy covenant."},{"num":15,"verse":"And did he not make one, having in himself abundance of the Spirit? And why one? That he might seek offspring of God. Therefore take heed to your spirit and let no one deal treacherously against the wife of his youth."},{"num":16,"verse":"He that rejects her, sending her away, said the LORD God of Israel, covers the violence with his garment, said the LORD of the hosts; therefore take heed in your spirit, and do not be treacherous."},{"num":17,"verse":"Ye have wearied the LORD with your words. Yet ye say, In what have we wearied him? When ye say, Every one that does evil pleases the LORD, and he delights in them; or, Where is the God of judgment?"}]