[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:22-40 Christ largely insisted upon this caution not to give way to disquieting, perplexing cares, Mt 6:25-34. The arguments here used are for our encouragement to cast our care upon God, which is the right way to get ease. As in our stature, so in our state, it is our wisdom to take it as it is. An eager, anxious pursuit of the things of this world, even necessary things, ill becomes the disciples of Christ. Fears must not prevail; when we frighten ourselves with thoughts of evil to come, and put ourselves upon needless cares how to avoid it. If we value the beauty of holiness, we shall not crave the luxuries of life. Let us then examine whether we belong to this little flock. Christ is our Master, and we are his servants; not only working servants, but waiting servants. We must be as men that wait for their lord, that sit up while he stays out late, to be ready to receive him. In this Christ alluded to his own ascension to heaven, his coming to call his people to him by death, and his return to judge the world. We are uncertain as to the time of his coming to us, we should therefore be always ready. If men thus take care of their houses, let us be thus wise for our souls. Be ye therefore ready also; as ready as the good man of the house would be, if he knew at what hour the thief would come.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:42-51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second watch - See the notes at Matthew 14:25. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Second watch - See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "38. second … third watch—To find them ready to receive Him at any hour of day or night, when one might least of all expect Him, is peculiarly blessed. A servant may be truly faithful, even though taken so far unawares that he has not everything in such order and readiness for his master's return as he thinks is due to him, and both could and would have had if he had had notice of the time of his coming, and so may not be willing to open to him \"immediately,\" but fly to preparation, and let his master knock again ere he admit him, and even then not with full joy. A too common case this with Christians. But if the servant have himself and all under his charge in such a state that at any hour when his master knocks, he can open to him \"immediately,\" and hail his \"return\"—that is the most enviable, \"blessed\" servant of all.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 12:37\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Be ye therefore ready also,.... Not habitually, but actually, in the exercise of grace, and the discharge of duty, with loins girt, and lights burning. This may be understood either of a readiness to meet the Lord in the way of his judgments, and particularly the destruction of Jerusalem, which was to be in a few years; or of a preparation for death, and the last judgment, which lies in the righteousness of Christ imputed, and his grace imparted: and to have a comfortable view of the one, and a gracious experience of the other, as they will engage to the performance of good works, to which such are ready; so they make meet for the coming of Christ, be it in what way, and whensoever it will: and the rather, a concern should be had for such a preparation, because of the following reason, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the son of man cometh at an hour when ye think not; in either of the above ways; See Gill on Matthew 24:44. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for the son of man cometh at an hour when ye think not; in either of the above ways; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{12} Be ye therefore ready also: for the Son of man cometh at an hour when ye think not.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{12}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Be ye therefore ready also: for the Son of man cometh at an hour when ye think not.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(12) None need to watch more than they that have some degree of honour in the household of God.",
        "children": []
      }
    ]
  }
]