[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(41) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then Peter said unto him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The motive of Peter’s question is not given. Interpreted by the like question in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 19:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (where see Note), it is natural to suppose that he dwelt, not so much on the last words of warning, as on the greatness of the promise which is held out in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Was that to be the common blessing of all believers, or the special reward of those who had forsaken all?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 12:41-44",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:41-44",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Peter said, Lord, speakest thou this parable to us ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who are thy constant followers, to us who are ministers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or even to all — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That come to be taught by thee, to all the hearers, and, in them, to all Christians? Peter, it appears, had been giving close attention to the whole of Christ’s discourse, and saw it to be very important; out was at a loss to know whether the latter part of it, namely, the parable of the watching servants, was spoken to the multitude in general, and therefore to all that should hereafter become Christ’s followers, or to the apostles in particular. He therefore begged his master to satisfy him as to that point. He knew indeed that the parable was addressed to all the disciples, but it contained instructions which Peter thought might be peculiarly designed for the twelve. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord said, Who, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Our Lord, in his answer to Peter’s inquiry, shows that, though his exhortations were directed to all, they more especially concerned those who were, or hereafter should be, intrusted with the care of the souls of others, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who then is that faithful and wise steward,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c. — The sense of the word is, “What do you think ought to be the character and conduct of a steward to whom his lord commits the care of his family in his absence, as I do the care of my church to you? Why, certainly, he should be both ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to know in what manner to govern the family, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "faithful ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in executing whatever his wisdom and prudence direct as fit to be done; for thus only all the members of the family under his care will have due provision made for them.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Blessed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μακαριος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "happy, is that servant, whom his Lord when he cometh shall find so doing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To complete the character of such a steward, he must never remit his care and diligence, that so, at whatever time his Lord returns, he may find him employed in the prudent and faithful discharge of the duties of his office. If this be the case, such a servant shall be happy, not only in the consciousness of doing his duty well, but in the rewards and honours which his lord will bestow upon him. Here we see the unspeakable importance of a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "patient continuance in well-doing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The servant spoken of is supposed to be now ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wise, faithful, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "happy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "yet our Lord’s words imply that he might become the reverse of all this, and perish for ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I say unto you, That he will make him ruler, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He will commit the management of his whole estate to him; a trust which such a servant merits by the prudence, faithfulness, and diligence which he showed as steward of the household.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:41-53 All are to take to themselves what Christ says in his word, and to inquire concerning it. No one is left so ignorant as not to know many things to be wrong which he does, and many things to be right which he neglects; therefore all are without excuse in their sin. The bringing in the gospel dispensation would occasion desolations. Not that this would be the tendency of Christ's religion, which is pure, peaceable, and loving; but the effect of its being contrary to men's pride and lusts. There was to be a wide publication of the gospel. But before that took place, Christ had a baptism to be baptized with, far different from that of water and the Holy Spirit. He must endure sufferings and death. It agreed not with his plan to preach the gospel more widely, till this baptism was completed. We should be zealous in making known the truth, for though divisions will be stirred up, and a man's own household may be his foes, yet sinners will be converted, and God will be glorified.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:42-51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Second watch - See the notes at Matthew 14:25. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Second watch - See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41-48. unto us or even to all?—us the Twelve, or all this vast audience?",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 41-48. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 24:45\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and following verses to ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 24:51",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where we met with the same parable, but here expressed more largely, and with more circumstances. Matthew hath not the introduction to it which we have here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 12:41",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:41",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It was occasioned from Peter’s saying to Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lord, speakest thou this parable unto us, or unto all?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Doth this duty of watchfulness concern all thy disciples, or only us, that are thine apostles, the ministers of thy gospel? The substance of what our Lord saith in answer to Peter, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 12:42-48",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:42-48",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", is, Peter, I spake it to all, I have not the meanest hearer but is concerned to watch against my coming; but you that are ministers of my gospel are most eminently concerned. Others are concerned, upon the pain of eternal damnation, to have the loins of their understandings girt about with truth, the loins of their minds girt with sobriety and hope, to have their lights burning, to be every way and always ready, watching against sin, abstaining from it, and industriously keeping themselves from any obedience to their lusts, in a prospect of my coming to judgment. But you that are to be ministers are more highly concerned than others. You are the rulers of my household, the stewards of my mysteries, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 4:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 4:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; your work is to give the rest of my people ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their portion of meat in due season; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " if you faithfully do this, you shall be blessed, holding on in doing of it to your lives end, so as your Lord find you so doing. But if any of you shall be found, who out of any atheistical principles, not in heart believing what you preach to others, but saying, either that I will not come, or not so soon but you may sleep awhile, and wake time enough to prepare for my coming; if they who should be examples to my flock, and are the rulers over them, shall give reins to their lusts, and eat with the gluttons, and drink with the drunkards; if they who should feed my flock, shall fail to the worrying of it, instead of feeding, beating my men servants and maidens; the Lord will not spare them long, but be upon them before they are aware, kai dicotomhsei, and cut them to pieces, (the word signifies to divide into two parts), as those nations were wont to serve the vilest transgressors, traitors, and rebels, and violaters of their covenants; they shall be most severely dealt withal, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 12:47",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 12:47",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be beaten with many stripes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because they knew their Master’s will, and did it not. Ignorance of the Divine will not wholly excuse the sinner, he shall be beaten, but his stripes shall be few, his damnation shall be gentle compared with a minister’s, that knows his Master’s will, but doth it not; teacheth it to others, but doth it not himself. Our Saviour further tells them, that this just judgment of God upon lewd and scandalous ministers, is justified by the ordinary practice of men, who require much where they give much, and ask milch of those to whom they have committed great trusts. God looks upon wicked, loose, and scandalous and mischievous ministers as the greatest transgressors, and he will deal with them as such. There will be degrees in the punishment as well as in the rewards of another life. Such persons as have taken upon them to be the rulers of Christ’s household, the stewards of his mysteries, if they be vile and wicked, if they be not faithful in giving the servants of Christ’s household their portion in its season, must expect the deepest place in the bottomless pit: they know more than others, they have more committed to their trust than others, their examples do more harm than others, their sins are greater than others, and the fiery furnace will for them be heated over seven times. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then Peter said unto him, Lord,.... The Syriac, Persic, and Ethiopic versions read, \"our Lord\": ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "speakest thou this parable: of the master at the wedding, and his servants waiting for him, or of the housekeeper watching that his house be not broken up, or both: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "unto us, or unto all? Peter was in doubt whether the above discourse was peculiarly directed to them, the apostles, as containing special instructions to them in the discharge of the ministerial work; or whether it was designed for all his disciples and followers, both in the present age, and in time to come, to the end of the world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "unto us, or unto all? Peter was in doubt whether the above discourse was peculiarly directed to them, the apostles, as containing special instructions to them in the discharge of the ministerial work; or whether it was designed for all his disciples and followers, both in the present age, and in time to come, to the end of the world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Peter said unto him, Lord, speakest thou this parable unto us, or even to all?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Certainly original (in opposition to de Wette, Holtzmann, Weizsäcker, Weiss), the more certainly, the finer are the threads with which what follows down to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is linked on to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "such",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a question. The succeeding passage at least offered no ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "occasion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for either the tradition or Luke inventing ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " question. If it had been suggested to Luke by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 13:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the answer of Jesus would also have been in closer agreement with the meaning of the passage in Mark.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πρός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in reference to, for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " us, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 20:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν παραβ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ταύτ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] to wit, of the slaves who wait for their lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. The reference to the master of the house and the thief, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", belonged also thereto as a concrete warning example.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἢ καί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Peter asks whether the parable is intended for the disciples, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "or also",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or at the same time also) has a general reference.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:41-46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A question by Peter and a reply",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:45-51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Some look on Peter’s question as a literary device of the evangelist either to connect his material (Weiss in Meyer; x. 29, xi. 45 cited as similar instances), or to give what follows a special relation to the Apostles and to Peter as their head (Holtzmann, H. C., the passage thus becoming in his view a substitute for ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:18-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then Peter said unto him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Peter’s intercourse with his Lord seems to have been peculiarly frank and fearless, in accordance with his character. In the immaturity of the disciples we may suppose that the blessing on the faithful servants mainly prompted his question. But if so the lesson of our Lord was by no means lost on him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and passim.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἡμᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the apostles, and disciples.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even, also",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we not being excluded. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [where His discourse is restricted to the disciples].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πάντας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") viz. all then present. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 41.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then Peter said unto him, Lord, speakest thou this parable unto us, or even to all?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Peter's question here referred evidently to the longer and more important parable-story, where the reward which the faithful watchers were to receive is mentioned (ver. 37). The grandeur of that reward seems deeply to have impressed the impulsive apostle. Some true conception of the heaven-life had entered into Peter's mind; we know, too, that now and again dimly Peter seemed to grasp the secret of his Master's awful Divinity. What meant, then, thought the faithful, loving man, the figure in the parable of the lord? Who was that lord - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "himself serving",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his faithful followers? The same curious perplexity evidently passed through Peter's mind when, on the evening before the death, in a symbol-act the Master repeated the words of the great promise made here, and washed his disciples' feet. Then we read how Peter said to him, \"Lord, dost ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thou",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " wash ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " feet?\" Were ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who followed Jesus to share in that strange, mighty promise; or only a few, such as Peter and his companions, called for a special purpose? Luke 12:41",
        "children": []
      }
    ]
  }
]