[{"header":"The Workers in the Vineyard"},{"num":20,"verse":"“The Kingdom of heaven is like this. Once there was a man who went out early in the morning to hire some men to work in his vineyard. "},{"num":2,"verse":"He agreed to pay them the regular wage, a silver coin a day, and sent them to work in his vineyard. "},{"num":3,"verse":"He went out again to the marketplace at nine o'clock and saw some men standing there doing nothing, "},{"num":4,"verse":"so he told them, ‘You also go and work in the vineyard, and I will pay you a fair wage.’ "},{"num":5,"verse":"So they went. Then at twelve o'clock and again at three o'clock he did the same thing. "},{"num":6,"verse":"It was nearly five o'clock when he went to the marketplace and saw some other men still standing there. ‘Why are you wasting the whole day here doing nothing?’ he asked them. "},{"num":7,"verse":"‘No one hired us,’ they answered. ‘Well, then, you go and work in the vineyard,’ he told them."},{"num":8,"verse":"“When evening came, the owner told his foreman, ‘Call the workers and pay them their wages, starting with those who were hired last and ending with those who were hired first.’ "},{"num":9,"verse":"The men who had begun to work at five o'clock were paid a silver coin each. "},{"num":10,"verse":"So when the men who were the first to be hired came to be paid, they thought they would get more; but they too were given a silver coin each. "},{"num":11,"verse":"They took their money and started grumbling against the employer. "},{"num":12,"verse":"‘These men who were hired last worked only one hour,’ they said, ‘while we put up with a whole day's work in the hot sun—yet you paid them the same as you paid us!’ "},{"num":13,"verse":"‘Listen, friend,’ the owner answered one of them, ‘I have not cheated you. After all, you agreed to do a day's work for one silver coin. "},{"num":14,"verse":"Now take your pay and go home. I want to give this man who was hired last as much as I gave you. "},{"num":15,"verse":"Don't I have the right to do as I wish with my own money? Or are you jealous because I am generous?’”"},{"num":16,"verse":"And Jesus concluded, “So those who are last will be first, and those who are first will be last.”"},{"header":"Jesus Speaks a Third Time about His Death(C)"},{"num":17,"verse":"As Jesus was going up to Jerusalem, he took the twelve disciples aside and spoke to them privately, as they walked along. "},{"num":18,"verse":"“Listen,” he told them, “we are going up to Jerusalem, where the Son of Man will be handed over to the chief priests and the teachers of the Law. They will condemn him to death "},{"num":19,"verse":"and then hand him over to the Gentiles, who will make fun of him, whip him, and crucify him; but three days later he will be raised to life.”"},{"header":"A Mother's Request(D)"},{"num":20,"verse":"Then the wife of Zebedee came to Jesus with her two sons, bowed before him, and asked him for a favor."},{"num":21,"verse":"“What do you want?” Jesus asked her."},{"num":22,"verse":"“You don't know what you are asking for,” Jesus answered the sons. “Can you drink the cup of suffering that I am about to drink?”"},{"num":23,"verse":"“You will indeed drink from my cup,” Jesus told them, “but I do not have the right to choose who will sit at my right and my left. These places belong to those for whom my Father has prepared them.”"},{"num":24,"verse":"When the other ten disciples heard about this, they became angry with the two brothers. "},{"num":25,"verse":"So Jesus called them all together and said, “You know that the rulers of the heathen have power over them, and the leaders have complete authority. "},{"num":26,"verse":"This, however, is not the way it shall be among you. If one of you wants to be great, you must be the servant of the rest; "},{"num":27,"verse":"and if one of you wants to be first, you must be the slave of the others— "},{"num":28,"verse":"like the Son of Man, who did not come to be served, but to serve and to give his life to redeem many people.”"},{"header":"Jesus Heals Two Blind Men(G)"},{"num":29,"verse":"As Jesus and his disciples were leaving Jericho, a large crowd was following. "},{"num":30,"verse":"Two blind men who were sitting by the road heard that Jesus was passing by, so they began to shout, “Son of David! Have mercy on us, sir!”"},{"num":31,"verse":"The crowd scolded them and told them to be quiet. But they shouted even more loudly, “Son of David! Have mercy on us, sir!”"},{"num":32,"verse":"Jesus stopped and called them. “What do you want me to do for you?” he asked them."},{"num":33,"verse":"“Sir,” they answered, “we want you to give us our sight!”"},{"num":34,"verse":"Jesus had pity on them and touched their eyes; at once they were able to see, and they followed him."}]