[{"header":"The Picture-Story of the Workmen in the Grape-Field"},{"num":20,"verse":"“For the holy nation of heaven is like the owner of a grape-field. He went out early in the morning to hire workmen to work in his grape-field. "},{"header":"Jesus Tells of His Death the Third Time (A)"},{"num":17,"verse":"As Jesus was going up to Jerusalem, He talked also to the twelve followers by the side of the road. He said, "},{"num":18,"verse":" “Listen! We are going up to Jerusalem. The Son of Man will be handed over to the religious leaders and to the teachers of the Law. They will say that He must be put to death. "},{"header":"The Mother of James and John Asks Jesus Something Hard (B)"},{"num":20,"verse":"The mother of Zebedee’s children (James and John) came to Jesus with her sons. She got down on her knees before Jesus to ask something of Him. "},{"num":21,"verse":"He said to her, “What do you want?” She said, “Say that my two sons may sit, one at Your right side and one at Your left side, when You are King.” "},{"num":22,"verse":"Jesus said to her, “You do not know what you are asking. Are you able to take the suffering that I am about to take? (*Are you able to be baptized with the baptism that I am baptized with?)” They said, “Yes, we are able.” "},{"num":23,"verse":"He said to them, “You will suffer as I will suffer. But the places at My right side and at My left side are not Mine to give. Whoever My Father says will have those places.”"},{"num":24,"verse":"The other ten followers heard this. They were angry with the two brothers. "},{"num":25,"verse":"Jesus called them to Him and said, “You know how the kings of the nations show their power to the people. Important leaders use their power over the people. "},{"header":"The Healing of the Blind Men (C)"},{"num":29,"verse":"As they went away from the city of Jericho, many people followed Him. "},{"num":30,"verse":"Two blind men were sitting by the side of the road. They called out when they heard that Jesus was going by. They said, “Lord, take pity on us, Son of David!” "},{"num":31,"verse":"Many people spoke sharp words to them. They told the blind men not to call out. But they called all the more, “Lord! Take pity on us, Son of David!” "},{"num":32,"verse":"Jesus stopped and called them. He asked, “What do you want Me to do for you?” "},{"num":33,"verse":"The blind men said to Jesus, “Lord, we want our eyes opened!” "},{"num":34,"verse":"Jesus had loving-pity on them and put His hands on their eyes. At once they could see, and they followed Jesus."}]