[{"header":"A Parable of Workers in the Vineyard"},{"num":20,"verse":"“This will help you understand the way heaven’s kingdom operates:"},{"num":2,"verse":"After agreeing to pay them the standard day’s wage, he put them to work. "},{"num":3,"verse":"Then at nine o’clock, as he was passing through the town square, he found others standing around without work. "},{"num":4,"verse":"He told them, ‘Come and work for me in my vineyard and I’ll pay you a fair wage.’ "},{"num":5,"verse":"So off they went to join the others. He did the same thing at noon and again at three o’clock, making the same arrangement as he did with the others."},{"num":6,"verse":"“Hoping to finish his harvest that day, he went to the town square again at five o’clock and found more who were idle. So he said to them, ‘Why have you been here all day without work?’"},{"num":7,"verse":"“ ‘Because no one hired us,’ they answered."},{"num":8,"verse":"“When evening came, the owner of the vineyard went to his foreman and said, ‘Call in all the laborers, line them up, and pay them the same wages, starting with the most recent ones I hired and finishing with the ones who worked all day.’"},{"num":9,"verse":"“When those hired late in the day came to be paid, they were given a full day’s wage. "},{"num":10,"verse":"And when those who had been hired first came to be paid, they were convinced that they would receive more. But everyone was paid the standard wage. "},{"num":11,"verse":"When they realized what had happened, they were offended and complained to the landowner, saying, "},{"num":12,"verse":"‘You’re treating us unfairly! They’ve only worked for one hour while we’ve labored and sweated all day under the scorching sun. You’ve made them equal to us!’"},{"num":13,"verse":"“The landowner replied, ‘Friends, I’m not being unfair—I’m doing exactly what I said. Didn’t you agree to work for the standard wage? "},{"num":14,"verse":"If I want to give those who only worked for an hour equal pay, what does that matter to you? "},{"num":15,"verse":"Don’t I have the right to do what I want with what is mine? Why should my generosity make you jealous of them?’"},{"num":16,"verse":"“Now you can understand what I meant when I said that the first will end up last and the last will end up being first. Everyone is invited, but few are the chosen.”"},{"header":"Jesus Again Prophesies His Death"},{"num":17,"verse":"Jesus was about to go to Jerusalem, so he took his twelve disciples aside privately and said to them, "},{"num":18,"verse":"“Listen to me. We’re on our way to Jerusalem, and I need to remind you that the Son of Man will be handed over to the religious leaders and scholars, and they will sentence him to be executed. "},{"num":19,"verse":"And they will hand him over to the Romans to be mocked, tortured, and crucified. Yet three days later he will be raised to life again.”"},{"header":"The Ambition of Jacob and John"},{"num":20,"verse":"The wife of Zebedee approached Jesus with her sons, Jacob and John. She knelt before him and asked him for a favor."},{"num":21,"verse":"He said to her, “What is it that you want?”"},{"num":22,"verse":"Jesus replied, “You don’t know what you are asking.” Then, looking in the eyes of Jacob and John, Jesus said, “Are you prepared to drink from the cup of suffering that I am about to drink? And are you able to endure the baptism into death that I am about to endure?”"},{"num":23,"verse":"“You will indeed drink the cup of my suffering and be immersed into my death,” Jesus told them. “But to be the ones who sit at the place of highest honor is not mine to decide. My Father is the one who chooses them and prepares them.”"},{"num":24,"verse":"The other ten disciples were listening to all of this, and a jealous anger arose among them against the two brothers. "},{"num":25,"verse":"Jesus, knowing their thoughts, called them to his side and said, “Kings and those with great authority in this world rule oppressively over their subjects, like tyrants. "},{"num":26,"verse":"But this is not your calling. You will lead by a completely different model. The greatest one among you will live as the one who is called to serve others, "},{"num":27,"verse":"because the greatest honor and authority is reserved for the one with the heart of a servant. "},{"num":28,"verse":"For even the Son of Man did not come expecting to be served but to serve and give his life in exchange for the salvation of many.”"},{"header":"Two Blind Men Healed"},{"num":29,"verse":"As Jesus left Jericho a huge crowd gathered and followed him. "},{"num":30,"verse":"And there were two blind men sitting on the roadside. When they heard that it was Jesus passing by, they shouted, “Son of David, show us mercy, Lord!” "},{"num":31,"verse":"Those in the crowd scolded them and told them to be quiet. But the blind men shouted even louder, “Jesus, Son of David, show us mercy, Lord!”"},{"num":32,"verse":"So Jesus stopped and had them brought to him. He asked them, “What do you want me to do for you?”"},{"num":33,"verse":"They said, “Lord, we want to see! Heal us!”"},{"num":34,"verse":"Jesus was deeply moved with compassion toward them. So he touched their eyes, and instantly they could see! Jesus said to them, “Your faith has healed you.” And all the people praised God because of this miracle. And the two men became his followers from that day onward."}]