[{"num":8,"verse":"1 After the opening of the seventh seal, 3 the Saints’ prayers are offered up with odors. 6 The seven Angels come forth with trumpets. 7 The four first blow, and fire falleth on the earth, 8 the sea is turned into blood, 10, 11 the waters wax bitter. 12 and the stars are darkened."},{"num":1,"verse":"And when he had opened the seventh seal, there was silence in heaven about half an hour."},{"num":2,"verse":"And I saw the seven Angels, which stood before God, and to them were given seven trumpets."},{"num":3,"verse":"Then another Angel came and stood before the Altar, having a golden censer, and much odors was given unto him, that he should offer with the prayers of all Saints upon the golden Altar, which is before the throne."},{"num":4,"verse":"And the smoke of the odors with the prayers of the Saints, went up before God, out of the Angel’s hand."},{"num":5,"verse":"And the Angel took the censer, and filled it with fire of the Altar, and cast it into the earth, and there were voices, and thunderings, and lightnings, and earthquake."},{"num":6,"verse":"Then the seven Angels, which had the seven trumpets, prepared themselves to blow the trumpets."},{"num":7,"verse":"So the first Angel blew the trumpet, and there was hail and fire mingled with blood, and they were cast into the earth, and the third part of trees was burnt, and all green grass was burnt."},{"num":8,"verse":"And the second Angel blew the trumpet, and as it were a great mountain, burning with fire, was cast into the sea, and the third part of the sea became blood."},{"num":9,"verse":"And the third part of the creatures, which were in the sea, and had life, died, and the third part of ships were destroyed."},{"num":10,"verse":"Then the third Angel blew the trumpet, and there fell a great star from heaven, burning like a torch, and it fell into the third part of the rivers, and into the fountains of waters."},{"num":11,"verse":"And the name of the star is called wormwood: therefore the third part of the waters became wormwood, and many men died of the waters, because they were made bitter."},{"num":12,"verse":"And the fourth Angel blew the trumpet, and the third part of the sun was smitten, and the third part of the moon, and the third part of the stars, so that the third part of them was darkened: and the day was smitten, that the third part of it could not shine, and likewise the night."},{"num":13,"verse":"And I beheld, and heard one Angel flying through the midst of heaven, saying with a loud voice, Woe, woe, woe to the inhabitants of the earth, because of the sounds to come of the trumpet of the three Angels, which were yet to blow the trumpets."}]