[{"num":8,"verse":"And when the SEH, (Lamb, SHEMOT 12:3; YESHAYAH 53:7 Moshiach) opened the chotam hashevi’i (seventh seal), there was silence in Shomayim about half an hour."},{"num":2,"verse":"And I saw the shivat hamalachim (seven angels) who stand before Hashem, and there were given to them shivah shofarot."},{"num":3,"verse":"And another malach came and stood at the Mizbe’ach (altar), having a golden mikteret (fire pan), and there was given to him much ketoret (incense, TEHILLIM 141:2) to offer with the tefillos (prayers) of all the Kadoshim at the golden Mizbe’ach before the Kes (Throne). [SHEMOT 30:1-6]"},{"num":4,"verse":"And the smoke of the ketoret ascended with the tefillos of the Kadoshim out of the hand of the malach (angel) before Hashem. [TEHILLIM 141:2]"},{"num":5,"verse":"And the malach has taken the mikteret and filled it from the eish (fire) of the Mizbe’ach (altar) and he threw it down to ha’aretz, and there were thunders and sounds and lightning and an earthquake. [VAYIKRA 16:12,13]"},{"num":6,"verse":"And the shivat hamalachim (seven angels) having the shiva shofarot prepared themselves that they might sound the shofarot."},{"num":7,"verse":"And harishon sounded his shofar; and there came barad (hail) and eish (fire) having been mingled with dahm and it was thrown to ha’aretz, and a third of ha’aretz was burned up, and a third of the etzim (trees) was burned up and all green grass was burned up. [YECHEZKEL 38:22]"},{"num":8,"verse":"And the malach hasheyni (second angel) sounded his shofar; and as it were a great mountain with eish (fire) burning was thrown into the yam (sea), and a third of the yam became dahm [YIRMEYAH 51:25]"},{"num":9,"verse":"And a third of the living yetzurim hayam (creatures of the sea) died, and a third of the ships were destroyed."},{"num":10,"verse":"And the malach hashlishi (third angel) sounded his shofar; and there fell out of Shomayim a kokhav gadol (great star) blazing as a torch and it fell on a third of the rivers and on the wells of mayim (water). [YESHAYAH 14:12]"},{"num":11,"verse":"And the name of the kokhav (star) is said to be \"Wormwood,\" and a third of the mayim became bitter wormwood, and many of the Bnei Adam died from the mayim because the mayim were made bitter. [YIRMEYAH 9:15, 23:15]"},{"num":12,"verse":"And the malach harevi’i (fourth angel) sounded his shofar; and a third of the shemesh (sun) was struck and a third of the levanah (moon) and a third of the kokhavim (stars), that a third of them might be darkened, and the yom (day) could not appear, and likewise the lailah (night). [SHEMOT 10:21-23; YECHEZKEL 32:7]"},{"num":13,"verse":"And I saw, and I heard one nesher (eagle) flying in midair, saying with a kol gadol (loud voice), Oy, oy, oy to the ones dwelling on ha’aretz (the earth), because of the remaining blasts of the shofar of the shloshet hamalachim (three angels) being about to sound."}]