[{"header":"Chapter 12"},{"num":1,"verse":"The New Life and the True Worship. Therefore, brethren, I implore you by the mercies of God to offer your bodies as a living sacrifice that is holy and acceptable to God—a spiritual act of worship."},{"num":2,"verse":"Do not be conformed to the world, but be transformed by the renewal of your minds, so that you will be able to discern the will of God and to know what is good and acceptable and perfect."},{"num":3,"verse":"Right Use of the Gifts of the One Body. Through the grace that God has bestowed upon me, I advise every one of you not to think of yourself too highly, but to regard yourself objectively, based on the measure of faith that God has granted."},{"num":4,"verse":"For just as in one body we have many parts, and the parts do not all have the same function,"},{"num":5,"verse":"so we, though many, make up one body in Christ, and individually we are all parts of one another."},{"num":6,"verse":"We all have different gifts according to the grace given to us. If it is a gift of prophecy, we should exercise it in proportion to our faith."},{"num":7,"verse":"If it is a gift of ministry, we should engage in serving others. If it is a gift of teaching, we should teach."},{"num":8,"verse":"If it is a gift of exhortation, we should encourage. Whoever gives alms should do so generously; whoever leads should do so conscientiously; whoever performs acts of mercy should do so cheerfully."},{"num":9,"verse":"A Truly Sincere Love. Let your love be sincere. Loathe what is evil and hold fast to what is good."},{"num":10,"verse":"Love one another with genuine affection. Esteem others more highly than yourself."},{"num":11,"verse":"Do not be lacking in zeal, but serve the Lord with spiritual fervor."},{"num":12,"verse":"Be joyful in your hope. Be patient in times of affliction. Persevere in prayer."},{"num":13,"verse":"Contribute to the needs of the saints, and practice hospitality."},{"num":14,"verse":"Bless those who persecute you; bless them and do not curse them."},{"num":15,"verse":"Rejoice with those who rejoice; weep with those who weep."},{"num":16,"verse":"Live in harmony with one another. Do not consider yourself to be better than others, but associate with the lowly, and never be conceited."},{"num":17,"verse":"Do not repay anyone evil for evil. Rather, be concerned about doing what is good in the eyes of all."},{"num":18,"verse":"As much as possible, and to the extent of your ability, live in peace with everyone."},{"num":19,"verse":"Dearly beloved, never seek revenge. Leave that to the time of retribution. For it is written, “Vengeance is mine, says the Lord. I will repay.”"},{"num":20,"verse":"On the contrary,"},{"num":21,"verse":"Do not be conquered by evil, but conquer evil with good."}]