[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As a false divination in their sight.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The divination of the Babylonians seemed false to the Jews, primarily, because they were determined not to believe it; yet, doubtless, there was mingled with this a secret consciousness of the worthlessness of the idolatries which they themselves practised, and a consequent readiness to cast them aside when opposed to their wishes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To them that have sworn oaths.—These words have been very variously interpreted, but the simplest meaning seems the best; the resolution of Nebuchadnezzar to attack Jerusalem seemed impossible to the Jews, because they were his vassals, and under oaths of fidelity to him. They must have been conscious of their own violation of those oaths, and yet have persuaded themselves that their intrigues with Egypt were not known to Nebuchadnezzar, and that therefore he would not attack them.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "To them that have sworn oaths.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—These words have been very variously interpreted, but the simplest meaning seems the best; the resolution of Nebuchadnezzar to attack Jerusalem seemed impossible to the Jews, because they were his vassals, and under oaths of fidelity to him. They must have been conscious of their own violation of those oaths, and yet have persuaded themselves that their intrigues with Egypt were not known to Nebuchadnezzar, and that therefore he would not attack them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But he will call to remembrance the iniquity.—The pronoun is here understood by many as referring to the Lord, and “iniquity” as expressing the general sinfulness of the people. It is better to refer the pronoun to Nebuchadnezzar, who will call to remembrance and punish the violation of their oaths to him. It is constantly to be remembered that Zedekiah was placed upon the throne by him under a solemn oath of fidelity to himself (2Chronicles 36:10; 2Chronicles 36:13; Jeremiah 52:3; Ezekiel 17:15; Ezekiel 17:18, &c).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "But he will call to remembrance the iniquity.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The pronoun is here understood by many as referring to the Lord, and “iniquity” as expressing the general sinfulness of the people. It is better to refer the pronoun ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "to ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Nebuchadnezzar, who will call to remembrance and punish the violation of their oaths to him. It is constantly to be remembered that Zedekiah was placed upon the throne by him under a solemn oath of fidelity to himself (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 36:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 36:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 21:23-24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:23-24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And it shall be as a false divination to them that have sworn oaths — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, the Jews, when they shall hear of it, shall deride and despise it as a vain, lying divination, and so shall consider themselves as being unconcerned in it; and that though they have sworn homage to the king of Babylon, and afterward perfidiously broken their covenant with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But he will call to remembrance the iniquity, that they may be taken",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Nebuchadnezzar will remember Zedekiah’s breach of his oath, and all his and his people’s treacheries, and will avenge himself by taking the city, and making him and his subjects prisoners of war. The form of expression seems to imply that the king of Babylon had had it chiefly in his mind to go against Rabbath; but the divinations all signifying that he should go against Jerusalem, caused him to reflect on the perfidious behaviour of the Jewish nation toward him, and so determined him to take the way to Jerusalem, in order severely to punish the inhabitants of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because ye have made your iniquity to be remembered — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not by yourselves, that it might be repented of, but by me, that it might be punished: because by your open and manifest continuance in your former sinful courses against me, and rebellions against the king of Babylon, you cause both me and him to call your iniquitous conduct to mind, and punish you for it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye shall be taken by the hand — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As birds or beasts, entangled in the net, are easily taken with the hand, so shall you be taken in the easiest manner, and fall into the hands of the king of Babylon, whose anger you have justly provoked.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:18-27 By the Spirit of prophecy Ezekiel foresaw Nebuchadnezzar's march from Babylon, which he would determine by divination. The Lord would overturn the government of Judah, till the coming of Him whose right it is. This seems to foretell the overturnings of the Jewish nation to the present day, and the troubles of states and kingdoms, which shall make way for establishing the Messiah's kingdom throughout the earth. The Lord secretly leads all to adopt his wise designs. And in the midst of the most tremendous warnings of wrath, we still hear of mercy, and some mention of Him through whom mercy is shown to sinful men.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It shalt be unto them - The Jews in their vain confidence shall look upon the hopes gathered from the divinations by the Babylonians as false and groundless.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To them that have sworn oaths - According to some, \"oaths of oaths are theirs;\" i. e., they have the most solemn oaths sworn by God to His people, in these they trust, forgetful of the sin which broke the condition upon which these promises were given. More probably the allusion is to the oaths which the Jews had sworn to Nebuchadnezzar as vassals Ezekiel 17:18-19; therefore they trust he will not attack them, forgetting how imperfectly they had kept their oaths, and that Nebuchadnezzar knew this.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To them that have sworn oaths - According to some, \"oaths of oaths are theirs;\" i. e., they have the most solemn oaths sworn by God to His people, in these they trust, forgetful of the sin which broke the condition upon which these promises were given. More probably the allusion is to the oaths which the Jews had sworn to Nebuchadnezzar as vassals ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 17:18-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; therefore they trust he will not attack them, forgetting how imperfectly they had kept their oaths, and that Nebuchadnezzar knew this.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But he will call to remembrance the iniquity - The king of Babylon will by punishment remind them of their perjury 2 Kings 25:6-7; 2 Chronicles 36:17.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But he will call to remembrance the iniquity - The king of Babylon will by punishment remind them of their perjury ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 36:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. Unto the Jews, though credulous of divinations when in their favor, Nebuchadnezzar's divination \"shall be (seen) as false.\" This gives the reason which makes the Jews fancy themselves safe from the Chaldeans, namely, that they \"have sworn\" to the latter \"oaths\" of allegiance, forgetting that they had violated them (Eze 17:13, 15, 16, 18).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but he, &c.—Nebuchadnezzar will remember in consulting his idols that he swore to Zedekiah by them, but that Zedekiah broke the league [Grotius]. Rather, God will remember against them (Re 16:19) their violating their oath sworn by the true God, whereas Nebuchadnezzar kept his oath sworn by a false god; Eze 21:24 confirms this.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Unto them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Jews, who shall either not believe that Nebuchadnezzar did so consult, or else that it is a vain, false, and lying divination, which will delude him that believes it, but never hurt them who deride it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Them that have sworn oaths; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Zedekiah, his princes, and nobles, who swore allegiance to the king of Babylon first, and afterward conspired with Egypt, and by new and contrary oaths perjured themselves, provoked as well as dishonoured God, and enraged Nebuchadnezzar to revenge their perfidiousness; these perjured persons will contemn all predictions of the prophet, and all the preparations of the king of Babylon. But Nebuchadnezzar will think on, and thoroughly weigh, and impart also to his council, as the ground of his war, the great wickedness of their perjury and rebellion; that both Zedekiah, and the Jews with him, may be subdued, taken captives, and the kingdom overthrown, the city burnt, and they sent into Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it shall be unto them as a false divination in their sight,.... That is, the Jews shall laugh at this divination as a vain thing, as a Heathenish practice, and of which nothing would come; and even at the prophet's account of it, and his prophecy concerning the king of Babylon coming to invade them; they looked upon them all as of a piece, trusting to their false prophets, who assured them that they should not be delivered into his hands: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to them that have sworn oaths; a description of the Jews, who had with their king Zedekiah sworn allegiance to the king of Babylon; which oaths they had violated, taking others to the king of Egypt; or, \"because they were bound by oaths to them\" (s); meaning either the Egyptians, who had bound themselves by oaths to protect the Jews; and therefore they feared nothing from this pretended divination and prophecy, as they judged them to be, though they had not kept faith with the Chaldeans themselves; or the Jews, because of the Egyptians who had entered into an alliance with them, confirmed by oaths; and this had made them secure, on this they depended. The Targum takes the words as if they signified \"seven times seven\"; and gives this strange paraphrase of them, accounting for the vain confidence of the Jews; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and their divinations were lies in their eyes, and the enchantments with which he enchanted them; for they knew not that he had observed forty nine times (i.e. his arrows, images, and liver), and an answer was returned upon the word, till the time came to him in which they should be delivered into his hands:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but he will call to remembrance the iniquity: that is, Nebuchadnezzar would call to mind the perfidy and perjury of the king of Judah, in breaking covenant with him, and violating his oath. Some think that the Chaldeans that were with Nebuchadnezzar were not satisfied at first that it was a true divination that was made, they being set upon the taking of Rabbath first; but Nebuchadnezzar, remembering and putting them in mind of the treachery of Zedekiah, reconciled them to it, and determined them in the expedition against the Jews: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they may be taken; as birds in a snare, or beasts in a net, and be carried captive. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(s)   \"quia obstrieti jurameutis eis suat\", Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s)   \"quia obstrieti jurameutis eis suat\", Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it shall be to them {s} as a false divination in their sight, to them that have sworn oaths: {t} but he will call to remembrance the iniquity, that they may be taken.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And it shall be to them ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{s}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as a false divination in their sight, to them that have sworn oaths: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{t}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but he will call to remembrance the iniquity, that they may be taken.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) Because there was a league between the Jews and the Babylonians, they of Jerusalem will think nothing less than that this thing would come to pass.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) That is, Nebuchadnezzar will remember the rebellion of Zedekiah, and so come on them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to them … sworn oaths",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words are obscure and wanting in LXX., and possibly are not original. Whether a gloss or no their purpose appears to be to explain why Israel considered this divination of the king’s to be false, i.e. believed that he would not besiege or at least capture Jerusalem. The natural sense is: they have those who have sworn oaths (to them), i.e. allies, viz, the Egyptians, &c., who will frustrate and falsify Nebuchadnezzar’s divination. Others: inasmuch as they (Israel) have sworn oaths to them (the Chaldeans). The construction is unnatural, and the sense without relevancy, because Israel had just broken its oath, a thing which Neb. came up to punish (ch. 17). Others still would change the pointing: they have weeks of weeks, i.e. weeks upon weeks—abundance of time to prepare for the siege, a sense feeble in the extreme.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he will call to remembrance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "calleth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The subject is most naturally Nebuchadnezzar, whose presence is an accusation before God of the king and people because of their breaking their allegiance to him (cf. ch. 17). The consequence of this accusation or bringing guilt to remembrance is that they shall be taken, i.e. captured, the city and people, by the foe. It is certainly possible that the clause “sworn oaths” may have been thrown in to explain this idea.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The whole verse is obscure, and has been very variously interpreted. I follow the translation of the Revised Version, and explain it by inserting words which are needed to bring out its meaning: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "It",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (what Nebuchadnezzar has done) ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall be as a vain divination in their sight",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". in that of the men of Jerusalem), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which have sworn unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". have taken oaths of fealty to the Chaldeans, and are ready to take them again), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "but he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Nebuchadnezzar) ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "brings iniquity to remembrance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fact represented is that when the people of Jerusalem heard of the divination at the parting of the ways, they still lulled themselves in a false security. They and Zedekiah had sworn obedience, and that oath would protect them. \"Not so,\" rejoins the prophet; \"the Chaldean king knows how those oaths have been kept.\" The LXX. omits all reference to \"oaths.\" The Vulgate. taking the word for \"oath\" in its ether sense of \"sabbath,\" gives the curious rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Eritque quasi consulens frustra oraculum in eorum oculis, et sabbatorum otium imitans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In spite of the reports that reached them, the men of Jerusalem thought themselves as safe as if the Chaldean king were keeping a sabbath day. Ewald partly follows the Vulgate, and renders, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "They believe they have weeks on weeks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". will not believe that the danger is close at hand. Keil and Havernick: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Oaths of oaths are theirs",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". they count on the oath of Jehovah, on his promises of protection, but he (Jehovah) brings iniquity to remembrance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That they may be taken",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". be seized by the invader and either slain or made prisoners Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This announcement will appear to the Judaeans, indeed, to be a deceptive divination, but nevertheless it will be verified. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it is like deceptive divination in their eyes; sacred oaths are theirs (lit., to them); but he brings the iniquity to remembrance, that they may be taken. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore thus saith the Lord Jehovah, Because ye bring your iniquity to remembrance, in that your offences are made manifest, so that your sins appear in all your deeds, because ye are remembered ye shall be taken with the hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And thou pierced one, sinner, prince of Israel, whose day is come at the time of the final transgression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith the Lord Jehovah, The turban will be removed, the crown taken off. This is not this; the low will be lifted up, and the lofty lowered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Overthrown, overthrown, overthrown will I make it; even this shall not be, till He cometh, to whom is the right, to Him do I give it. - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (28), להם, which is more precisely defined by בּעיניהם, refers to the Israelites, i.e., the Judaeans. This also applies to the following להם, which cannot possibly be taken as referring to a different subject, say, for example, the Chaldeans. It is evident, therefore, that it is impossible to sustain the rendering given in Gesenius' Thesaurus (s.v.) to the obscure words שׁבעי שׁבעות, viz., qui juramenta jurarunt eis (sc., Chaldaeis), which Maurer has modified and expounded thus: \"they will not fear these auguries; they will swear oaths to them (the Chaldeans), that is to say, according to their usual custom, these truce-breakers will take fresh oaths, hoping that the Chaldeans will be conciliated thereby.\" Moreover, the thought itself is an unsuitable one, inasmuch as \"the defiant attitude of confidence with which they looked such awfully threatening danger in the face must have had some other ground than a reliance upon false oaths and Chaldean credulity\" (Hvernick). The common explanation, which Rosenmller and Kliefoth uphold, is, \"because the Chaldeans are sworn allies, sworn confederates of theirs;\" or as Kliefoth explains it, \"on account of the oath of fealty or vassalage sworn by Zedekiah to Nebuchadnezzar, they have sworn confederates in the Chaldeans, and relying upon this, they are confident that they have no hostile attack to fear from them.\" But this is altogether untenable, not only because it is perfectly arbitrary to supply \"the Chaldeans,\" but still more for the reason adduced by Maurer. \"How,\" he justly asks, \"could the Judaeans despise these auguries because the Chaldeans were bound to them by an oath when they themselves had broken faith? When a treaty has been violated by one party, is not the other released from his oath?\" We therefore adopt the same explanation as Hvernick: \"oaths of oaths are theirs (to them), i.e., the most sacred oaths are (made) to them, namely, by God.\" They rely upon that which God has solemnly sworn to them, without considering upon what this promise was conditional, namely, upon a faithful observance on their part of the commandments of God. For the fact itself, compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and such passages as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., etc. The form שׁבעי by the side of שׁבעות may be explained in a very simple way from the relation of the construct state, i.e., from the endeavour to secure an obvious form for the construct state, and cannot in any case furnish a well-founded argument against the correctness of our explanation. As Ezekiel uses נפשׁים for נפשׁות in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he may also have formed שׁבעים (שׁבעי) by the side of שׁבעות. - As they rely upon the promises of God without reflecting upon their own breach of covenant, God will bring their sin to remembrance through His judgment. והוּא is Jehovah, upon whose oaths they rely. עון must not be restricted to Zedekiah's breach of covenant, since ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " clearly shows that it is the wrong-doing of Judah generally. להתּפשׂ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (29) is also to be understood of the whole nation, which is to be taken and punished by the king of Babylon. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (29) introduces the reason for the statement made in the last clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (28). God must put the people in remembrance of their iniquity by inflicting punishment, because they have called it to remembrance by sins committed without any shame, and thereby have, so to speak, compelled God to remember them, and to cause the sinners to be grasped by the hand of the slayer. הזכּיר עון is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (29) in a different sense from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (28), and is therefore explained by 'בּהגּלות. בּכּף, which is indefinite in itself, points back to יד הורג in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (16), and receives from that its more exact definition.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With Ezekiel 21:25 the address turns to the chief sinner, the godless King Zedekiah, who was bringing the judgment of destruction upon the kingdom by his faithless breach of oath. The words חלל, רשׁע, and 'נשׂיא ישׂ are asyndeta, co-ordinate to one another. חלל does not mean profane or infamous (βέβηλε, lxx), but simply pierced, slain. This meaning is to be retained here. This is demanded not only by the fixed usage of the language, but also by the relation in which חלל stands both to Ezekiel 21:14 and to חללי רשׁעים in Ezekiel 21:29 (34). It is true that Zedekiah was not pierced by the sword either at that time or afterwards, but was simply blinded and led in captivity to Babylon, where he died. But all that follows from this is, that חלל is used here in a figurative sense, given up to the sword, i.e., to death; and Zedekiah is so designated for the purpose of announcing in a more energetic manner the certainty of his fate. The selection of the term חלל is the more natural, because throughout the whole prophecy the description of the judgment takes its character from the figure of the sword of Jehovah. As God does not literally wield a sword, so חלל is no proof of actual slaying with the sword. יומו .dro, his day, is the day of his destruction (cf. 1 Samuel 26:10), or of the judgment upon him. The time of the final transgression is not the time when the transgression reaches its end, i.e., its completion, but the time when the wickedness brings the end, i.e., destruction (cf. Ezekiel 35:5, and for קץ in this sense, Ezekiel 7:2-3). The fact that the end, the destruction, is come, i.e., is close at hand, is announced in Ezekiel 21:26 to the prince, and in his person to the whole nation. If we understand the connection in this way, which is naturally suggested by Ezekiel 21:25, we get rid of the objection, which led Kliefoth to question the fact that it is the king who is addressed in Ezekiel 21:25, and to take the words as collective, \"ye slaughtered sinners, princes of Israel,\" and to understand them as referring to the entire body of rulers, including the priests, - an explanation that is completely upset by the words נשׂיא... אתּה (thou...prince), which are so entirely opposed to the collective view. Again, the remark that \"what follows in Ezekiel 21:26, viz., the statement to be made to the נשׂיא, has really nothing to do with him, since the sweeping away of the priesthood did not affect Zedekiah personally\" (Kliefoth), is neither correct nor conclusive. For Ezekiel 21:26 contains an announcement not only of the abrogation of the priesthood, but also of the destruction of the kingdom, which did affect Zedekiah both directly and personally. Moreover, we must not isolate the king addressed, even as an individual, from the position which he occupied, or, at any rate, which he ought to have occupied as a theocratic monarch, so as to be able to say that the abrogation of the priesthood did not affect him. The priesthood was one of the fundamental pillars of the theocracy, the removal of which would necessarily be followed by the collapse of the divine state, and therefore by the destruction of the monarchy. Hence it is that the abolition of the priesthood is mentioned first. The infinitives absolute (not imperatives) הסיר and הרים are selected for the purpose of expressing the truth in the most emphatic manner; and the verbs are synonymous. הרים, to lift up, i.e., not to elevate, but to take away, to abolish, as in Isaiah 57:14; Daniel 8:11. מצנפת does not mean the royal diadem, like צניף in Isaiah 62:3, but the tiara of the high priest, as it does in every instance in the Pentateuch, from which Ezekiel has taken the word. העטרה, the king's crown. The diadem of the priest and the regal crown are the insignia of the offices of high priest and king; and consequently their removal is the abolition of both high-priesthood and monarchy. These words contain the sentence of death upon the theocracy, of which the Aaronic priesthood and the Davidic monarchy constituted the foundations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the address turns to the chief sinner, the godless King Zedekiah, who was bringing the judgment of destruction upon the kingdom by his faithless breach of oath. The words חלל, רשׁע, and 'נשׂיא ישׂ are asyndeta, co-ordinate to one another. חלל does not mean profane or infamous (βέβηλε, lxx), but simply pierced, slain. This meaning is to be retained here. This is demanded not only by the fixed usage of the language, but also by the relation in which חלל stands both to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to חללי רשׁעים in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (34). It is true that Zedekiah was not pierced by the sword either at that time or afterwards, but was simply blinded and led in captivity to Babylon, where he died. But all that follows from this is, that חלל is used here in a figurative sense, given up to the sword, i.e., to death; and Zedekiah is so designated for the purpose of announcing in a more energetic manner the certainty of his fate. The selection of the term חלל is the more natural, because throughout the whole prophecy the description of the judgment takes its character from the figure of the sword of Jehovah. As God does not literally wield a sword, so חלל is no proof of actual slaying with the sword. יומו .dro, his day, is the day of his destruction (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or of the judgment upon him. The time of the final transgression is not the time when the transgression reaches its end, i.e., its completion, but the time when the wickedness brings the end, i.e., destruction (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 35:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and for קץ in this sense, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 7:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The fact that the end, the destruction, is come, i.e., is close at hand, is announced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the prince, and in his person to the whole nation. If we understand the connection in this way, which is naturally suggested by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we get rid of the objection, which led Kliefoth to question the fact that it is the king who is addressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and to take the words as collective, \"ye slaughtered sinners, princes of Israel,\" and to understand them as referring to the entire body of rulers, including the priests, - an explanation that is completely upset by the words נשׂיא... אתּה (thou...prince), which are so entirely opposed to the collective view. Again, the remark that \"what follows in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", viz., the statement to be made to the נשׂיא, has really nothing to do with him, since the sweeping away of the priesthood did not affect Zedekiah personally\" (Kliefoth), is neither correct nor conclusive. For ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contains an announcement not only of the abrogation of the priesthood, but also of the destruction of the kingdom, which did affect Zedekiah both directly and personally. Moreover, we must not isolate the king addressed, even as an individual, from the position which he occupied, or, at any rate, which he ought to have occupied as a theocratic monarch, so as to be able to say that the abrogation of the priesthood did not affect him. The priesthood was one of the fundamental pillars of the theocracy, the removal of which would necessarily be followed by the collapse of the divine state, and therefore by the destruction of the monarchy. Hence it is that the abolition of the priesthood is mentioned first. The infinitives absolute (not imperatives) הסיר and הרים are selected for the purpose of expressing the truth in the most emphatic manner; and the verbs are synonymous. הרים, to lift up, i.e., not to elevate, but to take away, to abolish, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 57:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". מצנפת does not mean the royal diadem, like צניף in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but the tiara of the high priest, as it does in every instance in the Pentateuch, from which Ezekiel has taken the word. העטרה, the king's crown. The diadem of the priest and the regal crown are the insignia of the offices of high priest and king; and consequently their removal is the abolition of both high-priesthood and monarchy. These words contain the sentence of death upon the theocracy, of which the Aaronic priesthood and the Davidic monarchy constituted the foundations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They predict not merely a temporary, but a complete abolition of both offices and dignities; and their fulfilment took place when the kingdom of Judah was destroyed by the king of Babylon. The earthly sovereignty of the house of David was not restored again after the captivity; and the high-priesthood of the restoration, like the second temple, was only a shadowy outline of the glory and essential features of the high-priesthood of Aaron. As the ark with the Shechinah, or the gracious presence of God, was wanting in the temple of Zerubbabel; so were the Urim and Thummim wanting to the high-priesthood, and these were the only means by which the high priest could really carry out the mediation between the Lord and the people. זאת לא זאת .el (this is not this) does not refer to the tiara (mitre) and crown. זאת is neuter, and therefore construed with the masculine היה. This (mitre and crown) will not be this (היה is prophetic), i.e., it will not continue, it will be all over with it (Hvernick, Maurer, and Kliefoth). To this there is appended the further thought, that a general inversion of things will take place. This is the meaning of the words - the low will be lifted up, and the lofty lowered. הגבּהּ and השׁפּיל are infinitives, and are chosen in the same sense as in the first hemistich. The form השּׁפלה, with ה without the tone, is masculine; the ־ה probably serving merely to give greater fulness to the form, and to make it correspond more nearly to הגּבהּ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Hitzig has given a most preposterous exposition of this verse. Taking the words הסיר and הרים as antithetical, in the sense of removing ad exalting or sustaining in an exalted position, and regarding the clauses as questions signifying, \"Shall the high-priesthood be abolished, and the real dignity, on the contrary, remain untouched?\" he finds the answer to these questions in the words זאת לא  (this, not this). They contain, in his opinion, as affirmation of the former and a negation of the latter. But he does not tell us how זאת לא זאת without a verb can possibly mean, \"the former (the abrogation of the high-priesthood) will take place, but the latter (the exaltation of the monarchy) will not occur.\" And, finally, the last clause, \"the low shall be lifted up,\" etc., is said to contain simply a watchword, which is not for the time being to be followed by any result. Such trifling needs no refutation. We simply observe, therefore, that there is no ground for the assertion, that הרים without מן cannot possibly signify to abolish.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This general thought is expressed still more definitely in Ezekiel 21:27. עוּה, which is repeated twice to give greater emphasis to the thought, is a noun derived from עוּה, inversion, overthrow; and the suffix in אשׂימנּהּ points back to זאת in Ezekiel 21:26 (31). This, the existing state, the high-priesthood and the monarch, will I make into destruction, or utterly overthrow. But the following זאת cannot also refer to the tiara and crown, as Kliefoth supposes, on account of the גּם which precedes it. This shows that זאת relates to the thing last mentioned. Even this, the overthrow, shall have no durability; or, as Tanch. has correctly expressed it, neque haec conditio erit durabilis. The following עד־בּא attaches itself not so much to this last clause as to the main thought: overthrow upon overthrow will ensue. The thought is this: \"nowhere is there rest, nowhere security; all things are in a state of flux till the coming of the great Restorer and Prince of peace\" (Hengstenberg). It is generally acknowledged that the words עד־בּא אשׁר־לו המּשׁפּט contain an allusion to Genesis 49:10, עד כּי; and it is only by a false interpretation of the preceding clauses, wrung from the words by an arbitrary alteration of the text, that Hitzig is able to set this connection aside. At the same time, אשׁר־לו המּשׁפּט is of course not to be taken as a philological explanation of the word שׁילה, but is simply a theological interpretation of the patriarchal prophecy, with direct reference to the predicted destruction of the existing relations in consequence of the ungodliness and unrighteousness of the leaders of the theocracy up to that time. המּשׁפּט is not the rightful claim to the mitre and crown, but right in an objective sense, as belonging to God (Deuteronomy 1:17), and entrusted by God to the earthly government as His representative. He then, to whom this right belongs, and to whom God will give it, is the Messiah, of whom the prophets from the time of David onwards have prophesied as the founder and restorer of perfect right on earth (cf. Psalm 72; Isaiah 9:6; Isaiah 42:1; Jeremiah 23:5; Jeremiah 33:17). The suffix attached to נתתּיו is not a dative, but an accusative, referring to משׁפּט (cf. Psalm 72:1). There was no necessity to mention the person again to whom God would give the right, as He had already been designated in the previous expression אשׁר לו. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This general thought is expressed still more definitely in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". עוּה, which is repeated twice to give greater emphasis to the thought, is a noun derived from עוּה, inversion, overthrow; and the suffix in אשׂימנּהּ points back to זאת in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (31). This, the existing state, the high-priesthood and the monarch, will I make into destruction, or utterly overthrow. But the following זאת cannot also refer to the tiara and crown, as Kliefoth supposes, on account of the גּם which precedes it. This shows that זאת relates to the thing last mentioned. Even this, the overthrow, shall have no durability; or, as Tanch. has correctly expressed it, neque haec conditio erit durabilis. The following עד־בּא attaches itself not so much to this last clause as to the main thought: overthrow upon overthrow will ensue. The thought is this: \"nowhere is there rest, nowhere security; all things are in a state of flux till the coming of the great Restorer and Prince of peace\" (Hengstenberg). It is generally acknowledged that the words עד־בּא אשׁר־לו המּשׁפּט contain an allusion to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", עד כּי; and it is only by a false interpretation of the preceding clauses, wrung from the words by an arbitrary alteration of the text, that Hitzig is able to set this connection aside. At the same time, אשׁר־לו המּשׁפּט is of course not to be taken as a philological explanation of the word שׁילה, but is simply a theological interpretation of the patriarchal prophecy, with direct reference to the predicted destruction of the existing relations in consequence of the ungodliness and unrighteousness of the leaders of the theocracy up to that time. המּשׁפּט is not the rightful claim to the mitre and crown, but right in an objective sense, as belonging to God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and entrusted by God to the earthly government as His representative. He then, to whom this right belongs, and to whom God will give it, is the Messiah, of whom the prophets from the time of David onwards have prophesied as the founder and restorer of perfect right on earth (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 33:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The suffix attached to נתתּיו is not a dative, but an accusative, referring to משׁפּט (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). There was no necessity to mention the person again to whom God would give the right, as He had already been designated in the previous expression אשׁר לו. ",
            "children": []
          }
        ]
      }
    ]
  }
]