[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And it shall be no more.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this also shall not be. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "After the emphatic repetition of “over-turn” at the beginning of the verse, it is now added that the condition which follows the overthrow shall not be permanent; “the foundations” shall be put “out of course,” and everything thrown into that condition of flux and change, without permanent settlement, which was so characteristic of the state of Judaea until the coming of Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Until he come whose right it is.—This is generally acknowledged as a reference to Genesis 49:10, “until Shiloh come” even by those who reject the interpretation of Shiloh as meaning “he to whom it belongs.” The promise here made refers plainly both to the priestly and to the royal prerogatives, and a still more distinct foretelling of the union of both in the Messiah may be found in Zechariah 6:12-13. In Him, and in Him alone, will all this confusion and uncertainty come to an end; for, as Ezekiel’s contemporary declared, “His dominion is an everlasting dominion, which shall not pass away, and His kingdom that which shall not be destroyed” (Daniel 7:14).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Until he come whose right it is.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This is generally acknowledged as a reference to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “until Shiloh come” even by those who reject the interpretation of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Shiloh ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as meaning “he to whom it belongs.” The promise here made refers plainly both to the priestly and to the royal prerogatives, and a still more distinct foretelling of the union of both in the Messiah may be found in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 6:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In Him, and in Him alone, will all this confusion and uncertainty come to an end; for, as Ezekiel’s contemporary declared, “His dominion is an everlasting dominion, which shall not pass away, and His kingdom that which shall not be destroyed",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "” ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 21:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will overturn, overturn, overturn it — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By several degrees I will utterly overthrow the kingdom of Judah; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and it shall be no more — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It shall never recover its former lustre and dignity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "until he come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Till the Messiah come to take his kingdom. To the same purpose is Lowth’s paraphrase on the verse: “After that Zedekiah is deprived of his regal authority, there shall be no more kings of that family till Christ come, the King so often foretold and promised, who in due time shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "reign upon the throne of his father David, and of whose kingdom there shall be no end, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:32-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the captivity, some of the priests of the Asmonean race assumed the style and title of kings; but not being of the tribe of Judah, they could have no just right to that honour. The expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whose right it is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "seems to be peculiarly characteristic of the Messiah, who is always spoken of by the prophets as the true and right heir to the throne of David, and as one who was in an eminent manner to inherit the kingdom. His indeed the right was; for him was reserved the kingly dominion, not only over Judea, but the whole earth. The repetition of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "overturn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the beginning of this verse, or, as the Hebrew expression ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עוה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may be more literally rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an overturning, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may probably be intended to predict the repeated subversions which the Jewish state was to undergo in future times, by the Chaldeans, Macedonians, Romans, and many others, and the multiplied destructions of their nation, by which they would be punished for their sins; which subversions and destructions will not come to any happy termination, till they submit to the easy yoke of their long- rejected Messiah, and in humility, faith, and gratitude, accept the salvation which he waits to confer upon them. Nay, and the expression might be intended “to predict all the convulsions in states and kingdoms, which shall make way for the establishment of his kingdom throughout the earth.” — Scott.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:18-27 By the Spirit of prophecy Ezekiel foresaw Nebuchadnezzar's march from Babylon, which he would determine by divination. The Lord would overturn the government of Judah, till the coming of Him whose right it is. This seems to foretell the overturnings of the Jewish nation to the present day, and the troubles of states and kingdoms, which shall make way for establishing the Messiah's kingdom throughout the earth. The Lord secretly leads all to adopt his wise designs. And in the midst of the most tremendous warnings of wrath, we still hear of mercy, and some mention of Him through whom mercy is shown to sinful men.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It shall be no more - Or, \"This also shall not be;\" the present state of things shall not continue: all shall be confusion \"until He come\" to whom the dominion belongs of right. Not Zedekiah but Jeconiah and his descendants were the rightful heirs of David's throne. Through the restoration of the true line was there hope for Judah (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the promised King in whom all power shall rest - the Son of David - Messiah the Prince. Thus the prophecy of destruction ends for Judah in the promise of restoration (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. Literally, \"An overturning, overturning, overturning, will I make it.\" The threefold repetition denotes the awful certainty of the event; not as Rosenmuller explains, the overthrow of the three, Jehoiakim, Jeconiah, and Zedekiah; for Zedekiah alone is referred to.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "it shall be no more, until he come whose right it is—strikingly parallel to Ge 49:10. Nowhere shall there be rest or permanence; all things shall be in fluctuation until He comes who, as the rightful Heir, shall restore the throne of David that fell with Zedekiah. The Hebrew for \"right\" is \"judgment\"; it perhaps includes, besides the right to rule, the idea of His rule being one in righteousness (Ps 72:2; Isa 9:6, 7; 11:4; Re 19:11). Others (Nebuchadnezzar, &c.), who held the rule of the earth delegated to them by God, abused it by unrighteousness, and so forfeited the \"right.\" He both has the truest \"right\" to the rule, and exercises it in \"right.\" It is true the tribal \"scepter\" continued with Judah \"till Shiloh came\" (Ge 49:10); but there was no kingly scepter till Messiah came, as the spiritual King then (Joh 18:36, 37); this spiritual kingdom being about to pass into the literal, personal kingdom over Israel at His second coming, when, and not before, this prophecy shall have its exhaustive fulfilment (Lu 1:32, 33; Jer 3:17; 10:7; \"To thee doth it appertain\").",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This triplication of the threat speaks the certainty of the event, and also the gradual, successive troubles and overthrows that this kingdom should ever after be afflicted with. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It shall be no more; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " never recover its former glory and strength, but consume, till the sceptre be quite taken away from Judah, and way be made for the Messiah, who is he that is to come, whose is the dominion, and to whom the Father will give it. So the final desolation of the temporal kingdom of the seed of David, which was most heavy tidings to the carnal Jews, is threatened, and the eternal kingdom of the Messiah, most joyful tidings to the believing Jews, is promised. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will overturn, overturn, overturn, it,.... The crown and kingdom of Judah; which being expressed three times, has not respect, as Kimchi thinks, to the three generations, in which the crown ceased after the captivity, as those of Asir, Shealtiel, Pedaiah; and in the fourth generation was restored to Zerubbabel; for he was no king, nor was there any of David's line after; nor were the Maccabees or Hasmoneans properly kings; but the phrase denotes the utter abolition of the kingly power, and the certainty of it, which could not be restored, notwithstanding the attempts made by Gedaliah and Ishmael; all their schemes were overturned, and so in successive ages and may also denote and include the troubles that were in the Jewish state, not only during the captivity, but from that time unto the Messiah's coming; there were nothing but overturnings, overturnings till that time came: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and it shall be no more; a kingdom governed by one of the seed of the then present family, or of the seed of David; there shall be no more a king of his race, as there was not till Shiloh came, intended in the next clause: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "until he come whose right it is; the right of the crown and kingdom of Israel; which belongs to Jesus the Messiah, being descended from a race of kings of the house of Judah, and of the seed of David: or, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to whom the judgment is (s); to whom the Father hath committed all judgment, John 5:22 all power of judging both his church and people, and the whole world: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to whom the judgment is (s); to whom the Father hath committed all judgment, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 5:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all power of judging both his church and people, and the whole world: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will give it him; the crown and kingdom, which is his right; put him in the possession of it, as he was at his resurrection and ascension; and which will more fully appear in the latter day, when all kingdoms will become his; especially he has, and will appear to have, the throne of his father David, and of his kingdom there will be no end, Luke 1:31. This is understood and interpreted of the Messiah, by R. Abendana (t), a modern Jew. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will give it him; the crown and kingdom, which is his right; put him in the possession of it, as he was at his resurrection and ascension; and which will more fully appear in the latter day, when all kingdoms will become his; especially he has, and will appear to have, the throne of his father David, and of his kingdom there will be no end, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This is understood and interpreted of the Messiah, by R. Abendana (t), a modern Jew. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s)   \"cujus est judicium\", Pagninus, Starckius; \"vel jus\", Junius & Tremellius, Polanus, Piscator. (t) Not. in Ben Melech, Miclol Yophi in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(s)   \"cujus est judicium\", Pagninus, Starckius; \"vel jus\", Junius & Tremellius, Polanus, Piscator. (t) Not. in Ben Melech, Miclol Yophi in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I will overturn, overturn, overturn, it: and it shall be no more, until he {y} cometh whose right it is; and I will give it him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will overturn, overturn, overturn, it: and it shall be no ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "more",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", until he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{y}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " cometh whose right it is; and I will give it ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "him",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) That is, to the coming of Messiah: for though the Jews had some sign of government later under the Persians, Greeks and Romans, yet this restitution was not till Christ's coming and at length would be accomplished as was promised, Ge 49:10.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and it shall be no",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more] Or, yea this—it shall not be (or, it is gone!). “This” does not refer to the condition introduced by the overturning, but goes back and resumes the present condition of things, which shall be overturned till he comes who hath the right, the Messiah. On verb, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 15:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "until he come … give it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " him] Rather: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and I will give",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He whose right it is, or, he who hath the right, is the Messiah. Reference is possibly to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Ezek. read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shelloh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (whose), not as now Shiloh.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will overthrow.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The sentence of destruction is emphasized, after the Hebrew manner, by a threefold iteration (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It shall be no more.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The pronoun in both clauses probably refers to the established order of the kingdom and the priesthood. \"That order,\" Ezekiel says, \"shall be no more.\" Keil, however, takes the second \"it\" - the \"this\" of the Revised Version - as meaning the fact of the overthrow. That also was not final; all things were as in a state of flux till the Messianic kingdom hinted at in the next clause should restore the true order. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Until he come whose right it is.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The words contain a singularly suggestive allusion to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where a probable interpretation of the word \"Shiloh\" is \"he to whom it belongs;\" or, as the LXX. gives it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τὰ ἀποκείμενα αὐτᾷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The passage is noticeable as being Ezekiel's first distinct utterance of the hope of a personal Messiah. Afterwards, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is definite enough. Ezekiel 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This announcement will appear to the Judaeans, indeed, to be a deceptive divination, but nevertheless it will be verified. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it is like deceptive divination in their eyes; sacred oaths are theirs (lit., to them); but he brings the iniquity to remembrance, that they may be taken. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore thus saith the Lord Jehovah, Because ye bring your iniquity to remembrance, in that your offences are made manifest, so that your sins appear in all your deeds, because ye are remembered ye shall be taken with the hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And thou pierced one, sinner, prince of Israel, whose day is come at the time of the final transgression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith the Lord Jehovah, The turban will be removed, the crown taken off. This is not this; the low will be lifted up, and the lofty lowered. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Overthrown, overthrown, overthrown will I make it; even this shall not be, till He cometh, to whom is the right, to Him do I give it. - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (28), להם, which is more precisely defined by בּעיניהם, refers to the Israelites, i.e., the Judaeans. This also applies to the following להם, which cannot possibly be taken as referring to a different subject, say, for example, the Chaldeans. It is evident, therefore, that it is impossible to sustain the rendering given in Gesenius' Thesaurus (s.v.) to the obscure words שׁבעי שׁבעות, viz., qui juramenta jurarunt eis (sc., Chaldaeis), which Maurer has modified and expounded thus: \"they will not fear these auguries; they will swear oaths to them (the Chaldeans), that is to say, according to their usual custom, these truce-breakers will take fresh oaths, hoping that the Chaldeans will be conciliated thereby.\" Moreover, the thought itself is an unsuitable one, inasmuch as \"the defiant attitude of confidence with which they looked such awfully threatening danger in the face must have had some other ground than a reliance upon false oaths and Chaldean credulity\" (Hvernick). The common explanation, which Rosenmller and Kliefoth uphold, is, \"because the Chaldeans are sworn allies, sworn confederates of theirs;\" or as Kliefoth explains it, \"on account of the oath of fealty or vassalage sworn by Zedekiah to Nebuchadnezzar, they have sworn confederates in the Chaldeans, and relying upon this, they are confident that they have no hostile attack to fear from them.\" But this is altogether untenable, not only because it is perfectly arbitrary to supply \"the Chaldeans,\" but still more for the reason adduced by Maurer. \"How,\" he justly asks, \"could the Judaeans despise these auguries because the Chaldeans were bound to them by an oath when they themselves had broken faith? When a treaty has been violated by one party, is not the other released from his oath?\" We therefore adopt the same explanation as Hvernick: \"oaths of oaths are theirs (to them), i.e., the most sacred oaths are (made) to them, namely, by God.\" They rely upon that which God has solemnly sworn to them, without considering upon what this promise was conditional, namely, upon a faithful observance on their part of the commandments of God. For the fact itself, compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and such passages as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., etc. The form שׁבעי by the side of שׁבעות may be explained in a very simple way from the relation of the construct state, i.e., from the endeavour to secure an obvious form for the construct state, and cannot in any case furnish a well-founded argument against the correctness of our explanation. As Ezekiel uses נפשׁים for נפשׁות in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he may also have formed שׁבעים (שׁבעי) by the side of שׁבעות. - As they rely upon the promises of God without reflecting upon their own breach of covenant, God will bring their sin to remembrance through His judgment. והוּא is Jehovah, upon whose oaths they rely. עון must not be restricted to Zedekiah's breach of covenant, since ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " clearly shows that it is the wrong-doing of Judah generally. להתּפשׂ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (29) is also to be understood of the whole nation, which is to be taken and punished by the king of Babylon. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (29) introduces the reason for the statement made in the last clause of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (28). God must put the people in remembrance of their iniquity by inflicting punishment, because they have called it to remembrance by sins committed without any shame, and thereby have, so to speak, compelled God to remember them, and to cause the sinners to be grasped by the hand of the slayer. הזכּיר עון is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (29) in a different sense from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (28), and is therefore explained by 'בּהגּלות. בּכּף, which is indefinite in itself, points back to יד הורג in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 21:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (16), and receives from that its more exact definition.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With Ezekiel 21:25 the address turns to the chief sinner, the godless King Zedekiah, who was bringing the judgment of destruction upon the kingdom by his faithless breach of oath. The words חלל, רשׁע, and 'נשׂיא ישׂ are asyndeta, co-ordinate to one another. חלל does not mean profane or infamous (βέβηλε, lxx), but simply pierced, slain. This meaning is to be retained here. This is demanded not only by the fixed usage of the language, but also by the relation in which חלל stands both to Ezekiel 21:14 and to חללי רשׁעים in Ezekiel 21:29 (34). It is true that Zedekiah was not pierced by the sword either at that time or afterwards, but was simply blinded and led in captivity to Babylon, where he died. But all that follows from this is, that חלל is used here in a figurative sense, given up to the sword, i.e., to death; and Zedekiah is so designated for the purpose of announcing in a more energetic manner the certainty of his fate. The selection of the term חלל is the more natural, because throughout the whole prophecy the description of the judgment takes its character from the figure of the sword of Jehovah. As God does not literally wield a sword, so חלל is no proof of actual slaying with the sword. יומו .dro, his day, is the day of his destruction (cf. 1 Samuel 26:10), or of the judgment upon him. The time of the final transgression is not the time when the transgression reaches its end, i.e., its completion, but the time when the wickedness brings the end, i.e., destruction (cf. Ezekiel 35:5, and for קץ in this sense, Ezekiel 7:2-3). The fact that the end, the destruction, is come, i.e., is close at hand, is announced in Ezekiel 21:26 to the prince, and in his person to the whole nation. If we understand the connection in this way, which is naturally suggested by Ezekiel 21:25, we get rid of the objection, which led Kliefoth to question the fact that it is the king who is addressed in Ezekiel 21:25, and to take the words as collective, \"ye slaughtered sinners, princes of Israel,\" and to understand them as referring to the entire body of rulers, including the priests, - an explanation that is completely upset by the words נשׂיא... אתּה (thou...prince), which are so entirely opposed to the collective view. Again, the remark that \"what follows in Ezekiel 21:26, viz., the statement to be made to the נשׂיא, has really nothing to do with him, since the sweeping away of the priesthood did not affect Zedekiah personally\" (Kliefoth), is neither correct nor conclusive. For Ezekiel 21:26 contains an announcement not only of the abrogation of the priesthood, but also of the destruction of the kingdom, which did affect Zedekiah both directly and personally. Moreover, we must not isolate the king addressed, even as an individual, from the position which he occupied, or, at any rate, which he ought to have occupied as a theocratic monarch, so as to be able to say that the abrogation of the priesthood did not affect him. The priesthood was one of the fundamental pillars of the theocracy, the removal of which would necessarily be followed by the collapse of the divine state, and therefore by the destruction of the monarchy. Hence it is that the abolition of the priesthood is mentioned first. The infinitives absolute (not imperatives) הסיר and הרים are selected for the purpose of expressing the truth in the most emphatic manner; and the verbs are synonymous. הרים, to lift up, i.e., not to elevate, but to take away, to abolish, as in Isaiah 57:14; Daniel 8:11. מצנפת does not mean the royal diadem, like צניף in Isaiah 62:3, but the tiara of the high priest, as it does in every instance in the Pentateuch, from which Ezekiel has taken the word. העטרה, the king's crown. The diadem of the priest and the regal crown are the insignia of the offices of high priest and king; and consequently their removal is the abolition of both high-priesthood and monarchy. These words contain the sentence of death upon the theocracy, of which the Aaronic priesthood and the Davidic monarchy constituted the foundations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the address turns to the chief sinner, the godless King Zedekiah, who was bringing the judgment of destruction upon the kingdom by his faithless breach of oath. The words חלל, רשׁע, and 'נשׂיא ישׂ are asyndeta, co-ordinate to one another. חלל does not mean profane or infamous (βέβηλε, lxx), but simply pierced, slain. This meaning is to be retained here. This is demanded not only by the fixed usage of the language, but also by the relation in which חלל stands both to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to חללי רשׁעים in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (34). It is true that Zedekiah was not pierced by the sword either at that time or afterwards, but was simply blinded and led in captivity to Babylon, where he died. But all that follows from this is, that חלל is used here in a figurative sense, given up to the sword, i.e., to death; and Zedekiah is so designated for the purpose of announcing in a more energetic manner the certainty of his fate. The selection of the term חלל is the more natural, because throughout the whole prophecy the description of the judgment takes its character from the figure of the sword of Jehovah. As God does not literally wield a sword, so חלל is no proof of actual slaying with the sword. יומו .dro, his day, is the day of his destruction (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or of the judgment upon him. The time of the final transgression is not the time when the transgression reaches its end, i.e., its completion, but the time when the wickedness brings the end, i.e., destruction (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 35:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and for קץ in this sense, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 7:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The fact that the end, the destruction, is come, i.e., is close at hand, is announced in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to the prince, and in his person to the whole nation. If we understand the connection in this way, which is naturally suggested by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", we get rid of the objection, which led Kliefoth to question the fact that it is the king who is addressed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and to take the words as collective, \"ye slaughtered sinners, princes of Israel,\" and to understand them as referring to the entire body of rulers, including the priests, - an explanation that is completely upset by the words נשׂיא... אתּה (thou...prince), which are so entirely opposed to the collective view. Again, the remark that \"what follows in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", viz., the statement to be made to the נשׂיא, has really nothing to do with him, since the sweeping away of the priesthood did not affect Zedekiah personally\" (Kliefoth), is neither correct nor conclusive. For ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contains an announcement not only of the abrogation of the priesthood, but also of the destruction of the kingdom, which did affect Zedekiah both directly and personally. Moreover, we must not isolate the king addressed, even as an individual, from the position which he occupied, or, at any rate, which he ought to have occupied as a theocratic monarch, so as to be able to say that the abrogation of the priesthood did not affect him. The priesthood was one of the fundamental pillars of the theocracy, the removal of which would necessarily be followed by the collapse of the divine state, and therefore by the destruction of the monarchy. Hence it is that the abolition of the priesthood is mentioned first. The infinitives absolute (not imperatives) הסיר and הרים are selected for the purpose of expressing the truth in the most emphatic manner; and the verbs are synonymous. הרים, to lift up, i.e., not to elevate, but to take away, to abolish, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 57:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". מצנפת does not mean the royal diadem, like צניף in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 62:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but the tiara of the high priest, as it does in every instance in the Pentateuch, from which Ezekiel has taken the word. העטרה, the king's crown. The diadem of the priest and the regal crown are the insignia of the offices of high priest and king; and consequently their removal is the abolition of both high-priesthood and monarchy. These words contain the sentence of death upon the theocracy, of which the Aaronic priesthood and the Davidic monarchy constituted the foundations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They predict not merely a temporary, but a complete abolition of both offices and dignities; and their fulfilment took place when the kingdom of Judah was destroyed by the king of Babylon. The earthly sovereignty of the house of David was not restored again after the captivity; and the high-priesthood of the restoration, like the second temple, was only a shadowy outline of the glory and essential features of the high-priesthood of Aaron. As the ark with the Shechinah, or the gracious presence of God, was wanting in the temple of Zerubbabel; so were the Urim and Thummim wanting to the high-priesthood, and these were the only means by which the high priest could really carry out the mediation between the Lord and the people. זאת לא זאת .el (this is not this) does not refer to the tiara (mitre) and crown. זאת is neuter, and therefore construed with the masculine היה. This (mitre and crown) will not be this (היה is prophetic), i.e., it will not continue, it will be all over with it (Hvernick, Maurer, and Kliefoth). To this there is appended the further thought, that a general inversion of things will take place. This is the meaning of the words - the low will be lifted up, and the lofty lowered. הגבּהּ and השׁפּיל are infinitives, and are chosen in the same sense as in the first hemistich. The form השּׁפלה, with ה without the tone, is masculine; the ־ה probably serving merely to give greater fulness to the form, and to make it correspond more nearly to הגּבהּ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Hitzig has given a most preposterous exposition of this verse. Taking the words הסיר and הרים as antithetical, in the sense of removing ad exalting or sustaining in an exalted position, and regarding the clauses as questions signifying, \"Shall the high-priesthood be abolished, and the real dignity, on the contrary, remain untouched?\" he finds the answer to these questions in the words זאת לא  (this, not this). They contain, in his opinion, as affirmation of the former and a negation of the latter. But he does not tell us how זאת לא זאת without a verb can possibly mean, \"the former (the abrogation of the high-priesthood) will take place, but the latter (the exaltation of the monarchy) will not occur.\" And, finally, the last clause, \"the low shall be lifted up,\" etc., is said to contain simply a watchword, which is not for the time being to be followed by any result. Such trifling needs no refutation. We simply observe, therefore, that there is no ground for the assertion, that הרים without מן cannot possibly signify to abolish.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This general thought is expressed still more definitely in Ezekiel 21:27. עוּה, which is repeated twice to give greater emphasis to the thought, is a noun derived from עוּה, inversion, overthrow; and the suffix in אשׂימנּהּ points back to זאת in Ezekiel 21:26 (31). This, the existing state, the high-priesthood and the monarch, will I make into destruction, or utterly overthrow. But the following זאת cannot also refer to the tiara and crown, as Kliefoth supposes, on account of the גּם which precedes it. This shows that זאת relates to the thing last mentioned. Even this, the overthrow, shall have no durability; or, as Tanch. has correctly expressed it, neque haec conditio erit durabilis. The following עד־בּא attaches itself not so much to this last clause as to the main thought: overthrow upon overthrow will ensue. The thought is this: \"nowhere is there rest, nowhere security; all things are in a state of flux till the coming of the great Restorer and Prince of peace\" (Hengstenberg). It is generally acknowledged that the words עד־בּא אשׁר־לו המּשׁפּט contain an allusion to Genesis 49:10, עד כּי; and it is only by a false interpretation of the preceding clauses, wrung from the words by an arbitrary alteration of the text, that Hitzig is able to set this connection aside. At the same time, אשׁר־לו המּשׁפּט is of course not to be taken as a philological explanation of the word שׁילה, but is simply a theological interpretation of the patriarchal prophecy, with direct reference to the predicted destruction of the existing relations in consequence of the ungodliness and unrighteousness of the leaders of the theocracy up to that time. המּשׁפּט is not the rightful claim to the mitre and crown, but right in an objective sense, as belonging to God (Deuteronomy 1:17), and entrusted by God to the earthly government as His representative. He then, to whom this right belongs, and to whom God will give it, is the Messiah, of whom the prophets from the time of David onwards have prophesied as the founder and restorer of perfect right on earth (cf. Psalm 72; Isaiah 9:6; Isaiah 42:1; Jeremiah 23:5; Jeremiah 33:17). The suffix attached to נתתּיו is not a dative, but an accusative, referring to משׁפּט (cf. Psalm 72:1). There was no necessity to mention the person again to whom God would give the right, as He had already been designated in the previous expression אשׁר לו. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This general thought is expressed still more definitely in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". עוּה, which is repeated twice to give greater emphasis to the thought, is a noun derived from עוּה, inversion, overthrow; and the suffix in אשׂימנּהּ points back to זאת in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 21:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (31). This, the existing state, the high-priesthood and the monarch, will I make into destruction, or utterly overthrow. But the following זאת cannot also refer to the tiara and crown, as Kliefoth supposes, on account of the גּם which precedes it. This shows that זאת relates to the thing last mentioned. Even this, the overthrow, shall have no durability; or, as Tanch. has correctly expressed it, neque haec conditio erit durabilis. The following עד־בּא attaches itself not so much to this last clause as to the main thought: overthrow upon overthrow will ensue. The thought is this: \"nowhere is there rest, nowhere security; all things are in a state of flux till the coming of the great Restorer and Prince of peace\" (Hengstenberg). It is generally acknowledged that the words עד־בּא אשׁר־לו המּשׁפּט contain an allusion to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", עד כּי; and it is only by a false interpretation of the preceding clauses, wrung from the words by an arbitrary alteration of the text, that Hitzig is able to set this connection aside. At the same time, אשׁר־לו המּשׁפּט is of course not to be taken as a philological explanation of the word שׁילה, but is simply a theological interpretation of the patriarchal prophecy, with direct reference to the predicted destruction of the existing relations in consequence of the ungodliness and unrighteousness of the leaders of the theocracy up to that time. המּשׁפּט is not the rightful claim to the mitre and crown, but right in an objective sense, as belonging to God (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and entrusted by God to the earthly government as His representative. He then, to whom this right belongs, and to whom God will give it, is the Messiah, of whom the prophets from the time of David onwards have prophesied as the founder and restorer of perfect right on earth (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 33:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The suffix attached to נתתּיו is not a dative, but an accusative, referring to משׁפּט (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). There was no necessity to mention the person again to whom God would give the right, as He had already been designated in the previous expression אשׁר לו. ",
            "children": []
          }
        ]
      }
    ]
  }
]