[{"num":40,"verse":"After this, it came to pass, that two eunuchs, the butler and the baker of the king of Egypt, offended their lord."},{"num":2,"verse":"And Pharao being angry with them (now the one was chief butler, the other chief baker)"},{"num":3,"verse":"He sent them to the prison of the commander of the soldiers, in which Joseph also was prisoner,"},{"num":4,"verse":"But the keeper of the prison delivered them to Joseph, and he served them. Some little time passed, and they were kept in custody."},{"num":5,"verse":"And they both dreamed a dream the same night, according to the interpretation agreeing to themselves:"},{"num":6,"verse":"And when Joseph was come in to them in the morning, and saw them sad,"},{"num":7,"verse":"He asked them, saying: Why is your countenance sadder to day than usual?"},{"num":8,"verse":"They answered: We have dreamed a dream, and there is nobody to interpret it to us. And Joseph said to them: Doth not interpretation belong to God? Tell me what you have dreamed."},{"num":9,"verse":"The chief butler first told his dream: I saw before me a vine,"},{"num":10,"verse":"On which were three branches, which by little and little sent out buds, and after the blossoms brought forth ripe grapes:"},{"num":11,"verse":"And the cup of Pharao was in my hand: and I took the grapes, and pressed them into the cup which I held, and I gave the cup to Pharao."},{"num":12,"verse":"Joseph answered: This is the interpretation of the dream: The three branches are yet three days:"},{"num":13,"verse":"After which Pharao will remember thy service, and will restore thee to thy former place: and thou shalt present him the cup according to thy office, as before thou wast wont to do."},{"num":14,"verse":"Only remember me, when it shall be well with thee, and do me this kindness: to put Pharao in mind to take me out of this prison:"},{"num":15,"verse":"For I was stolen away out of the land of the Hebrews, and here without any fault was cast into the dungeon."},{"num":16,"verse":"The chief baker seeing that he had wisely interpreted the dream, said: I also dreamed a dream, That I had three baskets of meal upon my head:"},{"num":17,"verse":"And that in one basket which was uppermost, I carried all meats that are made by the art of baking, and that the birds ate out of it."},{"num":18,"verse":"Joseph answered: This is the interpretation of the dream: The three baskets are yet three days:"},{"num":19,"verse":"After which Pharao will take thy head from thee, and hang thee on a cross, and the birds shall tear thy flesh."},{"num":20,"verse":"The third day after this was the birthday of Pharao: and he made a great feast for his servants, and at the banquet remembered the chief butler, and the chief baker."},{"num":21,"verse":"And he restored the one to his place to present him the cup:"},{"num":22,"verse":"The other he hanged on a gibbet, that the truth of the interpreter might be shewn."},{"num":23,"verse":"But the chief butler, when things prospered with him, forgot his interpreter."}]