[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Seest thou not . . .?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We enter on one of the darker regions of Jewish idolatry, such as Ezekiel (Jeremiah 8) saw in vision. A foreign worship of the basest kind was practised, not only in secret, but in the open places.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Benson CommentaryJeremiah 7:17-19. Seest thou not what they do in the cities of Judah — Thou canst not pass along the streets, but thou must needs be an eye witness of their abominations, committed openly and publicly in the face of the sun, without either shame or fear; and in the streets of Jerusalem — In both city and country. This intimates both that their sins were evident and could not be denied, and that the sinners were impudent and would not be reclaimed: they committed their wickedness even in the prophet’s presence and under his eye; he saw what they did, and yet they did it; which was an affront to his office, and to God, whose minister he was, and bid defiance to both. The children gather wood — Here God shows how busily they were employed, from the youngest to the oldest, for their idolatry. Every one in the family did something toward it. To make cakes to the queen of heaven — That is, the moon, either in an image, or in the original, or both. They worshipped her probably under the name of Astarte, or Ashtaroth, being in love, it seems, with the brightness with which they saw the moon walk, and thinking themselves indebted to her for her benign influences, or fearing her malignant ones, Job 32:26. The worship of the moon was much in use among the heathen nations, and, as appears from Jeremiah 44:17-19, many of the Jews were so attached to it, that they could not be reclaimed from it: no, not when destruction had come upon their country for that and other species of idolatry. We may observe, that the word מלכת, here rendered queen, may signify regency, as Blaney translates it, and therefore may include the whole host of heaven: but queen is the more common and proper signification of the word, and most probably here means the moon only: they, however, worshipped the sun and stars also. That they may provoke me to anger — Which is the direct tendency of their sin, though they may not propose to themselves such an end in the committing it. Do they provoke me to anger? — Do they think to grieve me, and trouble my infinite and eternal mind, as if they could hurt me by their wickedness? They are deceived: I am without passion, and can be without their offerings. Do they not provoke themselves, &c. — Will they not themselves feel the hurt, and reap the fruits of their conduct? Will not the arrow which they shoot against heaven recoil upon their own guilty heads? Will not their sins turn at last to their own utter confusion?Matthew Henry's Concise Commentary7:17-20 The Jews took pride in showing zeal for their idols. Let us learn to be earnest in the service of our God, even from this bad example. Let us think it an honour to be employed in any work for God. Let us be as diligent ourselves, and as careful to teach our children the truths of God, as many are to teach the mysteries of iniquity. The direct tendency of this sin is malice against God, but it will hurt themselves. And they shall find there is no escaping. God's wrath is fire unquenchable.Barnes' Notes on the BibleThe proof of the hopeless immorality of the people is this, that they worship pagan deities(1) generally in the cities of Judah, and not in the capital only; and(2) publicly in the streets of Jerusalem. Such public idolatry could have been practiced only in the reign of a king like Jehoiakim. Jamieson-Fausset-Brown Bible Commentary17. Jehovah leaves it to Jeremiah himself to decide, is there not good reason that prayers should not be heard in behalf of such rebels?Matthew Poole's Commentary q.d. How canst thou pass along the streets but thou must needs be an eye witness of their abominations, to thy no small trouble and sorrow? as Sodom was to Lot, 2 Peter 2:8; therefore how canst thou plead with me on their behalf? How canst thou either pray for them, or I pity them? In the cities of Judah, and in the streets of Jerusalem;  in city and country. See Jeremiah 2:28 11:13. Gill's Exposition of the Entire BibleSeest thou not what they do in the cities Judah,.... Not in one city only, but in all of and particularly the chief of them; as follows: and in the streets of Jerusalem? these words, with what is said next, show the reason why the prophet was forbid to pray for this people, and the Lord was so provoked with them as to cast them out of his sight; and he appeals to the prophet, and to what he saw, or which he might see; for what was done was done not in secret, but openly, in the very streets of the city; by which he might be sufficiently convinced it was but just with God to do what he determined to do with them. Geneva Study BibleSeest thou not what they do in the cities of Judah and in the streets of Jerusalem?",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 7:17-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Seest thou not what they do in the cities of Judah ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Thou canst not pass along the streets, but thou must needs be an eye witness of their abominations, committed openly and publicly in the face of the sun, without either shame or fear; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and in the streets of Jerusalem ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— In both city and country. This intimates both that their sins were evident and could not be denied, and that the sinners were impudent and would not be reclaimed: they committed their wickedness even in the prophet’s presence and under his eye; he saw what they did, and yet they did it; which was an affront to his office, and to God, whose minister he was, and bid defiance to both. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "The children gather wood ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Here God shows how busily they were employed, from the youngest to the oldest, for their idolatry. Every one in the family did something toward it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "To make cakes to the queen of heaven ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— That is, the moon, either in an image, or in the original, or both. They worshipped her probably under the name of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Astarte, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ashtaroth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "being in love, it seems, with the brightness with which they saw the moon walk, and thinking themselves indebted to her for her benign influences, or fearing her malignant ones, Job 32:26. The worship of the moon was much in use among the heathen nations, and, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:17-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", many of the Jews were so attached to it, that they could not be reclaimed from it: no, not when destruction had come upon their country for that and other species of idolatry. We may observe, that the word ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "מלכת",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", here rendered ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "queen, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "may signify ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "regency, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as Blaney translates it, and therefore may include ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the whole host of heaven: ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "but ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "queen ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "is the more common and proper signification of the word, and most probably here means the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "moon ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "only: they, however, worshipped the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "sun ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "stars ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "also. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "That they may provoke me to anger ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Which is the direct tendency of their sin, though they may not propose to themselves such an end in the committing it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Do they provoke me to anger? ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Do they think to grieve me, and trouble my infinite and eternal mind, as if they could hurt me by their wickedness? They are deceived: I am without passion, and can be without their offerings. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Do they not provoke themselves, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "&c. — Will they not themselves feel the hurt, and reap the fruits of their conduct? Will not the arrow which they shoot against heaven recoil upon their own guilty heads? Will not their sins turn at last to their own utter confusion?",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "7:17-20 The Jews took pride in showing zeal for their idols. Let us learn to be earnest in the service of our God, even from this bad example. Let us think it an honour to be employed in any work for God. Let us be as diligent ourselves, and as careful to teach our children the truths of God, as many are to teach the mysteries of iniquity. The direct tendency of this sin is malice against God, but it will hurt themselves. And they shall find there is no escaping. God's wrath is fire unquenchable.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The proof of the hopeless immorality of the people is this, that they worship pagan deities",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(1) generally in the cities of Judah, and not in the capital only; and",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(2) publicly in the streets of Jerusalem. Such public idolatry could have been practiced only in the reign of a king like Jehoiakim. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "17. Jehovah leaves it to Jeremiah himself to decide, is there not good reason that prayers should not be heard in behalf of such rebels?",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " q.d. How canst thou pass along the streets but thou must needs be an eye witness of their abominations, to thy no small trouble and sorrow? as Sodom was to Lot, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Peter 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; therefore how canst thou plead with me on their behalf? How canst thou either pray for them, or I pity them? ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "In the cities of Judah, and in the streets of Jerusalem; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in city and country. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 2:28 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Seest thou not what they do in the cities Judah,.... Not in one city only, but in all of and particularly the chief of them; as follows: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and in the streets of Jerusalem? these words, with what is said next, show the reason why the prophet was forbid to pray for this people, and the Lord was so provoked with them as to cast them out of his sight; and he appeals to the prophet, and to what he saw, or which he might see; for what was done was done not in secret, but openly, in the very streets of the city; by which he might be sufficiently convinced it was but just with God to do what he determined to do with them. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Seest thou not what they do in the cities of Judah and in the streets of Jerusalem?",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the streets",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A climax. Them is no sense of shame left. Jeremiah 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This punishment will be turned aside, neither by intercession, because the people re2fuses to give up its idolatry, nor by sacrifice, which God desires not, because for long they have turned to Him the back and not the face, and have not hearkened to His words. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"But thou, pray not for this people, and lift not up for them cry and prayer; and urge me not, for I do not hear thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Seest thou not what they do in the cities of Judah, and in the streets of Jerusalem? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sons gather sticks, and the fathers kindle the fire, and the women knead dough, to make cakes for the Queen of heaven, and to pour out drink-offerings unto other gods, to provoke me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Provoke they me, saith Jahveh, not themselves, to the shaming of their face? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore thus saith the Lord Jahveh, Behold, mine anger and my fury shall be poured out on this place, upon man, upon beast, upon the trees of the field, and upon the fruit of the ground; and shall burn, and not be quenched. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus saith Jahveh of hosts, the God of Israel: Your burnt-offerings add to your slain-offerings, and eat flesh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For I spake not with your fathers, nor commanded them in the day that I brought them out of the land of Egypt, concerning the matters of burnt-offering or slain-offering. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But this word commanded I them, saying, Hearken to my voice, and I will be your God, and ye shall be my people; and walk in the way which I command you, that it may be well with you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But they hearkened not, nor inclined their ear, and walked in the counsels, in the stubbornness of their evil heart, and turned to me the back, and not the face. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Since the day that your fathers went forth of the land of Egypt until this day, I sent to you all my servants the prophets, daily from early morn sending them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But they hearkened not to me, nor inclined their ear, and were stiffnecked, and did worse than their fathers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And though thou speakest all these words unto them, yet will they not hearken unto thee; and though thou callest unto them, yet will they not answer thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus speak to them: This is the people that hearken not unto the voice of Jahveh its God, and that receive not correction. Perished is faithfulness, cut off from their mouth.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The purport of Jeremiah 7:16, that God will not suffer Himself to be moved by any entreaties to revoke the doom pronounced on the wicked people, is expressed by way of a command from God to the prophet not to pray for the people. That Jeremiah did sometimes pray thus, however, we see from Jeremiah 14:19. (cf. Jeremiah 18:20), when to his prayer the same answer is given as we have here, and all intercession for the corrupt race is characterized as in vain. The second clause: lift not up for them crying, i.e., supplicatory prayer, expresses the same, only more strongly; while the third clause: urge me not, cuts off all hope of success from even the most importunate intercession. The reason for this command to desist is shown in Jeremiah 7:17, by a reference to the idolatry which was openly practised throughout the land by young and old, men and women. Each takes part according to strength and capacity: the sons gather wood together, the fathers set the fire in order, etc. The deity so zealously worshipped by the people is called the Queen of heaven, and is mentioned only by Jeremiah. Besides here, there is reference to her in Jeremiah 44:17, where we see that her worship was very diligently cultivated, and that she was adored as the bestower of earthly possessions. (מלכת is stat. constr., either from the Chald. form מלך, or from מליכה, after the analogy of גּברת, st. constr. of גּבירה; but perhaps it has מלכת in stat. abs.) This worship was combined with that of the stars, the host of heaven, which especially prevailed under Manasseh (2 Kings 21:5). Thence it may be presumed that the Queen of heaven was one of the deities who came to Western Asia with the Assyrians, and that she corresponds to the Assyrian-Persian Tanais and Artemis, who in the course of time took the place once occupied by the closely related Phoenician Astarte. She is originally a deification of the moon, the Assyrian Selene and Virgo caelestis, who, as supreme female deity, was companion to Baal-Moloch as sun-god; cf. Movers, Phnizier, i. S. 623ff. With this accords the statement of Steph. Byz., that σελήνη is also πήπανον τι τῷ ἄστρω παραπλήσιον. The offerings which, acc. to this verse and Jeremiah 44:19, were brought to her, are called כּוּנים, a word which would appear to have come to the Hebrews along with the foreign cultus. By the lxx it was Grecized into χαυῶνας, for which we find in glossators and codd. καυῶνας and χαβῶνας. They were, acc. to the Etymol. magn. and Suidas, ἄρτοι ἐλαίῳ ἀναφυραθέντες or λάχανα ὄπτα (? cooked vegetables); acc. to Jerome, χαυῶνας, quas nos placentas interpretati sumus. In any case, they were some kind of sacrificial cakes, which Vitr. put alongside of the πόπανα of Aristophanes and Lucian; cf. the various interpretations in Schleussner, Lexic. in lxx s.v. χαυών. These cakes were kindled on the altar (cf. מקטּרים, Jeremiah 44:19) as a kind of Minchah (meat-offering), and with this Minchah a libation or drink-offering (נסכים) was combined. הסּך corresponds to לעשׂות, so that ל has to be repeated; cf. Jeremiah 44:19, Jeremiah 44:25, where we find libations poured out to the Queen of heaven. In the 18th verse the expression is generalized into \"other gods,\" with reference to the fact that the service of the Queen of heaven was but one kind of idolatry along with others, since other strange gods were worshipped by sacrifices and libations. To provoke me; cf. Deuteronomy 31:29; Deuteronomy 32:16, etc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The purport of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that God will not suffer Himself to be moved by any entreaties to revoke the doom pronounced on the wicked people, is expressed by way of a command from God to the prophet not to pray for the people. That Jeremiah did sometimes pray thus, however, we see from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), when to his prayer the same answer is given as we have here, and all intercession for the corrupt race is characterized as in vain. The second clause: lift not up for them crying, i.e., supplicatory prayer, expresses the same, only more strongly; while the third clause: urge me not, cuts off all hope of success from even the most importunate intercession. The reason for this command to desist is shown in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", by a reference to the idolatry which was openly practised throughout the land by young and old, men and women. Each takes part according to strength and capacity: the sons gather wood together, the fathers set the fire in order, etc. The deity so zealously worshipped by the people is called the Queen of heaven, and is mentioned only by Jeremiah. Besides here, there is reference to her in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where we see that her worship was very diligently cultivated, and that she was adored as the bestower of earthly possessions. (מלכת is stat. constr., either from the Chald. form מלך, or from מליכה, after the analogy of גּברת, st. constr. of גּבירה; but perhaps it has מלכת in stat. abs.) This worship was combined with that of the stars, the host of heaven, which especially prevailed under Manasseh (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 21:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Thence it may be presumed that the Queen of heaven was one of the deities who came to Western Asia with the Assyrians, and that she corresponds to the Assyrian-Persian Tanais and Artemis, who in the course of time took the place once occupied by the closely related Phoenician Astarte. She is originally a deification of the moon, the Assyrian Selene and Virgo caelestis, who, as supreme female deity, was companion to Baal-Moloch as sun-god; cf. Movers, Phnizier, i. S. 623ff. With this accords the statement of Steph. Byz., that σελήνη is also πήπανον τι τῷ ἄστρω παραπλήσιον. The offerings which, acc. to this verse and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", were brought to her, are called כּוּנים, a word which would appear to have come to the Hebrews along with the foreign cultus. By the lxx it was Grecized into χαυῶνας, for which we find in glossators and codd. καυῶνας and χαβῶνας. They were, acc. to the Etymol. magn. and Suidas, ἄρτοι ἐλαίῳ ἀναφυραθέντες or λάχανα ὄπτα (? cooked vegetables); acc. to Jerome, χαυῶνας, quas nos placentas interpretati sumus. In any case, they were some kind of sacrificial cakes, which Vitr. put alongside of the πόπανα of Aristophanes and Lucian; cf. the various interpretations in Schleussner, Lexic. in lxx s.v. χαυών. These cakes were kindled on the altar (cf. מקטּרים, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as a kind of Minchah (meat-offering), and with this Minchah a libation or drink-offering (נסכים) was combined. הסּך corresponds to לעשׂות, so that ל has to be repeated; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where we find libations poured out to the Queen of heaven. In the 18th verse the expression is generalized into \"other gods,\" with reference to the fact that the service of the Queen of heaven was but one kind of idolatry along with others, since other strange gods were worshipped by sacrifices and libations. To provoke me; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 31:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. ",
            "children": []
          }
        ]
      }
    ]
  }
]