[{"num":89,"verse":"1 With many words doth the Prophet praise the goodness of God, 23 For his testament and covenant, that he had made between him and his elect by Jesus Christ the son of David. 38 Then doth he complain of the great ruin, and desolation of the kingdom of David, so that to the outward appearance the promise was broken. 46 Finally, he prayeth to be delivered from his afflictions, making mention of the shortness of man’s life, and confirming himself by God’s promise."},{"num":1,"verse":"I will sing the mercies of the Lord forever: with my mouth will I declare thy truth from generation to generation."},{"num":2,"verse":"For I said, Mercy shall be set up forever: thy truth shalt thou stablish in the very heavens."},{"num":3,"verse":"I have made a covenant with my chosen: I have sworn to David my servant,"},{"num":4,"verse":"Thy seed will I stablish forever, and set up thy throne from generation to generation. Selah."},{"num":5,"verse":"O Lord, even the heavens shall praise thy wondrous work: yea, thy truth in the Congregation of the Saints."},{"num":6,"verse":"For who is equal to the Lord in the heaven? and who is like the Lord among the sons of the gods?"},{"num":7,"verse":"God is very terrible in the assembly of the Saints, and to be reverenced above all that are about him."},{"num":8,"verse":"O Lord God of hosts, who is like unto thee, which art a mighty Lord, and thy truth is about thee?"},{"num":9,"verse":"Thou rulest the raging of the Sea: when the waves thereof arise, thou stillest them."},{"num":10,"verse":"Thou hast beaten down Rahab as a man slain: thou hast scattered thine enemies with thy mighty arm."},{"num":11,"verse":"The heavens are thine, the earth also is thine: thou hast laid the foundation of the world, and all that therein is."},{"num":12,"verse":"Thou hast created the North and the South: Tabor and Hermon shall rejoice in thy Name."},{"num":13,"verse":"Thou hast a mighty arm: strong is thy hand, and high is thy right hand."},{"num":14,"verse":"Righteousness and equity are the stablishment of thy throne: mercy and truth go before thy face."},{"num":15,"verse":"Blessed is the people that can rejoice in thee: they shall walk in the light of thy countenance, O Lord."},{"num":16,"verse":"They shall rejoice continually in thy Name, and in thy righteousness shall they exalt themselves."},{"num":17,"verse":"For thou art the glory of their strength, and by thy favor our horns shall be exalted."},{"num":18,"verse":"For our shield appertaineth to the Lord, and our King to the Holy one of Israel."},{"num":19,"verse":"Thou spakest then in a vision unto thine Holy one, and saidest, I have laid help upon one that is mighty: I have exalted one chosen out of the people."},{"num":20,"verse":"I have found David my servant: with mine holy oil have I anointed him."},{"num":21,"verse":"Therefore mine hand shall be established with him, and mine arm shall strengthen him."},{"num":22,"verse":"The enemy shall not oppress him, neither shall the wicked hurt him."},{"num":23,"verse":"But I will destroy his foes before his face, and plague them that hate him."},{"num":24,"verse":"My truth also and my mercy shall be with him, and in my Name shall his horn be exalted."},{"num":25,"verse":"I will set his hand also in the sea, and his right hand in the floods."},{"num":26,"verse":"He shall cry unto me, Thou art my Father, my God, and the rock of my salvation."},{"num":27,"verse":"Also I will make him my firstborn, higher than the kings of the earth."},{"num":28,"verse":"My mercy will I keep for him for evermore, and my Covenant shall stand fast with him."},{"num":29,"verse":"His seed also will I make to endure forever, and his throne as the days of heaven."},{"num":30,"verse":"But if his children forsake my Law, and walk not in my judgments:"},{"num":31,"verse":"If they break my statutes, and keep not my commandments:"},{"num":32,"verse":"Then will I visit their transgression with the rod, and their iniquity with strokes."},{"num":33,"verse":"Yet my loving kindness will I not take from him, neither will I falsify my truth."},{"num":34,"verse":"My Covenant will I not break, nor alter the thing that is gone out of my lips."},{"num":35,"verse":"I have sworn once by mine holiness, that I will not fail David, saying,"},{"num":36,"verse":"His seed shall endure forever, and his throne shall be as the sun before me."},{"num":37,"verse":"He shall be established for evermore as the moon, and as a faithful witness in the heaven. Selah."},{"num":38,"verse":"But thou hast rejected and abhorred, thou hast been angry with thine anointed."},{"num":39,"verse":"Thou hast broken the Covenant of thy servant, and profaned his crown, casting it on the ground."},{"num":40,"verse":"Thou hast broken down all his walls: thou hast laid his fortresses in ruin."},{"num":41,"verse":"All that go by the way, spoil him: he is a rebuke unto his neighbors."},{"num":42,"verse":"Thou hast set up the right hand of his enemies, and made all his adversaries to rejoice."},{"num":43,"verse":"Thou hast also turned the edge of his sword, and hast not made him to stand in the battle."},{"num":44,"verse":"Thou hast caused his dignity to decay, and cast his throne to the ground."},{"num":45,"verse":"The days of his youth hast thou shortened, and covered him with shame. Selah."},{"num":46,"verse":"Lord, how long wilt thou hide thyself, forever? shall thy wrath burn like fire?"},{"num":47,"verse":"Remember of what time I am: wherefore shouldest thou create in vain all the children of men?"},{"num":48,"verse":"What man liveth, and shall not see death? shall he deliver his soul from the hand of the grave? Selah."},{"num":49,"verse":"Lord, where are thy former mercies, which thou swarest unto David in thy truth?"},{"num":50,"verse":"Remember, O Lord, the rebuke of thy servants, which I bear in my bosom of all the mighty people."},{"num":51,"verse":"For thine enemies have reproached thee, O Lord, because they have reproached the footsteps of thine Anointed."},{"num":52,"verse":"Praised be the Lord for evermore. So be it, even so be it."}]