[{"num":1,"verse":"¶ I will sing of the mercies of the LORD for ever; with my mouth will I make known thy faithfulness to all generations."},{"num":2,"verse":"For I have said, Mercy shall be built up for ever in the heavens; in them thou shalt establish thy truth."},{"num":3,"verse":"I have made a covenant with my chosen; I have sworn unto David my slave, saying,"},{"num":4,"verse":"Thy seed will I establish for ever and build up thy throne to all generations. Selah."},{"num":5,"verse":"¶ And the heavens shall praise thy wonder, O LORD, thy truth also in the congregation of the saints."},{"num":6,"verse":"For who in the heavens can be compared unto the LORD? who among the sons of the mighty can be likened unto the LORD?"},{"num":7,"verse":"God is greatly to be feared in the assembly of the saints and to be had in reverence of all those that are about him."},{"num":8,"verse":"O LORD God of the hosts, who is like unto thee? Strong JAH, compassed about with thy truth."},{"num":9,"verse":"Thou dost rule the raging of the sea: when its waves arise, thou dost still them."},{"num":10,"verse":"Thou hast broken Egypt in pieces as one that is slain; thou hast scattered thine enemies with thy strong arm."},{"num":11,"verse":"The heavens are thine, the earth also is thine: the world and its fullness, thou didst found."},{"num":12,"verse":"Thou hast created the north and the south; Tabor and Hermon shall sing in thy name."},{"num":13,"verse":"The mighty arm is thine; strong is thy hand, and high is thy right hand."},{"num":14,"verse":"Thy throne is composed of righteousness and judgment; mercy and truth go before thy face."},{"num":15,"verse":"¶ Happy are the people that know how to enter into joy; they shall walk, O LORD, in the light of thy countenance."},{"num":16,"verse":"In thy name shall they rejoice each day; and in thy righteousness shall they be exalted."},{"num":17,"verse":"For thou art the glory of their strength, and in thy favour our horn shall be exalted."},{"num":18,"verse":"For the LORD is our shield, and the Holy One of Israel is our king."},{"num":19,"verse":"¶ Then thou didst speak in vision to thy holy one and didst say, I have laid help upon one that is mighty; I have exalted one chosen out of my people."},{"num":20,"verse":"I have found David my slave; I anointed him with the oil of my holiness,"},{"num":21,"verse":"with whom my hand shall be established; mine arm also shall strengthen him."},{"num":22,"verse":"The enemy shall not overcome him, nor the son of iniquity break him down."},{"num":23,"verse":"But I will break down his foes before his face and smite those that hate him."},{"num":24,"verse":"But my truth and my mercy shall be with him, and in my name shall his horn be exalted."},{"num":25,"verse":"In the same manner I will set his hand also in the sea and his right hand in the rivers."},{"num":26,"verse":"He shall call me, Thou art my father, my God, and the rock of my saving health."},{"num":27,"verse":"Also I will make him my firstborn, high above the kings of the earth."},{"num":28,"verse":"I will keep my mercy for him for ever, and my covenant shall stand fast with him."},{"num":29,"verse":"I will also make his seed to endure for ever, and his throne as the days of the heavens."},{"num":30,"verse":"If his sons forsake my law and do not walk in my judgments,"},{"num":31,"verse":"if they profane my statutes and do not keep my commandments,"},{"num":32,"verse":"then I will visit their rebellion with the rod and their iniquity with stripes."},{"num":33,"verse":"Nevertheless I will not take my mercy from him, neither will I falsify my truth."},{"num":34,"verse":"I will not profane my covenant, nor alter the thing that is gone out of my lips."},{"num":35,"verse":"Once have I sworn by my holiness that I will not lie unto David."},{"num":36,"verse":"His seed shall endure for ever and his throne as the sun before me."},{"num":37,"verse":"It shall be established for ever as the moon and as a faithful witness in heaven. Selah."},{"num":38,"verse":"¶ But thou hast cast off and abhorred thine anointed; thou hast been wroth with him."},{"num":39,"verse":"Thou hast made void the covenant of thy slave; thou hast profaned his crown by casting it to the ground."},{"num":40,"verse":"Thou hast broken down all his hedges; thou hast brought his strong holds to ruin."},{"num":41,"verse":"All that pass by the way spoil him; he is a reproach to his neighbours."},{"num":42,"verse":"Thou hast set up the right hand of his adversaries; thou hast made all his enemies to rejoice."},{"num":43,"verse":"Thou hast also blunted the edge of his sword and hast not made him to stand in the battle."},{"num":44,"verse":"Thou hast made his clarity to cease and cast his throne down to the ground."},{"num":45,"verse":"The days of his youth hast thou shortened; thou hast covered him with shame. Selah."},{"num":46,"verse":"How long, O LORD? wilt thou hide thyself for ever? shall thy wrath burn like fire?"},{"num":47,"verse":"Remember how short my time is; why hast thou made all men subject to vanity?"},{"num":48,"verse":"What man is he that lives and shall not see death? shall he deliver his soul from the hand of Sheol? Selah."},{"num":49,"verse":"Lord, where are thy former mercies, which thou didst sware unto David in thy truth?"},{"num":50,"verse":"Remember, Lord, the reproach of thy slaves; how I do bear in my bosom the reproach of many peoples,"},{"num":51,"verse":"because thine enemies have dishonoured, O LORD; they have dishonoured the footsteps of thine anointed."},{"num":52,"verse":"Blessed be the LORD for ever. Amen and Amen."}]