[{"num":89,"verse":"(A maskil of Eitan the Ezrachi). I will sing of the mercies of Hashem olam; with my mouth will I make known Thy emunah (faithfulness) to dor vador."},{"num":3,"verse":"For I have said, Chesed shall be built up olam; Thy emunah (faithfulness) shalt Thou establish in Shomayim itself."},{"num":4,"verse":"I have made a Brit with My Bechir (Chosen one), I have sworn unto Dovid Avdi,"},{"num":5,"verse":"Thy Zera will I establish ad olam, and build up thy kisse to dor vador. Selah."},{"num":6,"verse":"And Shomayim shall praise Thy wonders, O Hashem; Thy emunah (faithfulness) also in the Kahal Kedoshim."},{"num":7,"verse":"For who in the heavens can be compared unto Hashem? Who among the bnei elim can be likened unto Hashem?"},{"num":8,"verse":"G-d is greatly to be feared in the sod Kedoshim (council of the holy ones), and is awesome over all them that are around Him."},{"num":9,"verse":"Hashem Elohei Tzva’os, who is like Thee, O Mighty One, Hashem? Thy emunah also surrounds Thee!"},{"num":10,"verse":"Thou rulest the raging of the yam; when the waves thereof arise, Thou stillest them [see Mk 4:41]."},{"num":11,"verse":"Thou hast broken Rachav in pieces, as one that is slain; Thou hast scattered Thine oyevim with Thy strong Zero’a."},{"num":12,"verse":"Shomayim are Thine, Eretz also is Thine; as for the tevel (world) and the fulness thereof, Thou hast founded them."},{"num":13,"verse":"The tzafon (north) and the yamin (south) Thou hast created them; Tavor and Chermon shall sing for joy in Thy Shem."},{"num":14,"verse":"Thou hast a mighty Zero’a; strong is Thy Yad, and exalted is Thy Yamin."},{"num":15,"verse":"Tzedek and mishpat are the foundation of Thy kisse; chesed and emes shall go before Thy face."},{"num":16,"verse":"Ashrei is the people that know the joyful sound; they shall walk, Hashem, in the ohr (light) of Thy countenance."},{"num":17,"verse":"In Thy Shem shall they rejoice kol hayom; and in Thy tzedakah shall they be exalted."},{"num":18,"verse":"For Thou art the tiferet (splendor, glory) of their strength; and in Thy favor our keren shall be exalted."},{"num":19,"verse":"For Hashem is our mogen; and the Kadosh Yisroel is Malkeinu (our king)."},{"num":20,"verse":"Then Thou spoke in chazon (vision) to Thy chasidim, and saidst, I have laid ezer (help) upon one that is mighty; I have exalted one chosen out of the people."},{"num":21,"verse":"I have found Dovid Avdi; with My shemen kadosh (holy oil) meshachtiv (I anointed him);"},{"num":22,"verse":"With whom My yad shall be established; Mine zero’a also shall strengthen him."},{"num":23,"verse":"The oyev (enemy) shall not ensnare him; nor the ben avlah (son of wickedness) afflict him."},{"num":24,"verse":"And I will beat down his tzar before his face, and strike down them that hate him."},{"num":25,"verse":"But My emunah (faithfulness) and My chesed shall be with him; and in My Shem shall his keren be exalted."},{"num":26,"verse":"I will set his yad also upon the yam, and his yamin upon the neharot (rivers)."},{"num":27,"verse":"He shall cry out unto Me, Thou art Avi, Eli, and the Tzur of my Yeshuah (salvation) [Mt 16:16]."},{"num":28,"verse":"Also I will make him My Bechor, elyon (most exalted) of the Malkhei Aretz."},{"num":29,"verse":"My chesed will I be shomer over for him forevermore, and My Brit shall stand unfailing with him."},{"num":30,"verse":"His zera also will I make to endure forever, and his kisse as the days of Shomayim."},{"num":31,"verse":"If his banim forsake My torah, walk not in My mishpatim,"},{"num":32,"verse":"If they violate My chukkot, and are not shomer over My mitzvot;"},{"num":33,"verse":"Then will I visit their peysha with shevet (rod), and their avon (iniquity) with stripes."},{"num":34,"verse":"Nevertheless My chesed will I not utterly take from him, nor suffer My emunah (faithfulness) to fail."},{"num":35,"verse":"My Brit will I not violate, nor alter the thing that is gone out of My lips."},{"num":36,"verse":"Once have I sworn by My Kodesh; I will not lie unto Dovid."},{"num":37,"verse":"His zera shall endure l’olam, and his kisse as the shemesh before Me."},{"num":38,"verse":"It shall be established olam as the yarei’ach, and as an ed ne’eman (a faithful witness) in the heavens. Selah."},{"num":39,"verse":"But Thou hast cast off [mem-alef-samech, see same word Psalm 118:22] and abhorred, Thou hast been in wrath with Thine Moshiach."},{"num":40,"verse":"Thou hast made void the Brit of Thy eved; Thou hast profaned his nezer (diadem) to the ground."},{"num":41,"verse":"Thou hast broken down all his gederot (hedges); Thou hast brought his strongholds to ruin."},{"num":42,"verse":"All that pass by the derech plunder him; he is a cherpah (reproach) to his shchenim [Mt 27:39]."},{"num":43,"verse":"Thou hast exalted the yamin of his adversaries; Thou hast made all his oyevim to rejoice."},{"num":44,"verse":"Thou hast also turned back the edge of his cherev, and hast not made him to stand in the milchamah."},{"num":45,"verse":"Thou hast made his glory to cease, and cast his kisse down to the ground."},{"num":46,"verse":"The days of his youth hast thou shortened; Thou hast covered him with bushah (shame). Selah."},{"num":47,"verse":"How long, Hashem? Wilt Thou hide Thyself lanetzach (forever)? Shall Thy wrath burn like eish?"},{"num":48,"verse":"Remember how short my time is. For what vanity hast Thou created kol bnei adam?"},{"num":49,"verse":"What gever is he that liveth, and shall not see mavet? Shall he deliver his nefesh from the yad Sheol (power of Sheol)? Selah."},{"num":50,"verse":"Adonoi, where are Thy former lovingkindnesses, which Thou didst swear unto Dovid in Thy emunah?"},{"num":51,"verse":"Remember, Adonoi, the reproach of Thy avadim; how I do bear in my kheyk (bosom) the reproach of all rabbim amim (many peoples);"},{"num":52,"verse":"Wherewith Thine oyevim have reproached, Hashem; wherewith they have reproached the ikkevot (footsteps) of Thine Moshiach."},{"num":53,"verse":"Baruch Hashem l’olam. Omein and Omein."}]