[{"num":89,"verse":"The learning of Ethan, (the) Ezrahite. I shall sing [into] without end; the mercies of the Lord. In generation and into generation; I shall tell thy truth with my mouth. (The teaching of Ethan, the Ezrahite. I shall sing of the Lord’s constant love forever. To all generations, I shall tell out thy faithfulness with my mouth.)"},{"num":2,"verse":"For thou saidest, [Into] Without end mercy shall be builded in heavens; thy truth shall be made ready in those. (For thy love shall last forever; thy faithfulness is as enduring as the heavens.)"},{"num":3,"verse":"I disposed a testament to my chosen men; I swore to David, my servant, (Thou saidest, I made a covenant with my chosen man; I swore to my servant David,)"},{"num":4,"verse":"Till into without end I shall make ready thy seed. And I shall build thy seat; in generation, and into generation. (that I shall establish thy children, or thy descendants, forever. And I shall preserve thy throne; for all generations.)"},{"num":5,"verse":"Lord, heavens shall acknowledge thy marvels; and thy truth in the church of saints. (Lord, the heavens shall praise thy marvellous deeds; and the council of the saints shall praise thy faithfulness.)"},{"num":6,"verse":"For who in the clouds shall be made even to the Lord; shall be like God among the sons of God? (For who in heaven shall be made equal to the Lord? who shall be like God among the heavenly beings?/who shall be like God in the council of heaven?)"},{"num":7,"verse":"God, that is glorified in the council of saints; is great, and dreadful over all that be in his compass. (God, thou art feared/thou art revered, in the council of the saints; thou art great, and glorified above all who surround thee.)"},{"num":8,"verse":"Lord God of virtues, who is like thee? Lord, thou art mighty, and thy truth is in thy compass. (Lord God of hosts, who is like thee? Lord, thou art mighty, and thy faithfulness surroundeth thee.)"},{"num":9,"verse":"Thou art Lord of the power of the sea; forsooth thou assuagest the stirring of the waves thereof."},{"num":10,"verse":"Thou madest low the proud, as (those who be) wounded (and slain); in the arm of thy strength thou hast scattered thine enemies. (Thou hast crushed Rahab to death; thou hast scattered thy enemies with thy strong arm, or with thy power.)"},{"num":11,"verse":"(The) Heavens be thine, and the earth is thine; thou hast founded the world, and the fullness thereof;"},{"num":12,"verse":"thou madest of nought the north and the sea. Tabor and Hermon shall make full out joy in thy name; (thou madest the north and the south out of nothing. Tabor and Hermon shall make full out joy, or shall rejoice, in thy name.)"},{"num":13,"verse":"thine arm with power. Thine hand be made steadfast, and thy right hand be enhanced; (Thy arm hath power; let thy hand be made firm, and thy right hand be lifted high.)"},{"num":14,"verse":"rightfulness and doom is the making ready of thy seat. Mercy and truth shall go before thy face; (Righteousness and judgement be the foundations of thy throne; love and faithfulness go forth before thee.)"},{"num":15,"verse":"blessed is the people that know (a) hearty song. Lord, they shall go in the light of thy cheer; (Happy be the people who know a hearty song; Lord, they shall go forth by the light of thy face.)"},{"num":16,"verse":"and in thy name they shall make full out joy all day; and they shall be enhanced in thy rightfulness. (And in thy name, they shall make full out joy, or shall rejoice, all day long; and they shall be exalted, or shall be lifted up, by thy righteousness.)"},{"num":17,"verse":"For thou art the glory of the virtue of them; and in thy good pleasance our horn shall be enhanced. (For thou art the glory of their strength/For thou art the strength in which they have glory; and in thy good favour our horn shall be exalted.)"},{"num":18,"verse":"For our taking up is of the Lord; and of the holy of Israel our king. (For the Lord is our defender; yea, the Holy One of Israel is our King.)"},{"num":19,"verse":"Then thou spakest in revelation to thy saints, and saidest, I have set help in the mighty (man); and I have enhanced the chosen man of my people. (Then thou spokest in revelation to thy saints, and saidest, I have given help to the mighty man; yea, I have exalted, or lifted up, the chosen man of my people.)"},{"num":20,"verse":"I found David, my servant; I anointed him with mine holy oil. (I found my servant David; and I anointed him with my holy oil.)"},{"num":21,"verse":"For mine hand shall help him; and mine arm shall confirm him. (For my hand shall help him; and my arm, or my power, shall strengthen him.)"},{"num":22,"verse":"The enemy shall nothing profit in him (The enemy shall not gain any advantage over him); and the son of wickedness shall not lay to/shall not put to, for to harm him."},{"num":23,"verse":"And I shall slay his enemies from his face; and I shall turn into flight them that hate him. (And I shall kill all his enemies before his face; and I shall turn to flight, or make to flee, those who hate him.)"},{"num":24,"verse":"And my truth and mercy shall be with him; and his horn shall be enhanced in my name. (And my faithfulness and love shall be with him; and in my name his horn shall be exalted/his head shall be lifted up on high.)"},{"num":25,"verse":"And I shall set his hand in the sea; and his right hand in floods. (And I shall extend his power unto the Mediterranean Sea; and his right hand unto the Euphrates River.)"},{"num":26,"verse":"He shall inwardly call me, (saying,) Thou art my father; my God, and the up-taker of mine health. (And he shall say to me, Thou art my father; yea, my God, and my defender, my saviour.)"},{"num":27,"verse":"And I shall set him the first begotten son; higher than the kings of earth. (And I shall make him my first-born son; higher than all the kings of the earth.)"},{"num":28,"verse":"[Into] Without end I shall keep my mercy to him; and my testament faithful to him. (I shall hold onto my love for him forever; and faithfully keep my covenant with him.)"},{"num":29,"verse":"And I shall set his seed into the world of world; and his throne as the days of heaven. (And I shall establish his descendants forever and ever; and his throne for as long as the days of the heavens, that is, for as long as the heavenly bodies endure.)"},{"num":30,"verse":"Forsooth if his sons forsake my law; and go not in my dooms. (But if his sons abandon my Law; and do not go in my judgements.)"},{"num":31,"verse":"If they make unholy my rightfulnesses; and keep not my commandments. (If they break my statutes; and do not obey my commandments.)"},{"num":32,"verse":"I shall visit in a rod the wickednesses of them; and in beatings the sins of them. (Then I shall punish their wickednesses with a rod; and their sins with beatings.)"},{"num":33,"verse":"But I shall not scatter my mercy from him; and in my truth I shall not harm him. (But I shall not take away my love from him; and I shall be faithful to him.)"},{"num":34,"verse":"Neither I shall make unholy my testament; and I shall not make void those things that come forth of my lips. (Nor shall I break my covenant; and I shall not make void those things which come forth from my lips, that is, I shall not break my promises.)"},{"num":35,"verse":"Once I swore in mine holiness, I shall not lie to David; (Once I swore by my holiness, that I would never lie to David;)"},{"num":36,"verse":"his seed shall dwell [into] without end. And his throne as [the] sun in my sight, (his children, that is, his descendants, shall live forever. And his throne shall be before me like the sun,)"},{"num":37,"verse":"and as a perfect moon without end; and a faithful witness in heaven. (and like the moon, which shall endure forever; yea, like a faithful witness in the heavens.)"},{"num":38,"verse":"But thou hast put away, and despised; and hast delayed thy christ. (But thou hast rejected, and despised, and hast raged against thy anointed king.)"},{"num":39,"verse":"Thou hast turned away the testament of thy servant; thou madest unholy his saintuary in earth. (Thou hast made void the covenant with thy servant; thou hast defiled his crown, and hast thrown it to the ground.)"},{"num":40,"verse":"Thou destroyedest all the hedges thereof; thou hast set the steadfastness thereof (into) dread (thou hast brought his strongholds, or his fortresses, into ruin)."},{"num":41,"verse":"All men passing by the way ravished him; he is made (a) shame to his neighbours. (All who pass by him, on the way, rob him; he is shamed by his neighbours.)"},{"num":42,"verse":"Thou hast enhanced the right hand of men oppressing him; thou hast gladdened all his enemies."},{"num":43,"verse":"Thou hast turned away the help of his sword; and thou helpedest not him in battle (and thou hast not helped him in the battle)."},{"num":44,"verse":"Thou destroyedest him from cleansing; and thou hast hurled down his seat in earth. (Thou hast destroyed his purity; and thou hast thrown down his throne to the ground.)"},{"num":45,"verse":"Thou hast made less the days of his time; thou hast beshed him with shame."},{"num":46,"verse":"Lord, how long turnest thou away, into the end; shall thine ire burn out as fire? (Lord, how long turnest thou away, forever? shall thy anger always burn like fire?)"},{"num":47,"verse":"Bethink thou what is my substance; for whether thou hast ordained vainly all the sons of men? (Remember thou what my substance is/how short my time is; hast thou ordained all the sons of men in vain?)"},{"num":48,"verse":"Who is a man, that shall live, and shall not see death; shall (he) deliver his soul from the hand of hell? (What man shall live, and shall not see death? can he save his soul from the power of Sheol, or the land of the dead?/from the power of the grave?)"},{"num":49,"verse":"Lord, where be thine eld mercies; as thou hast sworn to David in thy truth? (Lord, where be the former acts, or the earlier proofs, of thy constant love? yea, those promises that thou hast sworn to David in thy faithfulness?)"},{"num":50,"verse":"Lord, be thou mindful of the shame of thy servants; (of the curses) of many heathen men, which I held together in my bosom. (Lord, remember thy servant’s shame; remember the curses of many of the heathen, which I carried in my heart.)"},{"num":51,"verse":"Which thine enemies, Lord, did shamefully; for they despised the changing of thy christ. (Which thy enemies, Lord, spoke shamefully to me; for they despised the footsteps of thy anointed king/for they despised the successors of thy anointed king.)"},{"num":52,"verse":"Blessed be the Lord [into] without end (Blessed be the Lord forever); be it done, be it done."}]