[{"header":"Abraham and the Covenant of Circumcision"},{"num":17,"verse":"When Abram was ninety-nine years old, the Lord appeared to him and said,"},{"num":3,"verse":"Then Abram fell on his face [in worship], and God spoke with him, saying,"},{"num":6,"verse":"I will make you exceedingly fruitful, and I will make nations of you, and kings will come from you. "},{"num":7,"verse":"I will establish My covenant between Me and you and your descendants after you throughout their generations for an everlasting covenant, to be God to you and to your descendants after you. "},{"num":8,"verse":"I will give to you and to your descendants after you the land in which you are a stranger [moving from place to place], all the land of Canaan, as an everlasting possession [of property]; and I will be their God.”"},{"num":9,"verse":"Further, God said to Abraham, “As for you [your part of the agreement], you shall keep and faithfully obey [the terms of] My covenant, you and your descendants after you throughout their generations. "},{"num":10,"verse":"This is [the sign of] My covenant, which you shall keep and faithfully obey, between Me and you and your descendants after you: Every male among you shall be circumcised. "},{"num":11,"verse":"And you shall be circumcised in the flesh of your foreskins, and it shall be the sign (symbol, memorial) of the covenant between Me and you. "},{"num":12,"verse":"Every male among you who is eight days old shall be circumcised throughout your generations, [including] a servant whether born in the house or one who is purchased with [your] money from any foreigner, who is not of your descendants. "},{"num":13,"verse":"A servant who is born in your house or one who is purchased with your money must be circumcised; and [the sign of] My covenant shall be in your flesh for an everlasting covenant. "},{"num":14,"verse":"And the male who is not circumcised in the flesh of his foreskin, that person shall be cut off from his people; he has broken My covenant.”"},{"num":15,"verse":"Then God said to Abraham, “As for Sarai your wife, you shall not call her name Sarai (my princess), but her name will be Sarah (Princess). "},{"num":16,"verse":"I will bless her, and indeed I will also give you a son by her. Yes, I will bless her, and she shall be a mother of nations; kings of peoples will come from her.” "},{"num":17,"verse":"Then Abraham fell on his face and laughed, and said in his heart, “Shall a child be born to a man who is a hundred years old? And shall Sarah, who is ninety years old, bear a child?” "},{"num":18,"verse":"And Abraham said to God, “Oh, that Ishmael [my firstborn] might live before You!” "},{"num":19,"verse":"But God said, “No, Sarah your wife shall bear you a son indeed, and you shall name him Isaac (laughter); and I will establish My covenant with him for an everlasting covenant and with his descendants after him. "},{"num":20,"verse":"As for Ishmael, I have heard and listened to you; behold, I will bless him, and will make him fruitful and will greatly multiply him [through his descendants]. He will be the father of twelve princes (chieftains, sheiks), and I will make him a great nation. "},{"num":21,"verse":"But My covenant [My promise, My solemn pledge], I will establish with Isaac, whom Sarah will bear to you at this time next year.” "},{"num":22,"verse":"And God finished speaking with him and went up from Abraham."},{"num":23,"verse":"Then Abraham took Ishmael his son, and all the servants who were born in his house and all who were purchased with his money, every male among the men of Abraham’s household, and circumcised the flesh of their foreskin the very same day, as God had said to him. "},{"num":24,"verse":"So Abraham was ninety-nine years old when he was circumcised. "},{"num":25,"verse":"And Ishmael his son was thirteen years old when he was circumcised. "},{"num":26,"verse":"On the very same day Abraham was circumcised, as well as Ishmael his son. "},{"num":27,"verse":"All the men [servants] of his household, both those born in the house and those purchased with money from a foreigner, were circumcised along with him [as the sign of God’s covenant with Abraham]."}]