[[],[{"type":"header","content":"The Law of Guilt Offerings"},{"type":"prose","content":"‘If anyone sins after he hears a public adjuration (solemn command to testify) when he is a witness, whether he has seen or [otherwise] known [something]—if he fails to report it, then he will bear his guilt  be held responsible. "}],[{"type":"prose","content":"Or if someone touches any [ceremonially] unclean thing—whether the carcass of an unclean wild animal or the carcass of an unclean domestic animal or the carcass of unclean creeping things—even if he is unaware of it, he has become unclean, and he will be guilty. "}],[{"type":"prose","content":"Or if he touches human uncleanness—whatever kind it may be—and he becomes unclean, but he is unaware of it, when he recognizes it, he will be guilty. "}],[{"type":"prose","content":"Or if anyone swears [an oath] thoughtlessly  impulsively aloud that he will do either evil or good, in whatever manner a person may speak thoughtlessly  impulsively with an oath, but he is unaware of it, when he recognizes it, he will be guilty in one of these. "}],[{"type":"prose","content":"So it shall be when a person is guilty in one of these, that he shall confess the sin he has committed. "}],[{"type":"prose","content":"He shall bring his guilt offering to the LORD for the sin which he has committed, a female from the flock, a lamb or a goat as a sin offering. So the priest shall make atonement on his behalf for his sin."}],[{"type":"prose","content":"‘But if he cannot afford a lamb, then he shall bring two turtledoves or two young pigeons as his guilt offering for his sin to the LORD, one as a sin offering and the other as a burnt offering. "}],[{"type":"prose","content":"He shall bring them to the priest, who shall offer first the one for the sin offering, and shall nip its head at the front of its neck, but shall not sever it [completely]. "}],[{"type":"prose","content":"He shall also sprinkle some of the blood of the sin offering on the side of the altar, and the rest of the blood shall be drained out at the base of the altar; it is a sin offering. "}],[{"type":"prose","content":"The second [bird] he shall prepare as a burnt offering, according to the ordinance. So the priest shall make atonement on his behalf for the sin which he has committed, and it will be forgiven him."}],[{"type":"prose","content":"‘But if he cannot afford to bring two turtledoves or two young pigeons, then he shall bring as his offering for his sin the tenth part of an ephah of fine flour as a sin offering; he shall not put [olive] oil or incense on it, for it is a sin offering. "}],[{"type":"prose","content":"He shall bring it to the priest, who shall take a handful of it as a memorial portion and offer it up in smoke on the altar, with the offerings by fire to the LORD; it is a sin offering. "}],[{"type":"prose","content":"In this way the priest shall make atonement for him for the sin which he has committed in one of these things, and it will be forgiven him; then  shall be for the priest, like the grain offering.’”"}],[{"type":"prose","content":"Then the LORD spoke to Moses, saying, "}],[{"type":"prose","content":"“If a person commits a breach of faith and sins unintentionally against the holy things of the LORD, then he shall bring his guilt offering to the LORD, a ram without blemish from the flock, valued by you in shekels of silver, that is, the shekel of the sanctuary, as a guilt offering. "}],[{"type":"prose","content":"He shall make restitution for the sin which he has committed against the holy thing, and shall add a fifth [of the ram’s value] to it, and give it to the priest. The priest shall then make atonement for him with the ram of the guilt offering, and he shall be forgiven."}],[{"type":"prose","content":"“Now if anyone sins and does any of the things which the LORD has forbidden, though he was not aware of it, still he is guilty and shall bear his punishment. "}],[{"type":"prose","content":"He is then to bring to the priest a ram without blemish from the flock, according to your valuation, for a guilt offering. In this way the priest shall make atonement for him regarding the error which he committed unintentionally and did not know it, and he shall be forgiven. "}],[{"type":"prose","content":"It is a guilt offering; he was certainly guilty before the LORD.”"}]]