[{"num":5,"verse":"If you refuse to testify in court about something you saw or know has happened, you have sinned and can be punished."},{"num":2,"verse":"You are guilty and unfit to worship me, if you accidentally touch the dead body of any kind of unclean animal."},{"num":3,"verse":"You are guilty if you find out that you have accidentally touched any waste that comes from a human body."},{"num":4,"verse":"You are guilty the moment you realize that you have made a hasty promise to do something good or bad."},{"num":5,"verse":"As soon as you discover that you have committed any of these sins, you must confess what you have done. "},{"num":6,"verse":"Then you must bring a female sheep or goat to me as the price for your sin. A priest will sacrifice the animal, and you will be forgiven."},{"num":7,"verse":"If you are poor and cannot afford to bring an animal, you may bring two doves or two pigeons. One of these will be a sacrifice to ask my forgiveness, and the other will be a sacrifice to please me."},{"num":8,"verse":"Give both birds to the priest, who will offer one as a sacrifice to ask my forgiveness. He will wring its neck without tearing off its head, "},{"num":9,"verse":"splatter some of its blood on one side of the bronze altar, and drain out the rest at the foot of the altar. "},{"num":10,"verse":"Then he will follow the proper rules for offering the other bird as a sacrifice to please me."},{"num":11,"verse":"If you are so poor that you cannot afford doves or pigeons, you may bring two pounds of your finest flour. This is a sacrifice to ask my forgiveness, so don’t sprinkle olive oil or sweet-smelling incense on it. "},{"num":12,"verse":"Give the flour to a priest, who will scoop up a handful and send it up in smoke together with the other offerings. This is a reminder that all of the flour belongs to me. "},{"num":13,"verse":"By offering this sacrifice, the priest pays the price for any of these sins you may have committed. The priest gets the rest of the flour, just as he does with grain sacrifices."},{"header":"Sacrifices To Make Things Right"},{"num":14,"verse":"The Lord told Moses what the people must do to make things right when they find out they have cheated the Lord without meaning to:"},{"num":16,"verse":"In addition, you must pay what you owe plus a fine of twenty percent. Then the priest will offer the ram as a sacrifice to make things right, and you will be forgiven."},{"num":17,"verse":"If you break any of my commands without meaning to, you are still guilty, and you can be punished. When you realize what you have done, you must either bring to the priest a ram that has nothing wrong with it or else pay him for one. The priest will then offer it as a sacrifice to make things right, and you will be forgiven."}]