[{"header":"Different Accidental Sins"},{"num":5,"verse":"“You might be called as a witness and take an oath to tell the truth. If you saw something or knew something but did not tell it, you are guilty of doing wrong and must bear the responsibility for your guilt."},{"num":2,"verse":"“You might touch something unclean. It might be the dead body of any kind of animal. You might not know that you touched these things, but you will still become unclean and must pay a fine."},{"num":3,"verse":"“You might touch any of the many things that can make a person unclean. You might touch something unclean, but not know about it. When you learn that you have touched something unclean, you must pay a fine."},{"num":4,"verse":"“You might make a quick promise to do something—it makes no difference if it is bad or good. People make many kinds of quick promises. You might make such a promise and forget it. When you remember your promise, you must pay a fine because you did not keep it."},{"num":5,"verse":"If you are guilty of any of these things, you must confess whatever you did wrong."},{"num":6,"verse":"Then you must bring your guilt offering to the Lord for the sin you did. You must bring a female lamb or a female goat as a sin offering. The priest will do this to make you pure from your sin."},{"num":7,"verse":"“If you cannot afford a lamb, you must bring two doves or two young pigeons to the Lord. These will be the guilt offering for your sin. One bird must be for a sin offering, and the other must be for a burnt offering."},{"num":8,"verse":"Take them to the priest. First, the priest will offer one bird for the sin offering. The priest will pull the bird’s head from its neck but he will not pull it off completely."},{"num":9,"verse":"The priest will sprinkle the blood from the sin offering on the side of the altar. Then he will pour out the rest of the blood at the base of the altar. It is a sin offering."},{"num":10,"verse":"Then he will offer the second bird according to the rules for a burnt offering. The priest will do this to make you pure from the sin you did, and God will forgive you."},{"num":11,"verse":"“If you cannot afford two doves or two pigeons, you must bring 8 cups of fine flour as your sin offering. You must not put oil or frankincense on the flour because it is a sin offering."},{"num":12,"verse":"You must bring the flour to the priest. The priest will take a handful of the flour as the memorial offering and bring it to the altar as a gift to the Lord. It is a sin offering."},{"num":13,"verse":"The priest will do this to make you pure, and God will forgive you. The part that is left will belong to the priest, just as the regular grain offering.”"},{"num":14,"verse":"The Lord gave this command to Moses for the people:"},{"num":15,"verse":"“You might promise to give something to the Lord. You might sin against me without meaning to by not giving what you promised. If you do that, you must bring a ram that has nothing wrong with it (or the same amount in silver using the official measure) as a guilt offering."},{"num":16,"verse":"You must give what you promised and add one-fifth of that amount as a fine. Give it to the priest and he will use the ram to make you pure, and God will forgive you."},{"num":17,"verse":"“If you sin and break any of the commands that the Lord said must not be done, you are guilty. Even if you did not know about it, you are still responsible for your sin."},{"num":18,"verse":"You must bring a ram that has nothing wrong with it (or the same amount in silver) to the priest. The priest will offer the ram, and God will forgive you for the sin you did without knowing it."},{"num":19,"verse":"You are guilty, and you must pay the guilt offering to the Lord.”"}]