[{"header":"Laws of Public Testimony"},{"num":5,"verse":"“If someone sins because he has failed to testify after receiving notice to testify as a witness regarding what he has observed or learned, he is to be held responsible.”"},{"header":"Offerings for Uncleanness"},{"num":2,"verse":"“When a person has touched a ceremonially unclean thing inadvertently, such as the carcass of an unclean animal, or some unclean creeping thing, he will be unclean and guilty nevertheless. "},{"num":3,"verse":"When he inadvertently touches the uncleanness of a human being, whatever his uncleanness that made him unclean may be, when he himself comes to know about it, he will be guilty. "},{"num":4,"verse":"When a person has sworn inadvertently by what he has said, whether for evil or good, whatever it was that the person spoke, when he comes to understand what he said, he will incur guilt by one of these things. "},{"num":5,"verse":"When a person is guilty of one of these things, then he is to confess whatever sin it was "},{"num":6,"verse":"and bring compensation to the Lord for the guilt that he committed: a female from the flock—whether a lamb or goat—for a sin offering. Then the priest is to make atonement for him.”"},{"header":"Inexpensive Offering Alternatives"},{"num":7,"verse":"“If he can’t afford a goat, then he is to bring to the Lord for his sin offering two turtledoves or two young doves: one for a sin offering and the other for a burnt offering. "},{"num":8,"verse":"He is to bring them to the priest, who will offer a sin offering first. He is to wring off its head without separating it. "},{"num":9,"verse":"Then he is to sprinkle some of the blood from the sin offering on the sidewall of the altar. Now as to the remainder of the blood, he is to pour it out at the base of the altar for a sin offering. "},{"num":10,"verse":"With respect to the second offering, he is to prepare it as a burnt offering, according to the approved procedure. The priest is to make atonement for him on account of his sin that he had committed. Then it will be forgiven him."},{"num":11,"verse":"“If he can’t afford two turtledoves or two young doves, then he is to bring as his offering a tenth of an ephah of fine flour as a sin offering for what he has committed. He is to put no olive oil or frankincense on it, since it’s a sin offering. "},{"num":12,"verse":"He is to bring it to the priest. The priest is to take a handful as a memorial and burn it on the altar as an offering made by fire to the Lord. It’s a sin offering. "},{"num":13,"verse":"The priest will make atonement for him, on account of the sin that he had committed in any of these things and it will be forgiven him. As far as the priest is concerned, it will be a meal offering.”"},{"header":"Offerings for Inadvertent Sins"},{"num":14,"verse":"The Lord told Moses, "},{"num":15,"verse":"“When a person commits a truly treacherous act and sins inadvertently concerning the sacred things of the Lord, then he is to bring a trespass offering to the Lord from the flock as compensation for his guilt. It is to be a ram without defect, estimated as to its value in silver shekels, according to the sanctuary shekel. "},{"num":16,"verse":"He is to compensate for whatever sin he had committed concerning the sacred things of the Lord, add a fifth part to it, and give it to the priest. The priest is to make atonement for him with the ram as a sin offering and he’ll be forgiven."},{"num":17,"verse":"“If a person sins and does what the Lord commanded is not to be done, and if he didn’t know that he had sinned, then he will be guilty nevertheless. "},{"num":18,"verse":"He is to bring from the flock to the priest a ram without defect, estimated as to its value in silver shekels, as a guilt offering. Then the priest is to make atonement for him concerning his inadvertent act that he committed through ignorance, and it will be forgiven him. "},{"num":19,"verse":"It’s a sin offering for his guilt in the Lord’s presence.”"}]