[{"header":"Chapter 33"},{"num":1,"verse":"The Prophet as Sentinel. The word of the Lord came to me: "},{"num":2,"verse":"Son of man, speak to your people and tell them: When I bring the sword against a land, if the people of that land select one of their number as a sentinel for them, "},{"num":3,"verse":"and the sentinel sees the sword coming against the land, he should blow the trumpet to warn the people. "},{"num":4,"verse":"If they hear the trumpet but do not take the warning and a sword attacks and kills them, their blood will be on their own heads. "},{"num":5,"verse":"They heard the trumpet blast but ignored the warning; their blood is on them. If they had heeded the warning, they could have escaped with their lives. "},{"num":6,"verse":"If, however, the sentinel sees the sword coming and does not blow the trumpet, so that the sword attacks and takes someone’s life, his life will be taken for his own sin, but I will hold the sentinel responsible for his blood."},{"num":7,"verse":"You, son of man—I have appointed you as a sentinel for the house of Israel; when you hear a word from my mouth, you must warn them for me. "},{"num":8,"verse":"When I say to the wicked, “You wicked, you must die,” and you do not speak up to warn the wicked about their ways, they shall die in their sins, but I will hold you responsible for their blood. "},{"num":9,"verse":"If, however, you warn the wicked to turn from their ways, but they do not, then they shall die in their sins, but you shall save your life."},{"num":10,"verse":"Individual Retribution. As for you, son of man, speak to the house of Israel: You people say, “Our crimes and our sins weigh us down; we are rotting away because of them. How can we survive?” "},{"num":11,"verse":"Answer them: As I live—oracle of the Lord God—I swear I take no pleasure in the death of the wicked, but rather that they turn from their ways and live. Turn, turn from your evil ways! Why should you die, house of Israel?"},{"num":12,"verse":"As for you, son of man, say to your people: The justice of the just will not save them on the day they sin; the wickedness of the wicked will not bring about their downfall on the day they turn from their wickedness. No, the just cannot save their lives on the day they sin. "},{"num":13,"verse":"Even though I say to the just that they shall surely live, if they, relying on their justice, do wrong, none of their just deeds shall be remembered; because of the wrong they have done, they shall die. "},{"num":14,"verse":"And though I say to the wicked that they shall die, if they turn away from sin and do what is just and right— "},{"num":15,"verse":"returning pledges, restoring stolen goods, walking by statutes that bring life, doing nothing wrong—they shall surely live; they shall not die. "},{"num":16,"verse":"None of the sins they committed shall be remembered against them. If they do what is right and just, they shall surely live."},{"num":17,"verse":"Your people say, “The way of the Lord is not fair!” But it is their way that is not fair. "},{"num":18,"verse":"When the just turn away from justice and do wrong, they shall die for it. "},{"num":19,"verse":"When the wicked turn away from wickedness and do what is right and just, because of this they shall live. "},{"num":20,"verse":"But still you say, “The way of the Lord is not fair!” I will judge each of you according to your ways, house of Israel."},{"num":21,"verse":"The Survivor from Jerusalem. On the fifth day of the tenth month, in the twelfth year of our exile, the survivor came to me from Jerusalem and said, “The city is taken!” "},{"num":22,"verse":"The hand of the Lord had come upon me the evening before the survivor arrived and opened my mouth when he reached me in the morning. My mouth was opened, and I was mute no longer."},{"num":23,"verse":"The word of the Lord came to me: "},{"num":24,"verse":"Son of man, these who live among the ruins in the land of Israel are saying: “Abraham was only one person, yet he was given possession of the land. Since we are many, the land must be given to us as our possession.” "},{"num":25,"verse":"Therefore say to them: Thus says the Lord God: You eat on the mountains, you raise your eyes to your idols, you shed blood—yet you would keep possession of the land? "},{"num":26,"verse":"You rely on your swords, you commit abominations, each defiles his neighbor’s wife—yet you would keep possession of the land? "},{"num":27,"verse":"Say this to them: Thus says the Lord God: As I live, those among the ruins shall fall by the sword; those in the open field I have made food for the wild beasts; and those in rocky hideouts and caves shall die by the plague. "},{"num":28,"verse":"I will make the land a desolate waste, so that its proud strength will come to an end, and the mountains of Israel shall be so desolate that no one will cross them. "},{"num":29,"verse":"Thus they shall know that I am the Lord, when I make the land a desolate waste because of all the abominations they committed."},{"num":30,"verse":"Popular Misunderstanding. As for you, son of man, your people are talking about you beside the walls and in the doorways of houses. They say to one another, “Let’s go hear the latest word that comes from the Lord.” "},{"num":31,"verse":"My people come to you, gathering as a crowd and sitting in front of you to hear your words, but they will not act on them. Love songs are on their lips, but in their hearts they pursue dishonest gain. "},{"num":32,"verse":"For them you are only a singer of love songs, with a pleasant voice and a clever touch. They listen to your words, but they do not obey them. "},{"num":33,"verse":"But when it comes—and it is surely coming!—they shall know that there was a prophet among them."}]