[{"header":"Psalm 37"},{"num":1,"verse":"Fret not yourself because of evildoers, neither be envious against those who work unrighteousness (that which is not upright or in right standing with God)."},{"num":2,"verse":"For they shall soon be cut down like the grass, and wither as the green herb."},{"num":3,"verse":"Trust (lean on, rely on, and be confident) in the Lord and do good; so shall you dwell in the land and feed surely on His faithfulness, and truly you shall be fed."},{"num":4,"verse":"Delight yourself also in the Lord, and He will give you the desires and secret petitions of your heart."},{"num":5,"verse":"Commit your way to the Lord [roll and repose each care of your load on Him]; trust (lean on, rely on, and be confident) also in Him and He will bring it to pass."},{"num":6,"verse":"And He will make your uprightness and right standing with God go forth as the light, and your justice and right as [the shining sun of] the noonday."},{"num":7,"verse":"Be still and rest in the Lord; wait for Him and patiently lean yourself upon Him; fret not yourself because of him who prospers in his way, because of the man who brings wicked devices to pass."},{"num":8,"verse":"Cease from anger and forsake wrath; fret not yourself—it tends only to evildoing."},{"num":9,"verse":"For evildoers shall be cut off, but those who wait and hope and look for the Lord [in the end] shall inherit the earth."},{"num":10,"verse":"For yet a little while, and the evildoers will be no more; though you look with care where they used to be, they will not be found."},{"num":11,"verse":"But the meek [in the end] shall inherit the earth and shall delight themselves in the abundance of peace."},{"num":12,"verse":"The wicked plot against the [uncompromisingly] righteous (the upright in right standing with God); they gnash at them with their teeth."},{"num":13,"verse":"The Lord laughs at [the wicked], for He sees that their own day [of defeat] is coming."},{"num":14,"verse":"The wicked draw the sword and bend their bows to cast down the poor and needy, to slay those who walk uprightly (blameless in conduct and in conversation)."},{"num":15,"verse":"The swords [of the wicked] shall enter their own hearts, and their bows shall be broken."},{"num":16,"verse":"Better is the little that the [uncompromisingly] righteous have than the abundance [of possessions] of many who are wrong and wicked."},{"num":17,"verse":"For the arms of the wicked shall be broken, but the Lord upholds the [consistently] righteous."},{"num":18,"verse":"The Lord knows the days of the upright and blameless, and their heritage will abide forever."},{"num":19,"verse":"They shall not be put to shame in the time of evil; and in the days of famine they shall be satisfied."},{"num":20,"verse":"But the wicked shall perish, and the enemies of the Lord shall be as the fat of lambs [that is consumed in smoke] and as the glory of the pastures. They shall vanish; like smoke shall they consume away."},{"num":21,"verse":"The wicked borrow and pay not again [for they may be unable], but the [uncompromisingly] righteous deal kindly and give [for they are able]."},{"num":22,"verse":"For such as are blessed of God shall [in the end] inherit the earth, but they that are cursed of Him shall be cut off."},{"num":23,"verse":"The steps of a [good] man are directed and established by the Lord when He delights in his way [and He busies Himself with his every step]."},{"num":24,"verse":"Though he falls, he shall not be utterly cast down, for the Lord grasps his hand in support and upholds him."},{"num":25,"verse":"I have been young and now am old, yet have I not seen the [uncompromisingly] righteous forsaken or their seed begging bread."},{"num":26,"verse":"All day long they are merciful and deal graciously; they lend, and their offspring are blessed."},{"num":27,"verse":"Depart from evil and do good; and you will dwell forever [securely]."},{"num":28,"verse":"For the Lord delights in justice and forsakes not His saints; they are preserved forever, but the offspring of the wicked [in time] shall be cut off."},{"num":29,"verse":"[Then] the [consistently] righteous shall inherit the land and dwell upon it forever."},{"num":30,"verse":"The mouth of the [uncompromisingly] righteous utters wisdom, and his tongue speaks with justice."},{"num":31,"verse":"The law of his God is in his heart; none of his steps shall slide."},{"num":32,"verse":"The wicked lie in wait for the [uncompromisingly] righteous and seek to put them to death."},{"num":33,"verse":"The Lord will not leave them in their hands, or [suffer them to] condemn them when they are judged."},{"num":34,"verse":"Wait for and expect the Lord and keep and heed His way, and He will exalt you to inherit the land; [in the end] when the wicked are cut off, you shall see it."},{"num":35,"verse":"I have seen a wicked man in great power and spreading himself like a green tree in its native soil,"},{"num":36,"verse":"Yet he passed away, and behold, he was not; yes, I sought and inquired for him, but he could not be found."},{"num":37,"verse":"Mark the blameless man and behold the upright, for there is a happy end for the man of peace."},{"num":38,"verse":"As for transgressors, they shall be destroyed together; in the end the wicked shall be cut off."},{"num":39,"verse":"But the salvation of the [consistently] righteous is of the Lord; He is their Refuge and secure Stronghold in the time of trouble."},{"num":40,"verse":"And the Lord helps them and delivers them; He delivers them from the wicked and saves them, because they trust and take refuge in Him."}]