[{"num":21,"verse":"Jehoshaphat slept with his fathers and was buried with [them] in the City of David. Jehoram his son reigned in his stead."},{"num":2,"verse":"He had brothers: Azariah, Jehiel, Zechariah, Azariah, Michael, and Shephatiah, all the sons of Jehoshaphat king of Israel."},{"num":3,"verse":"Their father gave them great gifts of silver, gold, and precious things, together with fortified cities in Judah, but the kingdom he gave to Jehoram, the firstborn."},{"num":4,"verse":"When Jehoram had ascended to the kingship of his father, he strengthened himself and slew all his brethren with the sword and also some of Israel’s princes."},{"num":5,"verse":"Jehoram at thirty-two years of age began his eight-year reign in Jerusalem."},{"num":6,"verse":"He walked in the ways of the kings of Israel, as did the house of Ahab, for he married the daughter of Ahab and did what was evil in the eyes of the Lord."},{"num":7,"verse":"But the Lord would not destroy the house of David, because He had made a covenant with David and promised to give a light to him and to his sons forever."},{"num":8,"verse":"In Jehoram’s days, the Edomites revolted from the rule of Judah and set up for themselves a king."},{"num":9,"verse":"Then Jehoram passed over [the Jordan] with his captains and all his chariots, and rose up by night and smote the Edomites who had surrounded him and his chariot captains."},{"num":10,"verse":"So Edom revolted from the rule of Judah to this day. Then Libnah also revolted from Jehoram’s rule, because he had forsaken the Lord, the God of his fathers."},{"num":11,"verse":"Moreover, he made idolatrous high places in the hill country of Judah and debauched spiritually the inhabitants of Jerusalem and led Judah astray [compelling the people’s cooperation]."},{"num":12,"verse":"And there came a letter to Jehoram from Elijah the prophet, saying, Thus says the Lord, the God of David your father [forefather]: Because you have not walked in the ways of Jehoshaphat your father nor in the ways of Asa king of Judah,"},{"num":13,"verse":"But have walked in the ways of Israel’s kings, and made Judah and the inhabitants of Jerusalem play the harlot like the [spiritual] harlotry of Ahab’s house, and also have slain your brothers of your father’s house, who were better than you,"},{"num":14,"verse":"Behold, the Lord will smite your people, and your children, your wives, and all your possessions with a great plague."},{"num":15,"verse":"And you yourself shall have a severe illness because of an intestinal disease, until your bowels fall out because of the sickness, day after day."},{"num":16,"verse":"And the Lord stirred up against Jehoram the anger of the Philistines and of the Arabs who were near the Ethiopians."},{"num":17,"verse":"They came against Judah, invaded it, and carried away all the possessions found in and around the king’s house, together with his sons and his wives; so there was not a son left to him except Jehoahaz, the youngest."},{"num":18,"verse":"And after all this, the Lord smote [Jehoram] with an incurable intestinal disease."},{"num":19,"verse":"In process of time, after two years, his bowels fell out because of his disease. So he died in severe distress. And his people made no funeral fire to honor him, like the fires for his fathers."},{"num":20,"verse":"Thirty-two years old was Jehoram when he began to reign, and he reigned in Jerusalem eight years, and departed without being wanted. Yet they buried him in the City of David, but not in the tombs of the kings."}]