[{"num":21,"verse":"When Jehoshaphat died, he was buried in the cemetery of the kings in Jerusalem, and his son Jehoram became the new ruler of Judah. "},{"num":2,"verse":"His brothers—other sons of Jehoshaphat—were Azariah, Jehiel, Zechariah, Azariah, Michael, and Shephatiah. "},{"num":3,"verse":"Their father had given each of them valuable gifts of money and jewels, also the ownership of some of the fortified cities of Judah. However, he gave the kingship to Jehoram because he was the oldest. But when Jehoram had become solidly established as king, he killed all of his brothers and many other leaders of Israel. "},{"num":5,"verse":"He was thirty-two years old when he began to reign, and he reigned eight years in Jerusalem. "},{"num":6,"verse":"But he was as wicked as the kings who were over in Israel. Yes, as wicked as Ahab, for Jehoram had married one of the daughters of Ahab, and his whole life was one constant binge of doing evil. "},{"num":7,"verse":"However, the Lord was unwilling to end the dynasty of David, for he had made a covenant with David always to have one of his descendants upon the throne."},{"num":8,"verse":"At that time the king of Edom revolted, declaring his independence of Judah. "},{"num":9,"verse":"Jehoram attacked him with his full army and with all of his chariots, marching by night, and almost managed to subdue him. "},{"num":10,"verse":"But to this day Edom has been successful in throwing off the yoke of Judah. Libnah revolted too because Jehoram had turned away from the Lord God of his fathers. "},{"num":11,"verse":"What’s more, Jehoram constructed idol shrines in the mountains of Judah and led the people of Jerusalem in worshiping idols; in fact, he compelled his people to worship them."},{"num":12,"verse":"Then Elijah the prophet wrote him this letter: “The Lord God of your ancestor David says that because you have not followed in the good ways of your father Jehoshaphat, nor the good ways of King Asa, "},{"num":13,"verse":"but you have been as evil as the kings over in Israel and have made the people of Jerusalem and Judah worship idols just as in the times of King Ahab, and because you have killed your brothers who were better than you, "},{"num":14,"verse":"now the Lord will destroy your nation with a great plague. You, your children, your wives, and all that you have will be struck down. "},{"num":15,"verse":"You will be stricken with an intestinal disease and your bowels will rot away.”"},{"num":16,"verse":"Then the Lord stirred up the Philistines and the Arabs living next to the Ethiopians to attack Jehoram. "},{"num":17,"verse":"They marched against Judah, broke across the border, and carried away everything of value in the king’s palace, including his sons and his wives; only his youngest son, Jehoahaz, escaped."},{"num":18,"verse":"It was after this that Jehovah struck him down with the incurable bowel disease. "},{"num":19,"verse":"In the process of time, at the end of two years, his intestines came out, and he died in terrible suffering. (The customary pomp and ceremony was omitted at his funeral.) "},{"num":20,"verse":"He was thirty-two years old when he began to reign, and he reigned in Jerusalem eight years and died unmourned. He was buried in Jerusalem, but not in the royal cemetery."}]