[{"header":"Judah Warned against Egyptian Alliance"},{"num":6,"verse":"A [mournful, inspired] oracle (a burden to be carried) concerning the beasts of the Negev (the South):"},{"num":12,"verse":"Therefore, the Holy One of Israel says this,"},{"num":15,"verse":"For the Lord God, the Holy One of Israel has said this,"},{"header":"God Is Gracious and Just"},{"num":19,"verse":"O people in Zion, inhabitant in Jerusalem, you will weep no longer. He will most certainly be gracious to you at the sound of your cry for help; when He hears it, He will answer you. "},{"num":20,"verse":"Though the Lord gives you the bread of adversity and the water of oppression, yet your Teacher will no longer hide Himself, but your eyes will [constantly] see your Teacher. "},{"num":21,"verse":"Your ears will hear a word behind you, “This is the way, walk in it,” whenever you turn to the right or to the left. "},{"num":22,"verse":"And you will defile your carved images overlaid with silver, and your cast images plated with gold. You will scatter them like a bloodstained cloth, and will say to them, “Be gone!”"},{"num":23,"verse":"Then He will give you rain for the seed with which you sow the ground, and bread [grain] from the produce of the ground, and it will be rich and plentiful. In that day your livestock will graze in large and roomy pastures. "},{"num":24,"verse":"Also the oxen and the young donkeys that work the ground will eat salted fodder, which has been winnowed with shovel and pitchfork. "},{"num":25,"verse":"On every lofty mountain and on every high hill there will be streams of water on the day of the great slaughter (the day of the Lord), when the towers fall [and all His enemies are destroyed]. "},{"num":26,"verse":"The light of the full moon will be like the light of the sun, and the light of the sun will be seven times brighter, like the light of seven days [concentrated in one], in the day the Lord binds up the fracture of His people and heals the wound He has inflicted [because of their sins]."}]