[{"header":"Don’t Expect Help from Egypt"},{"num":30,"verse":"This is the Lord’s message for his rebellious people:"},{"header":"Israel Refuses To Listen"},{"num":8,"verse":"The Lord told me to write down his message for his people, so that it would be there forever. "},{"num":9,"verse":"They have turned against the Lord and can’t be trusted. They have refused his teaching "},{"num":10,"verse":"and have said to his messengers and prophets:"},{"header":"Trust the Lord"},{"header":"The Lord Will Show Mercy"},{"num":19,"verse":"People of Jerusalem, you don’t need to cry anymore. The Lord is kind, and as soon as he hears your cries for help, he will come. "},{"num":20,"verse":"The Lord has given you trouble and sorrow as your food and drink. But now you will again see the Lord, your teacher, and he will guide you. "},{"num":21,"verse":"Whether you turn to the right or to the left, you will hear a voice saying, “This is the road! Now follow it.” "},{"num":22,"verse":"Then you will treat your idols of silver and gold like garbage; you will throw them away like filthy rags."},{"num":23,"verse":"The Lord will send rain to water the seeds you have planted—your fields will produce more crops than you need, and your cattle will graze in open pastures. "},{"num":24,"verse":"Even the oxen and donkeys that plow your fields will be fed the finest grain."},{"num":25,"verse":"On that day people will be slaughtered and towers destroyed, but streams of water will flow from high hills and towering mountains. "},{"num":26,"verse":"Then the Lord will bandage his people’s injuries and heal the wounds he has caused. The moon will shine as bright as the sun, and the sun will shine seven times brighter than usual. It will be like the light of seven days all at once."},{"header":"Assyria Will Be Punished"},{"num":29,"verse":"The Lord’s people will sing as they do when they celebrate a religious festival at night. The Lord is Israel’s mighty rock, and his people will be as happy as they are when they follow the sound of flutes to the mountain where he is worshiped."},{"num":30,"verse":"The Lord will get furious. His fearsome voice will be heard, his arm will be seen ready to strike, and his anger will be like a destructive fire, followed by thunderstorms and hailstones. "},{"num":31,"verse":"When the Assyrians hear the Lord’s voice and see him striking with his iron rod, they will be terrified. "},{"num":32,"verse":"He will attack them in battle, and each time he strikes them, it will be to the music of tambourines and harps."},{"num":33,"verse":"Long ago the Lord got a place ready for burning the body of the dead king. The place for the fire is deep and wide, the wood is piled high, and the Lord will start the fire by breathing out flaming sulfur."}]