[{"header":"Israel Should Trust in God, Not Egypt"},{"num":30,"verse":"The Lord said, “Look at these children. They don’t obey me. They make plans, but they don’t ask me to help them. They make agreements with other nations, but my Spirit does not want those agreements. These people are adding more and more sins to the ones they have already done."},{"num":2,"verse":"They are going down to Egypt for help, but they did not ask me if that was the right thing to do. They hope they will be saved by the Pharaoh. They want Egypt to protect them."},{"num":3,"verse":"“But I tell you, hiding in Egypt will not help you. Pharaoh will not be able to protect you."},{"num":4,"verse":"Your leaders have gone to Zoan, and your representatives have gone to Hanes."},{"num":5,"verse":"But they will be disappointed. They are depending on a nation that cannot help them. Egypt is useless—it will not help. Egypt will bring nothing but shame and embarrassment.”"},{"header":"God’s Message to Judah"},{"num":6,"verse":"This is a message about the Negev animals:"},{"num":7,"verse":"That useless nation is Egypt. Egypt’s help is worth nothing, so I call Egypt the “Do-Nothing Dragon.”"},{"num":8,"verse":"Now write this on a sign so that all people can see it, and write this in a book. Write these things for a future time. This will be far, far in the future:"},{"num":9,"verse":"These people are like children who refuse to obey. They lie and refuse to listen to the Lord’s teachings."},{"num":10,"verse":"They tell the prophets, “Don’t see dreams about things we should do. Don’t tell us the truth. Say nice things to us and make us feel good. See only good things for us."},{"num":11,"verse":"Stop seeing things that will really happen. Get out of our way. Stop telling us about the Holy One of Israel.”"},{"header":"Judah’s Help Comes Only From God"},{"num":12,"verse":"The Holy One of Israel says, “You people have refused to accept this message from me. You depend on fighting and lies to help you."},{"num":13,"verse":"You are guilty of these things. So you are like a tall wall with cracks in it. That wall will fall and break into small pieces."},{"num":14,"verse":"You will be like a large clay jar that breaks into many small, useless pieces. You cannot use them to get a hot coal from the fire or to get water from a pool in the ground.”"},{"num":15,"verse":"The Lord God, the Holy One of Israel, says, “If you come back to me you will be saved. Only by remaining calm and trusting in me can you be strong.”"},{"num":16,"verse":"You say, “No, we need fast horses for battle.” That is true—you will need fast horses, but only to run away because your enemy will be faster than your horses."},{"num":17,"verse":"One enemy soldier will make threats, and a thousand of your men will run away. And when five of them make threats, all of you will run away. The only thing that will be left of your army will be a flagpole on a hill."},{"header":"God Will Help His People"},{"num":18,"verse":"So the Lord is waiting to show his mercy to you. He wants to rise and comfort you. The Lord is the God who does the right thing, so he will bless everyone who waits for his help."},{"num":19,"verse":"You people who live in Jerusalem on Mount Zion will not continue crying. The Lord will hear your crying, and he will comfort you. When he hears you, he will help you."},{"num":20,"verse":"The Lord might give you sorrow and pain like the bread and water you eat every day. But God is your teacher, and he will not continue to hide from you. You will see your teacher with your own eyes."},{"num":21,"verse":"If you wander from the right path, either to the right or to the left, you will hear a voice behind you saying, “You should go this way. Here is the right way.”"},{"num":22,"verse":"Then you will take your idols covered with gold and silver and make them unfit to be used again. You will throw them away like filthy rags and say, “Go away!”"},{"num":23,"verse":"At that time the Lord will send you rain. You will plant seeds, and the ground will grow food for you. You will have a very large harvest. You will have plenty of food in the fields for your animals. There will be large fields for your sheep."},{"num":24,"verse":"Your cattle and donkeys will have all the food they need. There will be much food. You will have to use shovels and pitchforks to spread all the food for your animals to eat."},{"num":25,"verse":"Every mountain and hill will have streams filled with water. These things will happen after many people are killed and the enemy’s towers are pulled down."},{"num":26,"verse":"At that time the light from the moon will be as bright as the sun, and the light from the sun will be seven times brighter than it is now. One day of sunlight will be like a whole week’s worth. This will happen when the Lord bandages his broken people and heals the hurts from their beatings."},{"num":27,"verse":"Look! The Lord is coming from far away. His anger is like a fire with thick clouds of smoke. His mouth is filled with anger, and his tongue is like a burning fire."},{"num":28,"verse":"His breath is like a great river that rises until it reaches the throat. He will judge the nations as if putting them through a strainer that separates the ones fit for destruction. He will put a bit in their mouths to lead them to the place they don’t want to go."},{"num":29,"verse":"You will sing happy songs, like the nights when you begin a festival. You will be very happy walking to the Lord’s mountain and listening to the flute on the way to worship the Rock of Israel."},{"num":30,"verse":"The Lord will cause all people to hear his great voice and to see his powerful arm come down in anger. That arm will be like a great fire that burns everything. His power will be like a great storm with much rain and hail."},{"num":31,"verse":"Assyria will be frightened by the Lord’s voice and the stick that will beat him."},{"num":32,"verse":"And as the Lord beats Assyria, his people will keep the rhythm with their drums and harps."},{"num":33,"verse":"Topheth has been made ready for a long time. It is ready for the king. It was made very deep and wide. There is a very big pile of wood and fire there, and the Lord’s breath will come like a stream of burning sulfur to start the fire."}]