[{"num":30,"verse":"1 He reproveth the Jews, which in their adversity used their own counsels, 2 and sought help of the Egyptians, 10 despising the Prophets. 16 Therefore he showeth what destruction shall come upon them,  18 but offereth mercy to the repentant."},{"num":1,"verse":"Woe to the rebellious children, saith the Lord, that take counsel, but not of me, and cover with a covering, but not by my spirit, that they may lay sin upon sin:"},{"num":2,"verse":"Which walk forth to go down into Egypt (and have not asked at my mouth) to strengthen themselves with the strength of Pharaoh, and trust in the shadow of Egypt."},{"num":3,"verse":"But the strength of Pharaoh shall be your shame, and the trust in the shadow of Egypt your confusion."},{"num":4,"verse":"For his princes were at Zoan, and his ambassadors came unto Hanes."},{"num":5,"verse":"They shall be all ashamed of the people that cannot profit them, nor help, nor do them good, but shall be a shame and also a reproach."},{"num":6,"verse":"¶ The burden of the beasts of the South, in a land of trouble and anguish, from whence shall come the young and old lion, the viper and fiery flying serpent against them that shall bear their riches upon the shoulders of the colts, and their treasures upon the bunches of the camels, to a people that cannot profit."},{"num":7,"verse":"For the Egyptians are vanity, and they shall help in vain. Therefore have I cried unto her, Their strength is to sit still."},{"num":8,"verse":"Now go, and write it before them in a table, and note it in a book, that it may be for the last day forever and ever:"},{"num":9,"verse":"That it is a rebellious people, lying children, and children that would not hear the Law of the Lord."},{"num":10,"verse":"Which say unto the Seers, See not: and to the Prophets, Prophesy not unto us right things: but speak flattering things unto us: prophesy errors."},{"num":11,"verse":"Depart out of the way: go aside out of the path: cause the Holy one of Israel to cease from us."},{"num":12,"verse":"Therefore thus saith the Holy one of Israel, Because you have cast off this word, and trust in violence, and wickedness, and stay thereupon,"},{"num":13,"verse":"Therefore this iniquity shall be unto you as a breach that falleth, or a swelling in an high wall, whose breaking cometh suddenly in a moment."},{"num":14,"verse":"And the breaking thereof is like the breaking of a potter’s pot, which is broken without pity, and in the breaking thereof is not found a shard to take fire out of the hearth, or to take water out of the pit."},{"num":15,"verse":"For thus said the Lord God, the Holy one of Israel, In rest and quietness shall ye be saved: in quietness and in confidence shall be your strength, but ye would not."},{"num":16,"verse":"For ye have said, No, but we will flee away upon horses. Therefore shall ye flee. We will ride upon the swiftest. Therefore shall your persecutors be swifter."},{"num":17,"verse":"A thousand as one shall flee at the rebuke of one: at the rebuke of five shall ye flee, till ye be left as a ship mast upon the top of a mountain, and as a beacon upon an hill."},{"num":18,"verse":"Yet therefore will the Lord wait, that he may have mercy upon you, and therefore will he be exalted, that he may have compassion upon you: for the Lord is the God of judgment. Blessed are all they that wait for him."},{"num":19,"verse":"Surely a people shall dwell in Zion, and in Jerusalem: thou shalt weep no more: he will certainly have mercy upon thee at the voice of thy cry: when he heareth thee, he will answer thee."},{"num":20,"verse":"And when the Lord hath given you the bread of adversity, and the water of affliction, thy rain shall be no more kept back, but thine eyes shall see thy rain."},{"num":21,"verse":"And thine ears shall hear a word behind thee, saying, This is the way, walk ye in it, when thou turnest to the right hand, and when thou turnest to the left."},{"num":22,"verse":"And ye shall pollute the covering of the images of silver, and the rich ornament of thine images of gold, and cast them away as a menstruous cloth, and thou shalt say unto it, Get thee hence."},{"num":23,"verse":"Then shall he give rain unto thy seed, when thou shalt sow the ground, and bread of the increase of the earth, and it shall be fat and as oil: in that day shall thy cattle be fed in large pastures."},{"num":24,"verse":"The oxen also and the young asses, that till the ground, shall eat clean provender, which is winnowed with the shovel and with the fan."},{"num":25,"verse":"And upon every high mountain, and upon every high hill shall there be rivers, and streams of waters, in the day of the great slaughter, when the towers shall fall."},{"num":26,"verse":"Moreover, the light of the Moon shall be as the light of the Sun, and the light of the Sun shall be sevenfold, and like the light of seven days in the day that the Lord shall bind up the breach of his people, and heal the stroke of their wound."},{"num":27,"verse":"Behold, the Name of the Lord cometh from far, his face is burning, and the burden thereof is heavy: his lips are full of indignation, and his tongue is as a devouring fire."},{"num":28,"verse":"And his spirit is as a river that overfloweth up to the neck: it divideth asunder, to fan the nations with the fan of vanity, and there shall be a bridle to cause them to err in the jaws of the people."},{"num":29,"verse":"But there shall be a song unto you as in the night, when a solemn feast is kept; and gladness of heart, as he that cometh with a pipe to go unto the mount of the Lord, to the Mighty one of Israel."},{"num":30,"verse":"And the Lord shall cause his glorious voice to be heard, and shall declare the lighting down of his arm with the anger of his countenance, and flame of a devouring fire, with scattering and tempest, and hailstones."},{"num":31,"verse":"For with the voice of the Lord shall Assyria be destroyed, which smote with the rod."},{"num":32,"verse":"And in every place that the staff shall pass, it shall cleave fast, which the Lord shall lay upon him with tabrets and beards and with battles, and lifting up of hands shall he fight against it."},{"num":33,"verse":"For Tophet is prepared of old; it is even prepared for the King; he hath made it deep and large: the burning thereof is fire and much wood; the breath of the Lord, like a river of brimstone, doth kindle it."}]