[[],[{"type":"header","content":"The Futility of Reliance on Egypt"},{"type":"poetry","content":"who carry out a plan, but not mine;"},{"type":"poetry","content":"who make an alliance, but against my will,"}],[{"type":"poetry","content":"who set out to go down to Egypt"},{"type":"poetry","content":"to take refuge in the protection of Pharaoh,"}],[{"type":"poetry","content":"Therefore the protection of Pharaoh shall become your shame,"}],[{"type":"poetry","content":"For though his officials are at Zoan"}],[{"type":"poetry","content":"everyone comes to shame"},{"type":"poetry","content":"that brings neither help nor profit,"}],[{"type":"prose","content":"An oracle concerning the animals of the Negeb."},{"type":"poetry","content":"Through a land of trouble and distress,"},{"type":"poetry","content":"they carry their riches on the backs of donkeys,"}],[{"type":"poetry","content":"For Egypt’s help is worthless and empty,"}],[{"type":"header","content":"A Rebellious People"},{"type":"poetry","content":"Go now, write it before them on a tablet,"},{"type":"poetry","content":"so that it may be for the time to come"}],[{"type":"poetry","content":"For they are a rebellious people,"},{"type":"poetry","content":"children who will not hear"}],[{"type":"poetry","content":"who say to the seers, “Do not see”;"},{"type":"poetry","content":"speak to us smooth things,"}],[{"type":"poetry","content":"leave the way, turn aside from the path,"}],[{"type":"poetry","content":"Therefore thus says the Holy One of Israel:"},{"type":"poetry","content":"Because you reject this word,"}],[{"type":"poetry","content":"therefore this iniquity shall become for you"}],[{"type":"poetry","content":"its breaking is like that of a potter’s vessel"},{"type":"poetry","content":"that among its fragments not a sherd is found"},{"type":"prose","content":" "}],[{"type":"header","content":"God’s Promise to Zion"},{"type":"poetry","content":"Therefore the  waits to be gracious to you;"},{"type":"poetry","content":"For the  is a God of justice;"}],[{"type":"prose","content":"Truly, O people in Zion, inhabitants of Jerusalem, you shall weep no more. He will surely be gracious to you at the sound of your cry; when he hears it, he will answer you. "}],[{"type":"prose","content":"Though the Lord may give you the bread of adversity and the water of affliction, yet your Teacher will not hide himself any more, but your eyes shall see your Teacher. "}],[{"type":"prose","content":"And when you turn to the right or when you turn to the left, your ears shall hear a word behind you, saying, “This is the way; walk in it.” "}],[{"type":"prose","content":"Then you will defile your silver-covered idols and your gold-plated images. You will scatter them like filthy rags; you will say to them, “Away with you!”"}],[{"type":"prose","content":"He will give rain for the seed with which you sow the ground, and grain, the produce of the ground, which will be rich and plenteous. On that day your cattle will graze in broad pastures; "}],[{"type":"prose","content":"and the oxen and donkeys that till the ground will eat silage, which has been winnowed with shovel and fork. "}],[{"type":"prose","content":"On every lofty mountain and every high hill there will be brooks running with water—on a day of the great slaughter, when the towers fall. "}],[{"type":"prose","content":"Moreover the light of the moon will be like the light of the sun, and the light of the sun will be sevenfold, like the light of seven days, on the day when the LORD binds up the injuries of his people, and heals the wounds inflicted by his blow."}],[{"type":"header","content":"Judgment on Assyria"},{"type":"poetry","content":"See, the name of the  comes from far away,"},{"type":"poetry","content":"his lips are full of indignation,"}],[{"type":"poetry","content":"his breath is like an overflowing stream"},{"type":"poetry","content":"to sift the nations with the sieve of destruction,"}],[{"type":"prose","content":"You shall have a song as in the night when a holy festival is kept; and gladness of heart, as when one sets out to the sound of the flute to go to the mountain of the LORD, to the Rock of Israel. "}],[{"type":"prose","content":"And the LORD will cause his majestic voice to be heard and the descending blow of his arm to be seen, in furious anger and a flame of devouring fire, with a cloudburst and tempest and hailstones. "}],[{"type":"prose","content":"The Assyrian will be terror-stricken at the voice of the LORD, when he strikes with his rod. "}],[{"type":"prose","content":"And every stroke of the staff of punishment that the LORD lays upon him will be to the sound of timbrels and lyres; battling with brandished arm he will fight with him. "}],[{"type":"prose","content":"For his burning place has long been prepared; truly it is made ready for the king, its pyre made deep and wide, with fire and wood in abundance; the breath of the LORD, like a stream of sulfur, kindles it."}]]