[{"header":"What About Abraham?"},{"num":4,"verse":"What then shall we say that Abraham, our forefather according-to the flesh, has found? "},{"num":2,"verse":"For if Abraham was declared-righteous by works, he has a boast— but not before God."},{"header":"His Righteousness Came By Faith"},{"num":3,"verse":"For what does the Scripture say?— “And Abraham believed God, and it was credited to him for righteousness” [Gen 15:6]. "},{"num":4,"verse":"Now to the one working, the wages are not credited to him based-on grace, but based on debt. "},{"num":5,"verse":"But to the one not working but putting-faith upon the One declaring the ungodly righteous— his faith is credited for righteousness. "},{"num":6,"verse":"Just as David also says [in Ps 32:1-2] as to the blessedness of the person to whom God credits righteousness apart from works: "},{"num":7,"verse":"“Blessed are the ones whose lawless-deeds were forgiven and whose sins were covered. "},{"num":8,"verse":"Blessed is the man whose sin the Lord will never count”."},{"header":"This Occurred Prior To Circumcision"},{"num":9,"verse":"So is this blessedness upon the circumcised, or upon the uncircumcised also? For we say “Faith was credited to Abraham for righteousness”. "},{"num":10,"verse":"How then was it credited— to one being in circumcision, or in uncircumcision? Not in circumcision, but in uncircumcision! "},{"num":11,"verse":"And he received the sign of circumcision, a seal of the righteousness of  faith while in uncircumcision, so that he might be the father of all the ones believing through uncircumcision— so that righteousness might be credited also to them— "},{"num":12,"verse":"and the father of the circumcised to the ones not of circumcision only, but indeed the ones walking-in-line in the footsteps of the faith of our father Abraham while he was in uncircumcision."},{"header":"The Promise Was Not Through The Law But Faith, Making It Firm To All"},{"num":13,"verse":"For the promise to Abraham or to his seed that he should be the inheritor of the world was not through the Law, but through the righteousness of faith! "},{"num":14,"verse":"For if the ones of the Law are inheritors, faith has been made-empty and the promise has been nullified. "},{"num":15,"verse":"For the Law brings-about wrath. But where there is no Law, neither is there transgression. "},{"num":16,"verse":"For this reason it is by faith, in order that it may be based on grace, so that the promise might be firm to all the seed— not to the seed of the Law only, but also to the seed of the faith of Abraham,"},{"header":"Abraham Is The Father of All Who Believe"},{"num":17,"verse":"just as it has been written [in Gen 17:5] that “I have made you a father of many nations”— before God Whom he believed, the One giving-life-to the dead and calling the things not being as being,"},{"header":"He Believed God’s Promise, Contrary To All His Human Circumstances"},{"num":18,"verse":"... who believed contrary-to hope, upon hope, so that he might become the father of many nations in accordance with the thing having been spoken [in Gen 15:5]: “So shall your seed be”. "},{"num":19,"verse":"And not having weakened in faith, he considered his own body already having become impotent, being about a hundred years old, and the deadness of the womb of Sarah. "},{"num":20,"verse":"But he did not waver in unbelief with reference to the promise of God, but became-strong in faith— having given glory to God, "},{"num":21,"verse":"and having been fully-convinced that what He had promised He was able also to do."},{"header":"His Faith Was Credited To Him As Righteousness, And So Is Ours"},{"num":22,"verse":"Therefore indeed it was credited to him for righteousness. "},{"num":23,"verse":"And it was not written for his sake only that it was credited to him, "},{"num":24,"verse":"but also for our sake to whom it is going-to be credited— the ones putting-faith upon the One having raised Jesus our Lord from the dead, "},{"num":25,"verse":"Who was handed-over for our trespasses and was raised for our justification."}]