[{"header":"The Example of Abraham"},{"num":4,"verse":"What then shall we say that Abraham, our father according to the flesh, has found? "},{"num":2,"verse":"If Abraham was justified by works, he has something to boast about, but not before God. "},{"num":3,"verse":"What does the Scripture say? “Abraham believed God, and it was credited to him as righteousness.”"},{"num":4,"verse":"Now to him who works, wages are not given as a gift, but as a debt. "},{"num":5,"verse":"But to him who does not work, but believes in Him who justifies the ungodly, his faith is credited as righteousness. "},{"num":6,"verse":"Even David describes the blessedness of the man to whom God credits righteousness without works:"},{"num":9,"verse":"Does this blessedness then come upon the circumcised only, or upon the uncircumcised also? We are saying that faith was credited to Abraham as righteousness. "},{"num":10,"verse":"How then was it credited? When he was in circumcision? Or in uncircumcision? Not in circumcision, but in uncircumcision. "},{"num":11,"verse":"And he received the sign of circumcision, a seal of the righteousness of the faith that he had while being uncircumcised, so that he might be the father of all those who believe, though they are uncircumcised, that righteousness might be credited to them also, "},{"num":12,"verse":"and the father of circumcision to those who are not of the circumcision only, but who also walk in the steps of the faith of our father Abraham, which he had while still being uncircumcised."},{"header":"The Promise Received Through Faith"},{"num":13,"verse":"It was not through the law that Abraham and his descendants received the promise that he would be the heir of the world, but through the righteousness of faith. "},{"num":14,"verse":"For if those who are of the law become heirs, faith would be made void and the promise nullified, "},{"num":15,"verse":"because the law produces wrath, for where there is no law, there is no sin."},{"num":16,"verse":"Therefore the promise comes through faith, so that it might be by grace, that the promise would be certain to all the descendants, not only to those who are of the law, but also to those who are of the faith of Abraham, who is the father of us all "},{"num":17,"verse":"(as it is written, “I have made you a father of many nations”) before God whom he believed, and who raises the dead, and calls those things that do not exist as though they did."},{"num":18,"verse":"Against all hope, he believed in hope, that he might become the father of many nations according to what was spoken, “So shall your descendants be.” "},{"num":19,"verse":"And not being weak in faith, he did not consider his own body to be dead (when he was about a hundred years old), nor yet the deadness of Sarah’s womb. "},{"num":20,"verse":"He did not waver at the promise of God through unbelief, but was strong in faith, giving glory to God, "},{"num":21,"verse":"and being fully persuaded that what God had promised, He was able to perform. "},{"num":22,"verse":"Therefore “it was credited to him as righteousness.” "},{"num":23,"verse":"Now the words, “it was credited to him,” were not written for his sake only, "},{"num":24,"verse":"but also for us, to whom it shall be credited if we believe in Him who raised Jesus our Lord from the dead, "},{"num":25,"verse":"who was delivered for our transgressions, and was raised for our justification."}]