[{"num":4,"verse":"What tis then oun shall  we  say legō that  Abraham Abraam,  · ho our hēmeis forefather propatōr according kata to  the  flesh sarx,  has  discovered heuriskō about this? "},{"num":2,"verse":"For gar if ei Abraham Abraam was  justified dikaioō by ek works ergon,  he  has echō something  to  boast kauchēma about  ( but alla not ou before pros God theos). "},{"num":3,"verse":"For gar what tis does  the ho scripture graphē say legō? “ And de Abraham Abraam believed pisteuō · ho God theos,  and kai it  was  credited logizomai to  him autos as eis righteousness dikaiosynē.” "},{"num":4,"verse":"Now de to  the ho one  who  works ergazomai,  his ho wages misthos are  not ou credited logizomai as kata a  gift charis,  but alla as kata an  obligation opheilēma. "},{"num":5,"verse":"But de to  the ho one  who  does  not mē work ergazomai,  but de entrusts pisteuō himself  to epi the ho one  who  justifies dikaioō the ho ungodly asebēs,  his autos faith pistis is  credited logizomai · ho as eis righteousness dikaiosynē. "},{"num":6,"verse":"So kathaper also kai David Dauid speaks legō of  the ho blessedness makarismos of  the ho one anthrōpos to  whom hos · ho God theos credits logizomai righteousness dikaiosynē apart chōris from  works ergon: "},{"num":7,"verse":"“ Blessed makarios are those  whose hos lawless  deeds anomia are  forgiven aphiēmi,  · ho and kai whose hos sins hamartia are  covered epikalyptō.  · ho"},{"num":8,"verse":"Blessed makarios is the  man anēr whose hos sin hamartia the  Lord kyrios will  not ou mē take logizomai into  account .” "},{"num":9,"verse":"· ho Therefore oun, is  this houtos blessedness makarismos for epi the ho circumcised peritomē alone,  or ē is it  also kai for epi the ho uncircumcised akrobystia?  For gar we  say legō, “It was  to ho Abraham Abraam that ho faith pistis was  credited logizomai as eis righteousness dikaiosynē.” "},{"num":10,"verse":"How pōs then oun was  it  credited logizomai to him? Was it  after en he  was eimi circumcised peritomē or ē before en akrobystia? It was  not ou after en his  circumcision peritomē but alla before en akrobystia. "},{"num":11,"verse":"· kai He  received lambanō the  sign sēmeion of  circumcision peritomē as a  seal sphragis of  the ho righteousness dikaiosynē that he had  by ho faith pistis · ho while he was  still en · ho uncircumcised akrobystia,  so eis that  he autos would  be eimi the  father patēr of  all pas who ho believe pisteuō but  have  never  been  circumcised dia,  that eis they  too kai might  have  righteousness dikaiosynē credited logizomai to  them autos.  · ho"},{"num":12,"verse":"He is  also kai the  father patēr of  the  circumcised peritomē who ho are  not ou merely monon circumcised peritomē but alla also kai · ho walk stoicheō in  the ho footsteps ichnos of  the ho faith pistis that  · ho our hēmeis father patēr Abraham Abraam had while he was  still en uncircumcised akrobystia. "},{"num":13,"verse":"For gar the ho promise epangelia that  he autos would  be eimi heir klēronomos of kosmos the  world kosmos did  not ou come  to ho Abraham Abraam or ē to ho his autos descendants sperma through dia the  law nomos,  · ho but alla through dia the  righteousness dikaiosynē of  faith pistis. "},{"num":14,"verse":"For gar if ei the ho heirs klēronomos are those who  follow ek the  law nomos, then  faith pistis is  meaningless kenoō · ho and kai the ho promise epangelia is  void katargeō. "},{"num":15,"verse":"For gar the ho Law nomos brings  about katergazomai wrath orgē,  but de where hou there  is eimi no ou law nomos, there can be  no oude violation parabasis. "},{"num":16,"verse":"For dia this houtos reason  the ho promise epangelia is  based ek on  faith pistis,  that hina it may  depend kata on  grace charis and  so eis that  it  may  be eimi made  certain bebaios to  all pas his ho descendants sperma,  not ou only monon to  those ho who are  under ek the ho law nomos,  but alla also kai to  those ho who  share ek the  faith pistis of  Abraham Abraam,  who hos is eimi the  father patēr of  us hēmeis all pas. "},{"num":17,"verse":"As kathōs it  is  written graphō, “ I  have  made tithēmi you sy the  father patēr of  many polys nations ethnos.” He is our father,  in  the  presence katenanti of  God theos in pisteuō whom hos he  believed pisteuō,  the ho God  who  gives zōiopoieō life  to  the ho dead nekros and kai calls kaleō into hōs being eimi the ho things  that  do  not mē exist eimi. "},{"num":18,"verse":"Hoping elpis against epi hope elpis,  Abraham hos believed pisteuō that eis he autos would  become ginomai the  father patēr of  many polys nations ethnos according kata to  what ho had  been  spoken legō, “ So houtōs will  your sy descendants sperma be eimi.”  · ho"},{"num":19,"verse":"· kai Not mē being  weak astheneō in ho faith pistis,  he  considered katanoeō · ho his heautou own  body sōma as  dead nekroō ( since  he  was hyparchō about pou a  hundred hekatontaetēs years  old ),  and kai the ho barrenness nekrōsis of ho Sarah’ s Sarra womb mētra. "},{"num":20,"verse":"He  did diakrinō not ou waver diakrinō in ho unbelief apistia regarding eis · de the ho promise epangelia of ho God theos but alla was  strengthened endynamoō in ho faith pistis,  giving didōmi glory doxa to ho God theos, "},{"num":21,"verse":"· kai fully plērophoreō convinced  that hoti what hos God  had  promised epangellomai,  he  was eimi also kai able dynatos to  do poieō. "},{"num":22,"verse":"That dio is  why  · kai his faith  was  credited logizomai to  him autos as eis righteousness dikaiosynē. "},{"num":23,"verse":"But de the statement, “ it  was  credited logizomai to  him autos,”  was  not ou written graphō for dia his autos sake  alone monon, "},{"num":24,"verse":"but alla for dia our hēmeis sake dia as kai well ,  to  whom hos it  will mellō be  credited logizomai,  those ho who  believe pisteuō in epi the ho one  who  raised egeirō Jesus Iēsous · ho our hēmeis Lord kyrios from ek the  dead nekros, "},{"num":25,"verse":"who hos was  delivered paradidōmi over  to death  for dia · ho our hēmeis transgressions paraptōma and kai raised egeirō for dia · ho our hēmeis justification dikaiōsis. "}]