[{"header":"Abraham Justified through Faith[a]"},{"header":"Chapter 4"},{"num":1,"verse":"Justified through Faith, Not Works. What then are we to say about Abraham, our ancestor according to the flesh?"},{"num":2,"verse":"If Abraham was justified by the works he did, he has good reason to boast, but not in the eyes of God."},{"num":3,"verse":"For what does Scripture say? “Abraham placed his faith in God, and it was credited to him as righteousness.”"},{"num":4,"verse":"Now when a man works, his wages are not regarded as a gift but as something that is due to him."},{"num":5,"verse":"However, when someone who does not work places his faith in one who justifies the godless, such faith is reckoned as righteousness."},{"num":6,"verse":"In the same way, David speaks of the blessedness of the one to whom God attributes righteousness apart from works:"},{"num":9,"verse":"Justified before Being Circumcised. Is this blessedness granted only to the circumcised, or does it apply to the uncircumcised as well? We have asserted that Abraham’s faith “was credited to him as righteousness.”"},{"num":10,"verse":"How was it credited? Was it when he was circumcised or uncircumcised? Not when he was circumcised, but when he was uncircumcised."},{"num":11,"verse":"Abraham received the sign of circumcision as a seal of the righteousness that he had by faith while he was still uncircumcised. In this way, he was the father of all who believe without being circumcised and who thus have righteousness credited to them."},{"num":12,"verse":"Therefore, he is the father of the circumcised who have not only received circumcision but also follow that path of faith traversed by Abraham before he was circumcised."},{"num":13,"verse":"Justified Apart from the Law. It was not through the Law that Abraham and his descendants received the promise that he would inherit the world, but through the righteousness of faith."},{"num":14,"verse":"If those who live by the Law are the heirs, faith is null and the promise is void."},{"num":15,"verse":"For the Law produces only wrath, and where no Law exists, there cannot be any violation."},{"num":16,"verse":"Therefore, the promise depends on faith, so that it may be a free gift and the promise may be guaranteed to all descendants, not only to the adherents of the Law but also to those who share the faith of Abraham. For he is the father of all of us,"},{"num":17,"verse":"as it is written, “I have made you the father of many nations,” in the sight of God in whom he believed, the God who gives life to the dead and calls into being what does not exist."},{"num":18,"verse":"The Power of Faith. Though he hoped against hope, he believed that he would become the father of many nations, in fulfillment of the promise, “So shall your descendants be.”"},{"num":19,"verse":"His faith was not shaken when he considered his own body, which was as good as dead (for he was about one hundred years old), and the barren womb of Sarah."},{"num":20,"verse":"Confident in the promise of God, he did not doubt in unbelief; rather, he was strengthened in his faith and gave glory to God,"},{"num":21,"verse":"remaining fully convinced that he was able to fulfill his pledge."},{"num":22,"verse":"Therefore, his faith “was credited to him as righteousness.”"},{"num":23,"verse":"“It was credited to him” was not written with Abraham alone in mind."},{"num":24,"verse":"This was also meant for us as well, to whom it will be credited as righteousness—for us who believe in him who raised from the dead Jesus our Lord"},{"num":25,"verse":"who was handed over to death for our sins and who was raised to life for our justification."}]