[{"num":25,"verse":"“When a legal dispute takes place between men and they come near to the court, and the judges judge with respect to them, then they shall declare the righteous to be in the right and they shall condemn the wicked, "},{"num":2,"verse":"then it will happen if the guilty one deserves beating, then the judge shall make him lie, and he shall beat him before him, according to the prescribed number of lashes proportionate to the offense. "},{"num":3,"verse":"He may beat him with forty lashes, and he shall not do more than these, so that he will not beat more in addition to these many blows, and your countryman would be degraded before your eyes."},{"num":4,"verse":"“You shall not muzzle an ox when he is threshing."},{"num":5,"verse":"“When brothers dwell together and one of them dies and has no son, the wife of the deceased shall not become the wife of a man of another family; her brother-in-law shall have sex with her, and he shall take her to himself as a wife, and he shall perform his duty as a brother-in-law with respect to her. "},{"num":6,"verse":"And then the firstborn that she bears shall represent his dead brother, so that his name is not blotted out from Israel. "},{"num":7,"verse":"But if the man does not want to take his sister-in-law, then his sister-in-law shall go up to the gate, to the elders, and she shall say, ‘My brother-in-law refused to perpetuate his brother’s name in Israel, for he is not willing to marry me.’ "},{"num":8,"verse":"Then the elders of his town shall summon him and speak to him, and if he persists and says, ‘I do not desire to marry her’ "},{"num":9,"verse":"then his sister-in-law shall go near him before the eyes of the elders, and she shall pull off his sandal from his foot, and she shall spit in his face, and she shall declare and she shall say, ‘This is how it is done to the man who does not build the house of his brother.’ "},{"num":10,"verse":"And his family shall be called in Israel, ‘The house where the sandal was pulled off.’"},{"num":11,"verse":"“If a man and his brother fight each other and the wife of the one man comes near to rescue her husband from the hand of his attacker and she stretches out her hand and she seizes his genitals, "},{"num":12,"verse":"then you shall cut off her hand; your eye shall not take pity."},{"num":13,"verse":"“There shall not be for your use in your bag two kinds of stone weights, a large one and a small one. "},{"num":14,"verse":"There shall not be in your house for your use two kinds of measures. "},{"num":15,"verse":"Rather a full and honest weight shall be for your use; there shall be for you a full and honest measure, so that your days on the land that Yahweh your God is giving to you may be long. "},{"num":16,"verse":"For detestable to Yahweh your God is everyone who is doing such things, everyone who is acting dishonestly."},{"num":17,"verse":"“Remember what Amalek did to you on the journey when you went out from Egypt, "},{"num":18,"verse":"that he met you on the journey and attacked you, all those lagging behind you and when you were weary and worn out, and he did not fear God. "},{"num":19,"verse":"And when Yahweh your God gives rest to you from all your enemies from around about you in the land that Yahweh your God is giving to you as an inheritance to take possession of it, you shall blot out the remembrance of Amalek from under the heavens; you shall not forget!”"}]