[{"header":"Rebuilding the Tribe of Benjamin"},{"num":21,"verse":"Previously the men of Israel had taken an oath at Mizpah: “Not a man from among us will give his daughter to a Benjaminite as his wife.”"},{"num":2,"verse":"The people came to Bethel and remained there before God until evening. They lifted up their voices and wept bitterly. "},{"num":3,"verse":"They said, “Why, Lord God of Israel, has this happened in Israel, that today one tribe has been removed from Israel?”"},{"num":4,"verse":"The next day, when the people rose early, they built an altar there and offered burnt offerings and fellowship offerings."},{"num":5,"verse":"Then the Israelites said, “From all the tribes of Israel, was there anyone who did not come up to the assembly of Israel before the Lord?” For they had taken this solemn oath against anyone who did not come up to the Lord at Mizpah: “He will certainly be put to death.”"},{"num":6,"verse":"Then the people of Israel felt compassion toward Benjamin, their brother, and they said, “One tribe of Israel is cut off today. "},{"num":7,"verse":"What can be done to provide wives for those who remain? We have sworn by the Lord not to give any of our daughters to them as wives.”"},{"num":8,"verse":"So then they asked, “Was there anyone from the tribes of Israel who did not go up to the Lord at Mizpah?” They found that no one from Jabesh Gilead had come to the assembly at the camp. "},{"num":9,"verse":"In fact, when the roll call had been taken, not a man was there from the inhabitants of Jabesh Gilead."},{"num":10,"verse":"So the assembly sent twelve thousand powerful warriors and commanded them, “Go and strike down the people who live at Jabesh Gilead with the edge of the sword, including the women and children. "},{"num":11,"verse":"This is what you are to do: Every male and every woman who has known the bed of a male, you shall devote to destruction.”"},{"num":12,"verse":"They found among the inhabitants of Jabesh Gilead four hundred young women who were virgins, who had never known a man by lying down with a male. They brought the four hundred women to the camp at Shiloh in the land of Canaan."},{"num":13,"verse":"Then the entire assembly sent a message to the Benjaminites who were at the Rock of Rimmon. They extended an offer of peace to them. "},{"num":14,"verse":"The Benjaminites then returned, and the Israelites gave them the women that they had kept alive from Jabesh Gilead."},{"num":15,"verse":"Once more the people had compassion on Benjamin because the Lord had left an empty spot among the tribes of the Lord. "},{"num":16,"verse":"So the elders of the assembly asked, “What shall we do to get wives for those who were spared, since the women from Benjamin have been wiped out?” "},{"num":17,"verse":"They said, “There must be a way to provide an inheritance for the surviving remnant of Benjamin, so that a tribe will not be blotted out from Israel! "},{"num":18,"verse":"But we cannot give them wives from our daughters, because the people of Israel have sworn, ‘Cursed is anyone who gives a woman to Benjamin.’”"},{"num":19,"verse":"But then someone said, “Look! There is an annual festival of the Lord in Shiloh, which is north of Bethel, east of the highway that goes from Bethel toward Shechem, and south of Lebonah.”"},{"num":20,"verse":"So they commanded the Benjaminites, “Go and lie in wait in the vineyards "},{"num":21,"verse":"and watch. Then when the daughters of Shiloh come out to join in the dances, come out from the vineyards, and each man should seize a wife for himself from the daughters of Shiloh. Then return to the land of Benjamin. "},{"num":22,"verse":"If it happens that their fathers or brothers come to us to complain, we will say to them, ‘Be gracious to them, because we failed to capture a woman for each man during the battle, and you did not break your oath that you would not give your daughters, so you will not incur guilt.’”"},{"num":23,"verse":"So that is what the Benjaminites did. They grabbed and carried off as many women as they needed from among the dancers. Then they went and returned to their family property, rebuilt their cities, and lived in them."},{"num":24,"verse":"At the same time the Israelites returned from there. Each man returned to the territory of his tribe and clan, each man to his own family property."},{"num":25,"verse":"In those days there was no king in Israel, and every man did whatever was right in his own eyes."}]