[{"header":"Wives for the Men of Benjamin"},{"num":21,"verse":"At Mizpah the men of Israel had sworn, “Not one of us will let his daughter marry a man from the tribe of Benjamin.”"},{"num":2,"verse":"The people went to the city of Bethel and sat before God until evening, crying loudly. "},{"num":3,"verse":"They said, “Lord, God of Israel, why has this terrible thing happened to us so that one tribe of Israel is missing today?”"},{"num":4,"verse":"Early the next day the people built an altar and put burnt offerings and fellowship offerings to God on it."},{"num":5,"verse":"Then the Israelites asked, “Did any tribe of Israel not come here to meet with us in the presence of the Lord?” They asked this question because they had sworn that anyone who did not meet with them at Mizpah would be killed."},{"num":6,"verse":"The Israelites felt sorry for their relatives, the Benjaminites. They said, “Today one tribe has been cut off from Israel. "},{"num":7,"verse":"We swore before the Lord that we would not allow our daughters to marry a Benjaminite. How can we make sure that the remaining men of Benjamin will have wives?” "},{"num":8,"verse":"Then they asked, “Which one of the tribes of Israel did not come here to Mizpah?” They found that no one from the city of Jabesh Gilead had come. "},{"num":9,"verse":"The people of Israel counted everyone, but there was no one from Jabesh Gilead."},{"num":10,"verse":"So the whole group of Israelites sent twelve thousand soldiers to Jabesh Gilead to kill the people with their swords, even the women and children."},{"num":11,"verse":"“This is what you must do: Kill every man in Jabesh Gilead and every married woman.” "},{"num":12,"verse":"The soldiers found four hundred young unmarried women in Jabesh Gilead, so they brought them to the camp at Shiloh in Canaan."},{"num":13,"verse":"Then the whole group of Israelites sent a message to the men of Benjamin, who were at the rock of Rimmon, offering to make peace with them. "},{"num":14,"verse":"So the men of Benjamin came back at that time. The Israelites gave them the women from Jabesh Gilead who had not been killed, but there were not enough women."},{"num":15,"verse":"The people of Israel felt sorry for the Benjaminites because the Lord had separated the tribes of Israel. "},{"num":16,"verse":"The elders of the Israelites said, “The women of Benjamin have been killed. Where can we get wives for the men of Benjamin who are still alive? "},{"num":17,"verse":"These men must have children to continue their families so a tribe in Israel will not die out. "},{"num":18,"verse":"But we cannot allow our daughters to marry them, because we swore, ‘Anyone who gives a wife to a man of Benjamin is cursed.’ "},{"num":19,"verse":"We have an idea! There is a yearly festival of the Lord at Shiloh, which is north of the city of Bethel, east of the road that goes from Bethel to Shechem, and south of the city of Lebonah.”"},{"num":20,"verse":"So the elders told the men of Benjamin, “Go and hide in the vineyards. "},{"num":21,"verse":"Watch for the young women from Shiloh to come out to join the dancing. Then run out from the vineyards and take one of the young Shiloh women and return to the land of Benjamin. "},{"num":22,"verse":"If their fathers or brothers come to us and complain, we will say: ‘Be kind to the men of Benjamin. We did not get wives for Benjamin during the war, and you did not give the women to the men from Benjamin. So you are not guilty.’”"},{"num":23,"verse":"So that is what the Benjaminites did. While the young women were dancing, each man caught one of them, took her away, and married her. Then they went back to the land God had given them and rebuilt their cities and lived there."},{"num":24,"verse":"Then the Israelites went home to their own tribes and family groups, to their own land that God had given them."},{"num":25,"verse":"In those days Israel did not have a king. All the people did whatever seemed right in their own eyes."}]