[{"num":21,"verse":"Also the sons of Israel had sworn in Mizpeh, and said, None of us shall give to the sons of Benjamin a wife of his daughters. (At Mizpeh the Israelites had sworn, and said, None of us shall give any of his daughters for a wife to the Benjaminites.)"},{"num":2,"verse":"And all came to the house of God in Shiloh, and they sat in the sight of him till to eventide, and they raised their voice, and began to weep with great yelling, (And now when they all came to Bethel in the presence of God, they sat before him until the evening, and they raised up their voices, and began to weep with great yelling,)"},{"num":3,"verse":"and said, Lord God of Israel, why is this evil done in thy people, that today one lineage be taken away of us? (and they said, Lord God of Israel, why is this evil done among thy people, that today one tribe was taken away from us?)"},{"num":4,"verse":"Soothly in the tother day they rised early, and builded an altar, and offered there burnt sacrifices and peaceable sacrifices, (And the next day they rose up early, and built an altar there, and offered burnt sacrifices, and peace offerings,)"},{"num":5,"verse":"and said, Who of all the lineages of Israel went not up into the host of the Lord? For when they were in Mizpeh, they had bound themselves with a full great oath, that they that failed (to go up) thence should be (made) dead. (and they said, Who out of all the tribes of Israel did not go up to the gathering unto the Lord? For when they were in Mizpeh, they had bound themselves with a very great, or a very solemn, oath, that anyone who failed to go up there should be put to death.)"},{"num":6,"verse":"And the sons of Israel were led by penance on their brother Benjamin, and began to say, One lineage of Israel is taken away; (And the Israelites felt great remorse, or regret, over their kinsmen the Benjaminites, and said again, Today one of Israel’s tribes was taken from us;)"},{"num":7,"verse":"whereof shall they take wives? certainly all we have sworn in common, that we shall not give our daughters to them. (where shall they get wives? for we have all sworn in common, that we shall not give any of our daughters to them.)"},{"num":8,"verse":"Then they said, Who is it of all the lineages of Israel, that went not up to the Lord in Mizpeh? And lo! the dwellers of Jabesh of Gilead were found, that they were not in that host. (And again they said, Who is it out of all of Israel’s tribes, who did not go up unto the Lord at Mizpeh? And lo! the inhabitants of Jabesh of Gilead were found, that they had not been in that gathering.)"},{"num":9,"verse":"Also in that time, when they were in Shiloh, none of them was found there. (And there at Bethel, when the men were numbered, or were listed, none of the sons of Jabesh of Gilead was found to be there.)"},{"num":10,"verse":"Therefore they sent ten thousand (of the) strongest men, and commanded to them, Go ye, and smite the dwellers of Jabesh of Gilead by the sharpness of sword, as well the wives as the little children of them. (And so they sent twelve thousand of their strongest men, and commanded to them, Go ye, and strike down the people of Jabesh of Gilead with thy sharp swords, and their wives as well as their little children.)"},{"num":11,"verse":"And this thing shall be to you, that ye shall keep; slay ye all of male kind, and the women that have known men fleshly; reserve ye the virgins/but keep ye the maidens. (And this word shall be to you, that ye shall obey; kill ye all the males, and the women who have fleshly known men; but reserve ye the virgins/but keep ye the maidens.)"},{"num":12,"verse":"And four hundred virgins, that knew not the bed of (a) man, were found (among the people) of Jabesh of Gilead; and they brought them to the tents in Shiloh, into the land of Canaan."},{"num":13,"verse":"And Israel sent messengers to the sons of Benjamin, that were in the stone of Rimmon; and they commanded to them, that they should receive those women in peace. (And then the Israelites sent messengers to the Benjaminites, who were at the Rock of Rimmon; and they agreed to make peace.)"},{"num":14,"verse":"And the sons of Benjamin came (back) in that time, and the daughters of Jabesh of Gilead were given to them to wives; for they found none other women, which they should give to them in like manner. (And then the Benjaminites came back, and the daughters of Jabesh of Gilead were given to them for wives; but they found no other women, whom they could give to them in like manner.)"},{"num":15,"verse":"And all Israel sorrowed greatly, and did penance on the slaying of one lineage of Israel. (And all Israel greatly sorrowed, and had great remorse, or regret, over the killing of one of the tribes of Israel.)"},{"num":16,"verse":"And the greater men in birth said, What shall we do to the other men, that have not taken wives? All the women in the lineage of Benjamin have fallen down, (And the men of great age, that is, the elders, said, What shall we do for the other men who have not received wives? For all the women in the tribe of Benjamin have been killed,)"},{"num":17,"verse":"and it is to us to purvey with great care and great study, that one lineage be not done away from Israel. (and it is for us to find a way, so that one tribe be not done away from Israel.)"},{"num":18,"verse":"We may not give our daughters to them, for we be bound with an oath and cursing, by which we said, Be he cursed that giveth of his daughters (for) a wife to Benjamin."},{"num":19,"verse":"And they took counsel, and said, Lo! the solemnity of the Lord is in Shiloh, (after) the year’s turning about, that is set at the north coast of the city of Bethel, and at the east coast of the way that goeth from Bethel to Shechem, and at the south of the city of Lebonah. (And they took counsel, and said, Lo! the Feast of the Lord shall soon be in Shiloh, after the year’s turning about, yea, that city which is north of the city of Bethel, and to the east on the way that goeth from Bethel to Shechem, and to the south of the city of Lebonah.)"},{"num":20,"verse":"And they commanded to the sons of Benjamin, and said, Go ye, and be ye hid in [the] vineries; (And they commanded to the Benjaminites, and said, Go ye, and be ye hid there in the vineyards;)"},{"num":21,"verse":"and when ye see [the] daughters of Shiloh go forth by custom to lead dances, go ye out of the vineries suddenly, and ravish ye them, each man one wife, and go ye into the land of Benjamin. (and when ye see the daughters of Shiloh come out to dance, quickly go ye out of the vineyards, and seize ye them, each man one wife, and then go ye back to the land of Benjamin.)"},{"num":22,"verse":"And when the fathers and brethren of them shall come, and begin to complain and plead against you, we shall say to them, Have ye mercy of them; for we took not from a man his wife in battle, neither ye gave (them) to them, (so) why ye shall be blamed in time. (And when their fathers and their brothers shall come to you, and begin to complain and plead against you, ye shall say to them, Have ye mercy on us; for we did not take a wife from any man in battle, nor did ye give them to us, and so ye shall not be blamed for breaking the oath.)"},{"num":23,"verse":"And the sons of Benjamin did as it was commanded to them, and by their number they ravished wives to them, each man one wife, of them that led (the) dances. And they went into their possession, and builded cities, and dwelled in those. (And the Benjaminites did as it was commanded to them, and by their number they seized wives for themselves, each man one wife, out of those who led the dances. And then they went back to their possessions, and builded cities, and lived in them.)"},{"num":24,"verse":"And the sons of Israel turned again, by their lineages and families, into their tabernacles. (And the Israelites returned, by their tribes and families, to their inheritances, or their possessions.)"},{"num":25,"verse":"In those days was no king in Israel, but each man did that thing, that seemed rightful to himself. (In those days there was no king in Israel, but each person did what seemed right to himself.)"}]