[{"header":"The Vision of Jerusalem"},{"num":8,"verse":"In the sixth year, on the fifth day of the sixth month, I had just sat down in my house, with the elders of Judah seated in front of me. All of a sudden, the hand of the Lord God touched me "},{"num":2,"verse":"and I saw a likeness comparable to the appearance of a man. From his thighs downward there was the appearance of fire, and from his waist upward, there was the appearance of brightness that looked like brass."},{"num":3,"verse":"The form of a hand reached out and took me by the hair of my head. Then the Spirit lifted me up between the earth and sky, brought me toward Jerusalem, and in visions that came from God took me through the doors of the inner gate that faced north, where an image that provoked God’s jealous anger had been erected."},{"num":4,"verse":"All of a sudden, the glory of the God of Israel was there! It looked like what I had seen back in the valley. "},{"num":5,"verse":"Then he told me, “Son of Man, look up toward the north.”"},{"num":6,"verse":"Then the Spirit told me, “Son of Man, don’t you see what they’re doing? The house of Israel practices awful, detestable things here, so I’m going far away from my sanctuary. But you’re about to see things even more detestable than these.”"},{"header":"Idol Worship in the Temple"},{"num":7,"verse":"Then the Spirit brought me to the entrance of the court. As I watched, all of a sudden, there was a hole in the wall! "},{"num":8,"verse":"Then he told me, “Son of Man, dig through the wall!” So I dug into the wall. That’s when I uncovered an entrance!"},{"num":9,"verse":"Then he told me, “Go on through that entrance, so you may see the wicked, detestable things that they’re committing here.”"},{"num":10,"verse":"So I entered, looked around, and there was every form of crawling thing, loathsome animals, and all kinds of idols from the house of Israel carved all around the wall. "},{"num":11,"verse":"I saw 70 men from the elders of the house of Israel standing among them, including Shaphan’s son Jaazaniah. Each man held a censer in his hand. As the scent of the cloud of incense ascended, "},{"num":12,"verse":"the Spirit asked me, “Do you see, Son of Man, what the elders of Israel’s house are doing in secret, each in the chamber of his own carved idol? They keep saying, ‘God doesn’t see us. The Lord has abandoned the land.’”"},{"num":13,"verse":"Then the Spirit told me, “You’re about to see even more detestable practices that they’re doing!”"},{"header":"Women Weeping for Tammuz"},{"num":14,"verse":"Then he brought me to the entrance of the gate to the Lord’s Temple, which faced the north. That’s where I saw women seated, weeping for Tammuz. "},{"num":15,"verse":"Then he asked me, “Do you see this, Son of Man? You’re about to see even more detestable practices than these.”"},{"header":"Sun Worship in the Temple"},{"num":16,"verse":"Then he brought me to the inner court of the Lord’s Temple. There, at the entrance to the Lord’s Temple, between the porch and the altar, were 25 men, with their backs toward the Lord’s Temple and facing the east, prostrating themselves to the sun."},{"num":17,"verse":"“Do you see this, Son of Man?” he asked me. “Is it an insignificant thing for Judah’s house to commit the detestable things that they’re doing here? They’ve filled the land with violence and turned away from me, causing me to become angry again. Look how they’re sniffing with their noses! "},{"num":18,"verse":"I’m going to deal with them in rage and anger. I’ll show neither pity nor compassion. They’ll cry loudly directly in my ears, but I won’t listen to them.”"}]