[{"num":8,"verse":"Fourteen months after my first vision, on the fifth day of the sixth month of the sixth year, while I was sitting at my house, the elders of Judah came to me. The hand of the Eternal Lord fell upon me, and I had a vision. "},{"num":2,"verse":"I looked, and I saw what appeared to be a human—just as in my first vision. From his waist down I saw something like radiant fire, and from his waist up it was like gleaming metal surrounded by a glowing light. "},{"num":3,"verse":"He held out what looked to be a hand and seized me by the hair. The Spirit hoisted me up between heaven and earth and transported me—through a vision of God—to Jerusalem. I was taken just inside the entrance of the gate to the inner court that faces north where the infuriating image sat—the image that arouses God’s jealousy. "},{"num":4,"verse":"Right in front of me was the glory of the God of Israel, just as I had seen before in the plain."},{"num":7,"verse":"He then led me to the entrance of the temple court. I looked and saw an opening in the wall."},{"num":10,"verse":"And so I went in and looked around. It was unbelievable! There were engravings all over the wall of every forbidden thing—reptiles, impure animals, and all the lifeless idols worshiped by the people of Israel. "},{"num":11,"verse":"In front of the idols stood the 70 elders of Israel’s community, worshiping. Even Jaazaniah, son of Shaphan (a leader of Josiah’s reforms), was standing with them. Each one of the elders held a censer, and a perfumed cloud of incense was ascending from them."},{"num":14,"verse":"Then He led me to the entrance of the north-facing gate of the Eternal’s own sanctuary, and on the edge of the holiest ground in Judah, I saw women sitting around weeping for Tammuz."},{"num":16,"verse":"Then He led me to the inner court of the Eternal’s temple. There, in that sacred place between the portico and the altar of burnt offerings, were roughly 25 men. They all had their backs to the temple of the Eternal One so they could face the east and bow to the rising sun."}]