[{"header":"The Branch of the Lord"},{"num":11,"verse":"The cut-off stump of Jesse will sprout,"},{"header":"Christ Will Subdue All Things"},{"num":6,"verse":"Then the wolf will be subdued and live with the gentle lamb, and the leopard will lie down with the gentle lamb. The young calf and the ferocious lion will be together, and as a shepherd drives his flock, a small child will guide them along! "},{"num":7,"verse":"The cow and the bear will graze alongside each other; cubs and calves will lie down together. The lion, like the ox, will eat straw. "},{"num":8,"verse":"The nursing child will play safely near the rattlesnake’s den, and the toddler will stretch out his hand and shine light over the serpent. "},{"num":9,"verse":"On all my holy mountain of Zion, nothing evil or harmful will be found. For the earth will be filled with the intimate knowledge of the Lord Yahweh just as water swells the sea!"},{"header":"The God Who Restores"},{"num":10,"verse":"On that day, the root of Jesse will be lifted up as a miracle-sign to rally the people. Gentiles will diligently seek him, and his resting place will be glorious!"},{"num":11,"verse":"On that day, the Lord will extend his hand a second time to restore the remnant of his people from Assyria, Egypt, Pathros, Ethiopia, Iran, Iraq, Syria, and the coastlands of the sea. "},{"num":12,"verse":"He will lift up a banner among the nations and will gather the scattered Jews, and assemble the outcasts of Israel from the four corners of the earth. "},{"num":13,"verse":"Then Ephraim will be cleansed of envy, and those who are hostile to Judah will be cut off. Ephraim will no longer be jealous of Judah, and Judah will no longer be hostile toward Ephraim. "},{"num":14,"verse":"But they will swoop down on the slopes of Philistia to the west; together they will plunder the people of the east. They will rule over Edom and Moab, and the Ammonites will obey them."},{"num":15,"verse":"The Lord Yahweh will dry up the gulf of the Egyptian Sea. He will raise his hand over the Euphrates, and with the might of his wind, he will split it into seven streams that can be easily crossed in sandals. "},{"num":16,"verse":"Then there will be a highway leading out of Assyria for his remnant people to return, just as there was for Israel when they were set free from Egypt."}]