[{"num":2,"verse":"“‘Anyone who brings a grain offering to Adonai is to make his offering of fine flour; he is to pour olive oil on it and put frankincense on it. "},{"num":2,"verse":"He is to bring it to the sons of Aharon, the cohanim. The cohen is to take a handful of fine flour from it, together with its olive oil and all its frankincense, and make this reminder portion go up in smoke on the altar as an offering made by fire, a fragrant aroma for Adonai. "},{"num":3,"verse":"But the rest of the grain offering will belong to Aharon and his sons; it is an especially holy part of the offerings for Adonai made by fire."},{"num":4,"verse":"“‘When you bring a grain offering which has been baked in the oven, it is to consist of either unleavened cakes made of fine flour mixed with olive oil or matzah spread with olive oil. "},{"num":5,"verse":"If your offering is a grain offering cooked on a griddle, it is to consist of unleavened fine flour mixed with olive oil; "},{"num":6,"verse":"you are to break it in pieces and pour olive oil on it — it is a grain offering. "},{"num":7,"verse":"(iii) If your offering is a grain offering cooked in a pot, it is to consist of fine flour with olive oil."},{"num":8,"verse":"“‘You are to bring the grain offering prepared in any of these ways to Adonai ; it is to be presented to the cohen, and he is to bring it to the altar. "},{"num":9,"verse":"The cohen is to remove the reminder portion of the grain offering and make it go up in smoke on the altar as an offering made by fire, a fragrant aroma for Adonai. "},{"num":10,"verse":"But the rest of the grain offering will belong to Aharon and his sons; it is an especially holy part of the offerings for Adonai made by fire."},{"num":11,"verse":"“‘No grain offering that you bring to Adonai is to be made with leaven, because you are not to cause any leaven or honey to go up in smoke as an offering made by fire to Adonai. "},{"num":12,"verse":"As an offering of firstfruits you may bring these to Adonai, but they are not to be brought up onto the altar to make a fragrant aroma. "},{"num":13,"verse":"You are to season every grain offering of yours with salt — do not omit from your grain offering the salt of the covenant with your God, but offer salt with all your offerings."},{"num":14,"verse":"“‘If you bring a grain offering of firstfruits to Adonai, you are to bring as the grain offering from your firstfruits kernels of grain from fresh ears, dry-roasted with fire. "},{"num":15,"verse":"Put olive oil on it, and lay frankincense on it; it is a grain offering. "},{"num":16,"verse":"The cohen is to cause the reminder portion of it, its grits and olive oil, with all its frankincense, to go up in smoke; it is an offering made by fire for Adonai."}]