[{"header":"The Law of Grain Offerings"},{"num":2,"verse":"‘Now when anyone presents a grain offering as an offering to the Lord, his offering shall be of fine flour, and he shall pour oil on it and put frankincense on it."},{"num":2,"verse":"He shall then bring it to Aaron’s sons the priests; and he shall take from it his handful of its fine flour and of its oil, with all of its frankincense. And the priest shall offer it up in smoke as its memorial portion on the altar, an offering by fire of a soothing aroma to the Lord."},{"num":3,"verse":"The remainder of the grain offering belongs to Aaron and his sons: a most holy part of the offerings to the Lord by fire."},{"num":4,"verse":"‘Now when you bring an offering of a grain offering baked in an oven, it shall be unleavened cakes of fine flour mixed with oil, or unleavened wafers spread with oil."},{"num":5,"verse":"And if your offering is a grain offering made on the griddle, it shall be of fine flour, unleavened, mixed with oil;"},{"num":6,"verse":"you shall break it into bits and pour oil on it; it is a grain offering."},{"num":7,"verse":"Now if your offering is a grain offering made in a pan, it shall be made of fine flour with oil."},{"num":8,"verse":"When you bring in the grain offering which is made of these things to the Lord, it shall be presented to the priest, and he shall bring it to the altar."},{"num":9,"verse":"The priest then shall take up from the grain offering its memorial portion, and shall offer it up in smoke on the altar as an offering by fire of a soothing aroma to the Lord."},{"num":10,"verse":"The remainder of the grain offering belongs to Aaron and his sons: a most holy part of the offerings to the Lord by fire."},{"num":11,"verse":"‘No grain offering, which you bring to the Lord, shall be made with leaven, for you shall not offer up in smoke any leaven or any honey as an offering by fire to the Lord."},{"num":12,"verse":"As an offering of first fruits you shall bring them to the Lord, but they shall not ascend as a soothing aroma on the altar."},{"num":13,"verse":"Every grain offering of yours, moreover, you shall season with salt, so that the salt of the covenant of your God will not be lacking from your grain offering; with all your offerings you shall offer salt."},{"num":14,"verse":"‘Also if you bring a grain offering of early ripened things to the Lord, you shall bring fresh heads of grain roasted in the fire, crushed grain of new growth, for the grain offering of your early ripened produce."},{"num":15,"verse":"You shall then put oil on it and place incense on it; it is a grain offering."},{"num":16,"verse":"Then the priest shall offer up in smoke its memorial portion, part of its crushed grain and its oil with all its incense as an offering by fire to the Lord."}]