[{"num":22,"verse":"1 David complained because he was brought into such extremities that he was past all hope, but after he had rehearsed the sorrows and griefs, wherewith he was vexed. 10 He recovereth himself from the bottomless pit of tentations, and groweth in hope.  And here under his own person he setteth forth the figure of Christ, whom he did foresee by the spirit of prophecy, that he should marvelously, and strangely be rejected, and abased, before his Father should raise and exalt him again."},{"num":1,"verse":"My God, my God, why hast thou forsaken me, and art so far from mine health, and from the words of my roaring?"},{"num":2,"verse":"O my God, I cry by day, but thou hearest not: and by night, but have no audience."},{"num":3,"verse":"But thou art holy, and dost inhabit the praises of Israel."},{"num":4,"verse":"Our fathers trusted in thee: they trusted, and thou didst deliver them."},{"num":5,"verse":"They called upon thee, and were delivered: they trusted in thee, and were not confounded."},{"num":6,"verse":"But I am a worm, and not a man: a shame of men, and the contempt of the people."},{"num":7,"verse":"All they that see me, have me in derision: they make a mow and nod the head, saying,"},{"num":8,"verse":"He trusted in the Lord, let him deliver him: let him save him, seeing he loveth him."},{"num":9,"verse":"But thou didst draw me out of the womb: thou gavest me hope, even at my mother’s breasts."},{"num":10,"verse":"I was cast upon thee, even from the womb: thou art my God from my mother’s belly."},{"num":11,"verse":"Be not far from me, because trouble is near: for there is none to help me."},{"num":12,"verse":"Many young bulls have compassed me: mighty bulls of Bashan have closed me about."},{"num":13,"verse":"They gape upon me with their mouths, as a ramping and roaring lion."},{"num":14,"verse":"I am like water poured out, and all my bones are out of joint: mine heart is like wax: it is molten in the midst of my bowels."},{"num":15,"verse":"My strength is dried up like a potsherd, and my tongue cleaveth to my jaws, and thou hast brought me into the dust of death."},{"num":16,"verse":"For dogs have compassed me, and the assembly of the wicked have enclosed me: they pierced mine hands and my feet."},{"num":17,"verse":"I may tell all my bones, yet they behold, and look upon me."},{"num":18,"verse":"They part my garments among them, and cast lots upon my vesture."},{"num":19,"verse":"But be not thou far off, O Lord, my strength: hasten to help me."},{"num":20,"verse":"Deliver my soul from the sword: my desolate soul from the power of the dog."},{"num":21,"verse":"Save me from the lion’s mouth, and answer me in saving me from the horns of the unicorns."},{"num":22,"verse":"I will declare thy Name unto my brethren: in the midst of the Congregation will I praise thee, saying,"},{"num":23,"verse":"Praise the Lord, ye that fear him: magnify ye him, all the seed of Jacob, and fear ye him all the seed of Israel."},{"num":24,"verse":"For he hath not despised nor abhorred the affliction of the poor: neither hath he hid his face from him, but when he called unto him, he heard."},{"num":25,"verse":"My praise shall be of thee in the great Congregation: my vows will I perform before them that fear him."},{"num":26,"verse":"The poor shall eat and be satisfied: they that seek after the Lord, shall praise him: your heart shall live forever."},{"num":27,"verse":"All the ends of the world shall remember themselves and turn to the Lord, and all the kindreds of the nations shall worship before thee."},{"num":28,"verse":"For the kingdom is the Lord’s, and he ruleth among the nations."},{"num":29,"verse":"All they that be fat in the earth shall eat and worship: all they that go down into the dust, shall bow before him, even he that cannot quicken his own soul."},{"num":30,"verse":"Their seed shall serve him: it shall be counted unto the Lord for a generation."},{"num":31,"verse":"They shall come and shall declare his righteousness unto a people that shall be born, because he hath done it."}]