[{"num":1,"verse":"Paul Paulos, an  apostle apostolos of  Christ Christos Jesus Iēsous because kata of  the  command epitagē from  God theos our hēmeis Savior sōtēr and kai Christ Christos Jesus Iēsous our hēmeis · ho hope elpis, "},{"num":2,"verse":"to  Timothy Timotheos, my  true gnēsios spiritual en son teknon:  Grace charis,  mercy eleos,  peace eirēnē from apo God theos the  Father patēr and kai Christ Christos Jesus Iēsous our hēmeis · ho Lord kyrios. "},{"num":3,"verse":"Just kathōs as  I  urged parakaleō you sy to  stay prosmenō on  in en Ephesus Ephesos while  I  was  traveling poreuō to eis Macedonia Makedonia,  so hina that  you  might  command parangellō certain tis people  not mē to  continue  teaching heterodidaskaleō any  different  doctrine "},{"num":4,"verse":"or mēde to  devote prosechō themselves  to  endless aperantos myths mythos and kai genealogies genealogia,  which hostis produce parechō speculations ekzētēsis rather mallon than ē the  stewardship oikonomia from  God theos which ho is  by en faith pistis. "},{"num":5,"verse":"But de the ho goal telos of  this ho command parangelia is eimi love agapē from ek a  clean katharos heart kardia and kai a  clear agathos conscience syneidēsis and kai a  sincere anypokritos faith pistis. "},{"num":6,"verse":"Some tis,  having  fallen astocheō short  of  these  things hos,  have  wandered ektrepō away  into eis senseless  babble mataiologia, "},{"num":7,"verse":"wishing thelō to eimi be  teachers nomodidaskalos of  the  law  even  though  they  do  not mē understand noeō either mēte what hos they  are  saying legō or mēte concerning peri what tis things  they  are  so  dogmatically  asserting diabebaioomai. "},{"num":8,"verse":"Now de we  know oida that hoti the ho law nomos is  good kalos if ean someone tis uses chraomai it autos lawfully nomimōs, "},{"num":9,"verse":"knowing oida this houtos,  that hoti law nomos is  not ou valid keimai for dikaios a  righteous  person dikaios but de for  the  lawless anomos and kai rebellious anypotaktos,  irreligious asebēs and kai sinners hamartōlos,  unholy anosios and kai profane bebēlos,  those  who  beat  their  fathers patrolōas and kai mothers mētrolōas,  murderers androphonos, "},{"num":10,"verse":"fornicators pornos,  men  who  practice  homosexuality arsenokoitēs,  kidnappers andrapodistēs,  liars pseustēs,  perjurers epiorkos,  and kai everything ei tis else heteros that ho is  contrary  to antikeimai healthy hygiainō teaching didaskalia, "},{"num":11,"verse":"in  conformity  to kata the ho gospel euangelion of ho the  glory doxa of  the ho blessed makarios God theos with  which hos I egō was  entrusted pisteuō. "},{"num":12,"verse":"I  continually echō thank charis him  who ho strengthened endynamoō me egō,  Christ Christos Jesus Iēsous · ho our hēmeis Lord kyrios,  since hoti he  considered hēgeomai that even  I egō would be  faithful pistos,  as  evidenced  by  his  appointing tithēmi me  to eis service diakonia, "},{"num":13,"verse":"even  though  · ho formerly proteros I  was eimi a  blasphemer blasphēmos,  · kai persecutor diōktēs,  and kai an  insolent  person hybristēs.  But alla I  was  shown  mercy eleeō since hoti,  being  ignorant agnoeō,  I  had  acted poieō in en unbelief apistia; "},{"num":14,"verse":"and de the ho grace charis of ho our hēmeis Lord kyrios completely  overflowed hyperpleonazō for me  with meta faith pistis and kai love agapē that ho are  in en Christ Christos Jesus Iēsous. "},{"num":15,"verse":"Trustworthy pistos is  the ho saying logos and kai worthy axios of  complete pas acceptance apodochē: “ Christ Christos Jesus Iēsous came erchomai into eis the ho world kosmos in  order  to  save sōzō sinners hamartōlos,”  of  whom hos I egō am eimi the  foremost prōtos. "},{"num":16,"verse":"But alla for dia this houtos reason  I  was  shown  mercy eleeō:  so  that hina in en me egō as  foremost prōtos Christ Christos Jesus Iēsous might  display endeiknymi his ho complete hapas patience makrothumia as pros an  illustration hypotypōsis for  those ho who  were mellō to  believe pisteuō in epi him autos for eis eternal aiōnios life zōē. "},{"num":17,"verse":"Now de to  the ho king basileus of ho ages aiōn,  incorruptible aphthartos,  invisible aoratos, the  only monos God theos, be  honor timē and kai glory doxa for eis all ho time aiōn ho.  · ho Amen amēn. "},{"num":18,"verse":"This houtos · ho command parangelia I  am  entrusting paratithēmi to  you sy,  child teknon Timothy Timotheos,  in  accordance  with kata the ho prophecies prophēteia previously proagō made  about epi you sy,  so  that hina by en them autos you might fight  the ho good kalos fight strateia, "},{"num":19,"verse":"holding echō on  to  faith pistis and kai a  good agathos conscience syneidēsis.  By  rejecting apōtheō their faith and good conscience,  some tis have  shipwrecked nauageō the ho faith pistis, "},{"num":20,"verse":"among  whom hos are eimi Hymenaeus Hymenaios and kai Alexander Alexandros,  whom hos I  have  delivered  over paradidōmi to ho Satan Satanas so  that hina they  might  be  taught paideuō through  punishment  not mē to  blaspheme blasphēmeō. "}]