[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye also, as lively stones, are built up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—This is true enough: they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in process of building up; but it suits the hortatory character of the whole Epistle better to take it (the one is as grammatical as the other) in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "imperative",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sense: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Be ye also as living stones built up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The rendering “lively,” instead of “living,” as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Peter 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is arbitrary, the Greek being precisely the same, and the intention being to show the complete conformation of the believers to Him who is the type and model for humanity. “Built up,” too, only expresses a part of the Greek word, which implies “built up ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A spiritual house.—The epithet is supplied, just as in “living stone,” to make it abundantly clear that the language is figurative. In the first three verses of the chapter these Hebrew Christians were treated individually, as so many babes, to grow up into an ideal freedom of soul: here they are treated collectively (of course, along with the Gentile Christians), as so many stones, incomplete and unmeaning in themselves, by arrangement and cemented union to rise into an ideal house of God. St. Peter does not distinctly say that the “house” is a temple (for the word “spiritual” is only the opposite of “material”), but the context makes it plain that such is the case. The temple is, however, regarded not in its capacity of a place for worship so much as a place for Divine inhabitation. “The spiritual house,” says Leighton truly, “is the palace of the Great King. The Hebrew word for palace and temple is one.” And the reason for introducing this figure seems to be, to console the Hebrews for their vanishing privileges in the temple at Jerusalem. They are being taught to recognise that they themselves, in their union with one another, and with Jesus Christ, are the true abode of the Most High. The Christian substitution of something else in lieu of the Jerusalem Temple was one of the greatest stumbling-blocks to the Hebrews from the very first. (See Mark 14:58; John 2:21; Acts 7:48; Acts 21:28; compare also Hebrews 9:8; Hebrews 9:11.) All history is the process of building up a “spiritual palace” out of a regenerate humanity, in order that, in the end, the Father Himself may occupy it. This follows from the fact that the Incarnate Son is described as a part of the Temple. Even through the Incarnation—at least so far as it has as yet taken effect—creation has not become so completely pervaded and filled with the Deity as it is destined to be when the “palace” is finished. (See 1Corinthians 15:28.) The idea of the Eternal Son occupying such a relation to the Father on the one hand, and to humanity and creation on the other hand, is really the same as when He is called (by an entirely different metaphor) the “firstborn of all creation” (Colossians 1:15).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A spiritual house.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The epithet is supplied, just as in “",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "living",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stone,” to make it abundantly clear that the language is figurative. In the first three verses of the chapter these Hebrew Christians were treated ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "individually, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "as so many babes, to grow up into an ideal ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "freedom of soul",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": here they are treated ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "collectively",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (of course, along with the Gentile Christians), as so many stones, incomplete and unmeaning in themselves, by arrangement and cemented union to rise into an ideal ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "house of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " St. Peter does not distinctly say that the “house” is a temple (for the word “spiritual” is only the opposite of “material”), but the context makes it plain that such is the case. The temple is, however, regarded not in its capacity of a place for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "worship",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " so much as a place for Divine ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "inhabitation.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " “The spiritual house,” says Leighton truly, “is the palace of the Great King. The Hebrew word for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "palace",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "temple",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is one.” And the reason for introducing this figure seems to be, to console the Hebrews for their vanishing privileges in the temple at Jerusalem. They are being taught to recognise that they themselves, in their union with one another, and with Jesus Christ, are the true abode of the Most High. The Christian substitution of something else in lieu of the Jerusalem Temple was one of the greatest stumbling-blocks to the Hebrews from the very first. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:58",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 2:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 21:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) All history is the process of building up a “spiritual palace” out of a regenerate humanity, in order that, in the end, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Father Himself",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may occupy it. This follows from the fact that the Incarnate ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Son",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is described as a ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "part",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the Temple. Even through the Incarnation—at least so far as it has as yet taken effect—creation has not become so completely pervaded and filled with the Deity as it is destined to be when the “palace” is finished. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 15:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The idea of the Eternal Son occupying such a relation to the Father on the one hand, and to humanity and creation on the other hand, is really the same as when He is called (by an entirely different metaphor) the “firstborn of all creation” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "An holy priesthood.—“Being living stones,” says Bengel, “they can be priests as well.” They not only compose the Temple, but minister in it. By becoming Christians they are cut off from neither Temple nor hierarchy, nor sacrifice; all are at hand, and they themselves are all. The old priesthood, like the old Temple, has “had its day, and ceased to be.” Mark, though, that the Apostle is not dwelling on the individual priesthood of each (though that is involved), but on the hierarchical order of the whole company of Christians: they are an organised body or college of priests, a new seed of Aaron or Levi. (See Isaiah 66:21.) The very word implies that all Christians have not an equal degree of priesthood. And this new priesthood, like the old, is no profane intruding priesthood like that of Core (Jude 1:11), but “holy”—i.e., consecrated, validly admitted to its work. The way in which this new metaphor is suddenly introduced,—“to whom coming, be built up upon Him . . . to be an holy priesthood,” implies that Jesus Christ is the High Priest quite as much as it implies His being Corner Stone. The Incarnate Son heads the adoration offered to the Father by creation, just as He binds creation into a palace for the Father’s indwelling.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "An holy priesthood.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—“Being ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "living",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stones,” says Bengel, “they can be priests as well.” They not only ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "compose",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the Temple, but minister in it. By becoming Christians they are cut off from neither Temple nor hierarchy, nor sacrifice; all are at hand, and they themselves are all. The old priesthood, like the old Temple, has “had its day, and ceased to be.” Mark, though, that the Apostle is not dwelling on the individual priesthood of each (though that is involved), but on the hierarchical order of the whole company of Christians: they are an organised body or college of priests, a new seed of Aaron or Levi. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The very word implies that all Christians have not an equal ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "degree",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of priesthood. And this new priesthood, like the old, is no profane intruding priesthood like that of Core (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jude 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but “holy”—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "consecrated, validly admitted to its work. The way in which this new metaphor is suddenly introduced,—“to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "whom",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " coming, be built up ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "upon Him",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " . . . to be an holy priesthood,” implies that Jesus Christ is the High Priest quite as much as it implies His being Corner Stone. The Incarnate Son heads the adoration offered to the Father by creation, just as He binds creation into a palace for the Father’s indwelling.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To offer up spiritual sacrifices.—The new priesthood is not merely nominal; it is no sinecure. None is a priest who does not offer sacrifices (Hebrews 8:3). But the sacrifices of the new hierarchy are “spiritual, ”—i.e., not material, not sacrifices of bulls and goats and lambs. What, then, do the sacrifices consist of? If our priesthood is modelled on that of Jesus Christ, as is here implied, it consists mainly (Calvin points this out) of the sacrifice of self, of the will; then, in a minor degree, of words and acts of worship, thanks and praise. (See Hebrews 13:10-16.) But in order to constitute a true priesthood and true sacrifices after the model of Jesus Christ, these sacrifices are offered up on behalf of others. (See Hebrews 5:1, and 1John 3:16.) The first notion of the priesthood of all believers is not that of a mediatorial system being abolished, but of the mediatorial system being extended: whereas, before, only Aaron’s sons were recognised as mediators and intercessors, now all Israel, all the spiritual Israel, all men everywhere are called to be mediators and intercessors between each other and God.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "To offer up spiritual sacrifices.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The new priesthood is not merely nominal; it is no sinecure. None is a priest who does not offer sacrifices (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But the sacrifices of the new hierarchy are “spiritual, ”—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "not material, not sacrifices of bulls and goats and lambs. What, then, do the sacrifices consist of? If our priesthood is modelled on that of Jesus Christ, as is here implied, it consists mainly (Calvin points this out) of the sacrifice of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "self, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "will;",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " then, in a minor degree, of words and acts of worship, thanks and praise. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:10-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) But in order to constitute a true priesthood and true sacrifices after the model of Jesus Christ, these sacrifices are offered up on behalf of others. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1John 3:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The first notion of the priesthood of all believers is not that of a mediatorial system being abolished, but of the mediatorial system being extended: whereas, before, only Aaron’s sons were recognised as mediators and intercessors, now all Israel, all the spiritual Israel, all men everywhere are called to be mediators and intercessors between each other and God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "By (or, through) Jesus Christ.—The name again, not the title only. We all help one another to present one another’s prayers and praises, which pass through the lips of many priests; but for them to be acceptable, they must be presented finally through the lips of the Great High Priest. He, in His perfect sympathy with all men, must make the sacrifice His own. We must unite our sacrifices with His—the Advocate with the Father, the Propitiation for our sins—or our sacrifice will be as irregular and offensive as though some Canaanite should have taken upon himself to intrude into the Holy of Holies on Atonement Day. (See Hebrews 10:19-25, especially 1Peter 2:21.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "By",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "through",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jesus Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "name",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " again, not the title only. We all help one another to present one another’s prayers and praises, which pass through the lips of many priests; but for them to be acceptable, they must be presented finally through the lips of the Great High Priest. He, in His perfect sympathy with all men, must make the sacrifice His own. We must unite our sacrifices with His—the Advocate with the Father, the Propitiation for our sins—or our sacrifice will be as irregular and offensive as though some Canaanite should have taken upon himself to intrude into the Holy of Holies on Atonement Day. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:19-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", especially ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Peter 2:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Peter",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "SPIRITUAL SACRIFICES",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In this verse Peter piles up his metaphors in a fine profusion, perfectly careless of oratorical elegance or propriety. He gathers together three symbols, drawn from ancient sacrificial worship, and applies them all to Christian people. In the one breath they are ‘temples,’ in the next ‘priests,’ in the third ‘sacrifices.’ All the three are needed to body out the whole truth of the relationship of the perfect universal religion--which is Christianity--to the fragmentary and symbolical religion of ancient time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Christians individually and collectively are temples, inasmuch as they are ‘the habitation of God through the Spirit.’ They are priests by virtue of their consecration, their direct access to God, their function of representing God to men, and of bringing men to God. They are sacrifices, inasmuch as one main part of their priestly function is to offer themselves to God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, it is very difficult for us to realise what an extraordinary anomaly the Christian faith presented at its origin, surrounded by religions which had nothing to do with morality, conduct, or spiritual life, but were purely ritualistic. And here, in the midst of them, started up a religion bare and bald, and with no appeal to sense, no temple, no altar, no sacrifice. But the Apostles with one accord declare that they had all these things in far higher form than those faiths possessed them, which had only the outward appearance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, this conception of the sacrificial element in the Christian life runs through the whole New Testament, and is applied there in a very remarkable variety of forms. I have taken the words of my text, not so much to discourse upon them especially. My object now is rather to gather together the various references to the Christian life as essentially sacrificial, and to trace the various applications which that idea receives in the New Testament. There are four classes of these, to which I desire especially to refer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. There is the living sacrifice of the body.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘I beseech you, by the mercies of God, that ye present’--which is a technical word for a priest’s action--’your bodies a living sacrifice,’ in contrast with the slaying, which was the presentation of the animal victim. Now, that ‘body’ there is not equivalent to self is distinctly seen when we notice that Paul goes on, in the very next clause, to say, ‘and be transformed by the renewing of your mind.’ So that he is speaking, not of the self, but of the corporeal organ and instrument of the self, when he says ‘present your bodies a living sacrifice.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Of course, the central idea of sacrifice is surrender to God; and, of course, the place where that surrender is made is the inmost self. The will is the man, and when the will bows, dethroning self and enthroning God, submitting to His appointments, and delighting to execute His commandments, then the sacrifice is begun. But, inasmuch as the body is the organ of the man’s activity, the sacrifice of the will and of self must needs come out into visibility and actuality in the aggregate of deeds, of which the body is the organ and instrument. But there must first of all be the surrender of my inmost self, and only then, and as the token and outcome of that, will any external acts, however religious they may seem to be, come into the category of sacrifice when they express a conscious surrender of myself to God. ‘The flesh profiteth nothing,’ and yet the flesh profiteth much. But here is the order that another of the Apostles lays down: ‘Yield yourselves to God,’ and then, ‘your members as instruments of righteousness to Him.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "To speak of the sacrifice of the body as a living sacrifice suggests that it is not the slaying of any bodily appetite or activity that is the true sacrifice and worship, but the hallowing of these. It is a great deal easier, and it is sometimes necessary, to cut off the offending right hand, to pluck out the offending right eye, or, putting away the metaphor, to abstain rigidly from forms of activity which are perfectly legitimate in themselves, and may be innocuous to other people, if we find that they hurt us. But that is second best, and though it is better in the judgment of common sense to go into life maimed than complete to be cast into hell-fire, it is better still to go into life symmetrical and entire, with no maiming in hand or organ. So you do not offer the living sacrifice of the body when you annihilate, but when you suppress, and direct, and hallow its needs, its appetites, and its activities.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The meaning of this sacrifice is that the whole active life should be based upon, and be the outcome of, the inward surrender of self unto God. ‘On the bells of the horses shall be written, Holiness to the Lord, and every pot and vessel in Jerusalem shall be holy as the bowls upon the altar’--in such picturesque and yet profound fashion did an ancient prophet set forth the same truth that lies in this declaration of our Apostle, that the body, the instrument of our activities, should be a living sacrifice to God. Link all its actions with Him; let there be conscious reference to Him in all that I do. Let foot and hand and eye and brain work for Him, and by Him, and in constant consciousness of His presence; suppress where necessary, direct always, appetites and passions, and make the body the instrument of the surrendered spirit. And then, in the measure in which we can do so, the greatest cleft and discord in human life will be filled, and body, soul, and spirit will harmonise and make one music of praise to God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ah! brethren, these bad principles have teeth to bite very close into our daily lives. How many of us, young and old, have ‘fleshly lusts which war against the soul’? How many of you young men have no heart for higher, purer, nobler things, because the animal in you is strong! How many of you find that the day’s activities blunt you to God! How many of us are weakened still under that great antagonism of the flesh lusting against the spirit, so that we cannot do the things that we would! Sensuality, indulgence in animal propensities, yielding to the clamant voices of the beast that is within us--these things wreck many a soul; and some of those that are listening to me now. Let the man govern and coerce the animal, and let God govern the man. ‘I beseech you that you yield your bodies a living sacrifice.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. There is the sacrifice of praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Of course, logically and properly, this, and all the others that I am going to speak about, are included within that to which I have already directed attention. But still they are dealt with separately in Scripture, and I follow the guidance. We read in the Epistle to the Hebrews: ‘By Him therefore let us offer the sacrifice of praise unto God continually--that is, the fruit of our lips giving thanks unto His name.’ There, then, is another of the regions into which the notion of sacrifice as the very essence of Christian life is to be carried.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is nothing more remarkable in Scripture than the solemn importance that it attaches to what so many people think so little about, and that is words. It even sometimes seems to take them as being more truly the outcome and revelation of a man’s character than his deeds are. And that is true, in some respects. But at all events there is set forth, ever running all through the Scripture, that thought, that one of the best sacrifices that men can make to God is to render up the tribute of their praise. In the great psalm which lays down with clearness never surpassed in the New Testament the principles of true Christian worship, this is declared: ‘Whoso offereth praise glorifieth Me.’ The true offering is not the slaying of animals or the presentation of any material things, but the utterance of hearts welling up thankfulness. In the ancient ritual there stood within the Holy place, and after the altar of burnt-offering had been passed, three symbols of the relation of the redeemed soul to God. There was the great candlestick, which proclaimed ‘Ye are the light of the world.’ There was the table on which the so-called shewbread was laid, and in the midst there was the altar of incense, on which, day by day, morning and evening, there was kindled the fragrant offering which curled up in wreaths of blue smoke aspiring towards the heavens. It lay smouldering all through the day, and was quickened into flame morning and evening. That is a symbol representing what the Christian life ought to be--a continual thank-offering of the incense of prayer and praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Nor that only, brethren, but also there is another shape in which our words should be sacrifices, and that is in the way of direct utterances to men, as well as of thanksgiving to God. What a shame it is, and what a confession of imperfect, partial redemption and regeneration on the part of professing Christians it is, that there are thousands of us who never, all our lives, have felt the impulse or necessity of giving utterance to our Christian convictions! You can talk about anything else; you are tongue-tied about your religion. Why is that? You can make speeches upon political platforms, or you can discourse on many subjects that interest you. You never speak a word to anybody about the Master that you say you serve. Why is that? ‘What is bred in the bone comes out in the flesh.’ What is deep in the heart sometimes lies there unuttered, but more often demands expression. I venture to think that if your Christianity was deeper, it would not be so dumb. You strengthen your convictions by speech. A man’s belief in anything grows incalculably by the very fact of proclaiming it. And there is no surer way to lose moral and spiritual convictions than to huddle them up in the secret chambers of our hearts. It is like a man carrying a bit of ice in his palm. He locks his fingers over it, and when he opens them it has all run out and gone. If you want to deepen your Christianity, declare it. If you would have your hearts more full of gratitude, speak your praise. There used to be in certain religious houses a single figure kneeling on the altar-steps, by day and by night, ever uttering forth with unremitting voice, the psalm of praise. That perpetual adoration in spirit, if not in form, ought to be ours. The fruit of the lips should continually be offered. Literally, of course, there cannot be that unbroken and exclusive utterance of thanksgiving. There are many other things that men have to talk about; but through all the utterances there ought to spread the aroma--like some fragrance diffused through the else scentless air from some unseen source of sweetness--of that name to which the life is one long thanksgiving.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. There is the sacrifice of help to men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The same passage in the Epistle to the Hebrews, to which I have already referred, goes on to bracket together the sacrifice of praise and of deeds. It continues thus:--’But to do good and to communicate forget not.’ Again I say, logically this comes under the first division. But still it may be treated separately, and it just carries this thought--your praying and singing praises are worse than useless unless you go out into the world an embodiment and an imitation of the love which you hymn. True philanthropy has its roots in true religion. The service of man is the service of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That principle cuts two ways. It comes as a sharp test of their prayers and psalm-singing to emotional Christians, who are always able to gush in words of thankfulness, and it confronts them with the question, What do you do for your brother? That is a question that comes very close to us all. Do not talk about being the priests of the Most High God unless you are doing the priestly office of representing God to men, and carrying to them the blessings that they need. Your service to God is worthless unless it is followed by diligent, fraternal, wise, self-sacrificing service for men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The same principle points in another direction. If, on the one hand, it crushes as hypocrisy a religion of talk, on the other hand it declares as baseless a philanthropy which has no reference to God. And whilst I know that there are many men who, following the dictates of their hearts, and apart altogether from any reference to higher religious sanctions, do exercise pity and compassion and help, I believe that for the basing of a lasting, wide, wise benevolence, there is nothing solid and broad except Christ and Him crucified, and the consciousness of having been--sinful and needy as we are--received and blessed by Him. Let the philanthropists learn that the surrender of self, and the fruit of the lips giving thanks to His name, must precede the highest kind of beneficence. Let the Christian learn that benevolence is the garb in which religion is dressed. ‘True worship and undefiled ... is this, to visit the widow and the fatherless in their affliction.’ Morality is the dress of Religion; Religion is the body of Morality.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. Lastly, there is the sacrifice of death.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘I am ready to be offered,’ says the Apostle--to be poured out, as a libation. And again, ‘If I be offered upon the sacrifice and service of your faith, I rejoice with you all.’ And so may",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": " ‘Death the endless mercies seal, And make the sacrifice complete.’",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ‘Death the endless mercies seal,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And make the sacrifice complete.’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It may become not a reluctant being dragged out of life whilst we cling to it with both our hands. It may be not a reluctant yielding to necessity, but a religious act, in which a man resignedly and trustfully and gratefully yields himself to God; and says, ‘Father! into Thy hands I commit my spirit.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ah! brethren, is not that a better way to die than to be like some poor wretch in a stream, that clutches at some unfixed support on the bank, and is whirled away down, fiercely resisting and helpless? We may thus make our last act an act of devotion, and go within the veil as priests bearing in our hands the last of our sacrifices. The sacrifice of death will only be offered when a life of sacrifice has preceded it. And if you and I, moved by the mercies of God, yield ourselves living sacrifices, using our lips for His praise and our possessions for man’s help, then we may die as the Apostle expected to do, and feel that by Christ Jesus even death becomes ‘an odour of a sweet smell, a sacrifice acceptable, well-pleasing unto God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Peter 2:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye also ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Believing in him with a loving and obedient faith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as lively ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ζωντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "living, stones ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Quickened and made alive to God by spiritual life derived from him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are built up ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Upon him, and in union with each other; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a spiritual house — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Spiritual yourselves; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a habitation of God through the Spirit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For, according to his promise, he lives and walks in every true believer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and collectively considered, as a holy society, or assembly, uniting together in his worship and service, you are the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of the living God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) in which he manifests his presence, displays his glory, communicates his blessings, and accepts the prayers and praises, alms and oblations, of his people; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a holy priesthood ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not only God’s temple, but the priests that serve him in that temple; that is, persons dedicated to and employed for God. Thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it is foretold that, in the days of the Messiah, the people of God should be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "named the priests of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the ministers of our God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 66:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Christians are called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a priesthood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the same sense that the Israelites were called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a kingdom of priests, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The apostle’s design, in giving these titles to real Christians, is partly to show that they are dedicated to God in heart and life, and also that in the Christian church or temple, there is no need of the mediation of priests to present our prayers to God. Every sincere worshipper has access to the Father through Christ, as if he were really a priest himself. The apostle says, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "priesthood, because genuine Christians are very different characters from the generality of the Jewish priests, who, though the posterity of Aaron, and dedicated externally to, and employed in, the service of God, were remarkably unholy, yea, very vicious characters; whereas the true disciples of Christ are really holy in heart and life. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To offer up spiritual sacrifices ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not merely their prayers and praises, but their souls and bodies, their time and talents, with all their thoughts, words, and actions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "acceptable to God through ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the mediation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus Christ — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The great High-Priest over the house of God, whose intercession alone can recommend to the Father such imperfect sacrifices as ours.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-10 Evil-speaking is a sign of malice and guile in the heart; and hinders our profiting by the word of God. A new life needs suitable food. Infants desire milk, and make the best endeavours for it which they are able to do; such must be a Christian's desires after the word of God. Our Lord Jesus Christ is very merciful to us miserable sinners; and he has a fulness of grace. But even the best of God's servants, in this life, have only a taste of the consolations of God. Christ is called a Stone, to teach his servants that he is their protection and security, the foundation on which they are built. He is precious in the excellence of his nature, the dignity of his office, and the glory of his services. All true believers are a holy priesthood; sacred to God, serviceable to others, endowed with heavenly gifts and graces. But the most spiritual sacrifices of the best in prayer and praise are not acceptable, except through Jesus Christ. Christ is the chief Corner-stone, that unites the whole number of believers into one everlasting temple, and bears the weight of the whole fabric. Elected, or chosen, for a foundation that is everlasting. Precious beyond compare, by all that can give worth. To be built on Christ means, to believe in him; but in this many deceive themselves, they consider not what it is, nor the necessity of it, to partake of the salvation he has wrought. Though the frame of the world were falling to pieces, that man who is built on this foundation may hear it without fear. He shall not be confounded. The believing soul makes haste to Christ, but it never finds cause to hasten from him. All true Christians are a chosen generation; they make one family, a people distinct from the world: of another spirit, principle, and practice; which they could never be, if they were not chosen in Christ to be such, and sanctified by his Spirit. Their first state is a state of gross darkness, but they are called out of darkness into a state of joy, pleasure, and prosperity; that they should show forth the praises of the Lord by their profession of his truth, and their good conduct. How vast their obligations to Him who has made them his people, and has shown mercy to them! To be without this mercy is a woful state, though a man have all worldly enjoyments. And there is nothing that so kindly works repentance, as right thoughts of the mercy and love of God. Let us not dare to abuse and affront the free grace of God, if we mean to be saved by it; but let all who would be found among those who obtain mercy, walk as his people.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye also, as lively stones - Greek, \"living stones.\" The word should have been so rendered. The word lively with us now has a different meaning from living, and denotes \"active, quick, sprightly.\" The Greek word is the same as that used in the previous verse, and rendered living. The meaning is, that the materials of which the temple here referred to was composed, were living materials throughout. The foundation is a living foundation, and all the superstructure is compassed of living materials. The purpose of the apostle here is to compare the church to a beautiful temple - such as the temple in Jerusalem, and to show that it is complete in all its parts, as that was. It has within itself what corresponds with everything that was valuable in that. It is a beautiful structure like that; and as in that there was a priesthood, and there were real and acceptable sacrifices offered, so it is in the Christian church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Jews prided themselves much on their temple. It was a most costly and splendid edifice. It was the place where God was worshipped, and where he was supposed to dwell. It had an imposing service, and there was acceptable worship rendered there. As a new dispensation was introduced; as the tendency of the Christian system was to draw off the worshippers from that temple, and to teach them that God could be worshipped as acceptably elsewhere as at Jerusalem, John 4:21-23 as Christianity did not inculcate the necessity of rearing splendid temples for the worship of God; and as in fact the temple at Jerusalem was about to be destroyed forever, it was important to show that in the Christian church there might be found all that was truly beautiful and valuable in the temple at Jerusalem; that it had what corresponded to what was in fact most precious there, and that there was still a most magnificent and beautiful temple on the earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Jews prided themselves much on their temple. It was a most costly and splendid edifice. It was the place where God was worshipped, and where he was supposed to dwell. It had an imposing service, and there was acceptable worship rendered there. As a new dispensation was introduced; as the tendency of the Christian system was to draw off the worshippers from that temple, and to teach them that God could be worshipped as acceptably elsewhere as at Jerusalem, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 4:21-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as Christianity did not inculcate the necessity of rearing splendid temples for the worship of God; and as in fact the temple at Jerusalem was about to be destroyed forever, it was important to show that in the Christian church there might be found all that was truly beautiful and valuable in the temple at Jerusalem; that it had what corresponded to what was in fact most precious there, and that there was still a most magnificent and beautiful temple on the earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence, the sacred writers labor to show that all was found in the church that had made the temple at Jerusalem so glorious, and that the great design contemplated by the erection of that splendid edifice - the maintenance of the worship of God - was now accomplished in a more glorious manner than even in the services of that house. For there was a temple, made up of living materials, which was still the special dwelling-place of God on the earth. In that I temple there was a holy priesthood - for every Christian was a priest. In that temple there were sacrifices offered, as acceptable to God as in the former - for they were spiritual sacrifices, offered continually. These thoughts were often dwelt upon by the apostle Paul, and are here illustrated by Peter, evidently with the same design, to impart consolation to those who had never been permitted to worship at the temple in Jerusalem, and to comfort those Jews, now converted to Christianity, who saw that that splendid and glorious edifice was about to be destroyed. The special abode of God on the earth was now removed from that temple to the Christian church. The first aspect in which this is illustrated here is, that the temple of God was made up of \"living stones;\" that is, that the materials were not inanimate stones but endued with life, and so much more valuable than those employed in the temple at Jerusalem, as the soul is more precious than any materials of stone. There were living beings which composed that temple, constituting a more beautiful structure, and a more appropriate dwelling-place for God, than any edifice could be made of stone, however costly or valuable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A spiritual house - A spiritual temple, not made of perishable materials, like that at Jerusalem net composed of matter, as that was, but made up of redeemed souls - a temple more appropriate to be the residence of one who is a pure spirit. Compare the Ephesians 2:19-22 notes, and 1 Corinthians 6:19-20 notes.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A spiritual house - A spiritual temple, not made of perishable materials, like that at Jerusalem net composed of matter, as that was, but made up of redeemed souls - a temple more appropriate to be the residence of one who is a pure spirit. Compare the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:19-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " notes, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 6:19-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " notes.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "An holy priesthood - In the temple at Jerusalem, the priesthood appointed to minister there, and to offer sacrifices, constituted an essential part of the arrangement. It was important, therefore, to show that this was not overlooked in the spiritual temple that God was raising. Accordingly, the apostle says that this is amply provided for, by constituting \"the whole body of Christians\" to be in fact a priesthood. Everyone is engaged in offering acceptable sacrifice to God. The business is not entrusted to a particular class to be known as priests; there is not a particular portion to whom the name is to be especially given; but every Christian is in fact a priest, and is engaged in offering an acceptable sacrifice to God. See Romans 1:6; \"And hath made us: kings and priests unto God.\" The Great High Priest in this service is the Lord Jesus Christ, (see the Epistle to the Hebrews, passim) but besides him there is no one who sustains this office, except as it is borne by all the Christian members.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "An holy priesthood - In the temple at Jerusalem, the priesthood appointed to minister there, and to offer sacrifices, constituted an essential part of the arrangement. It was important, therefore, to show that this was not overlooked in the spiritual temple that God was raising. Accordingly, the apostle says that this is amply provided for, by constituting \"the whole body of Christians\" to be in fact a priesthood. Everyone is engaged in offering acceptable sacrifice to God. The business is not entrusted to a particular class to be known as priests; there is not a particular portion to whom the name is to be especially given; but every Christian is in fact a priest, and is engaged in offering an acceptable sacrifice to God. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"And hath made us: kings and priests unto God.\" The Great High Priest in this service is the Lord Jesus Christ, (see the Epistle to the Hebrews, passim) but besides him there is no one who sustains this office, except as it is borne by all the Christian members.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There are ministers, elders, pastors, evangelists in the church; but there is no one who is a priest, except in the general sense that all are priests - because the great sacrifice has been offered, and there is no expiation now to be made. The name priest, therefore should never be conferred on a minister of the gospel. It is never so given in the New Testament, and there was a reason why it should not be. The proper idea of a priest is one who offers sacrifice; but the ministers of the New Testament have no sacrifices to offer - the one great and perfect oblation for the sins of the world having been made by the Redeemer on the cross. To him, and him alone, under the New Testament dispensation, should the name priest be given, as it is uniformly in the New Testament, except in the general sense in which it is given to all Christians. In the Roman Catholic communion it is consistent to give the name \"priest\" to a minister of the gospel, but it is wrong to do it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is consistent, because they claim that a true sacrifice of the body and blood of Christ is offered in the mass. It is wrong, because that doctrine is wholly contrary to the New Testament, and is derogatory to the one perfect Oblation which has been once made for the sins of the world, and in conferring upon just one class of people a degree of importance and of power to which they have no claim, and which is so liable to abuse. But in a Protestant church it is neither consistent nor right to give the name \"priest\" to a minister of religion. The only sense in which the term can now be used in the Christian church is a sense in which it is applicable to all Christians alike - that they \"offer the sacrifice of prayer and praise.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To offer up spiritual sacrifices - Not bloody offerings, the blood of lambs and bullocks, but those which are the offerings of the heart - the sacrifices of prayer and praise. Since there is a priest, there is also involved the notion of a sacrifice; but that which is offered is such as all Christians offer to God, proceeding from the heart, and breathed forth from the lips, and in a holy life. It is called sacrifice, not because it makes an explation for sin, but because it is of the nature of worship. Compare the notes at Hebrews 13:15; Hebrews 10:14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To offer up spiritual sacrifices - Not bloody offerings, the blood of lambs and bullocks, but those which are the offerings of the heart - the sacrifices of prayer and praise. Since there is a priest, there is also involved the notion of a sacrifice; but that which is offered is such as all Christians offer to God, proceeding from the heart, and breathed forth from the lips, and in a holy life. It is called sacrifice, not because it makes an explation for sin, but because it is of the nature of worship. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Acceptable to God by Jesus Christ - Compare the notes at Romans 12:1. Through the merits of the great sacrifice made by the Redeemer on the cross. Our prayers and praises are in themselves so imperfect, and proceed from such polluted lips and hearts, that they can be acceptable only through him as our intercessor before the throne of God. Compare the notes at Hebrews 9:24-25; Hebrews 10:19-22. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Acceptable to God by Jesus Christ - Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Through the merits of the great sacrifice made by the Redeemer on the cross. Our prayers and praises are in themselves so imperfect, and proceed from such polluted lips and hearts, that they can be acceptable only through him as our intercessor before the throne of God. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:24-25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:19-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. Ye also, as lively stones—partaking of the name and life which is in \"THE Living Stone\" (1Pe 2:4; 1Co 3:11). Many names which belong to Christ in the singular are assigned to Christians in the plural. He is \"THE Son,\" \"High Priest,\" \"King,\" \"Lamb\"; they, \"sons,\" \"priests,\" \"kings,\" \"sheep,\" \"lambs.\" So the Shulamite called from Solomon [Bengel].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "are built up—Greek, \"are being built up,\" as in Eph 2:22. Not as Alford, \"Be ye built up.\" Peter grounds his exhortations, 1Pe 2:2, 11, &c., on their conscious sense of their high privileges as living stones in the course of being built up into a spiritual house (that is, \"the habitation of the Spirit\").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "priesthood—Christians are both the spiritual temple and the priests of the temple. There are two Greek words for \"temple\"; hieron (the sacred place), the whole building, including the courts wherein the sacrifice was killed; and naos (the dwelling, namely, of God), the inner shrine wherein God peculiarly manifested Himself, and where, in the holiest place, the blood of the slain sacrifice was presented before Him. All believers alike, and not merely ministers, are now the dwelling of God (and are called the \"naos,\" Greek, not the hieron) and priests unto God (Re 1:6). The minister is not, like the Jewish priest (Greek, \"hiercus\"), admitted nearer to God than the people, but merely for order's sake leads the spiritual services of the people. Priest is the abbreviation of presbyter in the Church of England Prayer Book, not corresponding to the Aaronic priest (hiereus, who offered literal sacrifices). Christ is the only literal hiereus-priest in the New Testament through whom alone we may always draw near to God. Compare 1Pe 2:9, \"a royal priesthood,\" that is, a body of priest-kings, such as was Melchisedec. The Spirit never, in New Testament, gives the name hiereus, or sacerdotal priest, to ministers of the Gospel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "holy—consecrated to God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "spiritual sacrifices—not the literal one of the mass, as the Romish self-styled disciples of Peter teach. Compare Isa 56:7, which compare with \"acceptable to God\" here; Ps 4:5; 50:14; 51:17, 19; Ho 14:2; Php 4:18. \"Among spiritual sacrifices the first place belongs to the general oblation of ourselves. For never can we offer anything to God until we have offered ourselves (2Co 8:5) in sacrifice to Him. There follow afterwards prayers, giving of thanks, alms deeds, and all exercises of piety\" [Calvin]. Christian houses of worship are never called temples because the temple was a place for sacrifice, which has no place in the Christian dispensation; the Christian temple is the congregation of spiritual worshippers. The synagogue (where reading of Scripture and prayer constituted the worship) was the model of the Christian house of worship (compare Note, see on [2614]Jas 2:2, Greek, \"synagogue\"; Ac 15:21). Our sacrifices are those of prayer, praise, and self-denying services in the cause of Christ (1Pe 2:9, end).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "by Jesus Christ—as our mediating High Priest before God. Connect these words with \"offer up.\" Christ is both precious Himself and makes us accepted [Bengel]. As the temple, so also the priesthood, is built on Christ (1Pe 2:4, 5) [Beza]. Imperfect as are our services, we are not with unbelieving timidity, which is close akin to refined self-righteousness, to doubt their acceptance THROUGH Christ. After extolling the dignity of Christians he goes back to Christ as the sole source of it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As lively; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " viz. as being enlivened by Christ. The word here translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lively, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "living",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the former verse, is the same; but being there spoken of Christ, it is to be understood actively, and here being applied to believers, who receive their spiritual life from Christ, it must be taken passively. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Stones; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " each particular believer is here called a stone, as all together a house or temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Corinthians 6:16 Ephesians 2:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 6:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in respect of their union among themselves, and with their foundation; though elsewhere, in respect of God’s inhabitation, even particular believers are called his temple, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 3:16,17 6:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 3:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",17 6:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Are built up; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " viz. upon Christ the principal Corner-stone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 2:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This may be understood, either: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Imperatively. q.d. Be ye built up; and then it is an exhortation, and relates not only to their continuing in Christ, but their being further built up on him by faith, and is of the same import as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Peter 2:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that ye may grow:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or rather: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Indicatively; the apostle as yet being engaged in showing the dignity and privileges of believers, and not entering upon his exhortation till ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Peter 2:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words being in the present tense, implies the building to be still but going on, and not yet finished. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A spiritual house; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in distinction from the material one, relating to those scriptures where the tabernacle or temple is called God’s house, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 23:19 34:26 Deu 23:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 34:26 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 23:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The material house built of dead stones, was but a type of the spiritual house made up of lively stones, and built upon Christ the living Stone; and this he brings (the truth being always more excellent than the type) to heighten the privileges of the gospel church. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "An holy priesthood; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either the abstract is put for the concrete, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an holy priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for holy priests; or it may note the whole college or society of evangelical priests, consisting of all particular saints, to whom, in the New Testament, this title is given, but never appropriated to gospel ministers: Christ being a Priest for ever after the order of Melchisedec, had no partner with him in his priesthood, but was himself only to offer a propitiatory sacrifice to God for sin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To offer up spiritual sacrifices; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the immediate end of gospel priests, to offer, not bodily, but spiritual sacrifices; in general themselves, whom they are to consecrate to God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 12:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 12:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; particularly prayer, thanksgivings, alms, and other duties of religion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Philippians 4:18 Hebrews 13:15,16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 4:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Acceptable to God by Jesus Christ:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by, and through whom alone, as the persons, so the performances, of believers (though in themselves imperfect) are pleasing to God, Christ presenting them to his Father by his intercession, and covering their defects by his own most perfect righteousness, Some refer this clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by Jesus Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the foregoing verb, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to offer up; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and then the words run thus, to offer up spiritual sacrifices by Jesus Christ, acceptable to God; but the former seems most proper, and includes this latter: we are therefore to offer up spiritual sacrifices to God by Christ, because they are acceptable only by him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 13:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 13:15,16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye also, as lively stones,.... Saints likewise are compared to stones; they lie in the same quarry, and are the same by nature as the rest of mankind, till dug out and separated from thence by the powerful and efficacious grace of God, when they are hewn, and made fit for the spiritual building; where both for their ornament, beauty, and strength, which they receive from Christ, they are compared to stones, and are lasting and durable, and will never perish, nor be removed out of the building: and because of that life which they derive from him, and have in him, they are called \"lively\", or \"living stones\"; the spirit of life having entered into them, a principle of life being implanted in them, and coming to Christ, the living stone, they live upon him, and he lives in them; and his grace in them is a well of living water, springing up into eternal life. It was usual with poets and philosophers to call stones, as they lie in the quarry before they are taken out of it, \"living\" ones: so Virgil (p), describing the seats of the nymphs, says, \"intus aquae dulces vivoque sedilia saxo, nympharum domus\", &c. but here the apostle calls such living stones, who were taken out from among the rest: the stones which Deucalion and Pyrrha cast over their heads after the flood are called (q) , \"quickened stones\", they becoming men, as the fable says. \"Are built up a spiritual house\"; these living stones being laid, and cemented together, in a Gospel church state, become the house of God in a spiritual sense, in distinction from the material house of the tabernacle, and temple of old, to which the allusion is; and which is built up an habitation for God, by the Spirit, and is made up of spiritual men; such as have the Spirit of God, and savour the things of the Spirit, and worship God in Spirit and in truth; among whom spiritual services are performed, as prayer, praise, preaching, and hearing the word, and administering ordinances. Some read these words in the imperative, as an exhortation, \"be ye built up as lively stones; and be ye spiritual temples and holy priests\", as the Syriac version. A synagogue with the Jews is called , \"a spiritual house\" (r); and so is the third temple which the Jews expect in the times of the Messiah; of which one of their writers (s) thus says: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"it is known from the ancient wise men, that the future redemption, with which shall be the third  \"spiritual\" sanctuary, is the work of God, and will not be as the former redemptions: \"I will fill this house with glory\"; this is  \"a spiritual\" one, for even the walls shall be  \"spiritual\"--for even all this \"house\" shall be \"spiritual\"; for that which was then built, which is the second, shall be turned into another a \"spiritual\" one: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and which has been already done, and is what the apostle means here, the church, under the Gospel dispensation, or the Gospel church state, in opposition to the worldly sanctuary, and carnal worship of the Jews, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "An holy priesthood; in allusion to the priests under the law, who were set apart, and sanctified for that office; but now, under the Gospel, all the saints are priests unto God, and are all appointed and directed ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to offer up spiritual sacrifices; their whole selves, souls, and bodies, as a holy, living, and acceptable sacrifice; their prayers and praises, and all good works done in faith, and from love, and to the glory of God; particularly acts of kindness and beneficence to poor saints; these are called spiritual, in distinction from legal sacrifices, and because offered in a spiritual manner, under the influence, and by the assistance of the Spirit of God, and with their spirits. So the Jews speak of spiritual sacrifices, as distinct from material ones: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the intellectual sacrifice (they say (t)) is before the material sacrifices, both in time and excellency.--Cain brought an offering to the Lord of the fruit of the earth, and behold the intellectual attention did not agree with it, which is , \"the spiritual sacrifice\". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Now such are ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "acceptable to God by Jesus Christ; through whom they are offered up; for it is through him the saints have access to God, present themselves to him, and their services; and both persons and services are only accepted in Christ, and for his sake, and in virtue of his sacrifice, which is always of a sweet smelling savour to God, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) Aeneid. l. 1.((q) Eustathius in Homer. Iliad. 1.((r) Neve Shalom apud Caphtor, fol. 14. 1.((s) R. Alshech. in Hagg. ii. 7, 8, 9, 10. (t) Neve Shalom apud Caphtor, fol. 88. 2. Vid. Raziel. fol. 33. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) Aeneid. l. 1.((q) Eustathius in Homer. Iliad. 1.((r) Neve Shalom apud Caphtor, fol. 14. 1.((s) R. Alshech. in Hagg. ii. 7, 8, 9, 10. (t) Neve Shalom apud Caphtor, fol. 88. 2. Vid. Raziel. fol. 33. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Ye also, as lively stones, are built up a spiritual house, {5} an holy priesthood, to offer up spiritual sacrifices, acceptable to God by Jesus Christ.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ye also, as lively stones, are built up a spiritual house, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{5}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an holy priesthood, to offer up spiritual sacrifices, acceptable to God by Jesus Christ.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) Continuing, he compares us now to priests, placed for this purpose in the spiritual temple, that we should serve him with a spiritual worship, that is, with holiness and righteousness: but as the temple, so is the priesthood built upon Christ, in who alone all our spiritual offerings are accepted.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Fulfilment of the saying, Destroy this temple and in three days I will raise it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Christians live to God through Jesus Christ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For this development of the figure of building, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " especially ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἰκοδομεῖσθε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", indicative rather than imperative. “It is remarkable that St. Peter habitually uses the aorist for his imperatives, even when we might expect the present; the only exceptions (two or three) are preceded by words removing all ambiguity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f”. (Hort).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἶκος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἅγιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a spiritual house for an holy priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The connection with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the offering of sacrifices points to the special sense of the House of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Temple; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 4:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ναὸς ὅς ἐστε ὑμεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὗ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Χριστοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἶκός ἐσμεν ἡμεῖς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἱεράτευμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "body of priests",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "priests",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Ma 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 2 Maccabees cf.9 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "infra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here Hort prefers the equally legitimate sense, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Acts of priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Usage supports the first and only possible etymology the second. The ideal of a national priesthood is realised, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνενέγκαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Χριστοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to offer up spiritual sacrifices acceptable to God through Jesus Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δια Ἰησοῦ Χ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is better taken with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". than ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐπροσδ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διʼ αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the thankoffering is singled out as the fit type of the Christian sacrifice. Spiritual sacrifices are in their nature acceptable to God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Christians are enabled to offer them through Jesus Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀναφέρειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in this sense is peculiar to LXX, Jas. and Heb.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye also, as lively stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "as living stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", there being no reason for a variation in the English, to which there is nothing corresponding in the Greek. The repetition of the same participle gives prominence to the thought that believers are sharers in the life of Christ, and that, in the building up of the spiritual temple, each of these “living stones” takes its voluntary, though not self-originated, part. It is an open question, as far as the Greek is concerned, whether the verb is in the passive or the middle voice, in the indicative or the imperative mood, but the sense is, perhaps, best given by the rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "build yourselves up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a spiritual house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words come as a secondary predicate of the previous clause. “This,” St Peter says, “is what you will become by coming to Christ and building yourselves on Him.” The “house,” like the corner-stone, carries our thoughts back to the Temple as “the house of God” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which finds its antitype in that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ecclesia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to which St Paul attaches the same glorious title (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We can hardly think that St Peter could write these words without remembering the words which had told him of the rock on which Christ would build His Church, and into the full meaning of which he was now, at last, entering (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a holy priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The thought of the Temple is followed naturally by that of its ritual and of those who are the chief agents in it. Here also there is a priesthood, but it is not attached, as in the Jewish Temple, to any sacerdotal caste, like that of the sons of Aaron, but is co-extensive with the whole company of worshippers. As in the patriarchal Church, as in the original ideal of Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from which the appointment of the Levitical priesthood was a distinctly retrograde step consequent on the unfitness of the nation for its high calling as a kingdom of priests, as in the vision of the future that floated before the eyes of Isaiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 61:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so now in the Church of Christ, there was to be no separate priesthood, in the old sense of the word, and with the old functions. All were to offer “spiritual sacrifices” (we note the identity of thought with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as contrasted with the burnt-offerings or meat-offerings of Jewish ritual. And, by what to a Jew must have seemed at first the strangest of all paradoxes, and afterwards the development of a truth of which germinal hints had been given to his fathers, in this new order of things the Temple and the Priesthood were not, as in the old, distinguished and divided from each other, but were absolutely identical. The Priests who sacrificed in the true Temple, were themselves the stones of which that Temple was built.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "acceptable to God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] St Peter uses the stronger and more emphatic form of the adjective which was familiar on St Paul’s lips (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 8:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In the addition of the words “through Jesus Christ,” we have at once the sanction for the Church’s use of that form of words in connexion with all her acts of prayer and praise, and the implied truth that it is only through their union with Christ as the great High Priest and with His sacrifice that His people are able to share His priesthood and to offer their own spiritual sacrifices.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yourselves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", partakers of the same name (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λίθοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Many names, which belong to Christ in the singular, are assigned to Christians in the plural. Christ is the Living Stone; Christians are living stones. From Him they also are called sons, priests, kings, lambs, etc. So the Shulamite is called from Solomon.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ζῶντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "living",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Such persons, living stones, may be at once both a house and a priesthood.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἰκοδομεῖσθε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are built up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The indicative, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἶκος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a temple.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἱεράτευμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") a multitude of priests. This is presently afterwards explained, and (the contrary having been premised in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἅγιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as belonging to God.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θυσίας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacrifices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of praise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐπροσδέκτους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "acceptable",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 56:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αἱ θυσίαι αὐτῶν ἔσονται δεκταὶ ἐπὶ τὸ θυσιαστήριόν μου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "· ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Their sacrifices shall be accepted on My altar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Christ is both ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "precious",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Himself, and makes us accepted; for He is the altar. See Isa. as quoted above.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye also, as lively stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "living stones",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word is the same as that used in ver. 4. Christians are living stones in virtue of their union with the one living Stone: \"Because I live, ye shall live also.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Are built up a spiritual house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "be ye built up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The imperative rendering seems more suitable than the indicative, and the passive than the middle. The Christian comes; God builds him up on the one Foundation. The apostle says,\" Come to be built up; come that ye may be built up.\" The parallel passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jude 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"But ye, beloved, building up yourselves on your most holy faith,\" might seem to point to a reflexive rendering here; but the verb used by St. Jude is active, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐποικοδομοῦντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St. Jude is apparently thinking of the human side of the work, St. Peter of the Divine; in the deepest sense Christ is the Builder as well as the Foundation, as he himself said in words doubtless present to St. Peter's mind, \"Upon this rock I will build my Church.\" That Church is the antitype of the ancient temple - a building not material, but spiritual, consisting, not of dead stones, but of sanctified souls, resting on no earthly foundation, but on that Rock which is Christ (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ephesians 2:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 3:2, 17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An holy priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, for (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "into",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a holy priesthood",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The figure again changes; the thought of the temple leads to that of the priesthood. The stones in the spiritual temple are ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "living",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " stones; they are also priests. According to the original ideal of the Hebrew theocracy, all Israelites were to be priests: \"Ye shall be unto me a kingdom of priests, a holy nation\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This ideal is fulfilled in the Christian Church; it is a holy priesthood. Here and in ver. 9 the Church collectively is called a priesthood; in the Book of the Revelation (Revelation 1:6; 5:10; 20:6) Christians individually are called priests, Bishop Lightfoot says, at the opening of his dissertation on the Christian ministry, \"The kingdom of Christ has no sacred days or seasons, no special sanctuaries, because every time and every place alike are holy. Above all, it has no sacerdotal system. It interposes no sacrificial tribe or class between God and man.\" He continues, \"This conception is strictly an ideal, which we must ever hold before our eyes...  but which nevertheless cannot supersede the necessary wants of human society, and, if crudely and hastily applied, will lead only to signal failure. As appointed days and set places are indispensable to her efficiency, so also the Church could not fulfill the purposes for which she exists without rulers and teachers, without a ministry of reconciliation, in short, without an order of men who may in some sense be designated a priesthood.\" The whole Jewish Church was a kingdom of priests; yet there was an Aaronic priesthood. The Christian Church is a holy priesthood; yet there is an order of men who are appointed to exercise the functions of the ministry, and who, as representing the collective priesthood of the whole Church, may be truly called priests. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To offer up spiritual sacrifices, acceptable to God by Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The priest must have somewhat to offer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The sacrifices of the ancient Law had found their fulfillment in the one all-sufficient Sacrifice, offered once for all by the great High Priest upon the altar of the cross. But there is still sacrifice in the Christian Church. That one Sacrifice is ever present in its atoning virtue and cleansing power; and through that one Sacrifice the priests of the spiritual temple offer up daily spiritual sacrifices - the sacrifice of prayer and praise (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the sacrifice of alms and oblations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that sacrifice without which prayer and praise and alms are vain oblations, the sacrifice of self (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). These spiritual sacrifices are offered up through Jesus Christ the great High Priest (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); they derive their value only from faith in his sacrifice of himself; they are efficacious through his perpetual mediation and intercession; through him alone they are acceptable to God. They are offered through him, and they are acceptable through him. The Greek words admit of either connection; and perhaps are intended to cover both relations. 1 Peter 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Living stones - built up - a spiritual house",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It seems as though Peter must have had in mind the conception embodied in Christ's commission to him, of a building erected upon a rock. The metaphor of a house built of living stones is violent, and sufficiently characteristic of Peter; yet it pictures, in a very striking way, the union of stability, growth, and activity in the ideal church. Note the transition from babes growing (1 Peter 2:2) to stones built up. But, as Salmond remarks, \"In Paul we have even bolder instances of apparent confusion of metaphors, as when, in one breath, he represents believers as at once walking, rooted, and built up in Christ (Colossians 2:6, Colossians 2:7).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It seems as though Peter must have had in mind the conception embodied in Christ's commission to him, of a building erected upon a rock. The metaphor of a house built of living stones is violent, and sufficiently characteristic of Peter; yet it pictures, in a very striking way, the union of stability, growth, and activity in the ideal church. Note the transition from babes growing (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") to stones built up. But, as Salmond remarks, \"In Paul we have even bolder instances of apparent confusion of metaphors, as when, in one breath, he represents believers as at once walking, rooted, and built up in Christ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "To offer up (ἀνενέγκαι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The usual Old-Testament (Septuagint) term for offering of sacrifice. Lit., to bring up to the altar. Compare Hebrews 13:15. The force of ἀνά, up, appears in the fact of the altar being raised. The word is often used of carrying from a lower to a higher place. Thus Matthew 17:1; Luke 24:51. In this sense 1 Peter 2:24 of this chapter is suggestive, where it is said that Christ bare (ἀνήνεγκεν) our sins: carried them up to the cross. See note there. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The usual Old-Testament (Septuagint) term for offering of sacrifice. Lit., to bring up to the altar. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The force of ἀνά, up, appears in the fact of the altar being raised. The word is often used of carrying from a lower to a higher place. Thus ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 17:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 24:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this sense ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of this chapter is suggestive, where it is said that Christ bare (ἀνήνεγκεν) our sins: carried them up to the cross. See note there. ",
            "children": []
          }
        ]
      }
    ]
  }
]